{
    "year": "2009",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Despite what the final score may say, this game looked like it would go Buffalo's way early on. The Bills led 10-6 at halftime, and the Texans' offense was having problems because Owen Daniels left with a knee sprain. Steve Slaton also fumbled again - his seventh of the year - forcing Gary Kubiak to bench him. Well, give the Texans credit for dominating the second half by a 25-0 margin. Ryan Moats, taking over for Slaton, came out of nowhere to rush for 126 yards and three touchdowns. Making things worse for Slaton owners, Moats easily converted multiple goal-line attempts. ",
            "2": "With Slaton benched and Daniels out, it's surprising that Houston's receivers didn't step up with big numbers. Andre Johnson caught six balls for 63 yards, while Kevin Walter had four grabs for 29 yards. ",
            "3": "Matt Schaub finished the game well; he went 10-of-12 for 129 yards in the second half, thanks in part to Aaron Schobel leaving the game with an injury. Overall, Schaub was 25-of-34 for 268 yards and two picks, but the big news here is that Jairus Byrd caught both interceptions. As a mere rookie, Byrd has seven picks. ",
            "4": "Speaking of picks, Ryan Fitzpatrick also had a pair, finishing 15-of-23 for 117 yards. Fitzpatrick led the Bills to just nine first downs and was 2-of-10 on third-down conversions. ",
            "5": "The only touchdown the Bills scored was a 29-yard end-around by Terrell Owens, helped by a great Lee Evans block. Owens finished with five grabs for 39 yards, while Evans caught two balls for 29 yards. ",
            "6": "Houston's run defense continues to shine. The Texans struggled against the rush early in the year, but they've shut down the likes of Frank Gore and Cedric Benson recently. Marshawn Lynch and Fred Jackson had nine carries each for 43 and 28 yards, respectively. ",
            "7": "Congratulations to the Texans, who are now 5-3. This looked like a trap game, but Houston overcame an early deficit to win. This is the first time in the Texans' franchise history that they're two games over .500 (outside of a 2-0 start in 2007). It's also the first time ever that they've won a contest when favored on the road. Unfortunately, this victory for Houston comes with some unfortunate news. Daniels will be out for the rest of the year with what seems to be a torn ACL. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bears",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "The Bears may have blown out the Browns, but the victory was far from impressive. Chicago had major problems in the red zone, and the biggest issue was that the offensive line couldn't block Cleveland. No, that's not a typo. Chicago's offensive line couldn't block the Browns. The Bears had no answer for Shaun Rogers. Cleveland came up with four sacks and tons of pressures, even forcing Jay Cutler into a rare interception. ",
            "2": "Cutler was 17-of-30 for 225 yards otherwise. His top receiver was Devin Hester, who had seven grabs for 81 yards. Johnny Knox (44 yards) and Greg Olsen (40) were next in line with three receptions each. ",
            "3": "If you're a Matt Forte owner and you've hung on to him all this time, congratulations. Forte compiled 90 yards and two touchdowns on 26 carries. Of course, Forte was playing the Browns, so you may have expected more from him. ",
            "4": "Derek Anderson was completely horrendous in this game, as he continued to toss errant passes with his eyes closed the entire afternoon. Anderson was 2-of-9 for 13 yards and a pick at halftime, and finished 6-of-17 for 76 yards, two interceptions and a lost fumble. Anderson was benched in the fourth quarter, but Brady Quinn was just 1-of-3 for 9 yards. It could be Brett Ratliff time in Cleveland. ",
            "5": "Other than Jamal Lewis (16 carries, 69 yards) in favorable matchups, no Browns player is worth owning in fantasy leagues, and that fact was more prevalent than ever this week. Mohamed Massaquoi led all Cleveland receivers with a whopping two catches for 28 yards. ",
            "6": "Some more comical numbers: The Browns were 1-of-11 on third downs. They had nine first downs the entire game. They were out-gained 369-191 in net yardage. They lost the time-of-possession battle, 37:25 to 22:25. It's amazing Cleveland even scored; the team can thank Bears punter Brad Maynard for a 19-yard shank in the third quarter. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "After struggling early this year and nearly losing to the Chiefs, the Cowboys are on fire, and it's all thanks to the emergence of Miles Austin-Jones. Austin-Jones once again had a very productive game, catching five balls for 61 yards and a touchdown. He ran circles around Seattle No. 1 corner Marcus Trufant, who looked awful. ",
            "2": "As you can imagine based on Austin-Jones' stats and the final score, Tony Romo was prolific, going 21-of-36 for 256 yards and three touchdowns. Romo continuously moved the chains (7-of-13 on third downs) and Seattle's defense just couldn't get off the field all afternoon. The Cowboys won the time-of-possession battle by nearly 10 minutes. ",
            "3": "No other Dallas wideout did anything positive of note. Jason Witten caught just four balls for 36 yards. Roy Williams had two receptions for 19 yards and a touchdown that barely got over the goal line. Patrick Crayton snagged three balls for 39 yards. Crayton fumbled twice, but made up for it with an 82-yard punt return for a score. ",
            "4": "Marion Barber had a solid game - 14 carries, 53 yards and a touchdown - which is a rare sight; Barber hasn't done much since injuring his quad against the Giants. Felix Jones had 39 yards on eight rushes and a 30-yard reception, while Tashard Choice turned just four carries into 11 yards. ",
            "5": "Despite suffering yet another loss, I thought Matt Hasselbeck played very well behind his horrific offensive line. He was 22-of-39 for 249 yards and two touchdowns. Hasselbeck was sacked three times. ",
            "6": "Nate Burleson led the Seahawks with six receptions for 89 yards. T.J. Houshmandzadeh had four grabs for just 24 yards. At one point, Houshmandzadeh was so frustrated that he stormed off the field and yelled at the coaches on the sidelines. ",
            "7": "Julius Jones actually looked pretty decent running the ball in this contest. The problem was that he just didn't get enough opportunities. Jones gained 56 yards on 15 carries. Outside of the offensive line, upgrading the running back position will be Seattle's greatest priority this upcoming offseason. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "25"
        },
        "comments": {
            "amount": "6",
            "1": "This game was really frustrating. I had five units on New York -3.5. The Jets ended up losing, but they dominated this contest. Don't believe me? They out-gained the Dolphins 378-104. They also won the time-of-possession battle by nine minutes. Miami managed to win its third game of the year with three touchdowns on defense and special teams. One was a Shonn Greene fumble returned 48 yards. The other two scores were both by Ted Ginn on successive 100- and 101-yard kickoff returns. Of course, Ginn couldn't do this last week; instead, he ruined five more units of mine with numerous drops. ",
            "2": "Despite the loss and poor play-calling by offensive coordinator Brian Schottenheimer, Mark Sanchez played pretty well. He went 20-of-35 for 265 yards and two touchdowns, continuously driving the Jets down the field in the second half. Of course it didn't matter because Ginn scored on a kickoff right after every second-half possession. ",
            "3": "Dustin Keller caught eight balls for 76 yards and a score. Braylon Edwards was also solid, grabbing four balls for 74 yards and a touchdown. Jerricho Cotchery, off a hamstring injury, had three receptions for 70 yards. ",
            "4": "Thomas Jones did all of the work on the ground for the Jets in this contest, gaining 102 yards on 27 attempts. Greene, who had the aforementioned fumble-six, carried the ball only eight times for 18 yards. ",
            "5": "As noted, the Dolphins had only 104 net yards, so there isn't much to say in terms of their offensive numbers. Chad Henne was 12-of-21 for 112 yards and a touchdown. ",
            "6": "Ronnie Brown and Ricky Williams had 27 yards each on 11 and eight carries, respectively. Williams led the Dolphins in receiving yards with 41 on two catches. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "18"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "My dad bet on the Colts, so he called me around 3 to ask what was wrong with Peyton Manning. I told him that I didn't know and noted that Manning was playing like a drunk. It didn't even look like Manning knew what happened either. During the post-game press conference, Manning scratched his head and said that his team really struggled on third downs. Indianapolis was 8-of-19 on third downs, so maybe Manning was drunk after all. The really odd thing is that despite the 18 points, Manning was 31-of-48 for 347 yards. It's almost as if there was some sort of black hole vortex in the middle of the field that prevented the Colts from moving the chains past the 50. ",
            "2": "Manning didn't throw a touchdown because Joseph Addai tossed one on a halfback option in the second half. In addition to his 22-yard pass, Addai garnered 62 yards on 20 carries. With no Donald Brown in the lineup, Addai got all but one rushing attempt. By the way, Addai's touchdown pass marked the first time a Colts player other than Manning threw one since 2001 (Ken Dilger). ",
            "3": "Reggie Wayne had a monstrous performance, catching 12 balls for 147 yards and a score. Also chipping in were Dallas Clark (8 receptions, 99 yards), Austin Collie (6-66) and Pierre Garcon (4-53). ",
            "4": "Bob Sanders was back for the Colts. Sanders contributed with two tackles and a pick off a Michael Crabtree deflection. ",
            "5": "Alex Smith put up decent numbers, going 19-of-32 for 198 yards, one touchdown and the aforementioned pick. Smith didn't play poorly, but he just struggled to keep drives alive. The 49ers were just 2-of-10 on third downs, including 0-of-7 on 3rd-and-10 or longer. To be fair, Smith was going against one of the top pass defenses in the NFL. ",
            "6": "Smith once again looked for Vernon Davis in the red zone; Davis caught three balls for 20 yards and Smith's lone score. Crabtree, meanwhile, finished with six grabs for 81 yards. ",
            "7": "The 49ers were able to establish an early lead, thanks to a 64-yard touchdown by Frank Gore. Gore's final numbers stood at 91 yards on 13 carries. Using my nifty Windows calculator, Gore's other 12 rushes went for just 27 yards. Still, I was shocked that he had only 13 attempts. The 49ers led until the fourth quarter, so there's no reason Gore's touches should have been so limited. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "The Giants are really struggling right now and they're having major issues on both offense and defense. Beginning with the former, Eli Manning simply just hasn't been himself since suffering that heel injury against the Raiders. Manning was just 20-of-39 for 222 yards, one touchdown and two picks. ",
            "2": "With Mario Manningham out, Hakeem Nicks saw a ton of action. Nicks caught four balls for 53 yards. Steve Smith snagged eight balls for 68 yards. Kevin Boss, who caught Manning's sole touchdown, logged three receptions for 70 yards. ",
            "3": "Brandon Jacobs once again frustrated his fantasy owners by not getting into the end zone. Jacobs rushed for 86 yards on 20 carries. Ahmad Bradshaw ironically got a touchdown on just nine rushes for 21 yards. ",
            "4": "As for New York's defense, the safeties are simply giving up way too many big plays, while the line isn't getting any pressure on the quarterback. In fact, the Eagles averaged eight yards per play in this contest. C.C. Can't Cover Brown certainly lived up to his nickname. ",
            "5": "Donovan McNabb lost two fumbles, but was otherwise flawless, going 17-of-23 for 240 yards and three touchdowns. ",
            "6": "McNabb's longest pass went to a wide-open DeSean Jackson for 54 yards, thanks to poor coverage by Corey Webster. Jackson finished with three grabs for 78 yards. He also attempted to chest bump Andy Reid. Jackson's lucky he wasn't sucked into Big Red's stomach. ",
            "7": "Also scoring aerial touchdowns for the Eagles were Brent Celek (4 catches, 61 yards) and Jeremy Maclin (4-47). ",
            "8": "You can see now why the Eagles drafted LeSean McCoy in the second round this past April. Brian Westbrook was out, but the Eagles didn't miss a beat, gaining 82 yards and a touchdown on 11 carries. McCoy also caught two passes for 10 more yards. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Rams",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "If the Rams won and no one saw it, did they really win a game? St. Louis came away with a 17-10 victory, but Ford Field looked like a ghost town. From watching this game on TV, it looked like three-quarters of the seats were empty. ",
            "2": "This battle between two of the worst franchises in the NFL was an epic one. And by epic, I mean that there was epic fail on both sides. Here are some examples: - Matthew Stafford threw an interception in the end zone. Safety James Butler caught the ball, ran it out of the end zone and foolishly went back in, where he was tackled. Detroit was awarded with a safety. - The Rams attempted a 53-yard field goal in the second quarter. Instead of kicking it, they ran a fake. Josh Brown tossed a 36-yard touchdown to Daniel Fells. The Lions were simply unprepared for it. Shocker. - Detroit had about 10 drops in this game. Ten freaking drops. - The Lions had the ball with four minutes remaining in the contest with the score tied at 10. Instead of trying to put together a game-winning drive, Detroit ran the ball twice, putting Stafford into a third-and-long situation. Stafford was predictably sacked. The Lions punted the ball away and the Rams scored a touchdown on the following drive. - The man responsible for this idiotic play-calling was Scott Linehan. I liked the Lions -3.5 because of Linehan's knowledge of St. Louis' schemes and personnel. Apparently, Linehan knows absolutely nothing and obviously not paying attention to anything while coaching the Rams. ",
            "3": "Without Calvin Johnson, Stafford struggled statistically, going 14-of-33 for 168 yards and the aforementioned pick. But as I noted, Stafford suffered through close to 10 drops in this contest. His leading receiver was Bryant Johnson, who had two grabs for 43 yards. ",
            "4": "What really hurt the Lions, besides the drops, Linehan's ineptness and Megatron's absence, was a Kevin Smith ankle injury. Smith had 20 touches (63 rushing yards, 49 receiving yards). He was in and out of the lineup all afternoon. Maurice Morris actually had 14 carries for 63 yards, but was not much of a factor as a target coming out of the backfield. ",
            "5": "You have to feel really good for Steven Jackson, who has playing hard all year despite all of these losses. Jackson rushed for 149 yards on 22 carries. He also scored his first touchdown of the year. ",
            "6": "Marc Bulger was just 17-of-35 for 176 yards and a pick. His leading receiver was Keenan Burton, who managed five receptions for 54 yards. Donnie Avery had just one catch for 15 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "As long as JaMarcus Russell doesn't turn the ball over, the Raiders have the defense and rushing attack to stay close and even win a few games. A week after getting benched, Russell put together a pedestrian performance (14-of-22 for 109 yards), which was great for him because he had only one turnover (an interception). ",
            "2": "Justin Fargas helped Oakland move the chains by gaining 59 yards and a touchdown on 18 carries. Michael Bush chipped in with 27 yards on seven attempts. ",
            "3": "As you might predict, Zach Miller was Russell's leading target, catching five balls for 52 yards. Darrius Heyward-Bey actually caught a pass for 10 yards, inching ever closer to the Hall of Fame. ",
            "4": "Vincent Jackson was the most dominant offensive player in this matchup, coming up with eight grabs for 103 yards and a touchdown. If you're wondering what happened to Nnamdi Asomugha, I am too; Asomugha, for whatever reason, was not on Jackson. ",
            "5": "Philip Rivers finished 16-of-25 for 249 yards, one touchdown and a pick. LaDainian Tomlinson scored San Diego's other two touchdowns. He finished with 56 yards on 18 attempts. ",
            "6": "Shawne Merriman entered this contest without a sack. I guess playing the Raiders was the medicine he needed because he sacked Russell twice. ",
            "7": "The Chargers, who out-gained the Raiders, 346-180, have now won 13 in a row against Oakland. As a reference, the last time the Raiders beat San Diego, Rich Gannon, Tyrone Wheatley, Charlie Garner, Jerry Rice and Tim Brown were their offensive stars. That's right, Oakland fans - your team actually had talent at one point. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Titans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "All Vince Young does is win football games. It's that simple. He doesn't put up pretty passing stats. The stat that matters most is this one: Young is now 19-11 as a starter. You can point to the ground attack and the defense (the latter in years past obviously), but Young is now 1-0 with this team. Kerry Collins is 0-6. There is something to that, though the Young doubters will never admit this. Young was 15-of-18 for 125 yards and a touchdown. He seldom threw deep, but did a great job moving the chains. Young also had 30 rushing yards on 12 carries, as he made some very athletic plays to get first downs. It's no coincidence that the Titans were 8-of-15 on third downs. It was refreshing to watch Young after getting to see Collins stumble around for six weeks. ",
            "2": "Young's ability to scramble really opened up huge running lanes for Chris Johnson. Johnson rushed for an amazing 228 yards and two touchdowns on 24 carries. ",
            "3": "Young didn't have to throw often, but none of his receivers were going to compile big numbers anyway. Justin Gage led the team with 41 receiving yards, while Tennessee's leader in receptions was Bo Scaife with four for 27 yards. ",
            "4": "While Young does nothing but win football games, a case can be made that the Jaguars were just as responsible by beating themselves. Would you believe that a team with Maurice Jones-Drew had no carries in the first quarter? How about the fact that Jones-Drew didn't even touch the ball until there was 5:50 remaining in the second quarter? What drugs did Jacksonville's coaching staff take to make them think this was a good idea? Jones-Drew had just eight carries and one reception the entire contest, but made the most of it. He rushed for 177 yards and two scores of 80 and 79 yards. Combined, Jones-Drew and Johnson had four rushes of 50-plus yards. That's the first time that has happened in NFL history. ",
            "5": "As you may imagine, David Garrard threw constantly; he was 14-of-27 for 139 yards and two picks. ",
            "6": "Rookie Mike Thomas actually led the Jaguars in receiving with four catches for 55 yards. Torry Holt (2 catches, 17 yards) and Mike Sims-Walker (2 catches, 9 yards) were both nowhere to be found. Walker-Sims was targeted in the end zone late in the game, but the pass was intercepted. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "If you were to tell me that a quarterback in this game would throw five picks and lose a fumble, I would have bet all the money I have on Jake Delhomme doing so. Well, it's a good thing I didn't because I'd be living in a box on my street and yelling incoherently at squirrels right now. Kurt Warner went 27-of-46 for 242 yards and two touchdowns, but had those six costly turnovers. It's almost as if Delhomme (7-of-14, 90 yards, TD) knocked Warner out before the game and dressed up as an old, grizzled quarterback. Not a bad Halloween costume if I do say so myself. ",
            "2": "Larry Fitzgerald and Steve Breaston led the wideouts with six receptions each for 66 and 57 yards, respectively. Anquan Boldin had just three grabs for 23 yards. He left the game in the third quarter with an ankle injury. ",
            "3": "Tim Hightower actually led the Cardinals with eight catches for 57 receiving yards. Hightower and Chris Wells split carries evenly (8). Hightower scored a touchdown, but had less yards (37) than Wells (47). Overall, Wells looked like the far superior runner, but his struggles as a receiver out of the backfield are costing him rushing attempts - especially in a contest like this one where Arizona was behind the whole time. ",
            "4": "As for Carolina's ground attack, DeAngelo Williams and Jonathan Stewart ripped apart the league's top run defense. Williams gained 158 yards on 23 attempts, while Stewart accumulated 87 yards and two touchdowns on 17 carries. Stewart's two scores weren't goal-line rushes, so don't be too concerned if you're a Williams owner. ",
            "5": "Amazingly, Steve Smith caught his first touchdown all season in this contest. Smith finished with three grabs for 56 yards. Dwayne Jarrett, starting in place for Muhsin Muhammad, received two balls for 22 yards. ",
            "6": "Delhomme left the game in the fourth quarter and was hospitalized with a chest injury. Delhomme says he plans to play in Week 9. Try not to cry, Panther fans. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "Congratulations, Brett. You beat the Packers at Lambeau and got your revenge on Ted Thompson. All it took was betraying almost every single person who supported you for a decade and a half. I hope you're happy. If you somehow missed Favre's reception from the crowd, the Lambeau faithful booed him feverishly as he emerged out of the tunnel. The fans continue to jeer him throughout the first quarter, but Favre quickly silenced the Green Bay supporters by establishing a 14-3 lead in the first 20 minutes of the game. ",
            "2": "Favre was simply brilliant in this contest, continuously making big throws to move the chains (the Vikings were 6-of-14 on third downs.) Favre finished 17-of-28, 244 yards and four touchdowns. ",
            "3": "For the first time in what seems like months, Sidney Rice didn't post big numbers (4 catches, 40 yards). Instead, it was Percy Harvin (5 catches, 84 yards) who did most of the damage. Harvin caught a deep pass and eluded three Green Bay defenders to score a 51-yard touchdown. ",
            "4": "Bernard Berrian also scored, snagging three receptions for 47 yards. Fox Sports' John Czarnecki incorrectly and irresponsibly reported that Berrian would be out with a hamstring injury. Fantasy owners, direct your hate mail toward Czarnecki. Perhaps Fox should acquire a clone of Adam Schefter. ",
            "5": "Green Bay bottled up Adrian Peterson in the first meeting between these squads. This time? Not so much. Peterson gained 97 yards and a touchdown on 25 carries. He also caught a 44-yard screen pass. ",
            "6": "The reason I picked the Vikings in this contest was because I had no faith in Green Bay's offensive line to protect Aaron Rodgers. Turns out that was the correct assumption; Minnesota racked up six sacks to add to the eight sacks they had on Rodgers four weeks ago. Rodgers has now been sacked 31 times this year - easily tops in the NFL. Jared Allen had three sacks on rookie T.J. Lang, but it wasn't all on the offensive line. On several occasions, Rodgers simply held on to the ball too long. Don't get me wrong; the front-line blockers were horrible, but they don't deserve all the blame. ",
            "7": "Rodgers otherwise played well, going 26-of-41 for 287 yards and three touchdowns. Most of his yardage went to his two receivers. Donald Driver had six grabs for 63 yards, but the star was Greg Jennings, who collected eight receptions for 88 yards and a score. ",
            "8": "A bad sign for Green Bay was that Rodgers led the team in rushing yardage with 52 on five carries. Ryan Grant had only 30 yards on 10 attempts. "
        }
    },
    "numberOfGames": "11"
}