{
    "year": "2009",
    "week": "14",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "Where did this come from? Where was the crappy quarterback we saw against the Eagles? Chris Redman, who was completely awful last year, somehow stole Matt Ryan's talents to go 23-of-34, 303 yards, one touchdown and an interception. Most of Redman's completions were of the dink-and-dunk variety, but he hit enough big plays to keep the Falcons in the game, including a 50-yard touchdown bomb to Michael Jenkins. I guess this reinforces the notion that you can never underestimate a fierce rivalry. This Falcons squad barely beat the Buccaneers and was crushed by the Eagles. With Redman under center, they shouldn't have been within 10 points of the Saints just based on talent. Instead, Atlanta actually out-gained New Orleans, 392-391. ",
            "2": "Because most of Redman's attempts were short, neither Tony Gonzalez nor Roddy White managed much; Gonzalez had six catches for 50 yards, while White collected two receptions for 41 yards. ",
            "3": "With no Michael Turner, Jason Snelling (10 carries, 37 yards) and Jerious Norwood (9-33) pretty much split carries. Helping his fantasy owners out, Snelling also caught four balls for 65 yards, including a 38-yard gain. ",
            "4": "Drew Brees was brilliant once again, going 31-of-40 for 296 yards and three touchdowns. He absolutely torched the Falcons whenever they blitzed, and Atlanta forced the Saints into only one punt. The only other time New Orleans didn't score on a drive was when it attempted a dumb fake field goal up three with two minutes remaining in regulation. ",
            "5": "Three Saints tied the team lead with six receptions: Marques Colston (54 yards, TD), Pierre Thomas (53) and Reggie Bush (46, 2 TDs). Robert Meachem and Jeremy Shockey also chipped in with four grabs for 57 and 46 yards, respectively. ",
            "6": "With Mike Bell out, Thomas had the majority of the carries, but mustered only 47 yards on 13 attempts. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "For years, football coaches everywhere on every level will show tapes of this game to their players. Their focus: how not to tackle. This performance was pathetic. In a torrential downpour, the Lions showed absolutely no effort on defense. They didn't look like they wanted to be there. Perhaps the play that epitomized their defensive struggles was when Derrick Mason caught a deep pass over the middle of the field. Two Lions converged on Mason, but instead of hitting the Baltimore wideout, they crashed into each other, allowing Mason to score a 62-yard touchdown. ",
            "2": "Mason caught that long score and finished with five catches for 94 yards, but the offensive star for the Ravens was Ray Rice. Rice rushed for 166 yards and a touchdown on 13 carries, breaking tons of half-hearted Detroit tackles. Rice also had four catches for 53 yards. His only blemish was an early lost fumble in the red zone, marking the second game in a row he has committed that type of error. This needs to stop. ",
            "3": "Considering the sloppy conditions, Joe Flacco was very solid, going 13-of-20, 230 yards and a touchdown. Flacco converted 6-of-13 third downs and didn't take any sacks. ",
            "4": "The last time Daunte Culpepper was supposed to start, Matthew Stafford took the opportunity away from him on Thanksgiving. Culpepper broke down and cried. There were no tears shed this time because Culpepper got the nod. Well, not before the game anyway. There may have been some tears afterward because he was 16-of-34 for 135 yards and two interceptions. It's official: Culpepper sucks. ",
            "5": "Culpepper ruined things for Calvin Johnson owners, as Megatron was limited to just four receptions for 37 yards. The leading receiver for Detroit was Dennis Northcutt with 39 yards. ",
            "6": "Kevin Smith garnered 69 rushing yards on 21 attempts. Unfortunately, he left the game early with a torn ACL. He's out for the year. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Packers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Usually, NFL.com Gamecenter comments are illogical and incomprehensible. However, when I clicked on the Packers-Bears game, one user's post - in capital letters, of course - pretty much summed up this contest: RODGERS HAD A BAD GAME BCUZ THE O LINE WASNT PLAYING AS GOOD AS THEY WERE IN THE PAST 4 GAMES! Rodgers (16-of-24, 180 yards) took only two sacks, but was constantly pressured. He consequently fumbled twice. On one play, Rodgers was hit and the ball bounced out of his hands and back into his own arms. Immediately after the self-completion, the ball once again slipped out of Rodgers' hands and into the belly of a Chicago defensive lineman. ",
            "2": "Though Rodgers was pressured more than his coaching staff would like, the front allowed Ryan Grant to rush for 137 yards and two touchdowns on 20 carries. Grant burst for a 62-yard score on the team's opening possession. ",
            "3": "Meager stats for Rodgers meant poor stats for his receivers. Greg Jennings caught three balls for 56 yards, but Donald Driver had only two grabs for 11 yards. Jermichael Finley led the Packers with five receptions and 70 yards. ",
            "4": "Without Devin Hester, Jay Cutler put together some nice drives and finished 23-of-36 for 209 yards and two touchdowns. However, he had a pair of interceptions, including one really bad one that was thrown to no Bear in particular. ",
            "5": "The one bright spot for Chicago's offense was Johnny Knox, who caught five passes for 83 yards and a touchdown. Some of Knox's receptions were really impressive, and I believe he can be a very good No. 2 receiver in this league. The problem is that Hester is also a No. 2. ",
            "6": "Other Bears stats: Matt Forte had 51 yards on 12 carries. Greg Olsen mustered just two catches for 14 yards. Third-year wideout Devin Aromashodu somehow collected eight receptions for 76 yards and a score. Aromashodu had just nine career catches going into the game, so I wouldn't read too much into this. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "If only every game was as insignificant as this one. With no pressure on them, the Texans easily debacled the Seahawks. In fact, this score wasn't even indicative of how much of a blowout this matchup was. Houston established a 24-0 lead just two minutes into the second quarter. At that point, the Texans had 11 first downs compared to zero for the Seahawks. They also were out-gaining Seattle, 225-12. At halftime, Matt Schaub was 24-of-28 for 336 yards for two touchdowns. Those scores went to Andre Johnson, who had 10 grabs for 184 yards. ",
            "2": "The Texans pretty much ran the clock out in the second half, so the final stats don't look as pretty (Schaub: 29-39, 365 yards, 2 TDs, 1 INT; Johnson: 11-193, 2 TDs). ",
            "3": "So much for Chris Brown getting all the carries; Gary Kubiak's BFF had just three rushes for seven yards. Ryan Moats, the more talented back, had 43 yards and a touchdown on 10 attempts. Arian Foster actually led the team in rushes (13 for 34 yards), but most of that came in the fourth quarter. ",
            "4": "The Seahawks never really had a chance. Matt Hasselbeck went 24-of-35 for 247 yards, one touchdown and an interception, most of which came in the second half. Hasselbeck was knocked out of the game in the third quarter with a shoulder injury, but returned on the following drive. ",
            "5": "T.J. Houshmandzadeh and Nate Burleson were the Seahawk leaders in receiving yardage with 52 (4 catches) and 50 (3) respectively. ",
            "6": "With a large early deficit, the Seahawks couldn't establish the run. Julius Jones and Justin Forsett had about an equal amount of carries, but for only 39 and 26 yards, respectively. Forsett also caught four balls for 47 yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "A pair of cool records: Indianapolis set the NFL record for most consecutive regular-season victories with 22. Brandon Marshall, meanwhile, broke Terrell Owens' mark for completions in a game with 21 for 200 yards and two touchdowns. If you haven't figured it out yet, Marshall and the Colts are awesome. ",
            "2": "As for this game, it was pretty evenly matched despite what the score says. Denver out-gained Indianapolis, 357-312, and won the time of possession by three minutes. The difference was costly, self-inflicted errors and blown opportunities that the Broncos continuously committed. They were stuffed on a pair of fourth-and-ones near midfield with unsuccessful Knowshon Moreno runs. They also were guilty of seven penalties (compared to four for the Colts), most of which were really untimely. As an example, the Broncos had a 3rd-and-1 on Indianapolis' 15. A false start made it 3rd-and-6, and on that play, Kyle Orton tossed a pick. ",
            "3": "Speaking of picks, Peyton Manning launched three, two of which went to Brian Dawkins off deflections. However, the Broncos turned those all three of those interceptions into just three points. As I said, blown opportunities. Manning's stat line was otherwise very strange. He was just 20-of-42 for 220 yards, but tossed four touchdowns. Manning's troubles against good 3-4 defenses are well-documented, and will likely be prevalent in the postseason. ",
            "4": "Dallas Clark caught three of Manning's touchdowns. He finished with five grabs for 43 yards. Austin Collie (3-39) caught the other. Reggie Wayne and Pierre Garcon had just 43 and 39 yards, respectively. ",
            "5": "Joseph Addai had a solid game, rushing for 67 yards on 16 carries, and catching five passes for 49 more yards. Addai left the contest with a minor ankle injury, but returned to the lineup later on. ",
            "6": "As for the Broncos, Orton finished 29-of-41 for 277 yards, two touchdowns and an interception. Amazingly, 21 of his 29 completions went to Marshall. ",
            "7": "Knowshon Moreno couldn't do much against Indianapolis' defense. He carried the ball 23 times but for just 63 yards. He also caught three balls for 13 more yards. Correll Buckhalter had only four attempts (19 yards) because he left the game with an ankle injury in the first quarter and didn't return. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "Randy Moss shut it down. He quit. Those aren't my words. They are Chris Gamble's (paraphrased). But I agree with Gamble. Moss didn't look like he was exerting too much effort on the field against the Panthers. He dropped multiple passes and had alligator arms a few times. He caught only one pass (16 yards) and fumbled the ball right away. Brady approached Moss a couple of times on the sideline. Brady looked like he was trying to encourage his receiver, but Moss didn't even look at his quarterback, sitting silently most of the time. It appears as though the locker-room toad everyone was expecting back in 2007 is finally festering in New England. ",
            "2": "Including Moss' fumble, the Patriots had two turnovers in the red zone. That killed their chances of covering. Had they just scored three points on one of those two red-zone trips, they would have pushed. ",
            "3": "The Patriots have other problems aside from Moss' lack of effort. Brady isn't even close to 100 percent. He could be playing with a broken finger and/or cracked ribs. He consequently was just 19-of-32 for 192 yards, one touchdown and an interception. He also missed a wide-open Moss in the end zone, though Moss probably would have dropped that pass anyway. ",
            "4": "As for Brady's counterpart, Matt Moore was 15-of-30 for 197 yards and a score. Moore's touchdown was a 41-yard bomb to Steve Smith (2 catches, 83 yards) that sort of hanged up in the air like a punt. Fortunately for Moore, New England's secondary was too inept to defend the pass. ",
            "5": "The Panthers mustered 305 net yards of offense, thanks mostly to DeAngelo Williams' running. Williams compiled 82 yards on just 13 carries. Jonathan Stewart had just seven attempts for 29 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Going into this game, Chad Henne was 2-2 on the road, but never had a great performance away from Shark Tank Stadium (or whatever that place is called now.) In four road contests, Henne was a combined 65-of-115, 678 yards, three touchdowns and three interceptions. Well, Henne deserves all of the credit now. At halftime, he was 14-of-16 for 146 yards. He finished 21-of-29 for 220 yards. That said, Henne had a really horrible interception at midfield late in the game up four points. That could have really cost the Dolphins. Luckily, Jacksonville's offense couldn't do anything today. ",
            "2": "Miami out-gained Jacksonville, 354-217, and also won the time-of-possession battle by 11 minutes. The Jaguars converted only 3-of-14 third downs. ",
            "3": "Without a healthy Mike Sims-Walker, David Garrard had major problems, going 11-of-26 for only 139 yards. Sims-Walker played, but was very ineffective (1 catch, 6 yards). In fact, no Jaguar had more than two receptions. ",
            "4": "Maurice Jones-Drew gained 59 yards and a touchdown on 18 attempts. However, Jack Del Rio and Dirk Koetter once again failed to give Jones-Drew enough opportunities; he had just seven carries at halftime. I really don't understand why the concept is so difficult for those two guys. JUST GIVE THE DAMN BALL TO YOUR BEST PLAYER. ",
            "5": "As for Drew-Jones' counterpart, Ricky Williams gained 108 yards and a touchdown on 28 carries. However, Williams had three fumbles. He was lucky that the first two bounced out of bounds, but the third was recovered by Jacksonville in Miami territory. ",
            "6": "Proving that the Dolphins have one of the most inconsistent receiving corps in the NFL, Davone Bess had just three grabs for 34 yards one week after catching 10 balls. Greg Camarillo, meanwhile, had seven receptions for 110 yards. You really can't trust any of these guys in your fantasy leagues. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "This is one of the most depressing games I've ever watched. Not because I lost five units on Cincinnati's disappointing performance, and not because the Bengals failed to capitalize on some potential Brett Favre mistakes. But every time the Vikings had a positive play, CBS continuously showed the Minnesota National Guard cheering on their team. Because I was pulling for the Bengals and consequently going against these army people, I felt like a traitor to this country. I always call other people communists, but I never imagined I would be one myself. ",
            "2": "As mentioned, Favre had a couple of lucky breaks. In the second quarter, one of Favre's passes deflected off a Minnesota player, hit off a Bengals defender and landed into the arms of Greg Lewis. Later on, Favre fired a pass into the end zone that hit cornerback Johnathan Joseph right in the hands. Joseph dropped the ball and the Vikings scored two plays later. Overall, Favre was pretty solid, finishing 17-of-30 for 192 yards, one touchdown and an interception. It was certainly an upgrade over his disastrous performance last week. ",
            "3": "The Vikings did a good job establishing the run with Adrian Peterson again. Peterson rumbled over a stout Bengals defense for 97 yards and two touchdowns on 26 carries. Peterson also had three catches for 40 more yards. ",
            "4": "Sidney Rice caught Favre's touchdown, but had only 39 yards on four catches. Bernard Berrian shockingly led the team with 43 receiving yards. Percy Harvin missed the game with migraines. ",
            "5": "Before this contest, Chad Ochocinco promised that he would blow the Viking horn if he scored a touchdown. Well, Ochocinco did find the end zone, but didn't do anything worth noting. Perhaps it was because his team was losing 10-7 at the time. Mr. Hachi Go finished with three grabs for 27 yards. ",
            "6": "Carson Palmer was horrific. He went 15-of-25 for only 94 yards and a touchdown. A rabid Minnesota constantly hounded Palmer; the Bengals managed only 13 first downs. ",
            "7": "Cedric Benson provided the only sign of life for Cincinnati's offense. He rushed for 96 yards on just 16 carries - a pretty impressive feat against the Williams Wall. The Bengals fell behind early, so that's the only reason Benson didn't get much work. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bills",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "You can look at the box score if you want to know the storyline here. Matt Cassel took four sacks and tossed four picks. The Bills struggled to get into the end zone and this game was Kansas City's for the taking. However, Cassel's four interceptions, all of which took place in the second half, absolutely killed the Chiefs. And speaking of Kansas City's self-destruction, Cassel somehow took a 7-yard sack on 4th-and-goal on Buffalo's 1-yard line in the fourth quarter. I watched that play live and on replay, and I still don't know how something like that happened. Cassel finished 26-of-43 for 224 yards. His 5.2 YPA is something to be proud of; considering that he barely has the arm strength to complete 5-yard passes, any YPA greater than 5.0 is outstanding for him. ",
            "2": "The one bright spot for Kansas City's offense once again was Jamaal Charles. Charles rushed for 143 yards and a 76-yard touchdown on 20 carries. Charles also caught seven balls for 38 more yards. He's a stud, so you have to wonder why Todd Haley didn't recognize how talented he was earlier in the year. Why in the world did it take some homophobic remarks for Haley to make the switch from Larry Johnson to Charles? ",
            "3": "Chris Chambers led the Chiefs with 50 yards. Dwayne Bowe will be back next week, so maybe that'll help Cassel out. ",
            "4": "Ryan Fitzpatrick was 12-of-20 for 86 yards, one touchdown and an interception in the end zone. Fitzpatrick also had what looked like a costly fumble at the beginning of the contest, but the Chiefs failed to score (when Cassel took that dumb sack). ",
            "5": "Fitzpatrick had a sterling YPA of 4.3 and completed only two passes for 15 yards to Terrell Owens. However, Owens managed to score a touchdown, so no media meltdown this week. ",
            "6": "The Bills were able to move the chains via their ground attack. Fred Jackson had 99 yards on 20 carries (as well as three receptions for 23 more yards). Marshawn Lynch gained 84 yards on 12 attempts, one of which was a 47-yard gain. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Jets",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "3"
        },
        "comments": {
            "amount": "1",
            "1": "I'd love to tell you how lopsided this matchup was, but I can just show you a graphic (courtesy of NFL.com). Look at these pathetic Tampa Bay stats as of the end of the second quarter: "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Titans",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Yeah, I had three units on the Rams. I'm not ashamed to admit it. I knew there was a chance Kyle Boller might not play, but I thought, Hey, Boller sucks. Keith Null can't be much worse, can he? Well, now I know my answer. Null might be the worst quarterback to EVER play in the NFL. What's that you say? That title belongs to Ryan Leaf? Well, would you be surprised that Leaf was Null's mentor and coach at West Texas A&amp;M? Null at times appeared to be colorblind. I don't know whom he was throwing to at times because he constantly fired it to Titans defenders when there were no Rams receivers around. Null was 27-of-43 but for just 157 yards (3.7 YPA), one late touchdown and FIVE interceptions. What an embarrassing performance. ",
            "2": "With Null firing it to any moving target on the field, the Titans were able to stack the line of scrimmage and limit Steven Jackson to 47 yards on 19 carries. The Rams should consider shutting Jackson down for the rest of the year to avoid further injury to him. ",
            "3": "All right, enough about those crappy Rams. The most important story regarding this game was Vince Young's injury. Young, who was 6-of-8 for 132 yards and a touchdown, left the contest in the second quarter with a hamstring injury (nothing to do with his earlier knee injury). It's unclear if Young will be able to play next week. ",
            "4": "If Young can't go, Kerry Collins will have to lead the Titans to victory over the Dolphins. Collins was 11-of-19 for 154 yards and a touchdown, but this game was already out of hand when he entered. ",
            "5": "No surprise that Chris Johnson was amazing again. Johnson rushed for 117 yards and two touchdowns on 28 carries. He also had three catches for 69 more yards, which includes a 66-yard receiving score. Johnson nearly had a fourth touchdown in the final quarter, but couldn't get into the end zone on multiple goal-line opportunities. Johnson now has 1,626 rushing yards this season. He's on pace for 2,001 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "Yeah, I had four units on the Raiders. I'm not ashamed to admit it. I figured the Redskins would be flat after losing their Super Bowl and traveling across the country to play lowly Oakland. To be fair, if you were to tell me though that Bruce Gradkowski would get hurt at the end of the second quarter and JaMarcus Russell would have to play the duration of the game, there's no way I would have recommended anything more than 0.000000000001 units on Oakland. Russell was terrible. His stats don't look so bad (10-of-16, 74 yards, 1 INT), but he took multiple sacks because he couldn't read the defense or identify Washington's blitz package (shocker). The team as a whole looked really unmotivated when Russell stepped in. The score at one point was 17-13, but once Russell started taking sacks and doing stupid things, the Raiders looked like they gave up. ",
            "2": "Gradkowski was a more effective 10-of-18 for 153 yards. His knee appeared to get twisted on a tackle, but he was standing up and laughing on the sidelines, so it didn't appear to be serious. Unfortunately, it was later revealed that he has a partially torn MCL and will be shut down for the year. ",
            "3": "Zach Miller was the only Raider who had more than three catches. Miller had seven grabs for 46 yards. Darren McFadden led the squad in receiving yardage with 84 on three catches. ",
            "4": "McFadden couldn't get much on the ground, however; he had just 21 yards on eight carries. Justin Fargas had the same amount of yardage on nine attempts, but managed to score a touchdown. ",
            "5": "As for the Redskins, Quinton Ganther rushed for only 50 yards on 14 carries, but also had three catches for 43 more yards and two touchdowns. Ganther looked great; he doesn't have much physical talent, but he ran tough and continuously broke Oakland tackles, especially later in the game when the Raiders didn't look interested anymore. ",
            "6": "Jason Campbell was also very good, going 16-of-28 for 222 yards and two touchdowns. This was yet another solid performance for Campbell, who has looked like a completely different quarterback ever since Daniel Snyder hired a Bingo announcer to be his offensive coordinator. If I were the dark-hearted Snyder, I'd slap a high tender on Campbell this offseason. ",
            "7": "Despite Campbell's numbers, no Redskin wide receiver did much; Santana Moss paced the team with four receptions and 58 yards. Tight end Fred Davis had three grabs for 50 yards and two touchdowns. After his first score, it appeared as though Davis gave the crowd the middle finger, which drew a 15-yard penalty. ",
            "8": "Making a late push for Defensive Rookie of the Year, Brian Orakpo had four sacks and a forced fumble in this contest. Of course, that wasn't much of a challenge against JaMarcus Russell. Orakpo has 11 sacks on the season. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I had a terrible week with my NFL Picks, but this one was pretty easy. I just went by the trends: Philip Rivers is 14-7 ATS (against the spread) as a starter after Nov. 30. Tony Romo is 2-12 ATS as a starter after Nov. 30 One guy is awesome in December. The other guy sucks. If only each pick were so easy. My only regret is not placing 50,000 units on the Chargers. Laying $5.5 million to win $5 million would have been awesome. ",
            "2": "I'd love to bash Tony Aurora Snowmo, but this defeat wasn't his fault. Though he converted just 1-of-8 third downs, he was 19-of-30 for 249 yards and two touchdowns. Dallas' problem was an overall lack of urgency, a leaky defense that couldn't stop Philip Rivers, and poor, predictable play-calling down at the goal line. The Cowboys had 1st-and-goal on San Diego's 4-yard line in the second quarter. Instead of calling a play-action fake or a bootleg, offensive coordinator Jason Garrett gave Marion Barber four consecutive carries. Barber ran for 3, 0, 0 and 0 yards, and Dallas turned it over on downs. Apparently, Jerry Jones' desire to see Barber receive more carries came to fruition. Barber had a 10-yard gain on a draw and 13 other ineffective runs for 37 yards. As I've been saying, Barber should have gotten a week or two of rest earlier so his quad injury could heal. Instead, the team keeps feeding the ball to a runner who isn't anywhere near 100 percent. Meanwhile, Felix Jones was much more effective, gaining 51 yards on 10 attempts. Tashard Choice for some reason received only two carries, which he transformed into 11 yards. ",
            "3": "Solid numbers for both of Snowmo's receivers. Roy Williams had four grabs for 74 yards, while Miles Austin-Jones had six catches for 71 yards and a score. Jason Witten had four grabs for just 49 yards. ",
            "4": "Philip Rivers was 21-of-32 for 272 yards, one touchdown and an interception. Rivers made several completions to Vincent Jackson (7 catches, 120 yards) and Malcom Floyd (3-40) where I just said wow out loud. The two wideouts continuously made really impressive receptions. ",
            "5": "LaDainian Tomlinson rushed for 50 yards on 21 carries. He also scored his 10th touchdown of the year. He had a nice 10-yard run from his own goal line, but was otherwise ineffective outside of the red zone. He just doesn't have the blocking, and Dallas' defense was geared up to stop the rush in this contest. ",
            "6": "Unlike the Cowboys, the Chargers had some creative play-calling. On one play, they came out in a Wildcat formation with Tomlinson in the shotgun. They ran a double reverse, giving Rivers the ball. Rivers launched a deep throw downfield toward Jackson. The pass fell incomplete, but drew a 38-yard pass-interference flag. ",
            "7": "Two last notes: First, the officials were terrible in this contest. They screwed up on multiple pass interference calls on both sides, including an obvious infraction where Floyd was blatantly tackled by Dallas defensive backs. The refs didn't see it, which really cost the Chargers because Rivers tossed a pick on the next play. And second, DeMarcus Ware suffered a scary injury in this game where he was down on the field for about five minutes. They took Ware off on a stretcher, but he was able to give the thumbs up to the crowd. Fortunately, Ware suffered just a strained neck, and Jerry Jones said the prognosis for his star rush linebacker is excellent. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "38"
        },
        "comments": {
            "amount": "9",
            "1": "This was a crazy game. We got to see everything, from long touchdowns, to fumbles that never happened because no one picked the ball up, to double-reverse passes, to special teams and defensive scores. These NFC East rivals combined for 886 net yards. The Giants actually out-gained the Eagles, 512-374, and won the time of possession by 10 minutes. However, it was DeSean Jackson's punt return for a score and Sheldon Brown's fumble-six that proved to be the difference for the Eagles. ",
            "2": "Jackson was simply brilliant. Along with his 72-yard punt return, he caught six balls for 178 yards and a 60-yard touchdown. With those two long scores, Jackson has tied the NFL record with eight touchdowns in a single season from 50-plus. ",
            "3": "Donovan McNabb was 17-of-26 for 275 yards, two touchdowns and an interception. He nearly had another long score, but just missed Reggie Brown by a couple of inches. Instead, McNabb's other touchdown went to Brent Celek, who had five grabs for 64 yards. ",
            "4": "LeSean McCoy had just 28 yards on 10 carries and four catches for 26 more yards - a pretty disappointing fantasy performance to say the least. Making matters worse, Leonard Weaver vultured away a touchdown. ",
            "5": "Eli Manning was also brilliant here; he went 27-of-38 for 391 yards and three touchdowns. Amazingly, he was able to compile those numbers despite suffering six drops from his receivers. Hakeem Nicks had three balls bounce out of his hands; Steve Smith mishandled one along the sidelines; Kevin Boss couldn't come up with a tough, but catchable grab; and Mario Manningham ran yet another poor route and consequently couldn't get his second foot inbounds for a potential score. ",
            "6": "Nicks, Smith and Boss made up for their drops; the former hauled in a 68-yard touchdown, finishing with four grabs for 110 yards. Steve Smith had seven receptions for 74 yards. Kevin Boss also made seven catches for 70 yards and a score. ",
            "7": "Brandon Jacobs, who had been struggling going into this contest, fumbled in the first quarter. However, that seemed to give him the spark he needed. He went on to rumble for 60 yards and a touchdown on 15 carries, looking like the Jacobs of 2008. ",
            "8": "Two key injuries: Jeremy Maclin was carted off with a foot injury in the first quarter. He'll probably be out 1-2 weeks. Giants right tackle Kareem McKenzie sprained his MCL in the second quarter. He didn't return to the game either. ",
            "9": "With their victory, the Eagles are now in complete control of the NFC East at 9-4. They have two home games coming up against the 49ers and Broncos, while the Cowboys travel to undefeated New Orleans. Philly should be able to lock up its division pretty soon. Meanwhile, the Giants are 7-6, but they're far from out of it because they own the tie-breaker over capsizing Dallas. For thoughts on 49ers-Cardinals, check out my updated "
        }
    },
    "numberOfGames": "14"
}