{
    "year": "2009",
    "week": "06",
    "Game 1": {
        "Team 1": {
            "Name": "Packers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "You may not be able to tell this based on the score, but this was a really sloppy game for the Packers. Despite the blowout win, Aaron Rodgers was sacked five times. Green Bay was also penalized 13 times. And you can't ignore the fact that the Packers were just 1-of-5 in the red zone in terms of scoring touchdowns. ",
            "2": "Green Bay was in the red zone a lot, as the team seemed to live off of Detroit turnovers. Daunte Culpepper, who was 6-of-14 for 48 yards, tossed a pick that gave the Packers an easy touchdown (their only one in the red zone). Culpepper left in the third quarter because of a hamstring injury. Drew Stanton took his place and went 5-of-11 for 57 yards and two interceptions. ",
            "3": "With Calvin Johnson out, neither Culpepper nor Stanton had many options. Dennis Northcutt led the team with five receptions for 40 yards. Brandon Pettigrew didn't catch a single pass. ",
            "4": "Culpepper and Stanton were too inept to get Kevin Smith the ball out of the backfield. Smith finished with no receptions. He rushed for 61 yards on 15 carries. ",
            "5": "Despite poor protection, Aaron Rodgers went 29-of-37 for 358 yards, two touchdowns and a pick against Detroit's sorry secondary. ",
            "6": "Donald Driver led the team with seven catches for 107 yards. In doing so, Driver broke Sterling Sharpe's franchise record for receptions (595). Greg Jennings chipped in with six grabs for 64 yards. ",
            "7": "The Lions stunk all around, but someone who deserves a lot of credit on the team is Julian Peterson, who had 10 tackles, 2.5 sacks and two forced fumbles. On Green Bay's side, rookie Clay Matthews managed two sacks. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Congratulations to the Jaguars: Not only did they get their first-ever victory over the Rams; they also showed a great effort after getting drilled 41-0 last week. That may sound like I'm being sarcastic, but I'm really not. Jacksonville dominated this game, out-gaining St. Louis 492-262, and beat them in terms of accumulating first downs, 33-13. The Jaguars were also 11-of-16 on third down. So, what happened? Why was this decided in overtime? Well, the Jaguars had three turnovers, all of which were huge. Maurice Jones-Drew fumbled at the Rams 19. David Garrard's first interception was tipped and picked off by James Laurinaitis inside the Rams 15. Garrard's second pick was a weird play where Leonard Little caught an attempted screen and was able to return it for a touchdown. Jacksonville should have won this contest by double digits. ",
            "2": "Aside from the two interceptions, Garrard played very well, going 30-of-43 for 335 yards. And take away the costly fumble, and you'll see that Maurice Jones-Drew dominated this contest, rushing for 133 yards and three touchdowns on 33 carries. Drew-Jones also chipped in with five grabs for 45 more yards. ",
            "3": "Both Mike Sims-Walker and Torry Holt eclipsed the 100-yard receiving barrier. Walker-Sims grabbed nine balls for 120 yards. Holt, meanwhile, managed five receptions for 101 yards. ",
            "4": "Once again, Steven Jackson was the only St. Louis player who did anything. Jackson had just 50 rushing yards on 16 carries, but he also notched six receptions for 78 more yards. ",
            "5": "Marc Bulger was 22-of-34 for 213 yards, one touchdown and a pick. His score went to Donnie Avery, who caught that one pass for 17 yards. Unfortunately, Avery left the game in the second quarter because of a bruised hip. ",
            "6": "The Rams have now dropped 16 games in a row. At least they weren't all in the same season. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "31"
        },
        "comments": {
            "amount": "9",
            "1": "The Vikings quickly took a 14-0 lead in this game and appeared as though they would be running away with a blowout. So, what happened? I posed the question in our Live In-Games Thread, and Puppy Puncher, a Ravens fan, came up with a quick answer, I put on two jerseys and a hat and also made a pact with Satan. I guess Puppy Puncher didn't read his contract carefully. Just goes to show that you can't trust the Devil. What really happened to the Vikings was shoddy tackling. Ray Rice ran wild, and on his fourth-quarter touchdown, no Viking was anywhere close to him. He would have scored if they were playing two-hand touch. ",
            "2": "Rice was simply awesome in this game. He rushed for 77 yards and two touchdowns on just 10 carries. He also caught 10 balls for 117 more yards. ",
            "3": "As for Willis McGahee, he was once again left out of the game plan. McGahee had only seven touches, all of which were rushes. He finished with three yards. ",
            "4": "Joe Flacco struggled early on, but did a great job leading his team to a near-comeback victory. Flacco was 28-of-43 for 385 yards and two touchdowns. ",
            "5": "Flacco's two scores went to Derrick Mason and Mark Clayton. Mason caught seven balls for 97 yards, while Clayton had three catches for 57 yards. ",
            "6": "With all of that said, the big hero in this game was Brett Favre (21-of-29, 278 yards, 3 TDs), who once again pulled an improbable throw out of his rear end to lead the Vikings to victory. Favre, who didn't even look like he knew where he was throwing the ball, heaved it downfield and connected with Sidney Rice for a 63-yard gain on the team's final drive. Ryan Longwell nailed the decisive kick a few plays later. ",
            "7": "Rice had an amazing game, finishing with six receptions for 176 yards. Two of Favre's touchdowns went to Visanthe Shiancoe, who had four grabs for 48 yards. The other went to Bernard Berrian, who snagged three balls for 18 yards. ",
            "8": "A week after Cedric Benson became the first player to accumulate 100 rushing yards in a single game against the Ravens since 2006, Adrian Peterson established himself as the second guy to do so. Peterson compiled 143 yards on 22 carries. ",
            "9": "A bunch of Ravens fans traveled to this game, so it was a shame for them to watch Steven Hauschka ruin it by missing a 44-yard field goal that could have won the contest as time expired. I credited Steelers fans for filling Ford Field last week, so I need to mention that the Ravens fans made their presence known in the Homer Dome. After Todd Heap caught a pass, you could hear a ton of people shouting, Heeeeeap! <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Saints",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "No. 1 pass defense, my a**. Drew Brees looked like he was playing against a bunch of high school kids, going 23-of-30 for 369 yards and four touchdowns. The Saints didn't even punt until the third quarter. With the defense non-existent, Eli Manning (14-of-31, 178 yards, TD, INT) had to match the Saints score-for-score. Down 14-0, Eli missed a wide-open Steve Smith in the end zone. At the end of the first half, Manning fumbled the ball away, setting up New Orleans with a short field. At that point, the game was over. ",
            "2": "As you might expect, Brees spread his touchdowns around. The four scores went to Marques Colston (8 catches, 168 yards), Lance Moore (6-78), Robert Meachem (2-70) and Jeremy Shockey (4-37). ",
            "3": "Pierre Thomas and Mike Bell split their carries evenly, with each guy getting 15 attempts. Thomas predictably out-rushed Bell, 72-34. However, Bell scored a touchdown. Thomas also had a goal-line carry, but failed to convert. ",
            "4": "As for New York's running back rotation, Ahmad Bradshaw actually had more carries (10) than Jacobs (7). That was because Jacobs missed a good portion of this game with a stinger. Jacobs' seven rushes went for 33 yards. Bradshaw's 10 attempts turned into 48 yards and a touchdown. ",
            "5": "Hakeem Nicks led the Giants in receptions (5) and yards (114). He also scored a 37-yard touchdown from David Carr in garbage time. All of Nicks' targets came in the second half, but many of them were with Manning under center. Meanwhile, both Steve Smith (44 yards) and Mario Manningham (50 yards, TD) caught four balls. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "The Steelers easily won this game, but they disappointed bettors everywhere by failing to cover by one point. The people who spent their hard-earned money on Pittsburgh can point to two key fumbles that Willie Parker and Rashard Mendenhall gave away deep inside Cleveland territory. In fact, there were four fumbles (two by both teams) in a span of just eight plays in the third quarter. Also, I'd be remiss if I didn't mention that the shady officials in this game reviewed an obvious Hines Ward touchdown, but ruled the catch incomplete even though the ball never hit the ground. When that happened, I had a pretty good feeling that the Steelers weren't going to cover the spread. ",
            "2": "Two big stories for the Steelers. On the defensive side, Troy Polamalu played just his second game of the season. Polamalu made his presence known with an interception. Polamalu limped off the field on the same left knee he hurt in the opener after making the pick, but he returned to the game later on. ",
            "3": "On offense, Ben Roethlisberger was 23-of-35 for a whopping 417 yards, two touchdowns and a pick. Roethlisberger was sacked three times, but often had a ton of time to throw on most plays. On his first score, Roethlisberger seriously had 10 seconds in the pocket. ",
            "4": "Hines Ward and Santonio Holmes both had huge games. Ward caught eight balls for 159 yards and a touchdown, while Holmes grabbed five balls for 104 yards. Heath Miller, meanwhile, chipped in with five receptions for 80 yards and a score. ",
            "5": "Rashard Mendenhall shouldered most of the workload in this contest, rushing for 62 yards and a score on 17 carries. Willie Parker had just seven attempts for 26 yards, but fumbled the ball away in the third quarter. I was ready to criticize Mike Tomlin for using Parker, but Mendenhall fumbled on the next drive. ",
            "6": "As for Cleveland's offense, there's only one thing of note. Mohamed Massaquoi caught five balls for 83 yards. That number is pretty amazing, considering that Derek Anderson had just 122 yards. Anderson was 9-of-24 with a touchdown and a pick otherwise. ",
            "7": "Cleveland's running game predictably failed against the Steelers. Jamal Lewis rushed for 21 yards on 11 carries. Jerome Harrison actually out-gained Lewis (26 yards) on less attempts (5). ",
            "8": "Anderson's interception wasn't the only pick Cleveland had in this game; Josh Cribbs played out of the Wildcat in the red zone, yet tossed an interception to Polamalu. This was yet another mistake by Eric Mangini in his horrific tenure as the Browns head coach. Earlier in the year against the Vikings, Mangina was also unsuccessful running the Wildcat in the red zone. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "Tampa Bay's secondary has been so maligned this season, so am I surprised that Jake Delhomme went just 9-of-17, 65 yards, one touchdown and two interceptions (one of which was an ugly pick-six) against the Buccaneers? Nope. Not at all. Delhomme is that bad. ",
            "2": "Fortunately, the Panthers were able to lean on their running game to carry them to victory. DeAngelo Williams rushed for 152 yards and two touchdowns on 30 carries. Jonathan Stewart, meanwhile, garnered 110 yards and a score on 17 attempts. It's worth noting that Stewart fumbled at the Tampa Bay 2-yard line. ",
            "3": "It's hard to believe, but Steve Smith was shut down in this matchup. Smith's one catch for four yards can be attributed to the ineptness of Delhomme. ",
            "4": "The Buccaneers were able to keep this contest close because of Stewart's fumble, Delhomme's pick-six and Sammie Stroughter's kick return for a touchdown in the third quarter. The offense really didn't do anything; Tampa Bay managed just 12 first downs and 245 total yards. ",
            "5": "Josh Johnson played somewhat well (11-of-17, 147 yards), but once again made crucial errors that cost the team. Johnson launched an interception on the first play of the third quarter that led to a Panthers touchdown. He also had a whopping five fumbles. ",
            "6": "Tampa Bay's leading receiver wasn't Antonio Bryant (2 catches, 37 yards). It wasn't Kellen Winslow Jr. (3-29). It wasn't even the great Michael Clayton (1-9). It was Stroughter, who snagged three balls for 65 yards. ",
            "7": "It looks like Raheem Morris' revolutionary 2-2-1 RBBC rotation is gone. Cadillac Williams rushed for 77 yards and a score on 16 attempts. Derrick Ward, meanwhile, had only one carry. Good thing the Buccaneers didn't give Ward a huge contract before this season. ",
            "8": "Perhaps Tampa Bay should consider giving a big contract to a kicker. The newly signed Shane Andrus attempted only one field goal, and was way short from 43. And by way short, I mean WAY SHORT. It wasn't even close. It looked like a little kid kicked the ball. ",
            "9": "Panthers safety Dante Wesley was ejected from this game in the second quarter, and if I were Roger Goodell, I'd suspend him for the season. On a punt, Buccaneers punt returner Clifton Smith signaled for a fair catch. Instead of letting him field the ball, Wesley launched his shoulder into Smith's helmet. Smith was knocked out of the game with a concussion. There's no reason a dirty player like Wesley should be allowed on the field again this year. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "6"
        },
        "comments": {
            "amount": "8",
            "1": "Daniel Snyder needs to fire Jim Zorn right now. There's no point in waiting until the bye week. Zorn is terrible, and Snyder's not going to get anything out of keeping Zorn around for an extra week. How do you lose to the 0-5 Chiefs? What a disgrace. ",
            "2": "In a desperate move, Zorn benched Jason Campbell at halftime in favor of Todd Collins. Then again, I can't blame Zorn; at that point, Campbell was 9-of-16 for 89 yards, and the Chiefs had eight of the game's initial nine first downs. ",
            "3": "Clinton Portis rushed for 109 yards on 15 carries, but most of that came on a 78-yard gain in the third quarter. Portis left the game with an injury early on, but came back to get the longest rush of his career. Still, it's pretty embarrassing that the Redskins couldn't open up any running lanes against Kansas City's horrific defense. ",
            "4": "Washington's leading receiver was Chris Cooley, who had five catches for 57 yards. Santana Moss managed just one reception (42 yards). ",
            "5": "Though the Chiefs won, they weren't too sharp either. Early on, Todd Haley opted to punt on a 4th-and-4 on the Washington 36. However, the punt sailed into the end zone, which basically saved Kansas City only 16 yards. Haley, perhaps thinking about this decision, went for it on 4th-and-2 on the next drive. Matt Cassel took a sack and fumbled. In total, Cassel was sacked five times in this contest. ",
            "6": "Cassel was his usual self, tossing safe, short passes. He was just 17-of-32 for 186 yards, but did a good job moving the chains, leading the Chiefs to 16 first downs, compared to Washington's seven. ",
            "7": "The only target of Cassel's who had more than 25 receiving yards was naturally Dwayne Bowe, who managed six receptions for 109 yards. ",
            "8": "Larry Johnson rushed for 83 yards on 23 carries. Johnson had a lot of room to run through because Albert Haynesworth left the game yet again with another injury. Perhaps Snyder should hire a competent general manager when he fires Zorn. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "9"
        },
        "comments": {
            "amount": "8",
            "1": "If you slept through all of Sunday, this is not a typo. Yes, the Raiders actually won a game and knocked off the Eagles, who were favored by 14 on the road. So, how did this happen? Four things went wrong: 1. Philadelphia's offensive line couldn't block. It was the most pathetic effort from a front five that I've seen in a very long time. It looked like the Houston Texans' old line was protecting Donovan McNabb (22-of-46, 269 yards). The Raiders managed six sacks, but that doesn't even tell the whole story. McNabb was pressured on almost every single play. 2. Perhaps the reason why the line had issues was because of Andy Reid's horrendous play-calling. The Eagles ran the ball only 11 times out of 55 plays. Brian Westbrook (6 carries, 50 yards) and LeSean McCoy (5-13) combined for 63 yards and a 5.7 average, yet Reid continued to call passes like a mad man. 3. The Eagles as a whole were unfocused. The defense's tackling was pathetic. McNabb, meanwhile, tried to pull a Chris Webber by signaling for a timeout in the first half when he didn't have any in reserve. It was clear that the Eagles showed up to Oakland to just see the sights and play a football game in the hours in between. 4. The Raiders actually showed some signs of life for the first time since Week 2, so they must be given credit. No, scratch that. The Raiders deserve no accolades because for four weeks, they didn't put forth any effort. ",
            "2": "As noted, Westbrook's carries were limited, but he still had a great game, catching nine balls for 91 receiving yards. At least Reid was smart enough to involve Westbrook in the passing attack. ",
            "3": "DeSean Jackson was projected by many to struggle in this contest because of Nnamdi Asomugha. Fortunately for Jackson, Asomugha left the game early with an eye injury. Jackson caught six balls for 94 yards. ",
            "4": "JaMarcus Russell went 17-of-28 for 224 yards, one touchdown and two picks. One of the interceptions wasn't his fault. Russell looked sharp on most of his throws; it was a pretty odd phenomenon. ",
            "5": "The recipient of most of Russell's output was Zach Miller, who caught six balls for 139 yards and an 86-yard score in which the Eagles looked like they were completely uninterested in tackling. Asante Samuel really whiffed on his attempt. ",
            "6": "Fifty-five of Russell's yards went to fullback Gary Russell. Russell will be Oakland's fullback going forward and he'll be heavily relied upon in the aerial attack until Darren McFadden comes back from his injury. ",
            "7": "Justin Fargas rushed for 87 yards on 23 carries. Not the most impressive numbers, but the Eagles are usually stingy against opposing ground attacks. It was nice to see that Tom Cable actually stuck with his running game for a change. ",
            "8": "I lost this as a 4-unit play, but I'm happy to report that I was right about my prediction that Asante Samuel and Sheldon Brown would have more combined interceptions than Darrius Heyward-Bey would have catches. The count: Samuel &amp; Brown 1, Heyward-Bey 0. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "Arizona's defense dominated this game. The Cardinals had some impressive offensive statistics, but the stop unit was the real hero, doing an incredible job of shutting down Seattle's offense. The Seahawks had just 12 possessions in this contest. Eight of them concluded with a punt. One ended in a fumble. Another with an interception. There was the field goal, and the last one was the end of the game. Seattle had just seven first downs and was 0-of-11 on third downs. How did Arizona manage to put the clamps on the Sehawks? They simply put pressure on Matt Hasselbeck (10-of-29, 112 yards, 1 INT) on every play. The Cardinals had five sacks, but they were in the backfield on almost every snap. ",
            "2": "The Cardinals' offense had only two really good drives in this contest, including the first opening possession where they went 80 yards on 15 plays. However, Arizona was able to establish an early 17-0 lead, thanks to a pair of short fields. Immediately following the first touchdown, the Cardinals recovered an onside kick and turned that into another end-zone trip. Right after that, they recovered a Hasselbeck fumble and kicked a field goal. ",
            "3": "Kurt Warner had a solid statistical game, going 32-of-41 for 276 yards, two touchdowns and a pick. However, I'm going to say the same thing I've been harping on for weeks. Warner just isn't going deep; his longest completion was just 22 yards. That throw went to Steve Breaston, who caught seven balls for 77 yards and an impressive leaping score. ",
            "4": "Larry Fitzgerald dominated this contest, accumulating 13 catches for 100 yards and a touchdown. Anquan Boldin, meanwhile, made six receptions for 54 yards. Unfortunately, Boldin suffered a high ankle sprain. His status for Week 7 is still up in the air. ",
            "5": "The one discouraging element of Arizona's victory is that the team still couldn't get the rushing attack going. Tim Hightower had 32 yards and a touchdown on 13 carries, while Chris Wells managed only 29 yards on 12 attempts. ",
            "6": "At least Arizona's ground attack averaged two yards per carry. Check out these numbers from Seattle's backs - Julius Jones: 5 carries, 5 yards; Justin Forsett: 2 carries, 4 yards; Edgerrin James: 3 carries, 3 yards. ",
            "7": "If things weren't bad enough for the Seahawks, they lost Lofa Tatupu for the season with a torn pectoral muscle. What a miserable day in Seattle. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "59"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "Every single talking head on TV will tell you that Tom Brady is back, but I honestly don't know if you can take away anything from this game. I know Tom Brady was 29-of-34 for 380 yards and six touchdowns, and I know he set the record for most touchdowns thrown in a single quarter (5) in the Super Bowl era, but it really looked like Brady was playing in a 7-on-7 drill. The Titans seemed as if they gave up, leaving all of Brady's receivers wide open. Given that they were 0-5 going into the contest and weren't prepared for the snow coming from Tennessee, that shouldn't be a surprise. This game really reminded me of New England's thrashing of Arizona last year. ",
            "2": "Brady made Wes Welker and Randy Moss' fantasy owners very happy. Welker had 10 catches for 150 yards and two touchdowns. Moss, meanwhile, made eight grabs for 129 yards and three scores. Brady's other touchdown went to Kevin Faulk. ",
            "3": "Sammy Morris left in the first quarter with a knee injury, giving way to Laurence Maroney. Maroney responded brilliantly, gashing Tennessee's defense for 123 yards and a score on 16 carries. Seeing Maroney like this makes you wonder where this has been the past few years. ",
            "4": "The only offensive player on the Titans who didn't embarrass himself was Chris Johnson, who managed 128 yards on 17 attempts. ",
            "5": "And now for the humor... Kerry Collins had one of the worst statistical performances of all time. He was 2-of-12 for -7 yards, one interception and two fumbles. Kind of makes you think if Collins relived his Penn State days and showed up to the game drunk out of his mind. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bills",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "13"
        },
        "comments": {
            "amount": "9",
            "1": "Remember when the Jets were 3-0? Remember when Mark Sanchez was anointed as the next Joe Namath? Remember when Rex Ryan was a genius? What the hell happened? I understand losing to the dominant Saints. Going down to the Dolphins in a tough Monday night road game is also excusable. But blowing a 13-3 lead to the Bills who were missing their quarterback? Things are spiraling out of control. ",
            "2": "Sanchez was terrible in this contest, going 10-of-29 for 119 yards and a whopping five interceptions. Sanchez's throws were all over the place. Forget Namath... is this the next Brooks Bollinger? I'm not ready to give up on Sanchez yet, but I think the Jets need to worry that Sanchez all but predicted that he would struggle in cold weather. During the week, Sanchez told the media that he never played in frigid weather. Well, he better get used to it. ",
            "3": "With Jerricho Cotchery out, Braylon Edwards led all Jets receivers in catches with three for 40 yards. Dustin Keller, who was targeted often, came down with two grabs for 16 yards. Keller couldn't get more receptions because Sanchez simply misfired most of the time. ",
            "4": "The one bright spot for New York's offense is how dominant the ground attack was. Thomas Jones showed flashes of his 2008 performances, accumulating 210 yards and a touchdown on 22 carries. Leon Washington also got into the mix, netting 99 yards on 15 attempts. Furthermore, Washington led the squad with 46 receiving yards on three catches. ",
            "5": "Trent Edwards left the game in the beginning of the second quarter with a concussion. Edwards hit all five of his passes for 43 yards, but he missed a wide-open Terrell Owens for a potential long touchdown. That incompletion was wiped out by a Jets penalty. ",
            "6": "Ryan Fitzpatrick replaced Edwards and led the Bills to an overtime victory. Fitzpatrick was 10-of-25 for 116 yards, one touchdown and a pick. He doesn't have much of an arm, but seemed more willing than Edwards to take a shot downfield. There's really not much of a difference between Edwards and Fitzpatrick at this point. ",
            "7": "Marshawn Lynch once again received more touches (21) than Fred Jackson (15). Lynch's 19 carries went for 61 yards, while Jackson turned 15 rushes into 52 yards. ",
            "8": "With Fitzpatrick under center, Lee Evans had a solid performance, catching four balls for 68 yards and a touchdown. Terrell Owens, meanwhile, grabbed just three balls for 13 yards. Owens couldn't get away from Darrelle Revis on most occasions, and on the one time he did, Edwards missed him for a big score. ",
            "9": "Both teams screwed themselves late. Rian Lindell was wide right (shocker) on a 46-yard field goal at the end of regulation. The Jets won the coin toss and took the ball deep into Buffalo territory. Unfortunately, a long Jones run was nullified by a holding penalty. On the subsequent field goal attempt, there was an errant snap, so the holder had to try a pass on the botched play. The Bills intercepted it. "
        }
    }
}