{
    "year": "2009",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "Wow, the Cowboys are awesome! They're finally living up to expectations in December! They've finally turned it around!!!!!!!!!!!!!!! Yeah, OK. Last year, coincidentally in Week 15, the Cowboys triumphed in a game they weren't expected to win. They beat New York, 20-8, dominating both sides of the line of scrimmage, as Tony Romo was 20-of-30 for 244 yards and two touchdowns. Back then, everyone said the Cowboys had finally gotten over the hump. Even I was fooled. Dallas went on to lose their last two games by a combined score of 77-30. We all have a short memory. Anyone who thinks that the Cowboys have gotten over their annual December swoon is mistaken, or at least very premature in that judgment. I still say Dallas loses to Washington and Philadelphia to close out the year. Call me a hater or whatever, but I'm just calling it like I see it. ",
            "2": "I will give credit where credit is due though, and Romo played extremely well. He was 22-of-34 for 312 yards and a touchdown. He didn't throw a pick, though Roman Harper dropped a possible interception. ",
            "3": "Miles Austin-Jones made New Orleans' secondary look silly. He caught seven balls for 139 yards and a score. Jason Witten (5 catches, 44 yards) and Roy Williams (1-14) weren't as impressive. ",
            "4": "Sedrick Ellis' absence was huge; without their dominant defensive tackle, the Saints could not stop Dallas' ground attack, as Marion Barber (17 carries, 62 yards, 2 TDs) and Felix Jones (14-58) ran right through New Orleans' front. ",
            "5": "One huge area of concern for the Cowboys: With an opportunity to ice the game with a 24-yard field goal, the struggling Nick Folk bounced the ball off the right upright. That was Folk's league-leading 10th missed kick of the year. ",
            "6": "The big story for the Saints - aside from them actually losing a game - was how poorly the offensive line played. Drew Brees was sacked four times, marking only the second time he took more than two sacks all year. DeMarcus Ware, playing just six days after suffering a very scary neck strain, made left tackle Jermon Bushrod look like a helpless child. ",
            "7": "Some other uncharacteristic Saints numbers: - They had just one third-down conversion the entire game. They were 1-of-7 on third downs (compared to Dallas' 8-of-15). - They ran the ball just 11 times. The team's leading rusher was Reggie Bush, whose only carry went for 29 yards. - The first catch by a New Orleans wideout came at the 9:43 mark of the second quarter. - The Cowboys won the time-of-possession battle by 13 minutes. ",
            "8": "With pressure in his face all night, Brees went 29-of-45 for 298 yards, one touchdown, an interception and two fumbles. ",
            "9": "Despite Brees' struggles, four of his targets caught five or more passes: Marques Colston (86 yards), David Thomas (77), Pierre Thomas (50) and Robert Meachem (43). Lance Moore vultured away Brees' sole score on a receiver screen to the chagrin of Colston and Meachem owners everywhere. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Randy Moss has silenced all of his critics! He caught five passes for 70 yards and a touchdown! He's awesome again! I love how the media overreacts to this stuff. There was never denying Moss' talent. He's still one of the best receivers in the game. But last week's effort was still really disgusting. He jogged down the field on routes. He short-armed some potential catches. He fumbled away his only reception. There's absolutely no doubt that Moss dogged last week's game. He rebounded by trying hard here. Whoop dee freaking doo. ",
            "2": "Tom Brady was unimpressive to say the least. He was just 11-of-23 for 115 yards, a touchdown and an interception. It was once again apparent that he's nowhere near 100 percent. It also seemed like he was forcing the ball into Moss too much. Considering this easy opponent, as well all of the scrutiny Moss received from the media and the Panthers, I can't blame him. Nine of Brady's completions went to Moss and Wes Welker. Welker uncharacteristically had just four receptions for 40 yards. Brady forcing the ball into Moss really screwed Welker's fantasy owners. ",
            "3": "Laurence Maroney literally carried the Patriots to victory, rushing for 81 yards on 23 carries. He also scored a touchdown. ",
            "4": "Ryan Fitzpatrick was just 17-of-25 for 178 yards, one touchdown and an interception. He was actually benched in the second half, but that was short-lived because after three plays (one sack), Trent Edwards suffered a knee injury and left the game. Fitzpatrick would then lead Buffalo to two red-zone appearances. He hit Lee Evans for a touchdown, but Josh Reed dropped a potential score on fourth down on the other sequence. Speaking of Reed, he led the team in receptions (4) and receiving yards (63). Terrell Owens caught just two balls for 20 yards, so you can probably guess that he was upset afterward. ",
            "5": "Fred Jackson helped keep the Bills in the game, rushing for 80 yards on 15 attempts. With Jackson's help, BUffalo actually outgained New England, 241-224 and won the time-of-possession battle by seven minutes. Reed's dropped touchdown ended up being the deciding play. ",
            "6": "Though the Patriots barely outplayed the Bills, let's just remember how many key players they were missing. They were down two defensive linemen (Vince Wilfork, Ty Warren) and two offensive linemen (Stephen Neal, Nick Kaczur). Also, Brady is definitely not himself, though there's no telling if he'll ever be close to 100 percent before the 2010 season. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "Early on, it looked like the Lions were trying their best to shoot themselves in the foot. They dropped multiple interceptions. Dennis Northcutt muffed a punt. Jason Hanson missed a field goal. When the Cardinals went up 17-0, I wrote in our Live In-Games Thread, This game is over. Well, give major credit to Detroit for not giving up. It all started when Louis Delmas picked Kurt Warner off in the end zone and took it 100 yards to the house. On the next offensive drive, Maurice Morris scored on a 64-yard run. Later on, Cardinals defensive lineman Bryan Robinson helped the Lions score again with back-to-back 15-yard personal fouls as he appeared to shower expletives at the official. The Lions eventually lost, but given the fact that they played half this game with their third-string quarterback, I'd say they did a pretty good job. ",
            "2": "And yes, Daunte Culpepper was benched at halftime. He was horrific, going just 6-of-12 for 64 yards and an interception. Drew Stanton replaced him and went 10-of-19 for 72 yards and an interception. On the bright side, Stanton offered the Lions a rushing threat out of the quarterback position. However, he had major problems hitting his open receivers. All but two of his completions were for eight yards or less. ",
            "3": "When I say that Stanton had trouble getting it to his wideouts, I was referring to Calvin Johnson. Megatron had just three catches for 35 yards. ",
            "4": "With Kevin Smith on IR, Maurice Morris did a great job doing his best Smith impersonation, rushing for 126 yards and a touchdown on just 17 carries. He also caught five balls for 35 more yards. ",
            "5": "Chris Wells also topped 100 yards on the ground, gaining 110 yards and a score, also on 17 attempts. Unfortunately, Tim Hightower (6 carries, 4 yards) vultured away another potential touchdown. ",
            "6": "Warner's numbers were solid (23-37, 233 yards, 2 TDs, INT) but as mentioned earlier, he nearly threw several other picks. Overall, not a good performance, though it was pretty much a meaningless game. ",
            "7": "Warner's scores went to Anquan Boldin (6-72) and Larry Fitzgerald (4-36). "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Texans",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "I seldom say that anyone on NFL.com's GameCenter makes a smart comment, but check out this gem: houston paid big money not to win by 14,,,NFL MADE BIG MONRY FROM VEGAS This guy may have issues differentiating commas from periods, but he has a point. The Texans should have never been favored by 14 on the road. I know I picked them to cover, but it was for only half of a unit. Once I saw that this spread swelled from -9.5 to -14, I didn't like Houston anymore, but I didn't want to change my selection on Sunday morning for everyone who used my pick in their pool. ",
            "2": "The Texans dominated the Rams, outgaining them 367-149, but they just screwed themselves over too many times. It started on the opening drive when Arian Foster fumbled inside the red zone. Matt Schaub fumbled on a quarterback sneak. Kris Brown missed a 52-yard field goal at the end of the first half (this was in a dome, so it wasn't an impossible kick). Backup tight end Joe Dreessen dropped two key catches, including one in the end zone. ",
            "3": "As mentioned, Foster fumbled early on. Prior to that, he had two carries for seven yards and a 13-yard reception. However, after the fumble, he didn't receive a single touch. So much for Gary Kubiak getting a close look at Foster. Instead, Ryan Moats received the majority of the work, taking 13 rushes for 46 yards. ",
            "4": "Matt Schaub played well, going 28-of-40, 367 yards and a touchdown. More than half of that yardage went to Andre Johnson, who hauled in nine grabs for 196 yards. Kevin Walter (4 catches, 42 yards) caught the touchdown. ",
            "5": "Keith Null was a lot better this week than he was at Tennessee. Then again, that's not saying much. Null didn't actually throw to random moving targets on the field; instead, he was 18-of-27 for 173 yards, one touchdown, an interception and two fumbles. Null didn't really pose much of a threat downfield; his longest completion was a 25-yard connection to Steven Jackson coming out of the backfield. ",
            "6": "And speaking of Jackson, he rushed for 82 yards on 20 carries despite back spasms, a herniated disc in his back and the flu. Jackson also paced the team in receiving with 41 yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Titans",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "comments": {
            "amount": "3",
            "1": "Needless to say, this was a huge game for both squads. The loser wouldn't be eliminated, but would face a fierce uphill battle to reach the postseason. These teams played pretty evenly - Miami outgained Tennessee by 104 yards, though the Titans hit more big plays - but in the end, it was a number of huge errors by the Dolphins that did them in. Chad Henne was 29-of-46 for 349 yards and a touchdown, but he also threw three picks, all of which were costly. Henne's first two interceptions were deep in Tennessee territory. One of them was one of the dumbest decisions I've ever seen; Henne was being dragged down and just launched it without even looking. The third pick was the game-clinching duck in overtime. Ricky Williams was also to blame; though he ran for 80 yards and a touchdown on just 19 carries, he had a fumble just outside the red zone. Williams also had a big drop. Ted Ginn also screwed up with a muffed punt. Of course, he was a non-factor on offense. Instead, Brian Hartline led the team with 96 yards on two receptions. Davone Bess (4-58) and Greg Camarillo (5-46) didn't offer nearly as much as an impact as they have in recent games. ",
            "2": "Meanwhile, Chris Johnson once again had a dominant performance, rushing for 104 yards on 29 carries and catching two balls for 55 more yards. Unfortunately, Johnson is now on pace for just 1,977 rushing yards on the year. ",
            "3": "Vince Young was 14-of-27 for 236 yards, three touchdowns and an interception. He was really impressive at times, completing multiple deep throws to Lavelle Hawkins and Nate Washington for 32 yards, each. Young also had two scrambles for 24 yards. More importantly, he has brought this team all the way back to .500 after starting 0-6. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Browns",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "34"
        },
        "comments": {
            "amount": "4",
            "1": "It figures that this matchup would produce the most exciting contest of the afternoon. There were so many long touchdowns: - Joshua Cribbs took two kickoff returns to the house. His first, the seventh of his career, set the NFL record for most kickoff touchdowns. - A bizarre play: The Browns were punting. As the personal protector was pointing out all of the protections, the long-snapper released the ball early. The ball deflected off the protector and into the end zone. Instead of kicking the ball out of the end zone for a safety, punter Reggie Hodges ran circled around it. The Chiefs fell on it for six points. - Jamaal Charles scored on an impressive 47-yard run. Charles rushed for 154 yards and a touchdown on 25 carries. He also caught two balls for 16 more yards. - Jerome Harrison - not Chris Jennings - broke free for rushing scores of 71 and 28. Harrison somehow came within 11 yards of breaking Adrian Peterson's single-game rushing record, gaining 286 yards and three touchdowns on 34 carries. By the way, so much for Jennings being a solid fantasy start. He had just seven attempts in this contest. Harrison started and had a huge game, angering fantasy owners everywhere. It's hard to argue with the results, but it just goes to show that you can never trust the Mangina with anything. ",
            "2": "It's been three wins for the Browns now, and their quarterbacks have a combined 18 completions in those victories. Brady Quinn was just 10-of-17 for 66 yards and two interceptions. Once again, his downfield accuracy was really depressing; each shot he took deep wasn't even close. For more detail, forum member JoeyPotter: <i> Quinn throws the ball into double coverage and gets it intercepted. When he throws the ball long he doesn't look where he is throwing the ball. Quinn actually turns his head as he throws and ends up looking at the ground by the time he lets it go. Does the QB Coach not see this? That is why he is so atrocious with his downfield accuracy; he doesn't look where he's throwing. </i> ",
            "3": "Conversely, Matt Cassel was actually really impressive. He went 22-of-40 for 331 yards and two touchdowns. He nearly had a third score when Dwayne Bowe dropped a ball in the end zone. Cassel took just one sack. ",
            "4": "Outside of the end-zone drop, Bowe had four catches for 56 yards in the return from his suspension. Bowe's greatest purpose served as drawing attention away from Chris Chambers, who hauled in five grabs for 114 yards and a score. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "The Jets have only themselves to blame. They outplayed the Falcons (who secured their fifth first down with three minutes remaining in the third quarter and were outgained by 80 yards) but lost because they were way too sloppy. Mark Sanchez may need a new color-coding device because it's clearly broken. He tossed three horrible interceptions, one of which gave Atlanta a score. Sanchez finished 18-of-32 for 226 yards, one touchdown and those three picks. He made some impressive third-down conversions and a great deep throw to Braylon Edwards, but his mistakes really helped the Falcons win this one. More prominently, the Jets screwed up three field goal attempts. The first, a 19-yard try, was a botched hold by Kellen Clemens. The second was a missed 38-yard kick. The third was blocked from 37. ",
            "2": "Edwards had five catches for 105 yards and a pretty 65-yard touchdown in which he was wide open. Jerricho Cotchery had six grabs for 49 yards. ",
            "3": "The Jets surprisingly couldn't run the ball effectively. Thomas Jones gained just 52 yards on 19 carries. ",
            "4": "And speaking of running backs, Mike Smith really screwed everyone by making Michael Turner active. Turner carried the ball just once for seven yards before leaving the game when he reaggravated his ankle injury. There's really no reason Turner or Matt Ryan should have played; with the Falcons eliminated from the playoffs after Dallas' Saturday night win, both players should have sat out to heal their injuries. Instead, Smith irresponsibly went with his two starters despite the fact that they clearly weren't 100 percent. This, in my opinion, is a fireable offense. I like what Smith has done in Atlanta thus far, but his decision lacked any sort of intelligence, logic or common sense. Ryan, by the way, was just 16-of-34 for 152 yards and a score. He suffered some uncharacteristic dropped balls by Tony Gonzalez (3-32, TD). However, Ryan made the mistake of trying to force it to Roddy White often, which wasn't a good plan. White had just four grabs for 33 yards and was guilty of an offensive pass interference penalty. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "The Raiders battled the Broncos well and had a 13-6 advantage at halftime, but relinquished the lead in the third quarter. Denver went in front and led 19-13 in the third quarter when Charlie Frye left the game with an injury. I laughed as JaMarcus Russell put down his Skittles packet and donned his helmet. My survivor pick was safe. Or so I thought. Captain Skittles to the rescue! JaMarcus Russell did some stupid stuff when he entered the game. He took a sack and fumbled the ball. He even left for a play in which J.P. Losman looked completely helpless. But Russell came back and hit some clutch throws on the final drive, leading the Raiders to an improbable touchdown and victory. Survivor pick debacled. Well, it was a nice run. If it takes Captain Skittles to beat me, so be it. ",
            "2": "Captain Skittles was 5-of-11 for 47 yards and that game-winning touchdown to Chaz Schilens. Charlie Frye, meanwhile, was 9-of-17 for 68 yards and a pick. He also had a 26-yard scramble. Those numbers look pretty bad, but the team played hard under Frye. ",
            "3": "The Raiders were able to give themselves a chance to win by pounding the rock. Michael Bush looked great, gaining 133 yards and a touchdown on 18 carries. One has to wonder why he hasn't played more this year. Darren McFadden chipped in with 74 yards on 12 attempts. Justin Fargas didn't see much action because he <strike> had to find a virgin for Al Davis to sacrifice</strike> tweaked his knee. ",
            "4": "Conversely, Denver couldn't run the ball at all, which was surprising considering that Oakland was giving up 4.8 yards per carry entering this contest. Knowshon Moreno managed just 42 yards on 19 attempts. ",
            "5": "Kyle Orton went 19-of-34 for 278 yards and a touchdown, but struggled a bit deep in Oakland territory. The score went to Brandon Marshall, who of course was Denver's most productive receiver by far, hauling in seven grabs for 73 yards. ",
            "6": "This game stopped for about 10 minutes because someone in the stands had a laser pointer and was flashing it in the eyes of some of the players. The police did a good job of locating that douche bag and removing him from the crowd. Let's hope this idiot rots in prison for 50 years. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "No jokes or attempted humor here. I want to focus on how much respect I have for Cincinnati. There's no way the Bengals could have been mentally prepared for this game. At times, they seemed really disoriented. On one drive, they had three consecutive false starts, followed by a wasted timeout. They eventually fell down by 11, but they showed a ton of heart and made a great comeback. Unfortunately, the Chargers put together a 46-yard drive - with the help of a missed procedure penalty by the officials - to set up Nate Kaeding's game-winning 52-yard field goal. ",
            "2": "Chad Ochocinco planned on wearing Chris Henry's No. 15 jersey, but decided against it because he didn't want to cause a distraction. However, Ochocinco scored a touchdown in the second quarter. He had no crazy celebration planned; instead, he looked toward the sky, knelt down and prayed. A classy move by Ochocinco. ",
            "3": "Carson Palmer was great, going 27-of-40 for 314 yards, two touchdowns and an interception. Oddly enough, his target of choice was tight end J.P. Foschi, who had seven catches for 82 yards. ",
            "4": "Neither running back did much on the ground; Cedric Benson rushed for 53 yards on 15 carries, while LaDainian Tomlinson mustered 59 yards on 16 attempts. Tomlinson also had four catches for 58 more yards. ",
            "5": "Philip Rivers also had a solid performance considering that he was going up against two shutdown corners. He was 24-of-38 for 308 yards, three touchdowns and two picks. ",
            "6": "Two of Rivers' scores went to Vincent Jackson, who hauled in five balls for 108 yards. Antonio Gates (4-33) had the other. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "So much for all of the momentum the 49ers supposedly built by beating the Cardinals on Monday night. They managed just 261 total yards of offense and were a laughable 0-of-11 on third down. The big thing for San Francisco, however, was the turnovers. Alex Smith (20-37, 177 yards, TD) launched three interceptions in Eagles territory. Delanie Walker, meanwhile, fumbled in the red zone when the score was just 7-3. The Eagles took over and went 94 yards for a touchdown, giving them a sizable lead that they would never relinquish. ",
            "2": "Though he tossed two interceptions, Donovan McNabb otherwise played pretty well, going 21-of-36 for 306 yards and a touchdown. He hit three plays of 39 yards or more. Two of McNabb's big gainers (39, 59) went to DeSean Jackson, who finished with six receptions for 140 yards and a touchdown. The other was to Brent Celek (43), who notched four catches for 73 yards. ",
            "3": "Leonard Weaver led the team with 17 carries for 52 yards. LeSean McCoy rushed the ball just nine times, but gained 48 yards and a score. ",
            "4": "Frank Gore, meanwhile, led all backs in rushing with 107 yards on just 16 attempts. It's a shame the 49ers fell behind early; otherwise, Gore would have had more opportunities. ",
            "5": "Strangely, neither Vernon Davis (3-43) nor Michael Crabtree (4-26) led the 49ers in receiving. Josh Morgan did that, snagging seven balls for 61 yards and a touchdown. Davis received a verbal lashing from Mike Singletary for not making an attempt to break up Alex Smith's first interception. ",
            "6": "I thought this could be a potential stink bomb game from Andy Reid. The Eagles won, but Big Red still made a huge error. On 4th-and-inches in the first quarter, Reid decided to go for it on his own 29! Philadelphia wasn't able to convert, giving the 49ers a short field. Fortunately for them, Walker had that aforementioned fumble. ",
            "7": "Another humorous event in this contest: The Eagles moved deep into 49ers territory at the end of the first half. Time was running out, so they needed to clock it for one last attempt to get the ball into the end zone. However, they weren't able to do so because Weaver started jawing with a 49er defender. The time kept ticking down, but Weaver was killing the Eagles because he wasn't paying attention. Reggie Brown was. Brown hurled his tape at Weaver to get his attention. He then ran over to his fullback to pull him away. The Eagles stopped the clock, but didn't have enough time for an end-zone shot. They settled for a David Akers 26-yard field goal. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "What a great day for the Ravens. Not only did they absolutely crush the Bears, they also saw the Broncos, Jets and Dolphins all lose. Coming into this weekend out of playoff position, Baltimore now has control of the AFC's fifth seed. ",
            "2": "For the second straight week, Joe Flacco was nearly flawless. He was a sterling 21-of-29 for 234 yards and four touchdowns, helping Baltimore outgain Chicago by 120 yards. ",
            "3": "Flacco's first two touchdowns went to Todd Heap (5-56). The others went to Demetrius Williams (4-71) and Derrick Mason (6-87). ",
            "4": "With no need to play in the fourth quarter, Ray Rice had only 16 carries, but he turned those rushes into 87 yards. He also caught five balls for 17 more yards. ",
            "5": "For the Bears, it was the same old story. Jay Cutler tossed three interceptions, and was just 10-of-27 for 94 yards. Caleb Hanie saw action late, but was just 2-of-5 for eight yards and - surprise - another pick. ",
            "6": "Matt Forte was solid early and helped the Bears move the chains a bit in the first half. He rushed for 69 yards on 20 carries. Unfortunately, his effort was all for naught; the first two drives ended with Cutler interceptions in Baltimore territory, while the third was a turnover on downs at the Ravens' 1-yard line. Chicago's only score of the afternoon was on the ensuing punt return. ",
            "7": "Though the Ravens have to be feeling good about themselves right now, they received one piece of bad news Sunday night. Impressive rookie corner Lardarius Webb is out for the year with a torn ACL. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "36"
        },
        "comments": {
            "amount": "7",
            "1": "This game seemed to have everything - explosive offensive plays, some solid defensive stops and even a dumb coaching decision. Let's begin with the fireworks. Aaron Rodgers was 26-of-48 for 383 yards and four touchdowns (3 pass, 1 rush), but that pales in comparison to what Ben Roethlisberger accomplished. Just 10 days after struggling versus the Browns, Big Ben went 29-of-46 for 503 yards and three scores. His 503 yards were the 10th-highest single-game total in NFL history. These two teams combined for an amazing 973 total yards. But here's the amazing thing: There were still 10 punts and 17 penalties in this game! If I didn't know any better, I'd say the Steelers and Packers played five quarters. This contest was the last one to end, so I think that's a possibility. ",
            "2": "Roethlisberger was sacked five times, two times each by rookies Clay Matthews and Brad Jones. Matthews also forced Roethlisberger into a lost fumble, but that play was overturned on a review. ",
            "3": "None of Big Ben's scores went to Hines Ward, Heath Miller and Santonio Holmes. Two of them were to Mike Wallace (2-79). The other found Mewelde Moore. As for the three big names, both Ward and Miller made seven grabs for 126 and 118 yards, respectively. Ward's numbers were shocking, considering he was hobbled with a hamstring injury and appeared to be limping around the field at times. Holmes, meanwhile, made three receptions for 77 yards. ",
            "4": "Rashard Mendenhall also chipped in with six catches for 73 yards. He didn't do much on the ground though, mustering just 38 yards and a touchdown on 11 carries. ",
            "5": "Ryan Grant oddly just ran the ball eight times, gaining 37 yards and a touchdown. Unlike Mendenhall though, Grant didn't do anything in the passing game. ",
            "6": "Jermichael Finley paced the Packers in receptions with nine for 74 yards and a touchdown. The team's leading receiver was Greg Jennings, who hauled in five catches for 118 yards and a score. Donald Driver caught only three balls for 76 yards. ",
            "7": "As for the dumb coaching decision, Mike Tomlin opted to try an onside kick in the fourth quarter - only he was up two points and there were four minutes remaining in regulation. Tomlin said afterward that he didn't have any confidence in his defense to stop the Packers. Well, I'm not going to disagree with that, but an onside kick has what, a 20-percent chance of working? Did Tomlin actually think that there was less than a 20-percent chance that his defense could contain Rodgers? If so, will he try an onside kick every single time he plays a good offense? If so, I'd like to see that game. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "Jim Mora Jr. needs to be fired. He's a disgrace. It's one thing to go down to a losing team at home. It's another to drop a contest to a franchise that has a rookie quarterback, one win this year, oh, and just four victories on the West Coast since coming into the league! What happened to the Seahawks? Even if they aren't good, they should still be able to beat a terrible team at Qwest Field. Mora has completely ruined this organization and needs to go. Perhaps then he can pursue his dream to coach middle-school football in the state of Washington. ",
            "2": "It should not surprise you at all that the talentless Julius Jones had more touches than the upstart Justin Forsett. Jones had 65 yards on 12 carries, while Forsett managed 55 yards on nine rushes. Both had two receptions (Forsett: 14 yards; Jones: 0 yards). I'd advise Mora to use Forsett over Jones, but the man clearly doesn't understand talent. In fact, I don't think he understands anything at this point. Good riddance, I say. ",
            "3": "Ask any clueless person who the rookie quarterback was in this contest, and they'll all tell you it was Matt Hasselbeck. While Josh Freemen was a solid 16-of-26 for 205 yards, three touchdowns (2 pass, 1 rush) and an interception, Hasselbeck was 27-of-46 for 256 yards, one touchdown, four interceptions and a fumble. The fumble was really pathetic; he ran around in circles like some lunatic and needlessly tried to lateral the ball despite it being relatively early in the contest. Two of his picks were horrible reads. I'd say that Hasselbeck played with a JaMarcus Russell brain transplant, but Captain Skittles was actually better than Hasselbeck this Sunday. ",
            "4": "With Nate Burleson out, John Carlson and T.J. Houshmandzadeh led the team with seven catches for 86 and 73 yards, respectively. Carlson had the lone score. ",
            "5": "With Freeman playing well, Kellen Winslow Jr. actually had a solid performance, catching six balls for 93 yards. Antonio Bryant, however, had only three receptions for 35 yards. ",
            "6": "Derrick Ward and Cadillac Williams combined for 31 carries, gaining 67 and 66 yards, respectively. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "7"
        },
        "comments": {
            "amount": "3",
            "1": "One is an accident, two is a trend. The Vikings were blasted on the road two weeks ago, but that was against a tough Arizona team after not traveling out of the Metrodome for more than a month. This defeat was a lot more disconcerting for many more reasons: - This contest marked the first time a running back has tallied 100 or more yards against the Vikings since Ryan Grant in November 2007. And it wasn't DeAngelo Williams; Williams left the game early after six carries for 13 yards. Jonathan Stewart came in and mustered 109 yards and a touchdown on 25 attempts. The Vikings haven't been able to stop the rush ever since middle linebacker E.J. Henderson suffered a season-ending injury two weeks ago. - Matt Moore struggled early, but managed to go 21-of-33 for 299 yards and three touchdowns, hitting numerous big throws to Steve Smith (9 catches, 157 yards, TD). Moore really heated up in the fourth quarter. With the Vikings placing more of a focus on containing Stewart, Moore was able to finish an amazing 6-of-7 for 171 yards on his final three drives. - Brett Favre just had his third straight pedestrian performance. He was absolutely terrible at Arizona and was fortunate enough that the Bengals dropped multiple interceptions last week. Favre was 17-of-27 for 224 yards and an interception at Carolina. That doesn't seem that bad, and Favre made quite a few nice plays, but overall, he's not even close to the guy we saw dominate in November. - Perhaps the most confusing aspect of this game was Minnesota's inability to establish the run against a defense that had allowed five consecutive opponents to rush for 139 yards or more. Adrian Peterson compiled just 35 yards and a tough touchdown on 12 carries. He saved his fantasy owners with three receptions for 73 more yards (including a very impressive 63-yard run of the catch), but this is the second time in three weeks that the Vikings haven't been able to get Peterson going. - Also for the second time in three weeks, Minnesota struggled to protect Favre. After taking three sacks at Arizona, Favre went down four times at Carolina. Favre was getting hit so much that Brad Childress tried to pull him from the game. However, Favre refused to come out. ",
            "2": "Other numbers for the Vikings: Sidney Rice led the receivers with four catches for 69 yards. Bernard Berrian and Visanthe Shiancoe had three receptions each for 25 and 24 yards, respectively. Percy Harvin caught just one ball for 10 yards and was targeted just three times. Harvin barely practiced this past week because of migraines. ",
            "3": "As for the Panthers, I'm starting to really like this Matt Moore character. He had some shaky throws early on, but as the game progressed, it appeared as though John Fox and his staff had more confidence in him. As mentioned, he was 6-of-7 for 171 yards on his final three drives. More importantly, in his three starts, he has turned the ball over only once. Moore is the guy Jake Delhomme was supposed to be - a steady, mistake-free quarterback who can make just enough throws to give the defense and running game a chance to win. Barring a massive meltdown the next two weeks, Moore needs to be the starter next year; not Delhomme. "
        }
    },
    "numberOfGames": "14"
}