{
    "year": "2009",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "19"
        },
        "comments": {
            "amount": "1",
            "1": "I can sum up this game in a few sentences: Michael Turner injury. Horrible Falcons play-calling. Atlanta can't tackle. Matt Ryan sucked. Jake Delhomme's kids aren't kidnapped anymore. Let's go over each of those: - "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "This was a game that just slipped out of the Buccaneers' hands. They were continuously guilty of fumbling and holding calls at inopportune moments. Tampa Bay was whistled for nine penalties compared to Miami's three. The Buccaneers fumbled in Dolphins territory early in the contest, blowing an opportunity for at least three points. At the end of the first half, they fumbled on their own 15, setting up Miami with a short touchdown. In the third quarter, Tampa advanced to Miami's 35. I posted the following on the forum: Bucs to the Miami 35. Time for a fumble! Sure enough via NFL Game Center: (5:33) (Shotgun) J.Freeman FUMBLES (Aborted) at MIA 40, and recovers at MIA 48. J.Freeman to MIA 48 for no gain (C.Anderson). In total, Josh Freeman fumbled four times. He finished 16-of-28 for 196 yards, one touchdown and a pick otherwise. Freeman played a solid game for a rookie quarterback starting his first road tilt, but he needs to cut down on the mistakes and improve his ball security. ",
            "2": "Some key stats for the Bucs: Kellen Winslow had seven catches for 102 yards. Cadillac Williams rushed for 52 yards and a score on 14 attempts. ",
            "3": "While the Buccaneers tried their best to beat themselves early on, the Dolphins attempted to do so late in the contest. When Miami was running the clock out, Chad Henne tossed a horrible interception to Quincy Black on a third down. You have to wonder what Henne was thinking because no Dolphins player was even in the vicinity. Henne redeemed himself by putting together a game-winning drive with 1:14 remaining on the clock. Henne was 17-of-31 for 175 yards, one touchdown and that pick. ",
            "4": "Ted Ginn Jr. started the game and was booed when he dropped a long touchdown. He finished with no catches. If he wasn't such an effective return man, he wouldn't be on the team anymore. Davone Bess led the squad with four receptions for 72 yards. ",
            "5": "Ricky Williams had way more carries (20) than Ronnie Brown (12). Williams also out-gained Brown, 102-82. Brown caught the touchdown, but he left the game in the third quarter with an ankle injury and didn't return. He'll probably be out Thursday. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "You have to feel bad for those who had the Lions +16.5 because the Vikings kicked a meaningless field goal in the fourth quarter. But then again, Detroit was pretty fortunate to even be in the game. The Vikings may have won by 17, but they played a really sloppy game. Early on, they attempted a double end-around and fumbled. Against the Lions, you'd think that a standard offense would suffice. On a later 4th-and-1, they ran up the middle with Jeff Dugan - not Adrian Peterson - and failed. Peterson also lost two fumbles, including one in the end zone that resulted in a touchback. ",
            "2": "Despite those fumbles, Peterson still had a dominant performance, gaining 133 yards and two scores on just 18 carries. ",
            "3": "Sidney Rice simply cannot be contained. The third-year wideout had seven grabs for 201 yards. Meanwhile, Percy Harvin, Visanthe Shiancoe and Bernard Berrian each had three catches for 53, 43 and 22 yards, respectively. ",
            "4": "As for Brett Favre, the old veteran went 20-of-29 for 344 yards and a touchdown to Dugan. Think the Lions will be happy when this guy finally retires? ",
            "5": "Matthew Stafford did a good job rebounding off last week's five-pick performance. Still looking hampered by his knee, Stafford went 29-of-51 for 224 yards, one touchdown and no interceptions. He looked often toward Calvin Johnson, who finished with eight receptions for 84 yards. ",
            "6": "Kevin Smith rushed for 55 yards on 12 carries. He also had three catches for 10 more yards. That's 15 touches for Smith, which isn't anywhere near the number he should be getting. If the Lions want to win some games, they'll get the ball into Smith's hands 20-25 times per contest. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "22"
        },
        "comments": {
            "amount": "6",
            "1": "It's hard to believe that the Jaguars are 5-4. They were up 21-13 in this contest, but it looked like they were going to blow it when they surrendered nine unanswered points to the Jets in the fourth quarter. Once the Jets made it 22-21, Jacksonville had the ball on its own 17 with 4:56 remaining in regulation. New York never got the ball back. The Jaguars went 82 yards. Maurice Jones-Drew had the opportunity to score a touchdown, but wisely took a knee at the 1. Jacksonville bled the clock down and kicked an extra point-type field goal to secure the victory as time expired. ",
            "2": "That decision sucked for Maurice Jones-Drew's fantasy owners - and Jones-Drew apologized for this - but he still rushed for 123 yards and a touchdown on 24 carries. ",
            "3": "David Garrard was an economical 16-of-26 for 221 yards and a touchdown. That score went to Mike Sims-Walker, who had three grabs for 49 yards. Torry Holt had just two receptions. ",
            "4": "Mark Sanchez went 16-of-30 for 212 yards, one touchdown and two picks. It was ugly early for Sanchez, but he had a strong finish. On his final two drives, he went 9-of-13 for 79 yards, leading New York to nine points. Unfortunately for the Sanchez, he didn't get a chance to win because the Jaguars killed the clock. ",
            "5": "Amazingly, only four Jets caught passes: Braylon Edwards (3 catches, 79 yards), Jerricho Cotchery (6-68, TD), Dustin Keller (6-58) and David Clowney (1-7). ",
            "6": "Thomas Jones rushed for 77 yards and a touchdown on 21 carries. Shonn Green took away seven attempts, but turned them into only 26 yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "The big news in the War of 18-12 were two key injuries. Cedric Benson, who rushed for 22 yards on seven carries, left early with a strained hip flexor. The early prognosis looks good. Meanwhile, Troy Polamalu re-injured the left knee that he banged up in Week 1. He left in the first quarter and didn't return. ",
            "2": "I had the Bengals at 10-6 in my season previews, but never did I imagine that they would sweep both the Ravens and Steelers. This marked the first time since 1998 that Cincinnati beat Pittsburgh twice in the same year. Amazingly, the Bengals were just 3-13 that season. ",
            "3": "Cincinnati's defense is amazing. The Bengals... - Limited the Steelers to 226 yards. - Held Rashard Mendenhall to just 36 yards on 13 carries. - Forced Ben Roethlisberger into just 20-of-40 for 174 yards and a pick. - Sacked Roethlisberger four times. - Allowed no touchdowns and four field goals in four red-zone trips to the Steelers. ",
            "4": "The Bengals like to eliminate No. 1 receivers with their bracket coverage. Santonio Holmes caught seven balls for 88 yards (with a dropped touchdown), so it's clear that they were focusing more on Hines Ward, who had just four grabs for 24 yards. Heath Miller, meanwhile, had four catches for 26 yards. ",
            "5": "Carson Palmer went 18-of-30 for 178 yards, but he's really lucky that he wasn't intercepted three times in this game, including twice on the opening drive. The Bengals came out firing - they threw on the first five plays - and it nearly cost them. ",
            "6": "Chad Ochocinco didn't get a chance to pull any sort of mustard antics. Ochocinco was limited to just two grabs for 29 yards. Laveranues Coles led the squad with five receptions for 67 yards. ",
            "7": "With Benson out, Bernard Scott got all of the work versus Pittsburgh's No. 1 rush defense. Scott managed just 33 yards on 13 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Saints",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "Welcome to Bizarro World. The Saints came into this game as 14-point favorites, yet the Rams dominated this game. Don't believe me? St. Louis... - Out-gained the Saints, 434-420. - Had more first downs (23) than New Orleans (19). - Won the time-of-possession battle. - Forced Drew Brees into two interceptions (Brees was 18-of-26, 223 yards otherwise). - Stopped the run completely; aside from a 55-yard Reggie Bush scamper, Bush (6 carries, 83 yards), Pierre Thomas (11-37) and Mike Bell (8-30) were very ineffective. - Limited Marques Colston to just two catches for 17 yards. ",
            "2": "The leading receivers for the Saints? Devery Henderson (4 catches, 72 yards) and David Thomas (5-45). Bizarro World indeed. ",
            "3": "Speaking of Bizarro World, Marc Bulger went 26-of-40 for 298 yards, two touchdowns and a pick. Bulger loved going to his new receiver, rookie Brandon Gibson, who caught seven balls for 93 yards. Donnie Avery grabbed both of Bulger's scores, finishing with four receptions for 67 yards. ",
            "4": "Steven Jackson once again was amazing. He rushed for 131 yards and a touchdown on 26 carries. He also caught a whopping nine balls for 45 yards. It's clear that the Saints really miss stud defensive tackle Sedrick Ellis. They'll continue to struggle versus the run until he returns. ",
            "5": "While the Rams played well throughout this contest, their final 2-minute drive was very amusing. Bulger was horrible, hitting Saints defenders in the back, throwing short passes over the middle with no timeouts and wasting tons of time in other situations. Bulger basically had to go 80 yards with 2:21 in regulation and no timeouts. Despite that dilemma, Bulger had completions of just 7, 6, 9, 11, 4 and 5 yards. Not exactly what you're looking for when you need a very quick score. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Titans",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "Don't let the final score of this game deceive you; the Titans out-gained the Bills by about only 80 yards, and this was a 17-17 battle through three quarters. Tennessee had two late pick-sixes. ",
            "2": "It's three down, seven to go until we can all ask Chris Johnson for lottery numbers and the real date the world will end. Three weeks ago, Johnson announced that the Titans would finish the year 10-6 after starting 0-6, and that he would rush for 2,000 yards. Well, Tennessee has three wins in a row, and Johnson is on pace to run for 1,939 yards. Johnson completely carried this team once again, gaining 132 rushing yards and two touchdowns on 26 attempts. He also caught nine balls for 100 more yards. ",
            "3": "Vince Young, meanwhile, had yet another Hall of Fame-type performance. Young went 17-of-25 for 210 yards, one touchdown and a pick. He also scrambled five times for 29 yards. More importantly, Young is now 21-11 as a starter. ",
            "4": "Aside from Johnson, no Titan caught more than two passes. Kenny Britt (55 yards), Nate Washington (33, TD) and Bo Scaife (16) all had two grabs. ",
            "5": "A weird thing happened in this game. On one sequence in the second quarter, Terrell Owens was flagged for a penalty and then gave up on the block. Immediately afterward, Owens began yelling at everyone on the sidelines. Crazy, right? Yeah, Owens is such a great teammate that it's pretty difficult to imagine him yelling at anyone. What's even more strange is that Owens responded with two long receptions of 46 and 37 yards. I don't know who knocked Trent Edwards out and put on his uniform, but those passes sure were impressive. ",
            "6": "Edwards went 18-of-28 for 185 yards, one touchdown and a pick that went right through Owens' hands. That means that if you take away Owens' two long grabs, Edwards was just 16-of-26 for 102 yards, giving him a gaudy YPA of 3.9. Thanks for the effort, Trent. ",
            "7": "Fred Jackson was Buffalo's best offensive player in this contest. He rushed for 48 yards on eight carries and also had an impressive 27-yard touchdown pass to Lee Evans (Evans had four grabs for 50 yards and two scores). Everyone in the Live In-Games Thread in the forum pretty much agreed that the Bills should keep using Jackson as their quarterback. ",
            "8": "Marshawn Lynch strangely shared carries equally with Jackson; Lynch had only one more rushing attempt, yet had less yardage (37). It's good that the Bills are getting Jackson more involved on offense. Perhaps he'll get some more snaps as a Wildcat quarterback. ",
            "9": "Rookie safety Jairus Byrd pretty much has the Defensive Rookie of the Year locked up; Byrd picked off his eighth pass of the year. Maybe he should get snaps at quarterback too; at this point, anyone except Ryan Fitzpatrick would be an upgrade over Edwards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "It was fun while it lasted. It's more evident than ever that Denver's 6-0 start was a mirage. The Broncos are now 6-3 and have to battle a red-hot Chargers squad next week. If they lose that one, it's over. ",
            "2": "Of course, the Broncos may have won this game if Kyle Orton was able to play the entire game. Orton suffered an ankle injury in the second quarter and didn't come back after halftime. Orton was 11-of-18 for 193 yards and two touchdowns. His scores were deep bombs to a wide-open Brandon Marshall. Both tosses were ugly (especially the first one), but Orton easily connected with his No. 1 wideout because there was no Redskin within 10 yards of Marshall. Orton also somehow overthrew Eddie Royal for what would have been a 70-yard score. Chris Simms stepped in for Orton and was just 3-of-13 for 13 yards and a pick in the second half. If Simms isn't cut in the next few days, we'll know that Simms has naked photos of Josh McDaniels. ",
            "3": "Correll Buckhalter lost a fumble early on and didn't see another carry afterward. That was just the excuse McDaniels needed to have Knowshon Moreno as his every-down runner. Moreno rushed for 97 yards on 18 attempts. Buckhalter had just 11 yards on two carries. ",
            "4": "Marshall had those two aforementioned touchdowns. He finished with five grabs for 134 yards. It's a shame that Simms ruined what could have been a career day for Marshall. ",
            "5": "Tony Scheffler (4 catches, 29 yards) and Eddie Royal (2-21) both posted mediocre numbers. As mentioned earlier, Royal was robbed of a long score because of Orton's ineptness. ",
            "6": "You can make all the excuses about Orton being out, but anyone who defends the Broncos here has to answer for the defense. How in the world does Ladell Betts rush for 114 yards and a touchdown on 26 carries? Ladell freaking Betts. I thought Denver's new 3-4 defense was supposed to be good. ",
            "7": "The Broncos also failed to force Jason Campbell into a turnover. Campbell went an economical 17-of-26 for 193 yards and a touchdown. He was sacked just three times behind his awful offensive line. Denver's inability to contain Betts prevented them from accumulating more sacks in long-yardage situations. ",
            "8": "Santana Moss had just two receptions for eight yards. Tight end Fred Davis led the team in both catches (4) and yards (50). "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Al Davis' last three No. 1 picks all had a major hand in this loss. Shocker. - JaMarcus Russell (2007) was 9-of-24 for 67 yards. He was benched in the second half in favor of Bruce Gradkowski (4-of-8 for 46 yards, 2 INTs), who nearly led a comeback (more on this later). Russell was robbed of a touchdown and a long completion. I'll discuss the touchdown later as well (hint, hint). The completion, a 52-yard connection to Louis Murphy, was wiped out by a Robert Gallery tripping penalty. - Darren McFadden (2008) had just four carries for 11 yards coming off injury. Both Michael Bush (14 rushes, 119 yards) and Justin Fargas (10-41) were far more impressive than McFadden. - Darrius Heyward-Bey (2009) was the worst of them all. He dropped a touchdown pass. Late in the fourth quarter as the Raiders ventured inside Kansas City's 30, a Gradkowski pass bounced out of Heyward-Bey's hands and into the arms of a Kansas City defender. Heyward-Bey finished with one reception for 22 yards. ",
            "2": "Meanwhile, Chiefs fans should be thrilled because it looks like Todd Haley's IQ has finally reached double digits. Perhaps Haley read my scientific proof last week because he got Jamaal Charles much more involved in the offense. Charles rushed for 103 yards and a touchdown on 18 carries. He also chipped in with four catches for 14 more yards. ",
            "3": "Matt Cassel was a mediocre 19-of-34 for 216 yards, a pick and two fumbles. The good news is that he took just two sacks. ",
            "4": "Cassel found Dwayne Bowe six times for 91 yards. Chris Chambers had three grabs for 60 yards. Lance Wes Welker Lite Long had just two receptions for 18 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks may have lost by 11, but they actually out-gained the Cardinals by 10 yards and had seven more first downs. They even led at one point 17-7. Seattle simply couldn't stop Arizona in the second half. The Cardinals scored touchdowns on drives of 82, 80 and 85 yards. The Seahawks, meanwhile, had two interceptions in the red zone. ",
            "2": "Kurt Warner was really sharp, going 29-of-38 for 340 yards and two touchdowns. All three of his wideouts were active: Anquan Boldin (8 catches, 105 yards), Steve Breaston (4-79, TD) and Larry Fitzgerald (7-73, TD). ",
            "3": "The story here for the Cardinals is that Chris Wells had more carries (16) than Tim Hightower (10). While Hightower rushed for just 37 yards, Wells compiled 85 yards and two touchdowns. All but five of Wells' attempts came in the second half, so it looks like he's going to be a big part of this offense going forward. ",
            "4": "Speaking of a change at the running back position, Julius Jones left the game with a broken rib after two carries for 10 yards. He later suffered bleeding in his lung. Let's all hope that he'll be OK. Justin Forsett took over and was very impressive; he gained 123 yards and a touchdown on 17 attempts. He also caught five balls for 23 more yards. ",
            "5": "Matt Hasselbeck completed only 50 percent of his passes (26-of-52), but gained 315 yards and a touchdown. He also had those two aforementioned picks. He was constantly under pressure in the second half (shocker). ",
            "6": "Nate Burleson was targeted five times but couldn't come up with a single reception. Dominique Rodgers-Cromartie completely shut him down. ",
            "7": "T.J. Houshmandzadeh finally had his breakout performance as a Seahawk, coming up with nine receptions for 165 yards. Both figures were season-highs for the free-agent acquisition. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Packers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "This was a really sloppy game by both teams that was just 3-0 Packers going into the fourth quarter. Green Bay surrendered four sacks and was whistled for 12 penalties. The Cowboys, meanwhile, didn't convert a third down until there were only nine minutes remaining in regulation. Tony Romo was sacked five times and turned the ball over twice. Roy Williams also fumbled in Green Bay territory. A big problem was the season-ending injury to right tackle Marc Colombo, though one of Romo's sack-turnovers was the result of his failure to read a corner blitz by the Packers. ",
            "2": "Romo finished 24-of-39 for 251 yards, one touchdown, one pick and two fumbles. Romo was victimized by some drops, but he was pretty much ineffective for most of the game. A good amount of his yardage came in junk time. ",
            "3": "Roy Williams actually caught five balls for 105 yards and a touchdown, though he had the aforementioned fumble. Jason Witten snagged five receptions for 47 yards. Miles Austin-Jones, meanwhile, has really cooled off; he had only four grabs for 20 yards. ",
            "4": "This contest was a one-score game for three-plus quarters, so you have to wonder why the Cowboys ran the ball only 11 times. Marion Barber led the squad with five carries for 26 yards. Tashard Choice and Felix Jones each had three rushes for 13 and six yards, respectively. I don't know what offensive coordinator Jason Garrett was doing all week, but if I had to guess, he was busy studying Andy Reid game tape instead of preparing for the Packers. ",
            "5": "As mentioned, Aaron Rodgers took four sacks, which is a pretty small number for him. Ironically, Rodgers' numbers were down (25-of-36, 189 yards, TD). ",
            "6": "Donald Driver, Greg Jennings and Jordy Nelson had four receptions each for 50, 45 and 32 yards, respectively. ",
            "7": "Unlike the Cowboys, the Packers actually ran the ball. Ryan Grant gained 79 yards on 19 carries. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "8",
            "1": "Though this game was 28-9 at one point, it was a pretty evenly matched contest. In the end, the Eagles actually out-gained the Chargers, 462-331. The problem for Philadelphia? Same as always: - ",
            "2": "Donovan McNabb was 35-of-55 for a whopping 450 yards, two touchdowns and a pick, however he was just 4-of-12 for 22 yards in the red zone. McNabb nearly led a comeback from down 28-9, but came up about 35 yards too short (though the Eagles probably would have missed the 2-point conversion anyway). ",
            "3": "About a third of McNabb's yardage went to Jason Avant, who finished with eight grabs for 156 yards. DeSean Jackson also caught eight balls for 91 yards. Jeremy Maclin and Brent Celek each came up with six receptions and a touchdown for 76 and 47 yards, respectively. ",
            "4": "Brian Westbrook rushed only six times for 28 yards, but left the game with yet another concussion. He could be shut down for the rest of the season; he can't possibly risk a third concussion in a span of two months or less. LeSean McCoy took over, but carried the ball just three times for five yards. ",
            "5": "Philip Rivers was almost perfect, going 20-of-25 for 231 yards and two touchdowns. He was sacked only two times. ",
            "6": "The Eagles once again had major problems stopping the tight end, as Antonio Gates caught seven balls for 78 yards. Vincent Jackson surprisingly caught only one ball for 10 yards on what probably should have been offensive pass interference. ",
            "7": "Reports of LaDainian Tomlinson's demise have clearly been exaggerated. Tomlinson somehow gained 96 yards and two touchdowns on 24 carries. This really came out of nowhere, and it was shocking because the Eagles came into this contest ranked second against the run. It's amazing what can happen when you actually have quality blocking, eh? Congratulations to Tomlinson, by the way, who passed Marcus Allen for third all-time in career touchdowns with 146. Tomlinson is only behind Jerry Rice (208) and our pal Emmitt Smith (175). ",
            "8": "I promised I'd get to Boger, and I'm keeping my word. Though Boger called shady holding penalties throughout the contest, he didn't catch my attention until the final drive. Boger thrice let extra seconds tick off the clock. One example: DeSean Jackson caught a pass along the sidelines with 21 seconds remaining. As the play ended, the clock ticked away to 20 and 19 seconds. I was hoping Boger would see this and ask for the time to be reset to 20 or 21 seconds. Instead, Boger asked for the game clock to be reset to 18 seconds! Again, this happened three times! Boger's children better receive some great Christmas gifts because their father clearly made tons of money on this game. For thoughts on Patriots-Colts and Ravens-Browns, check out my updated "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Al Davis' last three No. 1 picks all had a major hand in this loss. Shocker. - JaMarcus Russell (2007) was 9-of-24 for 67 yards. He was benched in the second half in favor of Bruce Gradkowski (4-of-8 for 46 yards, 2 INTs), who nearly led a comeback (more on this later). Russell was robbed of a touchdown and a long completion. I'll discuss the touchdown later as well (hint, hint). The completion, a 52-yard connection to Louis Murphy, was wiped out by a Robert Gallery tripping penalty. - Darren McFadden (2008) had just four carries for 11 yards coming off injury. Both Michael Bush (14 rushes, 119 yards) and Justin Fargas (10-41) were far more impressive than McFadden. - Darrius Heyward-Bey (2009) was the worst of them all. He dropped a touchdown pass. Late in the fourth quarter as the Raiders ventured inside Kansas City's 30, a Gradkowski pass bounced out of Heyward-Bey's hands and into the arms of a Kansas City defender. Heyward-Bey finished with one reception for 22 yards. ",
            "2": "Meanwhile, Chiefs fans should be thrilled because it looks like Todd Haley's IQ has finally reached double digits. Perhaps Haley read my scientific proof last week because he got Jamaal Charles much more involved in the offense. Charles rushed for 103 yards and a touchdown on 18 carries. He also chipped in with four catches for 14 more yards. ",
            "3": "Matt Cassel was a mediocre 19-of-34 for 216 yards, a pick and two fumbles. The good news is that he took just two sacks. ",
            "4": "Cassel found Dwayne Bowe six times for 91 yards. Chris Chambers had three grabs for 60 yards. Lance Wes Welker Lite Long had just two receptions for 18 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks may have lost by 11, but they actually out-gained the Cardinals by 10 yards and had seven more first downs. They even led at one point 17-7. Seattle simply couldn't stop Arizona in the second half. The Cardinals scored touchdowns on drives of 82, 80 and 85 yards. The Seahawks, meanwhile, had two interceptions in the red zone. ",
            "2": "Kurt Warner was really sharp, going 29-of-38 for 340 yards and two touchdowns. All three of his wideouts were active: Anquan Boldin (8 catches, 105 yards), Steve Breaston (4-79, TD) and Larry Fitzgerald (7-73, TD). ",
            "3": "The story here for the Cardinals is that Chris Wells had more carries (16) than Tim Hightower (10). While Hightower rushed for just 37 yards, Wells compiled 85 yards and two touchdowns. All but five of Wells' attempts came in the second half, so it looks like he's going to be a big part of this offense going forward. ",
            "4": "Speaking of a change at the running back position, Julius Jones left the game with a broken rib after two carries for 10 yards. He later suffered bleeding in his lung. Let's all hope that he'll be OK. Justin Forsett took over and was very impressive; he gained 123 yards and a touchdown on 17 attempts. He also caught five balls for 23 more yards. ",
            "5": "Matt Hasselbeck completed only 50 percent of his passes (26-of-52), but gained 315 yards and a touchdown. He also had those two aforementioned picks. He was constantly under pressure in the second half (shocker). ",
            "6": "Nate Burleson was targeted five times but couldn't come up with a single reception. Dominique Rodgers-Cromartie completely shut him down. ",
            "7": "T.J. Houshmandzadeh finally had his breakout performance as a Seahawk, coming up with nine receptions for 165 yards. Both figures were season-highs for the free-agent acquisition. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Packers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "This was a really sloppy game by both teams that was just 3-0 Packers going into the fourth quarter. Green Bay surrendered four sacks and was whistled for 12 penalties. The Cowboys, meanwhile, didn't convert a third down until there were only nine minutes remaining in regulation. Tony Romo was sacked five times and turned the ball over twice. Roy Williams also fumbled in Green Bay territory. A big problem was the season-ending injury to right tackle Marc Colombo, though one of Romo's sack-turnovers was the result of his failure to read a corner blitz by the Packers. ",
            "2": "Romo finished 24-of-39 for 251 yards, one touchdown, one pick and two fumbles. Romo was victimized by some drops, but he was pretty much ineffective for most of the game. A good amount of his yardage came in junk time. ",
            "3": "Roy Williams actually caught five balls for 105 yards and a touchdown, though he had the aforementioned fumble. Jason Witten snagged five receptions for 47 yards. Miles Austin-Jones, meanwhile, has really cooled off; he had only four grabs for 20 yards. ",
            "4": "This contest was a one-score game for three-plus quarters, so you have to wonder why the Cowboys ran the ball only 11 times. Marion Barber led the squad with five carries for 26 yards. Tashard Choice and Felix Jones each had three rushes for 13 and six yards, respectively. I don't know what offensive coordinator Jason Garrett was doing all week, but if I had to guess, he was busy studying Andy Reid game tape instead of preparing for the Packers. ",
            "5": "As mentioned, Aaron Rodgers took four sacks, which is a pretty small number for him. Ironically, Rodgers' numbers were down (25-of-36, 189 yards, TD). ",
            "6": "Donald Driver, Greg Jennings and Jordy Nelson had four receptions each for 50, 45 and 32 yards, respectively. ",
            "7": "Unlike the Cowboys, the Packers actually ran the ball. Ryan Grant gained 79 yards on 19 carries. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "8",
            "1": "Though this game was 28-9 at one point, it was a pretty evenly matched contest. In the end, the Eagles actually out-gained the Chargers, 462-331. The problem for Philadelphia? Same as always: - ",
            "2": "Donovan McNabb was 35-of-55 for a whopping 450 yards, two touchdowns and a pick, however he was just 4-of-12 for 22 yards in the red zone. McNabb nearly led a comeback from down 28-9, but came up about 35 yards too short (though the Eagles probably would have missed the 2-point conversion anyway). ",
            "3": "About a third of McNabb's yardage went to Jason Avant, who finished with eight grabs for 156 yards. DeSean Jackson also caught eight balls for 91 yards. Jeremy Maclin and Brent Celek each came up with six receptions and a touchdown for 76 and 47 yards, respectively. ",
            "4": "Brian Westbrook rushed only six times for 28 yards, but left the game with yet another concussion. He could be shut down for the rest of the season; he can't possibly risk a third concussion in a span of two months or less. LeSean McCoy took over, but carried the ball just three times for five yards. ",
            "5": "Philip Rivers was almost perfect, going 20-of-25 for 231 yards and two touchdowns. He was sacked only two times. ",
            "6": "The Eagles once again had major problems stopping the tight end, as Antonio Gates caught seven balls for 78 yards. Vincent Jackson surprisingly caught only one ball for 10 yards on what probably should have been offensive pass interference. ",
            "7": "Reports of LaDainian Tomlinson's demise have clearly been exaggerated. Tomlinson somehow gained 96 yards and two touchdowns on 24 carries. This really came out of nowhere, and it was shocking because the Eagles came into this contest ranked second against the run. It's amazing what can happen when you actually have quality blocking, eh? Congratulations to Tomlinson, by the way, who passed Marcus Allen for third all-time in career touchdowns with 146. Tomlinson is only behind Jerry Rice (208) and our pal Emmitt Smith (175). ",
            "8": "I promised I'd get to Boger, and I'm keeping my word. Though Boger called shady holding penalties throughout the contest, he didn't catch my attention until the final drive. Boger thrice let extra seconds tick off the clock. One example: DeSean Jackson caught a pass along the sidelines with 21 seconds remaining. As the play ended, the clock ticked away to 20 and 19 seconds. I was hoping Boger would see this and ask for the time to be reset to 20 or 21 seconds. Instead, Boger asked for the game clock to be reset to 18 seconds! Again, this happened three times! Boger's children better receive some great Christmas gifts because their father clearly made tons of money on this game. For thoughts on Patriots-Colts and Ravens-Browns, check out my updated "
        }
    },
    "numberOfGames": "16"
}