{
    "year": "2009",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "I wish I had Jon Gruden here to comment on this because Miami's Wildcat offense was an epic failure in this contest. The Dolphins got just four yards out of the Wildcat, came on a Ronnie Brown run. Pat White, meanwhile ran for no gain and was incomplete on one attempt, missing an open Ted Ginn downfield. ",
            "2": "As for Miami's regular offense, the seven points it put up pretty much speaks for itself. The score could have been a lot closer, but Anthony Fasano fumbled the ball away at the Atlanta 10. In total, the Dolphins had four turnovers after coming up with a plus-17 turnover differential last year - a sign that things won't be the same in 2009. ",
            "3": "Chad Pennington was 21-of-29, but threw for just 176 yards, which gives him a pretty weak YPA of 6.1. Pennington also had a touchdown and an interception. ",
            "4": "Perhaps Miami's greatest mistake was not getting Ronnie Brown involved enough. Despite the fact that Brown averaged 4.3 yards per carry against Atlanta's pedestrian run defense, Brown was given only 10 carries. He also had just three receptions for 10 more yards. I understand being scared of Brown wearing down late in the year, but with games coming up against Indianapolis and San Diego, this was one the Dolphins had to have. ",
            "5": "Another concern the Dolphins suddenly have is pass protection; the Falcons, not known for being able to get after the quarterback consistently, managed four sacks on Pennington. John Abraham and Kroy Biermann had two each, exposing Jake Long and Vernon Carey. ",
            "6": "Matt Ryan was as good as advertised, going 22-of-36 for 229 yards and two touchdowns. Ryan found Tony Gonzalez and Roddy White five times each. Gonzalez had 73 yards and a score, while White had 42 yards. ",
            "7": "A disappointing outing for Michael Turner. Turner mustered only 65 yards on 22 carries against a Dolphins rush defense that was ranked in the middle of the pack last year. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "I complain about my bad beats all the time, but I'll admit that I got really lucky here. I had the Ravens -12.5 for four units, and it looked like they would win by seven points. Fortunately, the Chiefs fumbled with less than two minutes remaining on their own nine. Baltimore scored a touchdown on 4th-and-goal. Gooo meee! ",
            "2": "Of course, this game wouldn't have been close if the Ravens didn't repeatedly screw themselves over. Kansas City scored its first touchdown on a blocked punt. The team's next touchdown came off a Joe Flacco interception. Steve Hauschka also missed a 41-yard field goal. Paging Matt Stover? ",
            "3": "Outside of the pick, Joe Flacco was brilliant; he was 26-of-43 for 307 yards and three touchdowns. I loved Flacco as a fantasy sleeper after watching him this preseason, so if you have him on your roster, congratulations. If, for some reason, he's available in your league, pick him up immediately. ",
            "4": "Ray Rice rushed for 108 yards on 19 carries, and I'm actually a bit disappointed. I thought the Ravens would use him more (he also had two catches for 11 yards). Rice was also nowhere to be seen when Baltimore reached the red zone; Willis McGahee and LeRon McClain both scored. ",
            "5": "Though 14 of Kansas City's points came off Baltimore turnovers, Brodie Croyle was very impressive in this contest, considering the defense he was going up against. Croyle was 16-of-24 for 177 yards and two touchdowns. On a game-tying drive late in the fourth quarter, Croyle was 4-of-5 for 55 yards. There's little doubt that Croyle is the best quarterback on the Chiefs, but he can't stay healthy. Ironically, Matt Cassel should be back to ruin things next week. ",
            "6": "Dwayne Bowe, proving that he pretty much is matchup-proof (save for when he plays Nnamdi Asomugha), caught four balls for 40 yards and a touchdown. Mark Bradley also had four grabs for 73 yards. ",
            "7": "The Chiefs predictably couldn't run on the Ravens. Larry Johnson had just 20 yards on 11 carries. Jamaal Charles was the more effective player, catching four balls for 29 yards in addition to his eight rushing yards on four carries. ",
            "8": "Though Baltimore gave up 14 points off turnovers, the key to its victory today was third-down conversions; the Ravens were 10-of-17 on third downs. The Chiefs, meanwhile, were just 2-of-10. ",
            "9": "Perhaps the reason the Chiefs were 2-of-10 was because they kept putting themselves in impossible situations. Check this out: "
        }
    }
}