{
    "year": "2009",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Browns",
            "Points": "6"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "Derek Anderson was 2-of-17 for 23 yards and a pick. The Browns had just nine first downs and lost the time of possession. Cleveland allowed Buffalo to convert six third downs. How in the world did they win this game? Well, it took a bunch of ineptness on the Bills' part. Buffalo finished the game with a whopping 13 penalties. The offensive line couldn't pass protect for Trent Edwards, who was sacked twice and had to force a bunch of short stuff. When Edwards had time to throw, he seemed scared to throw it into a howling 30-mph wind. Edwards also had a horrible interception, where he had Terrell Owens open downfield, but horribly underthrew him for an interception. ",
            "2": "Edwards was 16-of-31 for 152 yards and that pick. As you can probably guess, his top target was Marshawn Lynch, who caught six balls for 56 yards on top of his 69 rushing yards (on 17 carries). Fred Jackson turned 15 touches into 47 total yards. ",
            "3": "Congratulations to Owens, by the way, who had a season-high reception total. Owens grabbed four balls for 44 yards. Lee Evans hauled in just two passes for 11 yards. ",
            "4": "As for the Browns, Jerome Harrison owners should direct their hate mail toward Eric Mangina, who decided to ride his old running back instead. Jamal Lewis carried the ball 31 times for 117 yards. He had a good game, but with the Browns building toward the future, you have to wonder why Harrison isn't getting the ball. ",
            "5": "Mohamed Massaquoi led the Browns in both receptions (1) and receiving yards (16). Steve Heiden had the only other catch. ",
            "6": "After the game, Buffalo's general manager would not commit to Dick Jauron as his head coach. It would not be a surprised if Jauron is fired very soon. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "This was a horrific loss by the Redskins. Not because they lost to the winless Jake Delhomme, but because they blew a 17-2 lead. Everything changed early in the fourth quarter when Washington received a punt. Antwaan Randle-El signaled for a fair catch, but was bumped into by teammate Bryon Westbrook, who was pushed by a Panther player. It was ruled a muff and was challenged by Jim Zorn. However, the call was upheld. Two plays later, the Panthers scored the game-winning touchdown. ",
            "2": "Jonathan Stewart was responsible for that score. He wasn't even expected to play, but he rushed for 39 yards on 10 carries. DeAngelo Williams, meanwhile, had only 40 yards on 18 attempts. The Panthers couldn't find any running room against Albert Haynesworth. ",
            "3": "Jake Delhomme was 16-of-25 for 181 yards and a touchdown. He also tossed an interception, but Muhsin Muhammad was responsible for that, as the ball bounced out of his hands. ",
            "4": "Muhammad and Steve Smith both led the Panthers with five receptions. They had 39 and 65 yards, respectively. ",
            "5": "Jason Campbell had a pretty economical game, going 17-of-23 for 145 yards and a touchdown. Campbell didn't have any time in the pocket, as he was sacked five times. Left tackle Chris Samuels left the game in the first quarter, allowing Julius Peppers to collect two sacks. ",
            "6": "Carolina scored its safety on a Clinton Portis run out of the end zone. Portis made a really stupid decision, running laterally when he couldn't find a hole to scamper through up front. Portis rushed for 57 yards and a touchdown. He had a second score off a reception. ",
            "7": "Santana Moss led the Redskins in receptions (4) and receiving yards (44). ",
            "8": "An angry Daniel Snyder didn't fly home with the Redskins on the team plane. It's very possible that Jim Zorn will be fired this week. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Lions lost, but they did a great job of competing with the Steelers on the road. Yes, I know this contest took place at Ford Field, but there seemed to be more Pittsburgh fans waving Terrible Towels than Detroit fans. It's amazing how well the Steelers travel. Still, the fact remains that the Lions hung in without their starting quarterback and their superstar receiver for most of the game. Calvin Johnson reaggrevated a thigh injury in the third quarter and didn't return. ",
            "2": "Daunte Culpepper played very well in this game, going 23-of-37 for 282 yards, one touchdown and a pick. He did a great job converting third downs, as he connected on a pair of 3rd-and-11s on the opening drive. Detroit was 11-of-18 on third down. What's amazing about Culpepper's numbers is that he was frequently pressured; the Steelers sacked him seven times. James Harrison made Jeff Backus look like a helpless child, sacking Culpepper three times. ",
            "3": "Without Megatron, Dennis Northcutt led the Lions in receptions with five for 70 yards and a late backdoor touchdown. Bryant Johnson had four grabs for 35 yards. ",
            "4": "As you might expect, Kevin Smith had a lot of touches. Smith had 20 rushes for 53 yards and three receptions for 42 more yards. ",
            "5": "The problem for the Lions is that they couldn't stop any aspect of Pittsburgh's offense. They somehow had a pick-six on Roethlisberger, but otherwise, they really struggled to force the Steelers into punting situations. ",
            "6": "Aside from the pick-six, Roethlisberger was pretty much flawless, going 23-of-30 for 277 yards, three touchdowns and a pick. ",
            "7": "Big Ben spread his scores around, launching them to Hines Ward (7 catches, 85 yards), Heath Miller (5-54) and Mike Wallace (2-52). Santonio Holmes had four grabs for 50 yards. ",
            "8": "Rashard Mendenhall didn't get many carries, but looked good when he did, rushing for 77 yards and a touchdown on 15 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "It's amazing - Miles Austin-Jones caught 10 balls for 250 yards and two touchdowns, setting a single-game record for most receiving yards in Dallas history. Yet, he didn't even have a very good performance. I know Austin-Jones caught the tying and winning scores for 59 and 60 yards. However, Austin-Jones dropped a whopping three touchdowns. I won't fault him for one because it was a bit overthrown (but catchable). However, the other two went right through his hands. At the time, I thought Jerry Jones might seek a divorce, but Austin-Jones redeemed himself. ",
            "2": "In addition to the three drops, the Cowboys made several other mental errors. On one sequence in the first quarter, they were whistled for a false start and then had to take an unnecessary timeout right afterward. In the first 25 minutes, Dallas was called for six penalties. The Cowboys also muffed a punt and bobbled a quarterback-center exchange that resulted in a lost fumble. Dallas finished with 13 penalties. It's almost as if they showed up and expected to win. It's this exact attitude that gets them bounced out of the playoffs early or before it even begins. ",
            "3": "Tony Romo suffered those three drops by Austin-Jones, but was still able to go 20-of-34 for 351 yards and two touchdowns without Roy Williams in the lineup. ",
            "4": "Austin-Jones was obviously the team's leading receiver. Jason Witten chipped in with five receptions for 47 yards. Patrick Crayton had four grabs for 44 yards, but fumbled twice. ",
            "5": "DeMarcus Ware had no sacks coming into this game. Thanks to Kansas City's horrific offensive line, he was able to get two. ",
            "6": "Speaking of the Chiefs' line, Matt Cassel didn't have much time to throw until the fourth quarter. That's when Cassel seemed to get into a groove. He finished 23-of-41 for 253 yards and two scores. ",
            "7": "Dwayne Bowe came up big, catching five balls for 74 yards and a touchdown. Jamaal Charles also had five catches for 54 yards. Now, if only Todd Haley would use him more in the running game... ",
            "8": "Speaking of which, Charles had three carries for nine rushing yards. Larry Johnson had just 37 yards on 21 attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Giants",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "So much was made of Eli Manning's heel before this game. In fact, it's the only reason I kept this from being more than a 1-unit play. But it was quickly evident that Manning would be fine; in fact, on the first play of the game, Manning dropped back from under center and completed a 9-yard pass to Marcy Darcy Johnson. Manning later threw a 30-yard touchdown strike to Mario Manningham. Manning was 8-of-10 for 173 yards and two scores before being pulled before halftime; Manning was fine; Tom Coughlin just wanted his quarterback on the sidelines because this game was a blowout. ",
            "2": "Brandon Jacobs carried the ball almost twice as many times as Ahmad Bradshaw. However, Bradshaw easily out-shined Jacobs, rushing for 110 yards and two touchdowns on 11 carries. Bradshaw also caught a 55-yard reception. Jacobs, meanwhile, rumbled for 67 yards on 21 attempts. ",
            "3": "Steve Smith led the team in receiving yards with 70 on three receptions. Hakeem Nicks had four grabs for 49 yards and a touchdown. As noted earlier, Manningham also scored, but had just two catches for 33 yards. ",
            "4": "The Raiders scored seven points, but that should have never happened. They got into the red zone because of a muffed punt. As forum member EliteBeatAgent noted, the Raiders best offensive play is a punt, apparently. When Oakland was in the red zone, Justin Fargas fumbled the ball, which was returned for a touchdown. However, the officials incorrectly blew the play dead and ruled Fargas down by contact. It was evident that Fargas lost the ball prior to hitting the turf. ",
            "5": "Speaking of Fargas, he had 18 yards on 11 carries. Michael Bush started, and got 37 yards and a touchdown on 12 attempts. ",
            "6": "JaMarcus Russell was awful once again. His stat line doesn't look too bad - 8-of-13 for 100 yards - but he lost a whopping three fumbles, which led to 13 Giants points. Russell struggled to convert third downs, going 1-of-11 in those situations. Oakland had six 3-and-outs. ",
            "7": "Only one Raider had multiple receptions. That was Zach Miller, who somehow hauled in six grabs for 69 yards. Darrius Heyward-Bey didn't catch a pass. Shocker. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The Buccaneers were blown out and Josh Johnson tossed three picks, but I was pretty impressed with him. He made some nice throws, moved the chains, ran well (5 carries, 40 yards) and even showed great leadership on the sidelines when the team was down. Unfortunately for Johnson (26-of-50, 240 yards, 2 TDs, 3 INTs), Tampa Bay was simply overmatched here. It should be noted how costly Johnson's three picks were. Two were thrown in the red zone. The other was deep in his own territory, which led to an Eagles touchdown. ",
            "2": "Raheem Morris' brilliant plan to give Cadillac Williams more carries backfired in this game. Cadillac ran 10 times for only eight yards. Derrick Ward, meanwhile, turned six rushes into 37 yards. If you gave a running back a lot of money this offseason, why wouldn't you use him? ",
            "3": "Kellen Winslow Jr. soldiered up in this game, catching nine balls for 102 yards and two touchdowns. Antonio Bryant chipped in with five grabs for 62 yards. ",
            "4": "It quickly became apparent that Donovan McNabb's rib injury was a non-factor. On Philadelphia's second offensive play, McNabb found Jeremy Maclin deep for a 51-yard touchdown. Maclin finished with six receptions for 142 yards and two scores. ",
            "5": "DeSean Jackson disappointed his fantasy owners, as he caught just one ball for one yard. McNabb simply had something going with Maclin. Brent Celek, meanwhile, had four grabs for 58 yards. ",
            "6": "Andy Reid is lucky that this was an easy game against a putrid opponent; the Eagles did not run the ball enough. Brian Westbrook carried the ball only six times for 18 yards and a score. Reid has a dubious history of ignoring the running game, and you can bet that this will resurface once the Eagles play a tougher foe. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "Despite what the score may say, this wasn't an easy game for the Vikings. They were coming off an emotional Monday night victory against the Packers, and had to play a road game on a short work week. At halftime, the Rams had more first downs (14-9) and yards (207-157) than the Vikings. However, they trailed 17-3 at that point because Kyle Boller had a fumble returned for a touchdown, Steven Jackson fumbled on the Minnesota 2, and Daniel Fells later fumbled inside the five. ",
            "2": "As indicated, St. Louis was able to move the chains in this game. Jackson rushed for 84 yards on 21 carries. Boller, who looked like a poor high school kid being asked to play amongst grown men, came back and played well after that, going 20-of-31 for 209 yards and a pick. ",
            "3": "Marc Bulger replaced Boller when the game was out of hand, and completed all seven passes for 88 yards and a score. Bulger should be ready to go next week. ",
            "4": "Donnie Avery showed some signs of life for the first time all year, catching five passes for 87 yards and a late touchdown from Bulger. ",
            "5": "Moving on to a real NFL team, Brett Favre was sharp once again, going 18-of-24 for 232 yards, one touchdown and a pick. Favre nearly had another score on a beautiful pass to Sidney Rice, but Rice couldn't get a second foot inbounds. ",
            "6": "Adrian Peterson scored two touchdowns in this contest. He rushed for only 69 yards, but that's because he carried the ball just 15 times. This game was out of hand in the third quarter. ",
            "7": "Percy Harvin (66 yards) and Visanthe Shiancoe (49 yards, TD) led the Vikings with four receptions each. Sidney Rice and Bernard Berrian both caught three balls. ",
            "8": "Jared Allen continues to terrorize offenses; he shockingly didn't get a sack in this game, but he returned Boller's fumble for a touchdown. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "45"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "I don't think anyone saw this coming. The 49ers' defense had been playing so well that it was almost unimaginable that any team could hang 45 on them. This game really turned around in the middle of the second quarter. The Falcons just scored to make it 21-10. The 49ers had a nice kickoff return to the 38, but Delanie Walker fumbled the ball. He looked down, but Mike Singletary couldn't challenge it because he was out of timeouts. Why was Singletary out of timeouts? He had to burn his last one because Glen Coffee thought that Josh Morgan scored on a previous long reception. Morgan was tackled near the goal line, but Coffee was off celebrating, and didn't know he had to come into the game. ",
            "2": "Coffee scored later, but was only able to carry the ball 12 times in this blowout. Coffee turned those attempts into 45 yards. He also had four receptions for 21 more yards. ",
            "3": "Shaun Hill was just 15-of-38 for 198 yards and a pick, and for the first time this year, it became apparent that he's a liability. Hill manages games well, but he can't win in a shootout. And speaking of firsts, this was Hill's first loss at Candlestick (7-1). ",
            "4": "Josh Morgan (4 catches, 78 yards) and Vernon Davis (5-51) had solid games despite Hill's struggles. ",
            "5": "But moving on to an elite quarterback, Matt Ryan was 22-of-32 for 329 yards, two touchdowns and a pick. Ryan easily sliced through San Francisco's secondary and wasn't sacked a single time. ",
            "6": "Ryan allowed Roddy White to have a career day; White caught eight balls for 210 yards and two scores. Tony Gonzalez had six grabs for 55 yards. ",
            "7": "Michael Turner had a great fantasy day, though he didn't have much room to run, outside of a 33-yard scamper. Turner finished with 97 yards and three touchdowns on 22 carries. ",
            "8": "Some teams have difficulty playing games across the country. Whatever Mike Smith is doing, it's clearly working; Crazy Eyebrows is now 3-0 straight up and against the spread on the West Coast. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "I really appreciate what Gary Kubiak has done for the Texans. When he took over four years ago, he was taking over a desolate team ruined by Charley Casserly and Dom Capers. Kubiak has turned the Texans into a solid squad capable of beating anyone with their dynamic offense. However, at some point, you have to realize that you're making the same mistake over and over again. Two weeks ago, I heavily criticized Kubiak for giving the ball to Chris Brown on the most important carry of the game - a rush at the goal line to tie the game up with Jacksonville. Brown fumbled the ball away, allowing the Jaguars to come away with a victory. On Sunday, Kubiak made the same dumb mistake. With great talents like Matt Schaub, Andre Johnson, Steve Slaton, Owen Daniels and even Kevin Walter, Kubiak decided that giving the ball to Brown, a talent-less, second-string running back who probably couldn't make the roster for half the teams in the league, was his best option. Predictably, Brown was stuffed at the goal line. Five units down the drain. ",
            "2": "The Texans were shut out in the first half, but mounted a tremendous 21-point comeback. Matt Schaub was brilliant for the most part, going 35-of-50 for 371 yards and two touchdowns. Unfortunately, Schaub made two horrible mistakes in this contest. The first was a pick-six when the game was tied 21-21 in the fourth quarter. The second was an errant pass to Joel Dreessen the play prior to Kubiak's blunderous call. Schaub had Dreessen open in the back of the end zone, but overthrew him. Dreessen caught the ball, but could only get one foot inbounds. ",
            "3": "Andre Johnson caught eight balls for 101 yards and two touchdowns. Owen Daniels also had eight grabs for 94 yards. Kevin Walter notched four receptions for 37 yards. ",
            "4": "As many predicted, Steve Slaton didn't have much running room to work with. He had 39 yards on 13 carries. Slaton saved his fantasy owners with six receptions for 59 more yards. ",
            "5": "As for the Cardinals, Kurt Warner came out of the gate on fire, torching Houston's secondary with 26-of-38 passing for 302 yards and two touchdowns. Warner looked sharp early on, but if you're an Arizona fan, you have to be concerned that the team couldn't score an offensive touchdown in the second half. In fact, the Cardinals had just one first down in the second half. ",
            "6": "Warner went to his usual suspects: Anquan Boldin (7 catches, 81 yards), Larry Fitzgerald (5-79, TD) and Steve Breaston (4-66). ",
            "7": "The Texans came into this game ranked last versus the run, so Arizona's inability to run the ball is alarming. Tim Hightower rushed for 17 yards and a touchdown on six carries. Chris Wells managed 24 yards on seven attempts. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "Yay Pick of the Month. Josh McDaniels for the win! ",
            "2": "It's really hard to believe that Tom Brady struggles this much against one team. Including the playoffs, Brady is 102-30 as a starter. Against the Broncos, he's now 1-6. ",
            "3": "The Broncos did a great job winning this contest and improving to 5-0, but they nearly gave the game away twice in the second half. The Broncos received a punt around midfield after holding the Patriots to a 3-and-out in the third quarter. However, there was a bogus running-into-the-kicker penalty that nearly caused Josh McDaniels to have an aneurysm. The Patriots got the first down. Later on the same drive but in the fourth quarter, Denver once again forced the Patriots into a punting situation. Unfortunately, they were offside on 4th-and-4, giving New England yet another first down. At that point, it looked like Denver was destined to lose. But give them credit for eventually getting the Patriots to punt for a third time. ",
            "4": "The Broncos ran a weird formation in this game that was dubbed the Wild Horses. Knowshon Moreno lined up in the backfield by himself. Kyle Orton, stationed in the slot, was allowed to scan the field and come in under center. It was pretty smart on McDaniels' part because it forced the Patriots to stick with their coverage. Orton completed every single pass out of the Wild Horses. Phil Simms, who called the game, was shocked by this phenomenon and opined that the Wild Horses could never be stopped. Expect every team to be running this by Halloween. ",
            "5": "Kyle Orton did a phenomenal job moving the chains in this game, going 35-of-48 for 330 yards, two touchdowns and a pick (off a Hail Mary). Orton played without a glove for the first time all year. If he keeps this up, he'll burn every single pair of gloves that he owns. ",
            "6": "Eddie Royal - where have you been? Royal finally had the type of performance I expected of him going into the season. Royal caught 10 balls for 90 yards. I don't know if it was Orton's glove-less hand or the new Wild Horses formation, but let's hope he keeps this up. ",
            "7": "Brandon Marshall continues to play well; he caught eight balls for 64 yards and two touchdowns. Marshall showed up to his post-game interview in a full Colorado Rockies uniform (with the helmet too). It's only a matter of time before he punches another TV. ",
            "8": "Moreno started this game with Correll Buckhalter out and got most of the carries. Moreno rushed 21 times for 88 yards. He also caught four balls for 36 yards. Unfortunately, Moreno lost a fumble early on and subsequently carried the ball with both hands on every touch. ",
            "9": "Tom Brady went 19-of-33 for 215 yards and two touchdowns. He had a chance to win the game late in the fourth quarter, but fumbled the ball away. The story here is that while Brady had tons of protection early in the contest, he was pressured late after Matt Light left the game with a knee injury. No word on the severity of Light's knee, but it looked really bad. ",
            "10": "Randy Moss had just one reception for 36 yards. Moss was open downfield on a play, but Brady just missed him. Moss also picked off Orton on a Hail Mary. Meanwhile, Wes Welker dominated the stat sheet with eight receptions for 86 yards and a score. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "Yeah, so, I had Jacksonville in this game for one unit. You can imagine how I'm feeling right now. That's right - very angry! I had the right side! This was a terrible beat! In all seriousness, the reason I took the Jaguars is that I thought Matt Hasselbeck was making a desperate decision in coming back early from a rib injury. I thought he wouldn't be 100 percent and would consequently struggle. Oops. Hasselbeck was awesome, going 18-of-30 for 241 yards and four touchdowns. He's healthy, which means the Seahawks are back. ",
            "2": "Hasselbeck threw two touchdowns each to Nate Burleson and T.J. Houshmandzadeh. Burleson led the team with six receptions for 98 yards. Houshmandzadeh had five grabs for 77 yards. John Carlson had only two catches for 31 yards. ",
            "3": "Despite Seattle's 41-point output, the team still couldn't run the ball. Julius Jones ran for 34 yards on 12 carries. Edgerrin James actually led the Seahawks with 46 yards on 16 attempts, but all but five of those rushes came in the fourth quarter when this game was well in hand. ",
            "4": "Aside from Hasselbeck's health, the main reason why Seattle was able to move the chains so well is that Hasselbeck was seldom pressured. Jacksonville got to him only one time. ",
            "5": "Conversely, David Garrard was constantly running for his life in this game. The Seahawks collected five sacks. ",
            "6": "Making matters worse for Garrard, Mike Sims-Walker was suspended for this game for violating team rules. Garrard (18-of-31, 188 yards) had no No. 1 receiver to work with. He had to resort to throwing to Torry Holt, who had seven grabs for 95 yards. ",
            "7": "Maurice Jones-Drew had only 17 touches; he managed 34 yards on 12 carries and five catches for 23 more yards. The Seahawks simply killed the time-of-possession battle (34:44-25:16), so the Jaguars didn't have a chance to get Drew-Jones the ball. "
        }
    },
    "numberOfGames": "11"
}