{
    "year": "2009",
    "week": "20",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "It's a shame when officials decide any football game, let alone a postseason contest. But once Garrett Hartley nailed a 40-yard field goal to seal a Super Bowl berth for the Vikings, thousands of NFL.com Gamecenter users focused on what they believed was a crooked game. I thought Pierre Thomas converted the first down in overtime and that Robert Meachem made an ensuing catch, but the pass interference call on Ben Leber was bogus and it mirrored the infraction in last week's Colts-Ravens game. It seems like officials nowadays have no grasp of what the word uncatchable means. The Saints also got away with an earlier roughing-the-passer penalty where a defender dived at Brett Favre's legs and injured the veteran quarterback. The Vikings should have been awarded a first down and had the interception nullified, though to be fair, Favre wouldn't have been able to play right away and Tarvaris Jackson just would have thrown a pick anyway. But with that in mind, all the shady second-half and overtime calls would have been, as Emmitt would say, none and void if the Vikings hadn't committed five turnovers. Minnesota fumbled the ball six times and lost three. Favre's second interception (at the end of regulation) was a horrific decision that Jay Cutler would have been proud of. Favre threw the ball late across his body over the middle of the field and had it picked off by Tracy Porter. This nullified a game-winning field goal attempt by Ryan Longwell. And remember, none of this would have happened if Minnesota didn't have 12 men on the field. I was not surprised - Brad Childress is a disciple of Andy Reid, and this is something Reid would have been guilty of. Three of Minnesota's fumbles belonged to Adrian Peterson. Peterson ran well otherwise (25 carries, 122 yards, 3 TDs), but continuously put the ball on the ground and cost Minnesota the game. The Vikings, by the way, outgained the Saints, 475-257. ",
            "2": "For a 40-year-old getting hit hard on what seemed like every play, Favre played a heck of a game (the second interception aside). Favre was 28-of-46 for 310 yards, one touchdown and those two picks. ",
            "3": "It was nice to see Bernard Berrian actually do something for a change. Berrian caught nine balls for 102 yards. Visanthe Shiancoe chipped in with four grabs for 83 yards, while Sidney Rice also had four catches for 43 yards and a score. ",
            "4": "Drew Brees went just 17-of-31 for 197 yards and three touchdowns. He and the Saints offense uncharacteristically failed to convert numerous third-and-short situations. ",
            "5": "After a dynamic performance last week, Reggie Bush did nothing outside of two great catches. He carried the ball seven times for eight yards. He also muffed a punt that set up the Vikings with a short field. ",
            "6": "The Vikings outplayed the Saints, but New Orleans ultimately came up with the win because they took care of the football. Congratulations to the Saints - it's hard to believe that only four years ago, they had three wins, and were playing home games in New York, San Antonio and Baton Rouge. <div class=dfpAdSlots> "
        }
    },
    "numberOfGames": "1"
}