{
    "year": "2009",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "Things looked a bit grim for the Cowboys early on. Their run defense was being gashed by Justin Fargas. When they were on offense, they hit three big plays but immediately suffered penalties afterward (two holdings; one false start). Fortunately, Dallas was playing an inept Oakland team that couldn't consistently sustain drives. The Raiders didn't even cross midfield until there were nine minutes remaining in the third quarter. Laughably, an Oakland receiver didn't catch a pass until there were four seconds left in the first half. ",
            "2": "Speaking of the Raider wideouts, Darrius Heyward-Bey somehow caught two passes for 21 yards and his first career touchdown. If Heyward-Bey didn't drop a pass early in the game, Al Davis would probably be planning a parade right now. ",
            "3": "Bruce Gradkowski went 18-of-35 for only 200 yards and that score, but didn't turn the ball over, making him better than JaMarcus Russell. However, he had one throw on a long out where he weakly lofted a ball that was nearly picked off. That pass pretty much exemplified why Gradkowski is a career backup in this league. He has zero arm strength. ",
            "4": "The aforementioned Fargas ran for 63 yards on 12 carries. He was very effective early in the contest, and one has to wonder why the Raiders wasted their time with Darren McFadden (6 rushes, 23 yards) and Michael Bush (3-8). ",
            "5": "Meanwhile, everyone on the Cowboys ran pretty well. Marion Barber gained 61 yards on 14 carries. Felix Jones managed 68 yards on seven attempts, including a 46-yard touchdown. Tashard Choice ran thrice out of the Wildcat for 67 yards (one run for 66 yards). ",
            "6": "Tony Romo was pretty accurate on all of his throws, going 18-of-29 for 309 yards and two touchdowns. There was no indication that he was struggling with the back injury he labored through last week. ",
            "7": "Miles Austin-Jones torched Chris Johnson, catching seven balls for 145 yards and a score. Jason Witten also had a good game, grabbing five balls for 107 yards. Roy Williams, shut down by Nnamdi Asomugha, had only two catches for 15 yards and a touchdown. ",
            "8": "The Raiders came close to scoring a touchdown near the end of the game which would have covered the spread. It was painful to watch, but thankfully, they ultimately failed. That kept Dallas' amazing streak alive of not allowing a touchdown in a Thanksgiving fourth quarter since 1998. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "Who saw this coming? The Giants just won a game and were feeling confident. The capsizing Broncos had dropped four in a row and lost control of the AFC West. Well, something I like to do is learn from my mistakes. Today I realized that I vastly underestimated how important homefield advantage is on Thanksgiving. The past few years, every non-crappy squad playing on Turkey Day has come away with a win and cover. The recent exceptions are the Lions and 2007 Joey Harrington-led Falcons. I'll be taking all of the home teams next Thanksgiving (and most of the other Thursday night games) unless a terrible team is hosting. ",
            "2": "Denver's defense completely put the clamps on New York's offense. The Giants were 3-of-12 on third downs and lost the time-of-possession battle by 11 minutes. Eli Manning was 24-of-40 for 230 yards and an interception. Most of that yardage came in garbage time, as his receivers couldn't get open early on. This, as well as Denver's confusing blitz schemes caused Manning to take three sacks. Manning had been sacked only 17 times entering this contest. ",
            "3": "As mentioned, a lot of the passing yardage came in junk time, so the New York receiving stats are meaningless. If you're curious: Steve Smith (7 catches, 71 yards); Hakeem Nicks (4-66); Mario Manningham (5-48). ",
            "4": "Denver's run defense had been horrendous entering this contest, so their ability to hold Brandon Jacobs to 27 yards on 11 carries was very shocking to me. ",
            "5": "The Broncos did an outstanding job putting long drives together and achieving first downs (23 to New York's 15). They completely stymied the Giants' struggling pass rush (1 sack) and ran all over New York's front. Knowshon Moreno had his coming-out party, rushing for 88 yards and a touchdown on 19 carries. Moreno also had two long gains called back because of holding penalties. Correll Buckhalter actually had more attempts than Moreno (20), but managed only 51 yards. But I won't berate Josh McDaniels for this; seven of Buckhalter's rushes came in the final two drives when this game was decided. ",
            "6": "Kyle Orton was 18-of-28 for 245 yards, one touchdown and an interception. He made a few questionable throws - including two that made my cousin laugh hysterically - but he was solid for the most part. ",
            "7": "Of course, it helped that Brandon Marshall made a couple of circus catches. Marshall, who had six receptions for 86 yards, made two incredible one-handed grabs. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "This was a great win for the Falcons. I know they barely beat a 1-9 squad and they were massive favorites coming into this contest, but they lost Matt Ryan in the first quarter with a toe injury. They struggled throughout the entire game, but Chris Redman was able to put together a final drive, connecting with Roddy White on a 5-yard touchdown on 4th-and-5 with 26 seconds remaining in regulation. Redman was solid on Atlanta's last possession, and his numbers look good on the stat sheet (23-of-41, 243 yards, 2 TDs). However, Redman took far too many sacks (6), which stalled a lot of drives and allowed the Buccaneers to hang around. Redman played relatively well, but there's no way the Falcons will be able to beat the Eagles or Saints without Ryan under center. ",
            "2": "Ryan's toe wasn't the only major injury for Atlanta. Michael Turner, who rushed for only 33 yards on 12 carries, re-aggravated the high ankle sprain he suffered two weeks ago in the third quarter. One has to wonder why Turner was even playing in this contest because he clearly wasn't 100 percent. With a deficit, the Falcons couldn't establish Jason Snelling (4 carries, 8 yards). ",
            "3": "White, who had the decisive score, had five catches for 57 yards. Tony Gonzalez, meanwhile, functioned as Redman's safety valve, hauling in nine receptions for 83 yards. ",
            "4": "Josh Freeman looked really impressive considering he was making just his second career road start. He went 20-of-29 for 250 yards and two touchdowns. More importantly, he refrained from committing careless turnovers - for the most part. Freeman had a really sloppy fumble at the beginning of the fourth quarter that Atlanta could have easily recovered to set them up on a short field. Freeman was fortunate enough to get the ball back. ",
            "5": "Antonio Bryant is alive! Bryant has spent the past month doing nothing but murdering fantasy teams because of his knee injury, but he finally was able to contribute. He caught three passes for 91 yards and a touchdown. Kellen Winslow Jr., meanwhile, had seven grabs for 81 yards. ",
            "6": "Raheem Morris said earlier in the week that he planned on giving more carries to Earnest Graham. Whoops! Graham had just one rush. Cadillac Williams (10 carries, 30 yards) and Derrick Ward (13-29) received most of the work but couldn't do anything against Atlanta's weak run defense. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bills",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "The Dolphins screwed themselves early. They took their opening drive down to Buffalo's 3-yard line. Ricky Williams lined up in the Wildcat, faked the run and lofted a soft pass into triple coverage. The Bills came away with an interception. Had Miami scored there - and Buffalo's defense was offering no resistance at the time - the Dolphins would have held a 21-3 lead going into the fourth quarter. And as good as Ryan Fitzpatrick was in this contest, I don't think he would have battled back from that deficit. ",
            "2": "Fitzpatrick was very sharp, going 17-of-26 for 246 yards, one touchdown and an interception. The Harvard product connected on deep throws to Terrell Owens (51 yards) and Lee Evans (32). Fitzpatrick also scrambled seven times for 50 yards, including a 31-yard touchdown. After that score, forum member ChicagoJay commented, Wow, Ryan Fitzpatrick just ran further than Trent Edwards will ever throw it. ",
            "3": "Owens, who had the game-clinching touchdown, finished with five receptions for 96 yards. I guess Perry Fewell's genius plan of getting the ball into Owens' hands is working. Lee Evans, meanwhile, had just two grabs for 40 yards. ",
            "4": "Fred Jackson was the star for the Bills. He rushed 15 times for 73 yards and two touchdowns, and also had five receptions for 43 more yards. Marshawn Lynch did nothing (3 carries, 6 yards). If only Dick Jauron realized that Jackson gave his team the better chance to win... One of the hundreds of reasons his firing was warranted. ",
            "5": "Ricky Williams wasn't the only Dolphin throwing interceptions. Chad Henne was horrible, going 17-of-31 for 175 yards, one touchdown and three picks. Henne always had trouble with consistency in Michigan. Looks like that has carried over to the pros. ",
            "6": "Aside from the pick, Williams was solid otherwise, rushing for 115 yards and a score on 27 carries. ",
            "7": "Predictably, nothing of note from the Dolphin receivers; Davone Bess led the wideouts with three catches for 34 yards. Ted Ginn Jr. had two receptions for 18 yards. Brian Hartine (3-31) caught Henne's touchdown. ",
            "8": "Joey Porter had 2.5 sacks in this contest, but the significant number is Jason Taylor's half sack, which tied him with the late Derrick Thomas for 11th all-time in career sacks with 126.5. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "This game had all the signs of another Andy Reid stink bomb. The Eagles opened the contest with a failed onside kick, allowing the Redskins to take over near the 20 and get a quick touchdown. Later on, Philly scored on a fourth down in the red zone, but the touchdown was wiped out by a penalty. The Eagles trailed 24-16 in the fourth quarter, but Donovan McNabb was able to put together consecutive drives of 90 and 80 yards. McNabb was 5-of-7 for 115 yards on those two possessions, perhaps silencing a few critics who cite that he struggles in the clutch. McNabb was 21-of-35 for 260 yards, one touchdown and an interception overall. ",
            "2": "Aside from the victory, the big news here is that DeSean Jackson suffered a concussion. He never lost consciousness, but the Eagles could hold Jackson out for a week because of what happened to Brian Westbrook. Jackson had two catches for 41 yards, including a 35-yard touchdown where he was wide open because of yet another Redskins blown assignment. ",
            "3": "Jason Avant and Jeremy Maclin both led Philadelphia with five receptions for 94 and 63 yards, respectively. ",
            "4": "LeSean McCoy ran well again, gaining 76 yards on 17 carries. He also caught four balls for 25 more yards. McCoy had plenty of space without Albert Haynesworth in the lineup. ",
            "5": "Jason Campbell continued to play well under his new Bingo-offense coordinator, going 22-of-37 for 231 yards and two touchdowns. However, he threw two picks in the second quarter that led to six Philadelphia points. ",
            "6": "Campbell's two scores went to Fred Davis (4 catches, 43 yards) and Santana Moss (4-28). Malcolm Kelly led the team with 50 yards on two reception. ",
            "7": "So much for all the Rock Cartwright hype. Cartwright had just 38 yards on 15 attempts, albeit against the Eagles' fourth-ranked rush defense. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "The only significance this game had was that the Rams became one loss closer to claiming Jimmy Clausen atop the <b> <a href=/draft2010.php> 2010 NFL Draft</a></b>. Unfortunately, the Browns lost as well. ",
            "2": "Justin Forsett was very impressive for the Seahawks, rushing for 130 yards and two touchdowns on 22 carries. With a performance like this, one has to wonder why Seattle was so concerned with Julius Jones' status. Forsett needs to be the starter going forward. ",
            "3": "Matt Hasselbeck was just 14-of-25 for 102 yards. Despite a potent ground attack by his side, he had accuracy issues throughout. On the bright side, his offensive line surrendered only one sack. ",
            "4": "T.J. Houshmandzadeh was more of a disappointment, catching just two balls for 14 yards. Nate Burleson out-performed the wanna-be Viking with four receptions for 46 yards. ",
            "5": "Kyle Boller went 28-of-46 for 282 yards, one touchdown and two interceptions. One of the picks was brought back for six points, but it came off a deflection. Overall, Boller was better than I anticipated, but that's not saying much. ",
            "6": "Steven Jackson once again carried the Rams, rushing for 89 yards and a touchdown on 23 carries. Not bad for a guy who was a game-time decision going into the contest. ",
            "7": "Neither Donnie Avery (4 catches, 48 yards) nor Brandon Gibson (3-18) did much, though Avery caught a touchdown. I never thought I'd say this, but both Rams wideouts missed Marc Bulger. ",
            "8": "Steve Spagnuolo has some dubious streaks he needs to get rid of. The Rams have dropped 10 straight to the Seahawks and 11 consecutive contests at home! <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "Jake Delhomme is terrible. I hope his kidnapped son is never found. Delhomme was 14-of-34 for 130 yards and four interceptions. On most of his throws, Delhomme didn't even look where he was throwing. I'm not kidding about this; he carelessly flinged balls downfield without even reading the coverage. Let's go through Delhomme's picks: 1. A pick-six by Darrelle Revis. This interception was the only one that wasn't Delhomme's fault. His throw bounced off what looked like Steve Smith's foot and into Revis' hands. 2. This was a shot downfield. Delhomme foolishly challenged Revis and lost. He underthrew his receiver, allowing Revis to come away with an easy pick. 3. This pass was lofted up carelessly and was picked off by Kerry Rhodes. Delhomme didn't even look like he was trying on this one. 4. The fourth and final interception was one of the worst throws I've ever seen from any quarterback on any level. Delhomme appeared as though he was looking into the stands when he fired this pass downfield. Perhaps he saw his son in the crowd. At this point, forum member PantherFaninfl commented, I wish Carolina would get a quarterback, Ill take Tebow, Pike, Snead, the homeless dude I saw in Orlando, anyone over Delhomme. My recently lost 8.8 units agree. ",
            "2": "Aside from the four interceptions, Carolina struggled because neither DeAngelo Williams (16 carries, 40 yards) nor Jonathan Stewart (9-35) could find any running room against the Jets' usually leaky rush defense. ",
            "3": "Give credit to Matthew Berry: He was criticized by Merril Hoge for listing Steve Smith as a sit on <i> Sunday NFL Countdown</i>. Smith had just one catch for five yards against Revis. One has to wonder what purpose Hoge serves on the show's brief fantasy segment aside from annoying everyone. ",
            "4": "Mark Sanchez completed almost all of his throws, going 13-of-17 for 154 yards and an interception. Sanchez did a good job keeping drives alive by converting third-and-short situations. ",
            "5": "Amazingly, Thomas Jones rushed for the same amount of yards (75) and the same amount of carries (25) that Williams and Stewart combined for. Jones also scored a touchdown. He had a number of negative plays, so he was much more effective than those numbers might indicate. ",
            "6": "With Sanchez's passing numbers limited, neither Braylon Edwards (3 catches, 40 yards) nor Jerricho Cotchery (1-12) did much. Dustin Keller led the squad with four receptions and 68 yards. ",
            "7": "The Panthers finished with six points, but they actually had two touchdowns wiped out by crooked official Jerome Boger. The first was an obvious catch by Steve Smith that Boger reviewed and incorrectly ruled incomplete (he said Smith lost control, which never happened). The second was a ticky-tack offensive pass interference on Dwayne Jarrett that most officials wouldn't have called. I guess Boger spent too much money on Black Friday; he must have been short on cash and bet on the Jets. As I said last week, Boger's kids better receive great Christmas gifts. And I wasn't the only one who noticed this shady officiating. My dad called me up around 5 and said, I wouldn't worry about this loss. The gay black referee screwed us again. I couldn't have put it any better myself. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "The Bengals just aren't big on being large favorites, are they? With this spread loss, they are now 1-8 against the number when laying 3.5 or more. But the important thing is that they won this game against the hapless Browns. Despite this low score, Cincinnati dominated the contest, holding Cleveland to 169 total yards and two first-half first downs. The Bengals had a simple game plan, running the ball non-stop and throwing short passes when needed. ",
            "2": "Larry Johnson shockingly rushed for 107 yards on 22 carries. There were a few occasions where the East Coast Cat danced around the line of scrimmage, but looked good for the most part. Bernard Scott, meanwhile, managed 87 yards on 18 attempts. ",
            "3": "I wasn't kidding when I said that the Bengals stuck to short passes. Carson Palmer's longest completion was just 19 yards. He finished 13-of-24 for 110 yards and a touchdown. He was sacked three times, as Shaun Rogers once again dominated the line of scrimmage. Unfortunately, Rogers left the game late. He's now out for the year with a torn Achilles' tendon. ",
            "4": "As you can imagine, the Bengal receivers did nothing. Chad Ochocinco led the group with three grabs for 38 yards. J.P. Foschi caught Palmer's lone score. ",
            "5": "Outside of one drive, Brady Quinn was absolutely horrible. He went 15-of-34 for 100 yards and a rushing touchdown on a quarterback draw. Many of his passes were ugly ducks, and it's a miracle that he wasn't intercepted. ",
            "6": "Browns leaders: Jamal Lewis had 40 yards on 11 carries, while Chansi Stuckey hauled in four receptions for 44 yards. Mohamed Massaquoi had just one catch (12 yards). "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Colts",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "27"
        },
        "comments": {
            "amount": "9",
            "1": "If you weren't keeping track, the Texans went up 17-0 at the start of the game. Matt Schaub was on fire, starting 9-of-9 for 106 yards and a score. The defense intercepted Peyton Manning twice. Everything was going Houston's way. That said, I never had any doubt that the Colts would win. I'll never forget that Sage Rosencopter game last year where Houston blew a huge lead with five minutes to go. The Texans always choke, and Manning always pulls through. I had to resort to praying that Houston would hold on and cover to preserve my half unit. My prayers were not answered. ",
            "2": "Schaub was really hot at the beginning of the game, but fizzled out, finishing 31-of-42 for 284 yards, two touchdowns, two interceptions and a big lost fumble. His second score and some of his yardage came in junk time when the Texans fell behind 35-20. ",
            "3": "Kevin Walter led the Texans with seven receptions for 73 yards. Andre Johnson had just five grabs for 67 yards. Johnson dropped a touchdown that could have given the Texans a 21-0 lead. ",
            "4": "Steve Slaton and Chris Brown shared carries pretty evenly and posted similar rushing numbers. Slaton gained 57 yards on 10 carries, while Brown totaled 56 yards on 11 attempts. Brown had a touchdown, while Slaton chipped in with seven receptions for 49 more yards. ",
            "5": "Manning had those aforementioned two first-half picks, but was extremely sharp after intermission. He finished 27-of-35 for 244 yards, three touchdowns. As I said earlier, there was never a doubt in my mind that Manning would pull away with the win. He always does. ",
            "6": "Manning's scores went to the usual suspects: Dallas Clark (9 catches, 63 yards), Pierre Garcon (5-63) and Reggie Wayne (3-19). Austin Collie didn't get a touchdown, but he led the team with 70 receiving yards on four receptions. ",
            "7": "Joseph Addai ran well against Houston's improved rush defense, gaining 69 yards on 15 carries. Donald Brown had five attempts for 27 yards. ",
            "8": "Houston was whistled for 10 penalties (129 yards) compared to Indianapolis' three. Some of the calls were legit, but there were more than enough bogus calls, including a terrible pass interference call where a Texan defensive back grazed the arm of a Colt receiver on an overthrown ball. Rodney Harrison said the penalty was a disgrace, and even former Indianapolis head coach Tony Dungy expressed his displeasure with the infraction. ",
            "9": "With this loss, the Texans have now fallen to 5-6 after a promising 5-3 start. This was their Super Bowl and they lost it. Their season is over. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Believe it or not, this is the first time the Chargers have beaten the Chiefs at home by more than 11 points since 1994. Considering the lack of talent on Kansas City, I can't say I'm surprised. ",
            "2": "What's odd is that Matt Cassel didn't take a single sack in this contest despite being pressured often. But don't worry - Cassel was pretty inept in other areas. He finished 19-of-31 for 178 yards, one touchdown, an interception and two fumbles. He also took a safety on an intentional grounding. ",
            "3": "Two bright spots for Kansas City's offense: Jamaal Charles rushed for 93 yards and a touchdown on 14 carries, and also had three receptions for 54 more yards. Chris Chambers had seven catches for 70 yards and a score against his old team. You show 'em, Chris! ",
            "4": "The Chiefs defense had no answer for no answer for Philip Rivers and his weapons. The Chargers compiled 426 total yards and 26 first downs, and won the time-of-possession battle by 11 minutes. Rivers was 21-of-28 for 317 yards and two touchdowns. ",
            "5": "Both of Rivers' scores went to Antonio Gates, who had seven catches for 118 yards and a pair of scores. Amazingly, he was wide open all afternoon. Vincent Jackson, meanwhile, had just two receptions for 27 yards. Rivers simply enjoyed airing it out to a completely open Gates. ",
            "6": "LaDainian Tomlinson also had two touchdowns, but managed just 39 yards on 13 carries versus Kansas City's horrid defense. Tomlinson nearly scored a third time late in the game, but fumbled at the 1-yard line. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "Surprise, surprise. Jack Del Rio and Dirk Koetter came up with another stupid game plan. I'm completely shocked. Last week, Del Rio and Koetter called 22 passes out of the first 32 plays of the game. This week, Maurice Jones-Drew received just FIVE carries in the first half compared to 18 David Garrard attempts. I'll capitalize: HOW STUPID CAN YOU BE? GET THE BALL TO YOUR BEST PLAYER, YOU IDIOTS! The Jaguars trailed 17-3 at the break, so amazingly, 10 of Jones-Drew's 15 carries came in the second half. Way to run the ball only when you're down. Jones-Drew finished with 75 yards on those 15 attempts. Oh, and you'll be surprised by this one - the Jaguars had five penalties in the first half. The 49ers had just one all game. And note that this frustration comes despite the fact that I won five units on San Francisco. It just bothers me that an NFL coaching staff can be this inept week in and week out. It's like Del Rio and Koetter are betting against themselves. It's inexcusable. Rant over. ",
            "2": "David Garrard was apparently solid by going 25-of-36 for 307 yards. However, Garrard took six sacks and lost two fumbles. He leads the NFL in fumbles with 11 (8 lost). ",
            "3": "Aside from Jones-Drew's five catches, Mike Thomas (62 yards), Torry Holt (50) and Mike Sims-Walker (46) led the team with four receptions. ",
            "4": "Alex Smith was very impressive despite not getting much out of Frank Gore (16 carries, 33 yards). Smith finished 27-of-41 for 232 yards and two touchdowns. ",
            "5": "Smith looked toward Michael Crabtree a lot in this game. Crabtree had four grabs for 54 yards, but dropped a touchdown. Vernon Davis, meanwhile, hauled in six grabs for 69 yards and a score. Gore had Smith's other touchdown. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "This game pretty much went the way everyone expected it to. Brett Favre was amazing, Jay Cutler threw interceptions, and the Vikings dominated in almost every statistical category. Some examples: - The Vikings had 31 first downs. The Bears had eight. - Minnesota converted 12-of-18 third downs. Chicago was 2-of-8. - The Vikings out-gained the Bears, 537-169. - Minnesota won the time-of-possession battle by nearly 22 minutes! ",
            "2": "Brett Favre was 32-of-48 for 392 yards and three touchdowns. His scores went to Percy Harvin (6 catches, 101 yards), Visanthe Shiancoe (5-51) and Chester Taylor (6-51). Sidney Rice and Bernard Berrian didn't get into the end zone, but both had solid games, catching six balls each for 89 and 74 yards, respectively. ",
            "3": "The only good thing the Bears did in this contest was hold Adrian Peterson in check. They limited him to 85 yards and a score on 25 carries. Peterson also fumbled twice. ",
            "4": "Horrible numbers for Chicago, as you would imagine. Jay Cutler was 18-of-23 for 147 yards and a touchdown, but also tossed two interceptions. One of them wasn't his fault (tipped ball). ",
            "5": "Matt Forte had no running room, as he gained only 27 yards on eight rushes. He did, however, catch four balls for 34 more yards. ",
            "6": "The leader in both catches and receiving yards for Chicago was Greg Olsen, with seven and 45. Devin Hester had only one reception for 20 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Titans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "All Vince Young does is win football games! If you somehow missed it, Young engineered a 99-yard game-winning drive down four with slightly more than two minutes remaining in regulation. Young was 9-of-16 for 94 yards on the final possession, converting three fourth downs, including a last-gasp 4th-and-goal from the 10 as time ran out. Young is now 23-11 as a starter. Unlike his past few outings, Young did it through the air, going 27-of-43 for 387 yards and the decisive touchdown. ",
            "2": "Of course, Chris Johnson was also a major factor. He rushed for 154 yards on 18 carries, including an 85-yard touchdown. Johnson is now on pace to rush for 2,030 yards. ",
            "3": "Kenny Britt emerged with seven catches for 128 yards. It looked like he was going to be the goat because he fumbled near Arizona's red zone on the penultimate drive of the contest, but made up for it by hauling in the game-winning touchdown. ",
            "4": "Matt Leinart, who had to be experiencing deja vu with another late loss to Young, played pretty well himself. He went 21-of-31 for 220 yards, and had five completions of 20-plus. That being said, he's got nothing on Warner in terms of downfield accuracy. ",
            "5": "Though Leinart had solid numbers, no Cardinal receiver did much. Anquan Boldin led the team in both receptions (5) and yards (53). Larry Fitzgerald had just two grabs for 34 yards. ",
            "6": "Tim Hightower received the majority of the carries with 11 for 55 yards and a touchdown. Chris Wells had just eight attempts for 20 yards. "
        }
    },
    "numberOfGames": "13"
}