{
    "year": "2009",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "With this victory, the Falcons are a win away from clinching consecutive winning seasons for the first time in franchise history. It's hard to believe that this has never happened, but it looks like Mike Smith is willing to do anything to make this happen - even if it means starting severely injured players. I kid, of course. Maybe. But Michael Turner didn't play, allowing Jason Snelling and Jerious Norwood to split carries. Snelling had 15 rushes for 68 yards, while Norwood mustered 52 yards on 13 attempts. ",
            "2": "Matt Ryan did a solid job rebounding off a dreadful Week 15, going 18-of-35 for 250 yards and three touchdowns. Ryan hit Roddy White twice for scores. White managed eight catches for 139 yards. Marty Booker caught the other score - perhaps the final touchdown of his career. ",
            "3": "Tony Gonzalez had just two receptions for 17 yards. He left the game with a calf injury in the second half. ",
            "4": "Buffalo's offense couldn't do anything against Atlanta's pedestrian defense, compiling just 178 total net yards and converting only 2-of-10 third downs. Then again, the Bills were going with a practice-squad quarterback who had never attempted a single pass in the NFL, so no one should be surprised by this. Brian Set Up Us the Brohm was 17-of-29 for 146 yards and two interceptions. No wonder he was so thoughtlessly discarded by the Packers. ",
            "5": "Terrell Owens didn't do much (4-39), but he's still worth noting because he became the sixth player NFL history to catch 1,000 passes. Lee Evans led the team with five receptions for 43 yards. ",
            "6": "Atlanta's run defense, which hasn't allowed more than 103 rushing yards to an opponent since Nov. 15, did a great job shutting down the Bills' ground attack. Fred Jackson had 39 yards on 13 carries, including a fumble-six. Marshawn Lynch had three attempts for three yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "No one should be shocked that the Bengals couldn't blow out the Chiefs. First of all, Cincinnati doesn't have an explosive offense; save for two instances this year, the Bengals haven't scored more than 24 points. More prominently though, Cincinnati suffered through Chris Henry's death last Thursday, had an emotional loss at San Diego last Sunday, and attended Henry's funeral on Tuesday. There was no way the Bengals would be able to get up for the lowly Chiefs. Nevertheless, the Bengals prevailed and have clinched the AFC North. ",
            "2": "Carson Palmer went 17-of-25 for 139 yards, two touchdowns and an interception. The game-winning score went to Chad Ochocinco (4-31), who raised one finger on one hand and five on the other to salute Henry, their old No. 15. ",
            "3": "Cedric Benson rushed for 133 yards on 29 attempts. Larry Johnson, facing his old team, had four rushes for 11 yards. Johnson had a 6-yard gain in this contest, and after he was tackled, he taunted a Kansas City defender. Johnson could have easily been flagged for this, but perhaps the official shared Johnson's disdain for motorcycle riders. ",
            "4": "As for the Chiefs, they actually outgained the Bengals, 295-274. Matt Cassel's two interceptions really hurt, however. He finished 22-of-37 for 180 yards, a touchdown and those two picks. Shockingly, Cassel was sacked only once. ",
            "5": "Shaking off the rust from last week, Dwayne Bowe mustered nine receptions for 61 yards. No other Chief had more than 35 receiving yards. ",
            "6": "Jamaal Charles rushed for 102 yards on 24 attempts, and also had three catches for 22 more yards. This was very impressive, considering how good Cincinnati's defense is. Charles could be a first-round fantasy player next year. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "The Browns really must not want a talented player in the 2010 NFL Draft. Why do they keep on winning? It's like they want to stay crappy forever. And speaking of crappy, it shouldn't be a surprise that Oakland's highlight was a Sebastian Janikowski play. Janikowski nailed a 61-yard field goal at the end of the first half, marking the first there has been a successful 61-yard kick in NFL history. ",
            "2": "Jerome Harrison rushed for 148 yards and a touchdown on a whopping 39 carries. The good news is that Harrison is legit, making the running back position a non-need this offseason. The bad news is that Mangina could easily just go with Chris Jennings next week. ",
            "3": "Derek Anderson went 8-of-17 for 121 yards and a score, looking very mediocre throughout. Mohamed Massaquoi caught that touchdown, notching three receptions for 61 yards. ",
            "4": "Meanwhile, Charlie Frye, the man Anderson once displaced in Cleveland, was 26-of-45 for 333 yards. But before you wet your pants and think that the Raiders have a legitimate quarterback, note that he tossed three interceptions as well. ",
            "5": "Zach Miller led the Raiders with nine catches for 110 yards. Michael Bush rushed for 52 yards on 10 attempts. Darren McFadden had only seven carries for 23 yards, but caught four balls for 55 more yards. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Packers",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Remember when the Seahawks used to contend for the NFC West title every year? Those days are history, and as long as Jim Mora Jr. is coaching the team, they're never coming back. I've spent a lot of time the past few weeks complaining about Mora, but I haven't discussed Matt Hasselbeck enough. Hasselbeck has reached what I like to call the Marc Bulger I've been hit too much, so I'm just going to throw horrible passes to avoid getting sacked threshold. Hasselbeck was absolutely horrible. We're talking Cade McNown-Ken Dorsey bad. He was 19-of-37 for 198 yards, one touchdown and four interceptions. His first pick was one of the worst throws I've ever seen. He rolled out and lofted a weak 4-yard lob to A.J. Hawk with absolutely no Seahawks in the vicinity. It actually looked like Hasselbeck did it on purpose. But that's impossible though. No NFL games are fixed, right? Hasselbeck spent the rest of the afternoon throwing into triple coverage. If the Seahawks can get Sam Bradford in April, they shouldn't hesitate as long as they're convinced that his shoulder is OK. ",
            "2": "Julius Jones and Justin Forsett split carries evenly, but it shouldn't surprise you that Forsett outgained Jones, 70-39. If Mora had a brain, he'd ride Forsett, but that ship has sailed a long time ago. ",
            "3": "The Packers, meanwhile, did a great job rebounding off that last-second loss in Pittsburgh. Aaron Rodgers completed just 12 of his 23 passes, but collected 237 yards and a touchdown in the process. Rodgers hit Greg Jennings (4 catches, 111 yards) for gains of 40, 38 and 24, and Jermichael Finley (3-80) for connections of 38 and 28. Donald Driver had just three catches for 33 yards. ",
            "4": "Ryan Grant rushed for 97 yards and two touchdowns on just 16 carries, including a 56-yard score. It was also nice to see Ahman Green get a late touchdown. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Texans",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "I think at this point, Dolphins fans would rather have their team play the Colts, Saints and Chargers rather than the Texans. Miami has never beaten Houston, owning an 0-5 record against the NFL's latest expansion club. ",
            "2": "Though this score was close, it was pretty much never in doubt. The Texans jumped out to a 27-0 lead in the second quarter. In fact, just 17 minutes into the game, Matt Schaub was 10-of-11 for 201 yards and two touchdowns. Miami eventually battled back - and give them credit for doing so - but once they failed to recover an onside kick with less than three minutes remaining, the game (and their playoff hopes) was over. ",
            "3": "Schaub fizzled out after the quick start, finishing 20-of-31 for 286 yards, two touchdowns and an interception. Andre Johnson led the team with five catches for 71 yards and a score. ",
            "4": "Gary Kubiak actually kept his promise this week - he stuck with Arian Foster, who rumbled for 97 yards and a touchdown on just 19 carries. Don't get too excited though; one fumble next week, and Foster will be sitting on the bench again. ",
            "5": "Chad Henne did a great job rallying his team back from the enormous deficit, going 35-of-55 for 322 yards, one touchdown and an interception. The pick wasn't Henne's fault; he threw a perfect pass to Ricky Williams, who bobbled the ball and allowed Brian Cushing to pick it off. Williams also had a poor game rushing the ball. Because the Dolphins were down early, he had just 10 carries for 35 yards. ",
            "6": "Believe it or not, Ted Ginn Jr. paced the Dolphins with 82 receiving yards off five catches. Ginn also had a 62-yard touchdown, but that was wiped out by a penalty. Ginn's so inconsistent that he'll probably have just one catch next week. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Congratulations to the referees for winning this game and keeping their season alive, winning 23-20 over their arch rival Ravens. Oh wait, did I say referees? My bad. Must have been a Freudian slip. Let me first say that there is no bias here. I'm neither a Ravens nor a Steelers fan. I had a half-unit selection on Baltimore, and it pushed. So, I have no agenda (at least not with this contest). But as a pure football fan who wanted to see a great game, the officiating here was despicable. The Ravens were whistled for 11 penalties, compared to four for the Steelers. The penalty yardage was 113-20. It seemed like every time Baltimore had a big play, the officials brought it back. Two Ravens' would-be game-winning touchdowns were eliminated by questionable holding and block-in-the-back flags that had very little to do with the scores. The Steelers were also able to run out the clock and avoiding an interception with two minutes remaining because of an illegal contact that had the announcers should have let go because the Pittsburgh receiver ran into the Baltimore defender. To be simple, I'm disgusted. Every official from this game should be fired immediately. ",
            "2": "Aside from the ridiculous flags, this was a really fun, evenly matched battle to watch. Ben Roethlisberger, sporting a new, very questionable haircut, went 17-of-33 for 259 yards, one touchdown and an interception. He was sacked four times. Big Ben's score went to Santonio Holmes, who had five catches for 86 yards. Hines Ward, hobbled with an injured hamstring, had four grabs for 37 yards. Mike Wallace picked up the slack with three receptions for 83 yards. ",
            "3": "Rashard Mendenhall did not have a good game. He scored a touchdown, but mustered only 36 yards on 17 carries. He also dropped a potential score. ",
            "4": "Mendenhall's counterpart, Ray Rice, was really impressive, rushing for 141 yards on 30 carries. ",
            "5": "Joe Flacco went 13-of-25 for 166 yards, two touchdowns and an interception. Flacco's scores both went to Todd Heap, but the only Baltimore player who had more than 37 yards was Derrick Mason, who finished with seven grabs for 77 yards. However, Mason dropped a very easy, wide-open touchdown in the fourth quarter. That was huge because Baltimore failed to muster a single point on that drive after a Flacco sack. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "I picked the Giants to cover, but this result didn't really surprise me too much. Think about it - New York had a dominant Monday night win on the road. The players were convinced that they were back; that all of the problems that haunted them in the middle of the year were resolved. With the crappy 6-8 Panthers coming to town in the team's final home game at Giants Stadium, New York just pretty much thought that this was an automatic victory for them. So, what happened? How did Carolina manage to win by 32 points in what was New York's final home game ever in Giants Stadium? Well, when the Panthers have a good quarterback under center, they're actually a really solid team. Matt Moore parlayed an impressive Sunday night performance with a great road outing, going 15-of-20 for 171 yards and three touchdowns. ",
            "2": "No one is happier than Steve Smith that the Panthers finally have a legitimate signal-caller on the roster (at least one who doesn't have any kidnapped children). Smith caught five balls for 60 yards and a touchdown. Unfortunately, Smith suffered a season-ending injury to his left radius in the third quarter. His diameter is still intact, so don't worry. ",
            "3": "With DeAngelo Williams out, Jonathan Stewart got all of the work against a sleepwalking Giants defense. Stewart compiled 206 yards and a score on 28 carries. ",
            "4": "The Giants had a chance to establish the momentum early on. They scored a touchdown on the first possession, but it was wiped out by a holding penalty. Later on the drive, Mario Manningham (6-87) caught a pass in the red zone to convert a 3rd-and-14, but fumbled the ball away. The Panthers took possession and put points on the board on the ensuing drive. ",
            "5": "Eli Manning went 29-of-43 for 296 yards, one touchdown and two interceptions. He also fumbled three times and took four sacks. Manning's score went to Steve Smith, who compiled seven receptions for 70 yards. Hakeem Nicks caught six balls but for only 44 yards. ",
            "6": "Want to see an embarrassing stat? Brandon Jacobs had six carries for a whopping one yard. He left the contest with a knee injury, but looked awful even before exiting. Ahmad Bradshaw (11-53) once again was more impressive. There's no reason he shouldn't be the featured back at this point going forward. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "There are two things to take away from this game. The first is something that we already know - Jack Del Rio and Dirk Koetter are morons. Del Rio essentially gave the Jaguars no chance to win. Just seven minutes into a scoreless game, Del Rio opted to go for it on 4th-and-1 on their own 35. Jacksonville predictably failed, giving Tom Brady a short field and a subsequent score. A drive later, Jacksonville was moving the chains well with Maurice Jones-Drew ripping off 8- and 10-yard gains. Koetter, of course, elected to have David Garrard (19-25, 185 yards, 2 INTs, 1 fumble) throw the ball. Garrard's pass sailed over his receiver's head by about 10 yards, and was picked off by Brandon Meriweather, who returned it deep to Jacksonville territory. Brady scored yet another touchdown on a short field. On my <b> <a href=/picks.php> NFL Picks</a></b> page, I wrote that the Jaguars needed to give Jones-Drew 30-plus touches to have a chance. Apparently, Del Rio and Koetter don't read this Web site. Jones Drew had just 18 carries (63 yards) and three catches (35 more yards). The bottom line: Del Rio and Koetter have to go. Oh, and for the 20 Jags fans out there: Get ready to order your Tim Tebow jerseys. ",
            "2": "The second thing you can take away from this game is that Tom Brady is completely healthy again. He looked great, continuously torching Jacksonville's secondary all afternoon. He was 23-of-26, 267 yards and four touchdowns. ",
            "3": "Three of Brady's scores went to Randy Moss, who caught just four balls for 45 yards. Wes Welker did most of the work, notching 13 receptions for 138 yards, becoming the first player in NFL history with 110-plus catches in three consecutive seasons. I feel your pain if you went against Welker in a PPR championship today. I did in an experts league and lost. ",
            "4": "Sammy Morris received most of the carries early on for the Patriots, compiling 95 yards and a touchdown on 12 attempts. Fred Taylor had 11 carries late in the game for 35 yards. Laurence Maroney rushed five times; he didn't get a chance after fumbling on Jacksonville's 1-yard line on the opening possession. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "I still can't believe the Saints lost this game. They were up 17-0 in the second quarter. It looked like they were playing at 100 mph, eagerly determined to rebound off their only loss of the year. The Buccaneers, meanwhile, were doing what they usually do when I pick them - driving down the field and making dumb turnovers in the red zone. Josh Freeman tossed two interceptions, including one in the end zone. I'm pretty sure that at one point in the Live In-Games Thread on the forum, I swore on Freeman's life. I guess he heard me because he played well afterward, finishing 21-of-31 for 271 yards. The Saints simply screwed up too many times. On one drive, Drew Brees took a sack on third down. On another, Marques Colston fumbled the ball away. On the final drive of regulation, Garrett Hartley whiffed on a 37-yard field goal, sending this contest into overtime. ",
            "2": "Brees and Colston otherwise played pretty well. Brees was 32-of-37 for 258 yards and a touchdown, and at one point in the second half, he had completed 19 passes in a row. Colston, meanwhile, notched eight receptions for 77 yards. Robert Meachem (5-66) caught Brees' touchdown. ",
            "3": "Pierre Thomas had just six carries for 60 yards and a score. He left the game in the second quarter with bruised ribs and never returned. Interestingly enough, the Saints couldn't muster a single point with Thomas out, as his absence killed New Orleans' rushing attack. Mike Bell, who had 20 yards on seven attempts, was not a worthy replacement. But we already knew that. ",
            "4": "As for Tampa's ground attack, Cadillac Williams looked like the same guy we saw coming right out of Auburn back in 2005. He dashed for 129 yards and a touchdown on 24 attempts. ",
            "5": "Antonio Bryant paced the Buccaneers with five receptions for 52 yards. Kellen Winslow Jr. collected four catches for 76 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "This wasn't much of a game. The Cardinals outgained the Rams by 169 yards, won the time-of-possession battle by nine minutes, and had 12 more first downs (26-14). This Arizona victory marked the first time the team notched double-digit victories in a season since 1976. ",
            "2": "As you might expect, Kurt Warner was prolific, going 24-of-38 for 313 yards and two touchdowns. He made only one mistake - he fumbled the ball in the third quarter, giving the Rams a short field and an eventual score. ",
            "3": "Anquan Boldin paced the team with eight receptions for 116 yards. Larry Fitzgerald made just five grabs for 48 yards, but saved his fantasy owners with a touchdown. ",
            "4": "Chris Wells once again saw more action than Tim Hightower, taking 17 carries for 68 yards and a score. Tim Hightower had 10 attempts for 32 yards and a touchdown. ",
            "5": "With Steven Jackson out, the Rams had no chance. Rookie Chris Ogbonnaya and Kenneth Darby split carries and combined for 85 rushing yards. ",
            "6": "Keith Null, who improved last week off his disastrous debut against the Titans, regressed a bit here. He was 20-of-31 for 171 yards, one touchdown and three interceptions. Null took four sacks, while his longest completion was just 21 yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "If you've ever wondered what Anthony Morelli (from <a href=/emmitt2013.php> Emmitt on the Brink</a>) would play like on a normal drunken day, you had your answer here if you watched Drew Stanton. No words can describe how horrible Stanton (11-21, 130 yards) was. All I will say is that Daunte Culpepper, who played at the end of the game, looked like Joe Montana compared to Stanton. Now we know why Rod Marinelli didn't want to start him. Stanton's passes were all over the place. He drunkenly tossed three interceptions, two of which were deep in 49ers territory. And it's not like those passes were tipped or anything; they weren't even near his intended targets. He also fumbled once. Stanton was so bad that he cannot be allowed to take another NFL snap. He's an embarrassment to Michigan State University, the Detroit Lions, the entire National Football League and the entire sport of football. ",
            "2": "Despite Stanton's alcohol-juiced balls, Calvin Johnson had a solid game, catching seven passes for 96 yards. Unfortunately, Megatron fumbled the ball away deep in 49ers territory late in the contest which nullified a potential backdoor cover. ",
            "3": "Coming off an impressive outing, Maurice Morris rushed for only 37 yards on 18 carries. He also caught four balls for 29 yards. ",
            "4": "For the 49ers, this game was all about Frank Gore; Gore rushed for 71 yards and a touchdown on 28 carries. He also led the team with four receptions for 81 more yards. ",
            "5": "Alex Smith was a solid 20-of-31 for 230 yards and a touchdown. Unlike his counterpart, Smith didn't commit any turnovers, but wasn't spectacular or anything either. ",
            "6": "Aside from Gore, Smith's leading receiver was Michael Crabtree, who hauled in four balls for 68 yards. Vernon Davis had only three grabs for 18 yards, but caught a touchdown - his 12th of the season. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "Aside from all the playoff implications, there were two big stories here: First was Brian Westbrook's return. Westbrook had 11 touches; nine carries for 32 yards and two receptions for five more yards. Whenever Westbrook touched the ball, I was actually scared that he would get hit in the helmet and suffer another concussion. I have no idea why Andy Reid would risk Westbrook's health like this. Second was Brian Dawkins' return to Philadelphia. Dawkins made an emphatic entry and was cheered heavily by his old fans. He paced the Broncos with eight tackles. ",
            "2": "I thought the Broncos were going to stink coming into this year. After watching them start 6-0, I was forced to eat some crow. Well, now I can do my best Lindsay Lohan impression because I'm puking that crow up. Denver's offense was more unbearable to watch than ever. Pretty much all of Kyle Orton's throws were horizontal. He was 27-of-41, 189 yards, three touchdowns and an interception (giving him a Ken Dorsey-like YPA of 4.6). Only one of Orton's completions was longer than 18 yards. Denver will need a new quarterback next year. Bronco fans will hope that Josh McDaniels settles for a guy who can actually throw harder than a 12-year-old girl. ",
            "3": "Brandon Marshall's stat line was the perfect result of Orton's horizontal passes; Marshall caught eight balls but for only 39 yards. ",
            "4": "Knowshon Moreno (or as Woody Paige calls him, No-Gain Moreno) rushed for only 18 yards on nine carries, but did chip in with three catches for 17 more yards and a touchdown. Correll Buckhalter, coming back from injury, gained 42 yards on five attempts. One of those rushes was a 33-yarder, so he didn't do much aside from that one touch. ",
            "5": "As for the Eagles, Donovan McNabb made a few sloppy throws and fumbled thrice, but was otherwise brilliant, going 20-of-35 for 322 yards, three touchdowns and an interception. McNabb also had a 27-yard scramble on third-and-long in the fourth quarter, but pulled his hamstring immediately in the process. McNabb looked pretty gimpy afterward, but managed to complete a 27-yard pass to Jeremy Maclin to set up David Akers' decisive field goal on the next drive. The catch was ruled out of bounds, but was overturned by the officials. I honestly thought there wasn't enough visual evidence to change the ruling (I don't know how they determined that his right foot was down), but I guess I'm not as wise or as honest as these refs. ",
            "6": "Brent Celek led the Eagles with 121 receiving yards and a touchdown. DeSean Jackson had a quiet evening, notching four receptions for 33 yards and a score. ",
            "7": "This was a close game that went down to the wire, but it was pretty frustrating to watch. The two teams combined for a whopping 18 penalties, many of which were very questionable. Brandon Stokley was even ejected for arguing a call and accidentally hitting an official's hand. I swear I heard Phil Simms mutter boy, that is a tough call at least half a dozen times. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Jets",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "15"
        },
        "comments": {
            "amount": "6",
            "1": "Before the game, Peyton Manning told Rachel Nichols that he would play as long as the game was competitive. So much for that. Manning started and was on the field for the entire first half, but took a seat up 15-10 in the third quarter. I'll have a full rant about this later in a day or two. As far as this game is concerned, Indianapolis didn't have a chance with Curtis Painter under center. In a quarter and a half, the Painter-led Colts mustered a laughable 34 total net yards. Painter finished 4-of-11 for 44 yards, an interception and a fumble. Manning was obviously better, though it's worth noting that he didn't set the world on fire either (14-21, 192 yards). New York's No. 1-ranked defense did a great job. ",
            "2": "As projected, Austin Collie led the Colts in receiving; Collie caught six balls for 94 yards. Dallas Clark notched four receptions for 57 yards. Reggie Wayne was blanketed by Darrelle Revis and was held to three grabs for 33 yards. My condolences if you had Manning, Clark and Wayne on your fantasy team. ",
            "3": "Joseph Addai had just six carries but made the most of them, collecting 40 yards and a touchdown. Donald Brown then shouldered the load, but managed only 22 yards and a score on 15 attempts. Brown simply had no room to roam with New York's defense not respecting Painter at all. ",
            "4": "The Jets had nothing out of their passing game (Mark Sanchez was 12-19, 106 yards), but were able to move the chains via the ground attack. Thomas Jones rushed for 105 yards and a touchdown on 23 carries, while Shonn Greene chipped in with 95 yards of his own on 16 attempts. ",
            "5": "With Sanchez doing nothing through the air, the Jets' leading receiver was Jerricho Cotchery with four grabs for only 45 yards. Braylon Edwards notched just two receptions for 18 yards. ",
            "6": "Oddly enough, the Jets somehow control their own destiny. If they beat the Bengals on Sunday night next week, they're in. Fortunately for them, it's likely that Cincinnati will bench all of its starters as well because of a potential rematch with the Jets in the first round of the playoffs. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "I'm really fed up with this Redskins team. They were horrible at the beginning of the season, but had a really impressive stretch where they easily could have beaten the Cowboys (road), Eagles (road) and Saints (home). They also defeated the Broncos, and went across the country and knocked off a hot Raiders squad. What in the world happened? They were playing so well, but have come up with two consecutive stink bombs at home. In a span of six days, the Redskins have embarrassed themselves by a combined score of 62-12. Good job, losers. ",
            "2": "Meanwhile, the Cowboys actually came up with a second win in December. A lot will be made of this, but I'm not completely convinced that this team is over its late-season choking habits. After all, the Giants debacled the Redskins and then went on to lose to the Panthers by 32 points. A win over this garbage Redskins squad apparently means nothing. ",
            "3": "Tony Romo played extremely well yet again, going 25-of-38 for 286 yards, one touchdown and an interception against a Redskins team that appeared to be playing prevent defense the entire evening. The pick wasn't Romo's fault; Roy Williams bobbled the ball, which allowed Washington to come away with the turnover. And speaking of Williams, he was the only goat on the Cowboys; he had more drops (2) than catches (1), and he was responsible for Romo's only statistical blemish. ",
            "4": "Jason Witten and Miles Austin-Jones, meanwhile, did a great job. Witten caught six balls for 117 yards, while Austin-Jones had nine catches for 92 yards. Ironically, it was Williams who caught Romo's touchdown. ",
            "5": "Marion Barber gashed Washington's defense for 63 yards and a touchdown on just 17 carries. Felix Jones chipped in with 58 yards on 10 attempts. ",
            "6": "As for the Redskins, Jason Campbell was 24-of-39 for 199 yards and an interception. Campbell didn't get any help from his horrific offensive line, but was also responsible for some poor decisions and misreads. Campbell was sacked three times - which is a lot for a quarterback who didn't take any seven-step drops. What's more sad is that Campbell actually tied for the Redskins lead in rushing yards with 13. Quinton Ganther was the other leader via seven carries. ",
            "7": "Santana Moss was the only Redskins receiver of note; he caught eight balls for 92 yards. Moss' effort was wasted, as Washington struggled to move the chains on every possession. The team had just 97 total net yards in the first half and NEVER crossed the Dallas 25-yard line the entire game. "
        }
    },
    "numberOfGames": "14"
}