{
    "year": "2009",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "I wish I had Jon Gruden here to comment on this because Miami's Wildcat offense was an epic failure in this contest. The Dolphins got just four yards out of the Wildcat, came on a Ronnie Brown run. Pat White, meanwhile ran for no gain and was incomplete on one attempt, missing an open Ted Ginn downfield. ",
            "2": "As for Miami's regular offense, the seven points it put up pretty much speaks for itself. The score could have been a lot closer, but Anthony Fasano fumbled the ball away at the Atlanta 10. In total, the Dolphins had four turnovers after coming up with a plus-17 turnover differential last year - a sign that things won't be the same in 2009. ",
            "3": "Chad Pennington was 21-of-29, but threw for just 176 yards, which gives him a pretty weak YPA of 6.1. Pennington also had a touchdown and an interception. ",
            "4": "Perhaps Miami's greatest mistake was not getting Ronnie Brown involved enough. Despite the fact that Brown averaged 4.3 yards per carry against Atlanta's pedestrian run defense, Brown was given only 10 carries. He also had just three receptions for 10 more yards. I understand being scared of Brown wearing down late in the year, but with games coming up against Indianapolis and San Diego, this was one the Dolphins had to have. ",
            "5": "Another concern the Dolphins suddenly have is pass protection; the Falcons, not known for being able to get after the quarterback consistently, managed four sacks on Pennington. John Abraham and Kroy Biermann had two each, exposing Jake Long and Vernon Carey. ",
            "6": "Matt Ryan was as good as advertised, going 22-of-36 for 229 yards and two touchdowns. Ryan found Tony Gonzalez and Roddy White five times each. Gonzalez had 73 yards and a score, while White had 42 yards. ",
            "7": "A disappointing outing for Michael Turner. Turner mustered only 65 yards on 22 carries against a Dolphins rush defense that was ranked in the middle of the pack last year. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "I complain about my bad beats all the time, but I'll admit that I got really lucky here. I had the Ravens -12.5 for four units, and it looked like they would win by seven points. Fortunately, the Chiefs fumbled with less than two minutes remaining on their own nine. Baltimore scored a touchdown on 4th-and-goal. Gooo meee! ",
            "2": "Of course, this game wouldn't have been close if the Ravens didn't repeatedly screw themselves over. Kansas City scored its first touchdown on a blocked punt. The team's next touchdown came off a Joe Flacco interception. Steve Hauschka also missed a 41-yard field goal. Paging Matt Stover? ",
            "3": "Outside of the pick, Joe Flacco was brilliant; he was 26-of-43 for 307 yards and three touchdowns. I loved Flacco as a fantasy sleeper after watching him this preseason, so if you have him on your roster, congratulations. If, for some reason, he's available in your league, pick him up immediately. ",
            "4": "Ray Rice rushed for 108 yards on 19 carries, and I'm actually a bit disappointed. I thought the Ravens would use him more (he also had two catches for 11 yards). Rice was also nowhere to be seen when Baltimore reached the red zone; Willis McGahee and LeRon McClain both scored. ",
            "5": "Though 14 of Kansas City's points came off Baltimore turnovers, Brodie Croyle was very impressive in this contest, considering the defense he was going up against. Croyle was 16-of-24 for 177 yards and two touchdowns. On a game-tying drive late in the fourth quarter, Croyle was 4-of-5 for 55 yards. There's little doubt that Croyle is the best quarterback on the Chiefs, but he can't stay healthy. Ironically, Matt Cassel should be back to ruin things next week. ",
            "6": "Dwayne Bowe, proving that he pretty much is matchup-proof (save for when he plays Nnamdi Asomugha), caught four balls for 40 yards and a touchdown. Mark Bradley also had four grabs for 73 yards. ",
            "7": "The Chiefs predictably couldn't run on the Ravens. Larry Johnson had just 20 yards on 11 carries. Jamaal Charles was the more effective player, catching four balls for 29 yards in addition to his eight rushing yards on four carries. ",
            "8": "Though Baltimore gave up 14 points off turnovers, the key to its victory today was third-down conversions; the Ravens were 10-of-17 on third downs. The Chiefs, meanwhile, were just 2-of-10. ",
            "9": "Perhaps the reason the Chiefs were 2-of-10 was because they kept putting themselves in impossible situations. Check this out: "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "I was going to start with Jake Delhomme, but the big story is Donovan McNabb. McNabb fractured a rib on a touchdown run late in the game. He'll likely be out next week, and you have to wonder why he was scrambling for a score up 31-10 in the second half. ",
            "2": "My greatest concern with the Eagles going into this contest was their pass protection; Jason Derrick Coleman Peters is terrible, while Winston Justice had never started at right tackle before. So, what have we learned? Absolutely nothing, though Peters was whistled for two false starts. The Eagles offense ran their ninth play when they were up 24-7, thanks to Delhomme's ineptness. All of Philadelphia's numbers were limited (McNabb: 79 yards, 2 TDs; Brian Westbrook: 64 rush yards) because the team barely had the ball. ",
            "3": "Back in January, Jake Delhomme's son was kidnapped. In order to get his son back, Delhomme had to throw the game against Arizona. Five interceptions and a fumble later, we all assumed Delhomme's kid would be returned safely. Not so fast! Turns out the kidnappers parlayed that contest with Carolina's Week 1 opponent! Delhomme went on to toss four interceptions and fumble once in this contest. Hopefully this was just a 2-team parlay. In all seriousness, Delhomme (7-of-17, 73 yards) is arguably the worst starting quarterback in the NFL. In his last two games, Delhomme has NINE picks and two fumbles. Nine freaking picks! I'd advise John Fox to start his backup, but the Panthers don't believe in drafting signal-callers, so their top backups are Josh McCown and Matt Moore. Ouch. ",
            "4": "Amazingly, the Panthers once had a lead in this game, as they scored on the opening drive on a DeAngelo Williams 11-yard run. But even that touchdown had its downside, as Carolina was very sloppy. Set up with a 1st-and-goal at the 1, they had two false starts that moved them back to the 11. Williams saved the day - temporarily. ",
            "5": "Williams was the only offensive Panther who showed up to play. In addition to his 37 rushing yards and touchdown, he also had four catches for 42 yards. ",
            "6": "Steve Smith had just three grabs for 21 yards. Delhomme's ineptness ruined a potential solid fantasy day for Smith owners. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "Wow. Sometimes it's better to be lucky than good, and that was the case in this contest. If you missed it, Kyle Orton heaved a weak pass with less than half a minute remaining in the fourth quarter, down 7-6. The pass, intended for Brandon Marshall, was tipped by a Cincinnati defender, but it bounced right into Brandon Stokley's hands. Stokley ran it in for a touchdown, on what would count as an 87-yard score for Orton. ",
            "2": "I'll never underestimate what a victory like this can do for a team, but looking at facts for a second, Orton was pretty pedestrian. He was 17-of-28 for 243 yards and a touchdown. Taking away that 87-yard score, however, Orton had just 156 yards on 27 attempts, giving him a YPA of 5.8. No surprise there - the Broncos struggled to move the chains all afternoon, converting 3-of-12 of their third downs. ",
            "3": "Correll Buckhalter started the game, but Knowshon Moreno got most of the work from the third drive on. Moreno had just 19 yards on eight carries, but it's worth noting that he lost four yards because he slipped. Moreno was obviously limited in this game, and he has a much better matchup next week against the woeful Browns. ",
            "4": "For all the talk of Brandon Marshall versus Eddie Royal, neither wideout did anything in this contest. Marshall had four catches 27 yards, while Royal had only two grabs for 18 yards. ",
            "5": "A funny stat: Tony Scheffler had one catch for 29 yards and one interception. Scheffler caught Carson Palmer's Hail Mary. ",
            "6": "The Bengals only have themselves to blame for this loss. They repeatedly shot themselves in the foot, even before Orton stuffed a four-leaf clover up his rear end on Denver's final drive. Carson Palmer was victimized by a whopping seven drops, most of which were by Laveranues Coles. Cincinnati also botched a field goal attempt on an errant snap. ",
            "7": "Palmer was 21-of-33 for 247 yards and two picks (one was on a Hail Mary). Those numbers aren't very impressive, but once again, Palmer suffered through seven drops. ",
            "8": "Cedric Benson, one of my fantasy sleepers, was one of the few Bengals who did not disappoint. Benson rushed for 76 yards and a touchdown on 21 carries. He also had four receptions for 32 more yards. ",
            "9": "Chad Ochocinco caught five balls for 89 yards, but Cincinnati's team-leader in receptions was Andre Caldwell, who had six grabs for 54 yards. Both Chris Henry and Laveranues Coles caught one pass each. Another few outings like this, and the Bengals should consider cutting Coles. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "So much for all of this Brett Favre talk. The Vikings could have had a mannequin under center and won this game; the Browns had absolutely no answer for Adrian Peterson, who rushed for 180 yards and three touchdowns on 25 carries. Good thing the Browns didn't spend so much money on defensive linemen a year ago. Oh, wait... ",
            "2": "Favre was just 14-of-21 for 110 yards and a touchdown to Percy Harvin. Favre didn't exactly do anything to validate the signing, but the one important thing he didn't do was turn the ball over. That will probably happen later in the year. ",
            "3": "Percy Harvin led the Vikings with three receptions for 36 yards and a score. Harvin also ran the ball twice for 22 yards. Harvin appears to be Brett Favre's favorite target, though it should be noted that Bernard Berrian (0 catches) was limited with an injury. ",
            "4": "While Peterson steamrolled over Cleveland's defense, the Browns could barely run the ball, losing the rushing battle, 225-89. Jamal Lewis rushed for 57 yards on 11 carries and chipped in with three receptions for 47 yards. James Davis, meanwhile, did nothing, garnering only five yards on four attempts. Davis chipped in with three receptions for four more yards. He'll have more running room against a defense that doesn't have the Williams Wall, and hopefully he won't be coming off another car accident next week. ",
            "5": "Brady Quinn finished the game 21-of-35 for 205 yards, one touchdown and a pick. However, most of Quinn's yardage and his score came late against Minnesota's backups. Quinn was very mediocre in this contest. He seldom went deep, and when he did, he was picked off. Quinn also lost a fumble that set up a Vikings field goal on a very strange play that will be featured on NFL blooper reels for years. The Browns have a better shot with Derek Anderson, who was the better quarterback this preseason. ",
            "6": "So much for playing for a new contract. Braylon Edwards had just one catch for 12 yards. He did have a touchdown that was overturned when the replay showed he stepped out of bounds prior to catching the ball, but Edwards was also responsible for two penalties worth 15 yards. ",
            "7": "With 1st-and-goal on the 6-yard line early in the game, the Browns eschewed running a regular offense and instead used a Wildcat formation twice. Those two plays gained a whopping one yard. With the Dolphins seemingly transitioning away from the Wildcat (read the Miami-Atlanta analysis), I find it funny that Eric Mangini is trying to use it as much as possible. Mangini is like the dorky kid who gets the cool toy a year too late. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "If you told me the final score of this game would be 24-7, I would have said, Wow, the Texans scored only 24 points? I think it goes without saying that my Houston playoff projection is looking very shaky. ",
            "2": "I really don't know where to start with this team. Perhaps up front, where Houston's offensive line couldn't pass protect or open up running lanes despite the fact that two of the Jets' better defenders (Shaun Ellis, Calvin Pace) were out. Or maybe we should discuss Steve Slaton, who must have spent all offseason watching Tim Hightower tapes. Slaton did way too much dancing around, rushing for a laughable 17 yards on nine carries. Slaton managed three receptions for 35 more yards, but also lost a fumble. And how about Matt Schaub? Schaub was 18-of-33 for 166 yards and an interception, though to be fair, he had no help from his offensive line. Oh, and let's not let the defense slide. Early on, Houston blew an opportunity to establish control, as they dropped three Mark Sanchez interceptions in the first quarter and a half. Most importantly, they couldn't get off the field; Houston let a rookie quarterback making his first NFL start convert 10-of-18 third downs. And these weren't just short-yardage situations; Sanchez moved the chains on 3rd-and-10 (three times), 3rd-and-7 (twice), 3rd-and-9 and 3rd-and-8. ",
            "3": "One interesting thing before we move on to the Jets. There were really two defenses that put the clamps on Houston's offense last year: Pittsburgh and Baltimore. Rex Ryan was the defensive coordinator for the Ravens in 2008; clearly, he has the perfect blueprint to shut down the Texans. ",
            "4": "Mark Sanchez was brilliant in his first start; he was 18-of-31 for 272 yards, a touchdown and a pick. Sanchez did have three potential interceptions dropped, but he also converted 10-of-18 third downs, which is simply amazing for a rookie making his first NFL start in a hostile environment. ",
            "5": "Thomas Jones rushed for 107 yards and two touchdowns on 20 carries, but those numbers don't convey how mediocre he was. Jones was able to break runs of 38 and 39 yards through wide-open holes created against Houston's tired defense in the second half. Take away those gains, and Jones managed only 30 yards on 18 rushes. Leon Washington, meanwhile, was far more impressive on 15 carries for 60 yards, and four catches for 24 more yards. ",
            "6": "Amazingly, only four Jets caught a reception in this contest, which makes you wonder what exactly the Texans were doing. Jerricho Cotchery led the team with six grabs for 90 yards. Dustin Keller (94 yards), Chansi Stuckey (64) and Washington (24) all caught four passes. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "The big news out of this game is that Anthony Gonzalez suffered a strained knee ligament in the first quarter. He will be out 2-6 weeks. ",
            "2": "Despite the loss of Gonzalez, Peyton Manning was still able to go 28-of-38 for 301 yards, one touchdown and a pick in the red zone. Manning also helped the Colts convert 8-of-14 third downs. ",
            "3": "Reggie Wayne picked up the slack with 10 catches for 162 yards and a touchdown. Looks like those who said Wayne's past production was a result of Marvin Harrison being on the opposite side of the field will finally be silenced. ",
            "4": "Joseph Addai scored a touchdown, but was otherwise very mediocre, rushing for 42 yards on 17 carries. Unfortunately, Donald Brown wasn't much better (11 rushes, 33 yards), but it's only a matter time before he takes over as the starter. Addai fumbled and dropped a screen. Indianapolis' ground attack simply could not get anything going against Jacksonville's pedestrian defense. ",
            "5": "Though the Jaguars kept this game close, David Garrard was just 14-of-28 for 122 yards. He completed only two passes greater than 15 yards. Torry Holt, expected to open this offense up, made just three grabs for 47 yards. ",
            "6": "Jacksonville rode Maurice Jones-Drew in this game, which is exactly what the Titans should have done with Chris Johnson on Thursday night. Jones-Drew touched the ball 26 times (21 carries, 5 catches) out of 55 plays. He rushed for 97 yards and garnered 26 receiving yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Saints",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "The biggest story to the media is Drew Brees. Brees absolutely lit up Detroit's hapless defense, going 26-of-34 for 358 yards, six touchdowns and a pick. Brees helped the Saints convert 9-of-13 third downs, and had to call in the punt unit only twice. ",
            "2": "The biggest story to me, on the other hand, is the play of New Orleans' defense. You may look at the score and say, The same old Saints gave up 27 points. Doing so would be ignorant; Detroit's first touchdown was set up on a great punt return. A later touchdown was a fumble return. New Orleans really gave up 13 points and allowed only 14 first downs to the Lions. ",
            "3": "The biggest story to the fantasy world is the emergence of Jeremy Shockey, who caught four balls for 31 yards and two touchdowns. Shame on you if you passed on Shockey because he had no scores last year; I guess having an entire offseason with a team helps, huh? ",
            "4": "Replacing Pierre Thomas, Mike Bell rushed for 143 yards on 28 carries. The injury Pierre Thomas suffered while chasing his dog could cost him millions of dollars; with this performance, Bell will take touches away from Frenchie. ",
            "5": "Marques Colston had just three catches for 30 yards and a touchdown. Lance Moore had only two grabs for 38 yards. Meanwhile, Devery Henderson hauled in five receptions for 103 yards and a score. Don't read too much into this; Henderson is a deep threat who is usually famine over feast. Henderson simply abused Detroit's abysmal secondary. ",
            "6": "Matthew Stafford had a tough outing against New Orleans' incredibly underrated defense, going 16-of-37 for 205 yards and three picks. On the bright side, Stafford was sacked just once. ",
            "7": "Kevin Smith and Calvin Johnson shined as expected. Smith mustered only 20 yards on 15 carries, but had seven receptions for 52 yards and a score. Megatron, meanwhile, grabbed three balls for 90 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "Tony Romo started this game slowly, as he was just 6-of-13 for 64 yards in the first 28 minutes of this contest. I was all prepared to write how Romo struggled with the departure of Terrell Owens, but Romo exploded after that, finishing 16-of-27 for 353 yards and three touchdowns. Amazingly, Romo's 353 yards were a career-high. So much for struggling without Owens! ",
            "2": "So, who stepped up in Owens' absence? Try everyone. Without needing to target Owens a set amount of times per game, Romo was allowed to scan the field and find the open receiver. Roy Williams had three catches for 86 yards and a touchdown. Patrick Crayton had four grabs for 135 yards and a score. Jason Witten garnered five receptions for 71 yards. Miles Austin-Jones chipped in with a 42-yard touchdown. ",
            "3": "Marion Barber ripped through Tampa Bay's anemic defense, gaining 79 yards and a touchdown on 14 carries. Felix Jones rushed only six times for 22 yards. ",
            "4": "It wasn't all positive for Dallas; the Cowboys' horrific rush defense picked up where it left off last year. Cadillac Williams, who started the game, rushed for 97 yards and a touchdown on 13 carries. Playing off the bench, Derrick Ward had 62 yards and a score on 12 attempts. ",
            "5": "It's confirmed - Michael Clayton is alive! Clayton, who has done nothing since a prolific rookie campaign in 2004, led the Buccaneers with five catches for 93 yards. Kellen Winslow Jr. also had five grabs for 30 yards and a score. ",
            "6": "Antonio Bryant, who didn't get to play much with Byron Sandwich in the preseason, managed only two receptions for 29 yards. His numbers will improve as he gets more time with Leftwich if he's healthy. The big concern is that Bryant left the game in the fourth quarter with a knee injury. ",
            "7": "Speaking of Mr. Sandwich, he was 25-of-41 for 276 yards and a score. Doesn't sound too bad, but most of that came in junk time late in the game. The amazing thing is that Sandwich didn't get sacked once. Still, the Buccaneers won't win (m)any games with him under center. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "And another Super Bowl loser bites the dust. One of the reasons I had the 49ers as a 5-unit play on my ",
            "2": "That stat is not misleading, but others are. Take Kurt Warner's 26-of-44 for 288 yards, one touchdown and two picks, for example. That doesn't look too bad, but Warner was awful. He simply looked awkward throwing the ball with his surgically repaired hip. Most of that yardage was on short dumpoffs. And these stats don't lie - Tim Hightower caught 12 balls for 121 yards. Warner was simply uncomfortable going downfield. If you're a Warner fantasy owner, be very concerned. I hated him from a fantasy perspective this summer because he's a 38-year-old man coming off hip surgery. I know Warner didn't have Anquan Boldin at 100 percent, but he just doesn't look right. ",
            "3": "Aside from Hightower, Larry Fitzgerald led the team with six receptions for 71 yards and a touchdown. Fitzgerald had a good game, but neither he nor Boldin (2 catches, 19 yards), will be fantasy monsters if Warner continues to play poorly. ",
            "4": "Though Hightower grabbed 12 balls, he couldn't get much on the ground (8 carries, 15 yards). Chris Wells was the more-effective runner (7 carries, 29 yards). ",
            "5": "Credit Mike Singletary for coming up with a defense to contain Arizona and sticking to his game plan. Through Frank Gore failed to average 1.5 yards per carry (22 rushes, 30 yards, 1 TD), Singletary continued to run the ball. The 49ers ran 24 times and passed 31 times. ",
            "6": "The big story here is the play of Shaun Hill. Hill wasn't spectacular (18-of-31, 209 yards, TD), but he converted third downs (7-of-18) and came up clutch when the 49ers needed him to. On the game-winning drive, Hill was 9-of-13 for 72 yards with a 3-yard score to Gore. He's now 8-3 as a starter. ",
            "7": "With all the hype Josh Morgan received from various places, including this site, it was the old, reliable Isaac Bruce who led the squad with 74 yards. Morgan had three grabs for 38 yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Giants",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Whenever someone questioned my having the Giants as the top-ranked NFC team in my ",
            "2": "While Smith and Manningham stepped up, Domenik Hixon was nowhere to be found. Hixon caught only one ball for 10 yards. ",
            "3": "On NBC's recap show, Tiki Barber said the Giants are now a pass-first team. I had a good laugh. New York will continue to rely heavily on Brandon Jacobs and Ahmad Bradshaw. Jacobs had 46 yards on 16 carries, while Bradshaw mustered 60 yards on 12 attempts. ",
            "4": "So much for Ladell Betts stealing Clinton Portis' touches. Portis had 62 yards on 16 rushes against a very tough Giants defense. Betts, meanwhile, had only three touches. ",
            "5": "Jason Campbell was 19-of-26 for 211 yards, one touchdown and a pick. Those numbers look solid, but a chunk of his yardage and his touchdown came in garbage time on a back-door scoring drive. Jim Zorn showed very little confidence in Campbell, taking the ball out of his hands on a few key occasions. ",
            "6": "Santana Moss had just two catches for six yards, while Antwaan Randle El had seven grabs for 98 yards. With Giants defenders in his face, Campbell had to resort to shorter stuff, which would explain Randle El's numbers. Chris Cooley also had seven grabs for 68 yards and a score. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks enjoyed their Week 1 bye with a 28-0 victory over the Rams. Things looked like they were going to be shaky at first when Matt Hasselbeck tossed two first-quarter interceptions. However, Hasselbeck quickly remembered how crappy St. Louis is and finished 25-of-36 for 279 yards and three touchdowns. ",
            "2": "They didn't get to play much together last year, but Hasselbeck and John Carlson looked very comfortable. Carlson grabbed six balls for 95 yards and two touchdowns. ",
            "3": "Aside from Carlson, Hasselbeck often targeted T.J. Houshmandzadeh (6 catches, 48 yards) and Nate Burleson (7 catches, 74 yards, 1 TD). ",
            "4": "Julius Jones had a great game, rushing for 117 yards and a score on 19 carries. Don't read too much into this; Michael Strahan's fictional wheel chair-ridden brother could have posted similar stats against the anemic Rams. ",
            "5": "Marc Bulger picked up where he left off last year, going 17-of-36 for 191 yards. For those of you scoring at home, that's a 5.3 YPA. If Bulger were a race horse, he'd be in a glue factory right now. ",
            "6": "Steven Jackson rushed only 16 times for 67 yards. The Rams were behind early and couldn't get Jackson more involved, so I can understand the lack of carries. The problem I have is that Jackson didn't log a single catch. Did St. Louis' coaching staff forget Jackson is a great weapon out of the backfield? ",
            "7": "The lone bright spot for the Rams was Laurent Robinson, who parlayed his great preseason into five catches for 87 yards. If you're in a league with clueless fantasy owners, Robinson could be available. Add him to your roster immediately. For thoughts on Green Bay-Chicago, New England-Bufalo and San Diego-Oakland, check out my updated "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "49ers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "And another Super Bowl loser bites the dust. One of the reasons I had the 49ers as a 5-unit play on my ",
            "2": "That stat is not misleading, but others are. Take Kurt Warner's 26-of-44 for 288 yards, one touchdown and two picks, for example. That doesn't look too bad, but Warner was awful. He simply looked awkward throwing the ball with his surgically repaired hip. Most of that yardage was on short dumpoffs. And these stats don't lie - Tim Hightower caught 12 balls for 121 yards. Warner was simply uncomfortable going downfield. If you're a Warner fantasy owner, be very concerned. I hated him from a fantasy perspective this summer because he's a 38-year-old man coming off hip surgery. I know Warner didn't have Anquan Boldin at 100 percent, but he just doesn't look right. ",
            "3": "Aside from Hightower, Larry Fitzgerald led the team with six receptions for 71 yards and a touchdown. Fitzgerald had a good game, but neither he nor Boldin (2 catches, 19 yards), will be fantasy monsters if Warner continues to play poorly. ",
            "4": "Though Hightower grabbed 12 balls, he couldn't get much on the ground (8 carries, 15 yards). Chris Wells was the more-effective runner (7 carries, 29 yards). ",
            "5": "Credit Mike Singletary for coming up with a defense to contain Arizona and sticking to his game plan. Through Frank Gore failed to average 1.5 yards per carry (22 rushes, 30 yards, 1 TD), Singletary continued to run the ball. The 49ers ran 24 times and passed 31 times. ",
            "6": "The big story here is the play of Shaun Hill. Hill wasn't spectacular (18-of-31, 209 yards, TD), but he converted third downs (7-of-18) and came up clutch when the 49ers needed him to. On the game-winning drive, Hill was 9-of-13 for 72 yards with a 3-yard score to Gore. He's now 8-3 as a starter. ",
            "7": "With all the hype Josh Morgan received from various places, including this site, it was the old, reliable Isaac Bruce who led the squad with 74 yards. Morgan had three grabs for 38 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Giants",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Whenever someone questioned my having the Giants as the top-ranked NFC team in my ",
            "2": "While Smith and Manningham stepped up, Domenik Hixon was nowhere to be found. Hixon caught only one ball for 10 yards. ",
            "3": "On NBC's recap show, Tiki Barber said the Giants are now a pass-first team. I had a good laugh. New York will continue to rely heavily on Brandon Jacobs and Ahmad Bradshaw. Jacobs had 46 yards on 16 carries, while Bradshaw mustered 60 yards on 12 attempts. ",
            "4": "So much for Ladell Betts stealing Clinton Portis' touches. Portis had 62 yards on 16 rushes against a very tough Giants defense. Betts, meanwhile, had only three touches. ",
            "5": "Jason Campbell was 19-of-26 for 211 yards, one touchdown and a pick. Those numbers look solid, but a chunk of his yardage and his touchdown came in garbage time on a back-door scoring drive. Jim Zorn showed very little confidence in Campbell, taking the ball out of his hands on a few key occasions. ",
            "6": "Santana Moss had just two catches for six yards, while Antwaan Randle El had seven grabs for 98 yards. With Giants defenders in his face, Campbell had to resort to shorter stuff, which would explain Randle El's numbers. Chris Cooley also had seven grabs for 68 yards and a score. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks enjoyed their Week 1 bye with a 28-0 victory over the Rams. Things looked like they were going to be shaky at first when Matt Hasselbeck tossed two first-quarter interceptions. However, Hasselbeck quickly remembered how crappy St. Louis is and finished 25-of-36 for 279 yards and three touchdowns. ",
            "2": "They didn't get to play much together last year, but Hasselbeck and John Carlson looked very comfortable. Carlson grabbed six balls for 95 yards and two touchdowns. ",
            "3": "Aside from Carlson, Hasselbeck often targeted T.J. Houshmandzadeh (6 catches, 48 yards) and Nate Burleson (7 catches, 74 yards, 1 TD). ",
            "4": "Julius Jones had a great game, rushing for 117 yards and a score on 19 carries. Don't read too much into this; Michael Strahan's fictional wheel chair-ridden brother could have posted similar stats against the anemic Rams. ",
            "5": "Marc Bulger picked up where he left off last year, going 17-of-36 for 191 yards. For those of you scoring at home, that's a 5.3 YPA. If Bulger were a race horse, he'd be in a glue factory right now. ",
            "6": "Steven Jackson rushed only 16 times for 67 yards. The Rams were behind early and couldn't get Jackson more involved, so I can understand the lack of carries. The problem I have is that Jackson didn't log a single catch. Did St. Louis' coaching staff forget Jackson is a great weapon out of the backfield? ",
            "7": "The lone bright spot for the Rams was Laurent Robinson, who parlayed his great preseason into five catches for 87 yards. If you're in a league with clueless fantasy owners, Robinson could be available. Add him to your roster immediately. For thoughts on Green Bay-Chicago, New England-Bufalo and San Diego-Oakland, check out my updated "
        }
    },
    "numberOfGames": "15"
}