{
    "year": "2009",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "I picked the Saints to go to the Super Bowl back in July. Looks like I got that one wrong. Sean Payton foolishly benched his starters against the Panthers. Drew Brees didn't even play a single snap. After next week's bye, New Orleans will be really out of rhythm. Payton may say that this strategy worked for him back in 2006, but it didn't; the Saints barely beat a poor Eagles team with backup quarterback Jeff Garcia, and then went on to get <strike> blowed</strike> blown out against Rex stinkin' Grossman and the Bears. ",
            "2": "No stats of note for New Orleans; the team mustered just 213 total net yards. Brunell was 15-of-29 for just 102 yards and an interception. Lynell Hamilton paced the Saints in rushing (48 yards, TD) and receiving (3-38). ",
            "3": "Jonathan Stewart started with DeAngelo Williams out again. Stewart rumbled for 125 yards on 16 carries, including a 67-yard touchdown on the first drive of the game. Unfortunately, he reaggravated his old Achillies injury and had to leave the game. ",
            "4": "Matt Moore was a mediocre 14-of-23 for 162 yards and a score, converting just 3-of-15 third downs. Keep in mind that Moore didn't have Steve Smith at his disposal. It was so bad that Muhsin Muhammad (7-85) led the team in receiving. Dwayne Jarrett chipped in with five receptions for 68 yards and a touchdown. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Browns",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "A fitting end to Jacksonville's season. The Jaguars showed no heart at times this year, getting blown out on multiple occasions, and barely escaping the likes of the Rams and Bills. After suffering a huge defeat at New England, Jacksonville didn't show up here, putting forth little effort on defense. On one occasion, Chris Jennings had a crazy 11-yard run where I'm pretty sure that every single Jaguars defender missed a tackle. What was really disturbing to me was a scene when Garrard threw a touchdown as time expired. Though the Jaguars lost and were officially disqualified from the playoffs, they celebrated the score and David Garrard beamed. It's like they didn't even care about the postseason. Garrard was 22-of-39 for 202 yards, two touchdowns and an interception. His scores went to tight end Zach Miller, who had eight grabs for 69 yards. Mike Sims-Walker had just two catches for 28 yards. ",
            "2": "The good news is that Jack Del Rio will probably be fired. Del Rio and Dirk Koetter once again failed to give Maurice Jones-Drew enough touches; MoJo had just 16 carries (82 yards) and one catch. Garrard, meanwhile, fired the ball 39 times. Great game-planning! ",
            "3": "Another big day for Jerome Harrison - the near-record-holder had 127 yards and a touchdown on 33 carries. Amazingly, he was able to run well despite the fact that the Browns didn't seem interested in throwing the ball at all. Derek Anderson was just 7-of-11 for 86 yards and an interception, and he didn't even attempt a single pass in the third quarter. No Cleveland player caught more than two passes. ",
            "4": "Still, give the Browns all the credit here. They've closed out a lost season with four consecutive victories and have displayed a ton of heart and grit. Perhaps Del Rio, Garrard and the Jaguars should pay attention to the Browns. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "And now, the argument against playing your starters. Wes Welker caught his only pass in the first quarter and ran down the field. Untouched, he made a cut and had his knee buckle. He later covered his head with his towel to hide his tears, and then was carted off the field. Despite this, Bill Belichick left his starters in for most of the game. He oddly took out Tom Brady in the second quarter in favor of Brian Hoyer, but later sent Brady back into the lineup. On the final drive, Brady was once again pulled for Hoyer. I really didn't understand this strategy, considering Randy Moss and the other starters played the entire way. I'm not saying the other starters should have been pulled as well; a victory would have given the Patriots the No. 3 seed, which would have ensured a home game in the AFC Championship if Cincinnati would have made it as well. ",
            "2": "Brady was 17-of-26 for 186 yards and an interception to Bernard Pollard of all people. Without Welker, Brady appeared to struggle at times. He tried to get Julian Edelman involved and was successful (10-103), but it was a noticeable downgrade that will be huge in the playoffs. ",
            "3": "Fred Taylor led the Patriots in rushing despite receiving only seven carries. Taylor was impressive, compiling 33 yards and two touchdowns on such few limited attempts. Randy Moss, meanwhile, caught five balls for 75 yards. Brady took multiple downfield shots to Moss, but they were able to hook up only once (41 yards). ",
            "4": "You have to give a lot of credit to the Texans for actually not choking for a change. Matt Schaub was great, going 24-of-39 for 303 yards, two touchdowns and an interception that came off a deflection. ",
            "5": "Andre Johnson caught six balls for 65 yards. Joel Dreessen paced the team with 81 yards and a touchdown on six receptions as well. Jacoby Jones, who was responsible for Schaub's pick, caught five balls for 65 yards and an acrobatic score. ",
            "6": "Arian Foster rushed for 119 yards and two touchdowns on 20 carries. Foster didn't fumble, so Gary Kubiak didn't have a chance to bench him. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "The Giants are pathetic. Maybe they lost to the Panthers because they were coming off a big Monday night win and weren't expecting a tough game from Carolina. I can buy that. But they showed neither heart nor effort here. It was absolutely disgusting. The game was over at halftime, with the Vikings owning a 31-0 lead. At intermission, the Giants had just four first downs and were outgained at that point, 343-82. Because the Giants put forth no effort in this contest, I'm not even going to talk about them any further. They don't deserve my time. ",
            "2": "Brett Favre completely abused an uninterested Giants defense, going 25-of-31 for 316 yards and four touchdowns. Two of Favre's scores found Sidney Rice, who hauled in six grabs for 112 yards. The others went to Visanthe Shiancoe (7-94) and stud fullback Naufahu Tahi. Percy Harvin caught seven balls for 59 yards. ",
            "3": "Another week, another sub-100-yard performance from Adrian Peterson, but he has an excuse this time; he carried the ball only nine times for 54 yards and a touchdown. With this game out of hand early, the Vikings simply didn't need his services. ",
            "4": "In the wake of this victory and Philadelphia's loss, the Vikings clinched the No. 2 seed. Teams with byes have faltered in the playoffs lately, but this is good for Minnesota; this team is simply not built to play on the road. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "49ers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "Despite what the score says, this was not a blowout. It was a dreadful game with absolutely no offense. The Rams led 3-0 at halftime, and trailed just 7-6 at the beginning of the fourth quarter. There were nine combined first downs in the first half. At intermission, the Rams had 87 yards, and still managed to outgain the 49ers by 35 yards. The 49ers were able to pull away late thanks to a few long pass plays. ",
            "2": "One of those long bombs was an Alex Smith-to-Vernon Davis connection that went for 73 yards. That touchdown was Davis' 13th, which tied him with Antonio Gates for most scores recorded by a tight end in a single season. Davis finished with six grabs for 89 yards. ",
            "3": "Alex Smith was 17-of-28 for 222 yards and that score, as most of his yardage was padded late in the fourth quarter. His top wide receiver was Michael Crabtree, who had three receptions for 58 yards. ",
            "4": "Frank Gore rushed for 107 yards and two touchdowns on 23 attempts. His counterpart, Steven Jackson, mustered just 63 yards on 20 tries. I can't find a reason why a hobbled Jackson should have played. There was really no point in risking his health even further. Not sure what Steve Spagnuolo was thinking here. ",
            "5": "Keith Null played like a perfect Ryan Leaf protege. He didn't throw any interception this time, but was just 7-of-17 for 57 yards. Kyle Boller relieved him late, but was just 4-of-11 for 23 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "3",
            "1": "This was a big win for the Falcons. It meant nothing in terms of any sort of playoff implications, but this victory gave Atlanta its first back-to-back winning seasons in franchise history. ",
            "2": "Save for Tony Gonzalez, who was playing hurt, all of the major Falcons posted solid numbers. Matt Ryan went 23-of-35 for 223 yards, two touchdowns and two interceptions. Jason Snelling rumbled for 147 yards on 25 attempts. Roddy White hauled in six grabs for 66 yards and a score. ",
            "3": "The Buccaneers, meanwhile, weren't nearly as impressive. They mustered just 206 total net yards. The running game wasn't working (Cadillac Williams rushed for 40 yards on 19 carries), and Josh Freeman was once again careless with the football. Freeman was 16-of-32 for 174 yards, one touchdown and two picks, including a bad one in the end zone. Antonio Bryant caught the score, but hauled in just two balls for 15 yards. Kellen Winslow Jr. paced the team with five receptions for 56 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "This was a really frustrating game if you bet the Dolphins to cover the +3. First, Chad Henne played only a half because of an eye injury. Yeah, I don't know what that's all about either. Henne was amazing in the first two quarters, going 16-of-20 for 140 yards, one touchdown and an interception. He was replaced by an ineffective Pat White, who threw only two times. At one point, one of the announcers said, The forward pass is not in Miami's game plan. White eventually left the contest after suffering a nasty collision to the helmet. Tyler Thigpen was more effective, but only by default (4-of-8, 83 yards, 1 TD, 2 INTs). Second, the Steelers kicked a covering field goal at the very end of the game that should have never happened. Pittsburgh was running out the clock when it received a 34-yard gain from Willie Parker that took the ball down to Miami's 8-yard line. Had Parker stayed inbounds, the game would have been over because the Dolphins didn't have any timeouts. Instead, the crooked Parker for some reason angled toward the sideline and consequently stopped the clock. This game Miami a long-shot chance, but instead allowed Pittsburgh to kick a field goal to give it a 6-point advantage. Like I said, really frustrating. ",
            "2": "Ben Roethlisberger was on top of his game, helping the Steelers move the chains all afternoon; they were 7-of-14 on third downs and 403 total net yards of offense. It's worth noting, however, that Roethlisberger suffered an arm injury in the fourth quarter that probably would have impacted him if the Steelers would have reached the playoffs. Big Ben was 18-of-27 for 220 yards and three touchdowns. His scores went to Mike Wallace (2-64), Heath Miller (5-56) and Santonio Holmes (1-5). Hines Ward didn't get into the end zone, but played well despite his hamstring, collecting eight receptions for 61 yards. ",
            "3": "The Steelers rushed for 202 yards in this contest, with Rashard Mendenhall and Willie Parker garnering 94 and 91 yards, respectively. ",
            "4": "The Dolphins, meanwhile, didn't run the ball well at all, which was a bit of a surprise because the Steelers had been struggling against the rush without Troy Polamalu. Ricky Williams went for just 31 yards on 12 carries. Lex Hilliard had just two touches, which was shocking because Miami seemed like it wanted to get him more involved in the offense. ",
            "5": "Though the Steelers won this battle, they were later eliminated when Baltimore beat Oakland. Now, if only they had defeated the Raiders or Browns... "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bears",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "This was a lost season for the Bears, but at least they have something to hang their hat on. They finished the year on a two-game winning streak, beating the Vikings impressively on Monday night and then slaying the Lions on the road off a short work week. The important thing here is that Jay Cutler has played really well two games in a row, going 22-of-36 for 276 yards and four touchdowns this Sunday. That means that in a span of six days, Cutler has passed 42-of-71, 549 yards, eight touchdowns and an interception. That's something for Bears fans to look forward to next year. ",
            "2": "And speaking of the future, two of Cutler's scores went to Devin Aromashodu, who garnered five receptions for 46 yards. Greg Olsen also came up with five catches for 94 yards and a touchdown. Devin Hester, coming off injury, hauled in three balls for 75 yards. ",
            "3": "Matt Forte ripped off a 53-yard gain, helping him reach 101 yards on just 16 carries in this contest. ",
            "4": "The big surprise here was that Daunte Culpepper played relatively well, helping the Lions move the chains all afternoon. Culpepper was 23-of-34 for 262 yards, two scores and a pick. ",
            "5": "Calvin Johnson caught one of those touchdowns, notching six balls for 86 yards. Maurice Morris totaled 65 yards on 16 attempts. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "I thought there might be a chance that the Eagles would struggle offensively with the absence of Jamaal Jackson, but I didn't expect this. A shutout against the league's fourth-ranked offense? Wow. Donovan McNabb was pressured throughout the evening, taking four sacks and fumbling twice, one of which was the result of a botched Nick Cole snap. When McNabb actually had time, he was able to hit most his targets (though he did miss some routine throws). He went 20-of-36 for 223 yards. ",
            "2": "Andy Reid did a poor job with his offensive balance. While McNabb threw 36 times, Philly running backs carried the ball on just seven occasions. That's really embarrassing. Brian Westbrook led the backs with five carries for 17 yards. ",
            "3": "Brent Celek paced the Eagles with seven catches for 96 yards. DeSean Jackson, who struggled against the Cowboys in their first matchup, caught just three balls for 47 yards. McNabb had Jackson open deep on one play, but overthrew him by five yards. ",
            "4": "Tony Romo did an incredible job moving the chains, keeping drives alive and putting enough points on the board. He went 24-of-34 for 311 yards, two touchdowns and an interception. Romo helped the Cowboys win the time-of-possession battle by nearly 21 minutes and limit the Eagles to just 10 first downs! ",
            "5": "While the Eagles refused to run the ball, Dallas took advantage of its strong rushing attack. Both Marion Barber and Felix Jones gained 91 yards on 14 and 15 carries, respectively. ",
            "6": "Miles Austin-Jones caught seven balls for 90 yards. Patrick Crayton (4-99) and Jason Witten (6-76) each snagged touchdowns. Roy Williams couldn't even collect a single reception, however. He was targeted once. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "For all of you prospective coaches out there, take note: Benching your best players before a big game - not such a good idea. Josh McDaniels' micro-mismanagement began this offseason, when he discarded a talented quarterback in favor of one who can't get the ball 10 yards downfield. After that, he screwed up the draft and fought with his stud receiver. Things were rosy after the Broncos lucked into a win at Cincinnati and rode that momentum against weak/distracted opponents, but everything ultimately course-corrected. Denver finished 2-8 after a hot 6-0 start. What I'm trying to say is that this wasn't an upset by any means; I had the Chiefs winning this game because the Broncos stink. They've always been bad; they just had a crazy amount of luck at the beginning of the year, which inflated their record and raised expectations. It was only a matter of time before they would crash back down to Earth. They have a lot of work to do this offseason, but I have no confidence that Mr. Mishandles will make the right moves. ",
            "2": "Kyle Orton shockingly threw for 431 yards and a touchdown, but most of that was short junk. He also launched three picks, including two pick-sixes to Derrick Johnson. Orton was bad despite not having any pressure in face, but to be fair, he didn't have Brandon Marshall, Eddie Royal and Tony Scheffler at his disposal. Jabar Gaffney played the role of Marshall, catching 14 balls for 213 yards. ",
            "3": "Knowshon Moreno had a great performance to close out the season, rushing for 50 yards and two touchdowns on just 14 carries. He also caught three balls for 48 more yards. Correll Buckhalter (6-18) didn't contribute much. ",
            "4": "But compared to Jamaal Charles, both Moreno nor Buckhalter were non-factors. Charles carried the ball 25 times for 259 yards and two scores. I've talked about this before; Charles has to be in the mix as a first-round fantasy running back next summer. He's incredibly talented, and it's a disgrace that Todd Haley waited until Larry Johnson berated motorcycle riders to utilize him. ",
            "5": "Save for one horrific interception, Matt Cassel was a solid 13-of-24 for 207 yards. Dwayne Bowe caught only one ball for six yards, so it was a good thing for the Chiefs that Chris Chambers (5-80) picked up the slack. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "It came a week late, but the Ravens knocked the Steelers out of the playoffs. This victory eliminated any chance Pittsburgh had of qualifying for the postseason, which is pretty ironic considering last week's shady officiating between the two teams. ",
            "2": "Unlike other squads that have fallen into a trap of throwing the ball too much against the Raiders (cough, Eagles, sneeze), Baltimore did a great job of pounding the rock in this contest. Ray Rice rushed for 70 yards on 14 carries, but Willis McGahee was the story; he compiled 167 yards on 16 attempts, including a 77-yard burst that featured a brutal stiff arm on Hiram Eugene. ",
            "3": "Joe Flacco was just 11-of-19 for 102 yards. It's not that John Harbaugh and Cam Cameron didn't trust him; the running game was just that effective. Flacco's leading receivers were Todd Heap (2-40) and Derrick Mason (1-23). ",
            "4": "Charlie Frye started this game for the Raiders and actually played well, going 18-of-25 for 180 yards and a touchdown. However, Frye left the contest with an injury and was replaced by JaMarcus Russell in the third quarter. Russell made some nice throws, including a sharp dart to Chaz Schilens, which converted a 3rd-and-15. However, Russell also committed his trademark errors. He took two sacks, threw an ugly interception and fumbled once. ",
            "5": "Speaking of Schilens (8-99), he and Louis Murphy (6-59) are two guys you'll want to look for in your fantasy leagues next year if the Raiders acquire a legitimate quarterback. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Titans",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "I'd tell you that the Titans won and everything, but I don't even think they care. All Tennessee seemed interested in was getting Chris Johnson up to 2,000 rushing yards on the year. With 134 yards and two touchdowns off a career-high 36 carries, Johnson finished with 2,006. Ed Hochuli is really lucky that Johnson didn't conclude the game with 2,043 yards; Johnson scored on a 62-yard run in the second half, but the scamper was called back because of a very questionable holding penalty. I like Hochuli as an official, but many people, including myself, would have been pissed off that history would have been erased because of a ticky-tack call. ",
            "2": "Since everything else was insignificant here - at least that's what the Titans told us - let's zip right through it... Vince Young was 17-of-28 for 171 yards and an interception. Nate Washington led Tennessee with six grabs for 83 yards, while Kenny Britt garnered only one reception for 14 yards. ",
            "3": "Matt Hasselbeck had another pedestrian game, going 15-of-30 for 175 yards, one touchdown and a pick. Deion Branch paced the Seahawks with four grabs for 77 yards, while T.J. Houshmandzadeh came up with yet another clunker (3-66). ",
            "4": "And this will definitely shock you: Justin Forsett carried the ball less (10) than Julius Jones (14), yet Forsett outgained Jones, 74-61. I mean, how surprising is that? It's almost as if Forsett might be the better player or something. But that can't be true, right? "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "I'm really disappointed in the Chargers. On paper they've won their 11th in a row, but that's not really true. Philip Rivers and the starters played just two drives in this contest. Sure, Rivers commanded the team to 10 points in those possessions, but they pretty much took the gas off the pedal after that. With a bye, they're going to be completely flat in two weeks. They clearly haven't learned from all of the mistakes their rival Colts have made over the years. ",
            "2": "In the two drives, Rivers was 9-of-15 for 99 yards and a touchdown. He was replaced by Billy Volek, who was a mediocre 19-of-30 for 216 yards, one score and an interception. With Vincent Jackson sitting out, Malcom Floyd led the Chargers with nine receptions for 140 yards. ",
            "3": "Give the Redskins credit for playing hard here, though it doesn't really matter because Jim Zorn and his staff will be fired on Monday. Hopefully the Bingo announcer can stick around because he was cool. ",
            "4": "Jason Campbell went 28-of-42 for 281 yards and two touchdowns. His favorite targets were Fred Davis (6-46) and Santana Moss (6-46). Malcolm Kelly paced the Redskins with 109 yards on five receptions, but most of that came on an 84-yard gain. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Packers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "This game is pretty simple to analyze. The Packers wanted to win it, and they played all of their starters throughout. The Cardinals, meanwhile, didn't care at all and stat some starters. ",
            "2": "Going against an uninterested and vanilla Arizona defense, Aaron Rodgers was 21-of-26 for 235 yards and a touchdown to Jermichael Finley (4-34). Donald Driver led the Packers in receptions (6) and yards (65). Greg Jennings, meanwhile, mustered just three receptions for 29 yards. ",
            "3": "The only Green Bay player who didn't get extensive action was Ryan Grant, who had 11 carries for 51 yards and a score. Ahman Green took over in relief, rushing for 42 yards on 12 attempts. ",
            "4": "Kurt Warner played just two drives, going 4-of-6 for 31 yards. Matt Leinart was under center for most of the content, but pretty much humiliated himself on 13-of-21 passing for just 96 yards and two interceptions. He tossed a third pick, but that was nullified by a holding penalty in the end zone that resulted in a safety. Leinart was eventually taken out in favor of Brian St. Pierre (2-4, 12 yds, TD, INT). ",
            "5": "The big news for the Cardinals is that two of their players suffered injuries. Dominique Rodgers-Cromartie is expected to be fine, but Anquan Boldin suffered ankle and knee injuries, and his status going forward is unknown. For the Packers, Charles Woodson injured his ailing shoulder, but is expected to be ready for next week's playoff game. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Jets",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "I don't know what the Giants, Jaguars and Bengals coaching staffs used as pre-game motivation for their teams, but whatever it was needs to stop. Like the Giants and Jaguars, Cincinnati showed up completely flat. The Bengals had just 72 total net yards and only five first downs. They put forth no effort, and there was absolutely no sign of desperation. They whiffed on tackles on defense and dropped countless balls on offense. They didn't even break a sweat, and they didn't seem to care as the Jets were pushing them around on both sides of the line of scrimmage. ",
            "2": "New York ran the ball extremely well; Brad Smith (4-92, TD), Thomas Jones (27-78, 2 TDs) and Shonn Greene (13-62) were all huge factors, gashing the Bengals with ease through wide-open holes. ",
            "3": "With the ground attack working so well, Mark Sanchez didn't have to air it out often; he was 8-of-16 for 63 yards, but made some clutch throws to move the chains. He nearly connected on a deep bomb to Braylon Edwards, but Edwards (2-15) mistimed the jump. ",
            "4": "Meanwhile, Sanchez's counterpart was the one left looking like a mere rookie. Carson Palmer was a laughable 1-of-11 for zero yards and one interception. Don't blame Palmer though; as mentioned, he was victimized by what seemed like half-a-dozen drops. ",
            "5": "A guy responsible for a lot of those drops was Chad Ochocinco, who didn't even haul in a single reception. Ochocinco vowed that he would change his name back to Chad Johnson if Darrelle Revis shut him down in this contest, so we'll see if <strike>Ochocinco</strike> Johnson keeps his word. "
        }
    }
}