{
    "year": "2009",
    "week": "07",
    "Game 1": {
        "Team 1": {
            "Name": "Texans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Texans were dominating this game. At halftime, they led 21-0 and were out-gaining the 49ers, 185-50. They had 11 first downs to San Francisco's three. When Shaun Hill was benched in favor of Alex Smith in the third quarter, everyone on the forum, including myself, thought it was over. We were all wrong, but can you blame us? Smith has been an epic failure his whole career, but he was amazing in the second half, leading the 49ers to three touchdown drives and coming several yards short on the final possession of a potential game-tying field goal. In just one half of play, Smith was 15-of-22 for 206 yards, three touchdowns and a desperation pick at the end of the game. It's hard to believe he can keep this up, and in the future, he'll need to avoid fumbling a lot (he has tiny hands), but if Smith can continue playing like this, the 49ers will be a Super Bowl contender. ",
            "2": "All three of Smith's touchdowns went to Vernon Davis, who caught seven balls for 93 yards. However, aside from Smith, the big story for the 49ers was Michael Crabtree. The rookie holdout had five receptions for 56 yards, several of which were pretty impressive grabs. Crabtree also had an 25-yard snag wiped out by an illegal motion penalty. ",
            "3": "Give Houston's run defense credit for putting the clamps on Frank Gore. Gore rushed for only 32 yards on 13 attempts. ",
            "4": "As for the winning squad, Matt Schaub was once again as sharp as a whistle, going 20-of-30 for 264 yards and two touchdowns. ",
            "5": "Schaub went to Owen Daniels the most, as the potential All-Pro tight end caught seven balls for 123 yards and a score. Andre Johnson had only two grabs, but managed 62 yards. Johnson left the game for a bit with a chest contusion. He's not expected to miss any time. ",
            "6": "Steve Slaton rushed for 67 yards on 18 carries. He also caught four balls for 22 yards and scored twice. The headline here is that Slaton got a goal-line carry in the first half and was successful in diving into the end zone. If Gary Kubiak had just stuck with Slaton in those situations all year, the Texans could be 6-1 right now. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "This game was never close, so let's get to the big story here. Because of their red-zone ineptness, the Chargers desperately tried to get LaDainian Tomlinson into the end zone from the goal line. Tomlinson had eight goal-line carries in this game, yet failed on every single official attempt. He was successful once, but the score was wiped out by an illegal substitution. ",
            "2": "Tomlinson rushed for 71 yards on 23 carries, most of which came on a 36-yard scamper. Tomlinson's YPC isn't impressive, but remember that eight of his rushes came at the goal line. San Diego's offensive line simply couldn't open anything up for him. ",
            "3": "Luckily, the Chargers had a hot Philip Rivers to torch Kansas City's anemic secondary. Rivers was 18-of-30 for 268 yards and three touchdowns. ",
            "4": "Vincent Jackson caught five balls for 142 yards and a touchdown. The amazing thing here is that Jackson had those numbers at halftime. The Chargers simply didn't need to throw in the second half. Jackson had two 51-yard receptions in this contest. ",
            "5": "As for Rivers' other targets, Antonio Gates caught five balls for 55 yards. Chris Chambers didn't log a single reception even though he had four targets. It's unclear why Chambers is still playing. ",
            "6": "Speaking of major suckage, Matt Cassel was just 10-of-25 for 97 yards, one touchdown and three picks. He was sacked four times by a defense that had been struggling to get pressure going into this game. ",
            "7": "Dwayne Bowe managed only two receptions for 11 yards and a touchdown. Cassel is simply too inept to get Bowe the ball consistently. ",
            "8": "Larry Johnson flopped around for 49 yards on 16 carries. Jamaal Charles had just four rushes, but managed 33 yards. I say this every week, but there is no reason that the archaic Johnson should be getting more touches than Charles. ",
            "9": "Norv Turner had one of the dumbest challenges ever in this game. In the first quarter, Gates dropped a touchdown that bobbled out of his hands. The thought of challenging didn't even enter my mind. When Norv threw the red flag, CBS announcer Dick Enberg laughed and said, I don't think this has a chance. When a nice guy like Enberg makes fun of you, you know you've epically failed. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Colts",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "I said that the Rams would have a chance to win this game if Peyton Manning got hurt. That didn't happen, which would explain the final score. ",
            "2": "Peyton Manning went 23-of-34 for 235 yards and three touchdowns. Manning played brilliantly, but this marked the first time that he hadn't thrown for 300 yards in a game all season. Blame the Rams for not keeping up and failing to force him to keep throwing. ",
            "3": "Reggie Wayne caught seven balls for 83 yards and a score. Those were impressive numbers because he strained his groin in the first half and missed some time. ",
            "4": "Manning's other targets: Dallas Clark (3 catches, 44 yards, TD), Austin Collie (4 catches, 36 yards, TD), Pierre Garcon (3 catches, 24 yards). ",
            "5": "Joseph Addai got all of the touches in this contest because Donald Brown suffered a shoulder strain and was knocked out of the game. Addai had 64 yards and a touchdown on 20 carries, while Brown totaled 58 yards on only two tries (gains of 45 and 13). It's a shame that Brown didn't get a chance to gash St. Louis' sorry defense. ",
            "6": "Mistakes killed the Rams here. Marc Bulger (14-of-26, 140 yards) tossed two interceptions, one of which was returned for a touchdown. Of course, Bulger didn't get much help from his receivers. Donnie Avery (2 catches, 58 yards) snagged a beautiful 50-yard reception off a flea flicker. However, St. Louis' wideouts were guilty of three drops in the first quarter alone. And aside from that catch, the Rams had just 76 yards in the first half. ",
            "7": "Steven Jackson, once again, was the only Rams offensive player worth mentioning. He rushed for 134 yards on 23 attempts. It's really a shame that his talent is going to waste like this. I've said it a few times and I'll say it again: If I'm the Rams, I sit Jackson for the rest of the year so he's healthy and fresh next season when the team will be more competitive. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "Even though this was a crap matchup - seriously, NFL, did you honestly think the Buccaneers would be competitive this year? - you have to give the Brits credit for filling the seats. According to Jim Nantz, this game sold out in six minutes. Cor blimey to the people who think this London thing doesn't work. ",
            "2": "Though Tom Brady tossed two interceptions, he had his way with Tampa Bay's secondary otherwise. He was 23-of-32 for 308 yards. ",
            "3": "As you can imagine, New England's leader in receptions was Wes Welker, who caught 10 balls for 107 yards and a score. Brady's other touchdowns went to Sam Aiken (shame on you if you didn't start him in fantasy) and Ben Watson. As for Randy Moss, he had five grabs for 69 yards. ",
            "4": "Laurence Maroney scored a touchdown in the fourth quarter, but was otherwise disappointing. Maroney gained 43 yards on 13 carries, as the Patriots mysteriously failed to open up running lanes for him. ",
            "5": "What killed the Buccaneers once again was Josh Johnson's decision-making. He compiled some junk yardage late, but at halftime was just 6-of-16 for 95 yards, a touchdown and three picks (one on a Hail Mary). Expect Josh Freeman to be the starter once the Buccaneers come off their bye in Week 9. ",
            "6": "Cadillac Williams ripped off a 9-yard gain on his second carry of the game, but finished with just 29 yards on 11 attempts. Derrick Ward led all Buccaneer backs with 48 yards on 13 rushes. ",
            "7": "Antonio Bryant caught Johnson's touchdown, but managed only one other reception. His two grabs went for 51 yards. Rookie Sammie Stroughter led the Buccaneers with three catches for 63 yards. ",
            "8": "This year, Raheem Morris' decision-making has really come into question. He hasn't been giving his high-priced free agent any carries, and he foolishly elected to go with Byron Sandwich over Luke McCown. Down 21-0 in this contest. Morris opted to punt it on 4th-and-1 at midfield. He got just a 25-yard punt out of it. At that point, it was evident that the Buccaneers didn't have a shot at making this game remotely close. Morris had no faith in his team, and the team responded appropriately. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "The Vikings were going to lose eventually, and if you would have asked people who would be responsible for that defeat, most would probably predict that Brett Favre would have imploded. Favre had the Vikings in position to kick a game-tying field goal, but tossed a pick-six that gave Pittsburgh a miraculous cover. However, it was Chester Taylor's fault, as the ball bounced out of his hands and into Keyaron Fox's. ",
            "2": "Despite tons of pressure in his face the entire afternoon, Brett Favre played very well after a rough start early on. He went 34-of-51 for 334 yards and the aforementioned pick that wasn't his fault. It should be noted that he also had a fumble returned for a score. ",
            "3": "Favre's target of choice continues to be Sidney Rice. He dominated with 11 receptions for 136 yards. ",
            "4": "Bernard Berrian, meanwhile, managed two catches for 18 yards. He left in the second quarter with a hamstring injury. He might be out for a while, as soft-tissue injuries tend to linger. ",
            "5": "Percy Harvin, who grabbed three balls for 42 yards, returned a kickoff for a touchdown in this contest. ",
            "6": "Though Adrian Peterson had just 69 yards, he had a great game. He compiled that yardage on 18 attempts, and he also caught four balls for 60 yards, showing that he could be an effective weapon out of the backfield. Peterson scored in the second quarter. ",
            "7": "Ben Roethlisberger won the game, but he was just 14-of-26 for 175 yards and a touchdown. Roethlisberger nearly threw a couple of picks, so he's pretty fortunate. ",
            "8": "One Steeler who did screw up was Rashard Mendenhall, who fumbled inside Minnesota's 5-yard line. The play was really weird; Mendenhall leaped over the 5-yard line and dived onto the 3. It's almost as if he thought the 5-yard line was the goal line. ",
            "9": "Even with Mendenhall doing stupid things, Willie Parker had only one carry for two yards. Mewelde Moore got the work late in the game, but that was by design. ",
            "10": "Hines Ward did nothing in this contest, catching just one ball for three yards. Santonio Holmes grabbed two passes for 59 yards. Oddly enough, Pittsburgh's leading receiver wasn't either of those two guys, nor was it Heath Miller (6 catches, 38 yards). It was Mike Wallace, who snagged three receptions for 72 yards and a score. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Bills",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "CBS color commentator Steve Tasker said something when the score was 17-2 that pretty much epitomized the Panthers' 2009 season: The Panthers have come back from a 17-2 deficit before, so this is familiar territory for them. Yes, Carolina was down 17-2 to the Bills. And unlike the Redskins game two weeks ago, they didn't have a completely inept coach-quarterback combination to bail them out. Ryan Fitzpatrick and Dick Jauron are only somewhat inept. ",
            "2": "Fitzpatrick was 11-of-22 for 123 yards and a touchdown. He was pretty mediocre throughout the afternoon, but had two brilliant throws. Fitzpatrick launched a deep 50-yard strike to Lee Evans, while his sole score was a dart thrown to Evans in the end zone. When it happened, I had no idea how Fitzpatrick fit the ball into Evans' body. ",
            "3": "Evans finished with five catches for 75 yards and a touchdown. Terrell Owens, meanwhile, once again struggled with just three grabs for 27 yards. He dropped two passes. ",
            "4": "Marshawn Lynch rushed for 40 yards and a score, which was disappointing considering that Carolina has one of the worst run defenses in the league. Fred Jackson did nothing (5 carries, 2 yards). ",
            "5": "It's really amazing that the Panthers lost this game because Buffalo finished with 167 total net yards and only nine first downs. As you might imagine, the man responsible was Jake Delhomme, who tossed three careless interceptions. It's really getting embarrassing, and it's time for John Fox to make the move to A.J. Feeley. ",
            "6": "DeAngelo Williams took advantage of Buffalo's poor rush defense, gaining 89 yards and a touchdown on 16 carries. Williams also came up with five receptions for 50 more yards. Jonathan Stewart wasn't very active (7 carries, 25 yards). ",
            "7": "Steve Smith actually contributed to the offense statistically this week, compiling six catches for 99 yards. Maybe Smith won't tell the media that he's worthless now. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "How in the world did the Raiders win two games this year? I watched both of their victories, but after seeing games like this, it makes me wonder how Oakland isn't 0-7 right now. ",
            "2": "Let's get this straight: The Jets didn't win this game. JaMarcus Russell lost it. It was all him. On the first drive of the game, he fumbled the ball to set up the Jets for a short touchdown. Two possessions later, Russell tossed a softly thrown pick to a Jets defender which set up New York with another quick touchdown. How quick were these scores? The Jets' two touchdown drives were for a combined eight yards. Once it was 14-0, New York was able to just run the ball out. Russell was mercifully benched in the middle of the second quarter. He finished 6-of-11 for 61 yards, two picks and a fumble. He nearly had another interception when he threw the ball across his body over the middle of the field. Bruce Gradkowski obviously wasn't effective (10-of-19 for 97 pass yards, 25 rush yards), but unlike Russell, he didn't make a crucial mistake on every other drive. It's really sad when Gradkowski is an upgrade for you. ",
            "3": "Darrius Heyward-Bey should be given a trophy because he caught two passes for 28 yards - both of which are career-highs for the No. 7 overall pick from the 2009 NFL Draft. Hall of Fame, here we come. ",
            "4": "Justin Fargas had a decent fantasy outing, rushing for 67 yards on only eight carries and catching three balls for 23 more yards. ",
            "5": "But speaking of great fantasy outings, check out what Thomas Jones and rookie Shonn Greene accomplished: Jones compiled 121 yards and a score on 26 carries, while Greene managed 144 yards and two touchdowns on 19 attempts. One may think that Greene got a bunch of touches late when the game was out of hand, but nine of his 19 rushes came in the second quarter. Leon Washington suffered a broken fibula and was carted off the field. It looks like he'll be out 10 weeks at the very least. ",
            "6": "With two quick scores, Mark Sanchez didn't need to throw much. He went 9-of-15 for 143 yards and two touchdowns (one passing; one rushing). ",
            "7": "Braylon Edwards couldn't get away from Nnamdi Asomugha, so combined with Sanchez's limited pass attempts, it's no surprise that Edwards notched only one reception for 14 yards. David Clowney led the Jets with four grabs for 79 yards and a touchdown. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "And here I thought that this game would be a nail-biter that would go down to the wire. Oops. The Bengals actually led 45-3 before a late touchdown. They beat the Bears in first downs, 30-15, and won the turnover battle, 4-0. ",
            "2": "Jay Cutler was responsible three of the give-aways, tossing three picks to go along with his 26-of-37 passing for 251 yards and a touchdown. Going into this game, all but one of Cutler's interceptions came on national TV. I defended him by stating that he simply forced the issue in the spotlight. Well, I can't say that anymore. ",
            "3": "The only positive fantasy performance for the Bears came via Devin Hester, who caught that late aforementioned score. Hester finished with eight grabs for 101 yards. ",
            "4": "None of Cutler's other targets did much. Here are the numbers: Earl Bennett (4 catches, 48 yards), Johnny Knox (4-42) and Greg Olsen (4-24). ",
            "5": "Matt Forte once again didn't have an opportunity to do anything. Because the Bears were down early, Forte rushed just six times for 24 yards. He also had four catches for 25 more yards. ",
            "6": "Carson Palmer was just four incompletions short of being perfect in this contest. Palmer was 20-of-24 for 233 yards and a whopping five touchdowns. This was only the second time this season that Palmer did not throw a pick. ",
            "7": "Two of Palmer's scores went to Chad Ochocinco, who compiled 10 catches for 118 yards. He also gave a ball to a cheerleader. She did not do a silly dance with it. ",
            "8": "The story going into this game was the Cedric Benson plot line. Benson, once a Chicago No. 1 pick, was dumped by the Bears after the 2007 season. Benson told the media that he believed that the Bears tried to blackball him. He had the last laugh, rushing for 189 yards and a touchdown. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Falcons opened this game with a very impressive 16-play, 8:34 drive that culminated with a 4-yard Roddy White touchdown. Atlanta just ripped through Dallas' defense and it looked like the team would dominate this game. Oddly enough, the Falcons mustered just 208 yards the rest of the contest. Michael Turner struggled to find any running room, gaining just 50 yards and a touchdown on 18 carries. Even more troubling, Atlanta's offensive line struggled to pass protect. Coming into this contest, the front five surrendered only two sacks all year. On Sunday, the Falcons surrendered four sacks; two to DeMarcus Ware. ",
            "2": "With lots of pressure in his face, Matt Ryan put together a pretty mediocre performance, going just 19-of-35 for 198 yards, two touchdowns, two picks and two fumbles. ",
            "3": "Ryan went to Roddy White six times. White managed 50 yards and a touchdown. Tony Gonzalez, meanwhile, registered four receptions for 37 yards. ",
            "4": "Can anyone stop Miles Austin-Jones? One contest after breaking Dallas' single-game record for receiving yards, Austin-Jones caught six balls for 171 yards and two scores. With Austin-Jones providing Tony Romo with the legitimate No. 1 receiver that he needs, Romo was 21-of-29 for 311 yards and three touchdowns. ",
            "5": "Roy Williams started across from Austin-Jones, yet all he managed was a mere 16-yard reception. He predictably dropped multiple passes. Patrick Crayton, who lost his job to Austin-Jones, scored twice (one on a punt return). Jason Witten had five grabs for 53 yards. ",
            "6": "Wade Phillips is very fortunate that he won this game because he can't be criticized for not using Tashard Choice, his only healthy running back. Marion Barber, playing with a strained quad, rushed for just 47 yards on 14 carries against Atlanta's poor run defense. Felix Jones had 37 yards on eight attempts. Choice didn't log a single carry, though he caught one ball for 23 yards. Mr. Turkey Neck clearly has no grasp of his offense. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Saints",
            "Points": "46"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "34"
        },
        "comments": {
            "amount": "8",
            "1": "This is the worst beat I've had. And it's not even close. I'm going to rant here. Taking 6.5 points with the Dolphins, they looked like the right side when Drew Brees was sacked five times and intercepted three times. Miami held a 24-3 lead and was dominating the game. My dad even called me at that point to ask me how I knew Brees would struggle like this (he doesn't use a computer). I proudly explained my reasons. The Saints scored at the end of the half to make it 24-10. The stupid thing about this touchdown was that the Saints were at the 1-yard line, but had only five seconds on a ticking clock to make a decision whether to go for it or kick a field goal. Sean Payton sent John Carney on the field, but Tony Sparano foolishly called a timeout. Sure enough, Brees convinced Payton to go for it during the stoppage, and Brees managed to sneak it in to make the game 24-10. A dumb mistake, but not a big deal with getting 6.5 points. At least that's what I thought at the time. On the opening drive of the third quarter, Chad Henne threw an ugly interception to Darren Sharper. Sharper returned it 42 yards and was signaled in for a touchdown by official John Parry. However, Sharper CLEARLY fumbled before he reached the end zone. It wasn't even close. It should have been overturned into a touchback. Instead, Parry, who obviously had money on the Saints, called it a touchdown. A Dolphins field goal (off a Brees fumble) and a Saints touchdown later, the score was 27-24. However, I was relieved to see Henne complete a 67-yard strike to Brian Hartline, setting up Ricky Williams for a 4-yard touchdown. With Miami up 34-24 and taking 6.5, I thought my bet was safe. Nope. In a span of five minutes, Brees led the Saints on two touchdown drives. Fortunately, John Carney missed an extra point, so a later field goal made it a 6-point game. With 3:23 remaining, my +6.5 5-unit play was still safe. Down six, Henne drove the Dolphins to their 41. After a penalty and two incomplete passes (one via a Ricky Williams drop), Henne tossed a desperation heave, allowing Tracy Porter to intercept it and returned the ball 54 yards for a pick-six. You've gotta be kidding me. Not only did the Dolphins blow a 24-3 lead, they also allowed a pick-six to lose the cover. But it gets worse... Miami somehow put together a drive to get down to the Saints 26. Henne lofted a beautiful pass to Ted Ginn Jr. in the end zone, but Ginn dropped it (more on this later). On the next play, Henne connected with Hartline for an 18-yard pass down to the Saints 8-yard line. With time ticking down, Henne spiked the ball with one second on the clock. The Dolphins seemed to have one more play, but Parry, who wanted to ensure that New Orleans would cover, suddenly stopped Miami when the team walked up to the line of scrimmage and announced that one of the Dolphins wideouts was not lined up properly on the previous spike, meaning the game was over. Congrats, Parry, you crook. I hope you won a ton of money. ",
            "2": "With a game like this, a lot of people deserve a ton of blame. Here's my top five: 5. Chad Henne - Thanks for the two pick-sixes. Henne is low on this list because he played well early, but he sure took his jolly good time in the final few minutes when Miami was trying to get a backdoor score. 4. Tony Sparano - If you're a coach on any level reading this, take note: DO NOT CALL A TIMEOUT WHEN THE CLOCK IS TICKING AT THE END OF A HALF ON THE 1-YARD LINE WHEN THE OTHER TEAM HAS ITS FIELD GOAL TEAM OUT THERE. As soon as Sparano called his timeout, I yelled, F*** you at the TV because I knew what was coming. 3. God - Players thank God for a win. I'm blaming God for this loss and blown cover. It was that bad. Actually, now that I think about it, I probably shouldn't blame God. So... 3. Gibril Wilson - This guy needs to attend a Pee Wee Football practice so he can learn how to tackle. Seriously, Wilson tackles like a little girl. 2. John Parry - Over-Under on how much Parry won with the Saints covering: $100,000. I got the Over. 1. Ted Ginn Jr. - If I were Bill Parcells, I'd cut Ted Ginn Jr. immediately. Ginn had three crucial drops in the fourth quarter: one when the Dolphins were up; one when they were down six; and one in the end zone when Miami was down 12. Ginn, who finished with two receptions for 16 yards, has now cost the Dolphins two big upsets with his hands of fail. He's hurting the team more than he is helping it. He needs to be cut. Now. ",
            "3": "Rounding things up, Henne was 18-of-36 for 211 yards and the two pick-sixes. ",
            "4": "Ricky Williams rushed for 80 yards and three touchdowns on nine carries, thanks to a 68-yard gain. Ronnie Brown mustered 48 yards and a score on 16 attempts. ",
            "5": "Greg Camarillo led the Dolphins with six grabs for 73 yards. ",
            "6": "Brees finished with three picks and two fumbles, but he was really sharp in the fourth quarter, finishing the game 22-of-38, 298 yards and a touchdown. ",
            "7": "Brees' score went to Marques Colston (5 catches, 72 yards, TD). Jeremy Shockey compiled four receptions for 105 yards. Lance Moore, meanwhile, disappointed with two catches for 18 yards. ",
            "8": "A major concern for all Pierre Thomas owners: Mike Bell had more carries (12) than Thomas (8). Bell also out-gained Thomas, 80-30. Most importantly, Bell was in the backfield late in the game when the Saints were making their cover-crushing comeback. "
        }
    },
    "numberOfGames": "10"
}