{
 "week":"18",
 "year":"2017",
 "numberOfGames":"4",
 "games":[
  {
   "Team 1":{
    "Name":"Titans",
    "Points":"22"
   },
   "Team 2":{
    "Name":"Chiefs",
    "Points":"21"
   },
   "comments":" The Chiefs were huge favorites in this game, but once again lost at home in the playoffs. This season, which once had so much promise for Kansas City, began and ended with a major injury. It started when Eric Berry went down in the season opener at New England, and it concluded with Travis Kelce's concussion in the second quarter. The Chiefs couldn't stop Tennessee because of Berry's absence, and they failed to score a single point in the second half, as they clearly missed Kelce. There will be those who say that excuses shouldn't be made for injuries, but Kelce was clearly missed, and this was evident on a third-down play in the second half. Alex Smith threw a pass to backup tight end Orson Charles on a crucial play, but Charles dropped the ball. The score was 21-16 at the time, and had Kelce been Charles, the pass almost certainly would've been complete, and Kansas City would've had a first down near midfield. Instead, the Chiefs had to punt the ball away, and the Titans scored the decisive touchdown on the very next drive. Meanwhile, the defense was atrocious. Kansas City allowed the Titans to mount the second-greatest comeback for a road team in playoff history, prevailing despite being down 21-3 at halftime. Marcus Mariota was terrific in the second half - 12-of-18, 123 yards, two touchdowns following intermission - but Derrick Henry was the big difference-maker down the stretch. Henry had just 42 yards at halftime, but ran with more power as the game progressed. Henry finished with 156 yards and a touchdown on 23 attempts. Kansas City's dead-last run defense (per DVOA) had no answer for Henry, who had ripped off 9-yard runs on numerous attempts in the second half. He appeared to completely blow it with what looked like a fumble return for a touchdown when the Titans were running out the clock, but replay review showed that he was down. Henry made up for it with a 22-yard burst to officially seal the victory, and that run was made possible with a fierce block by Mariota.    Like Henry, Mariota got better as the evening progressed. Mariota was dreadful to start. He made a horrible initial third-down pass that was behind Corey Davis. He then threw an interception on a telegraphed throw into a crowd of receivers. Mariota nearly was responsible for another turnover when he lost a fumble near the red zone. It was ruled that forward progress was stopped. This was one of the worst calls I've ever seen, and the officials in this game should be reprimanded for a horrible game overall. Mariota clearly fumbled, and the Chiefs may have won if it wasn't for that play. Then again, there was a clear Kansas City fumble on the Kelce concussion, yet there was no replay review for some reason. In the second half, the refs missed a spot by three yards. Someone needs to be fired for this utter embarrassment. Bad officiating isn't even acceptable in horrible Browns-Bengals games, and there shouldn't be any blatant errors in the playoffs. At any rate, Mariota, as mentioned, was prolific in the second half. He made one horrible throw - he missed on a wide-open Corey Davis for a touchdown - but made up for it by hitting Decker for the game-winning score on the very next play. Mariota finished 19-of-31 for 205 yards, two touchdowns and the aforementioned pick. One of his touchdowns was to himself. He threw a pass and had the ball tipped. It bounced right back to him, and Mariota dived into the end zone. He also scrambled eight times for 46 rushing yards.    Decker, as mentioned, caught Mariota's other score. Decker (2-21) needed that to bounce back from a brutal third-down drop past midfield in the second quarter. Mariota's top receiving threat, meanwhile, was Delanie Walker, who caught six of his eight targets for 74 yards. Davis (4-35) should've had a touchdown.    Going back to the Chiefs, it's likely that this is the final game for Alex Smith in Kansas City. This loss was definitely not Smith's fault, as he played well for most of the game, but it seems clear that the combination of Andy Reid and Smith won't make a deep trip to the playoffs, and it's unlikely that Reid will be the one to go. Smith misfired on just nine occasions, going 24-of-33 for 264 yards and two touchdowns. Four of his incompletions were dropped. Smith isn't a very talented quarterback, and he needs elite skill players around him to succeed. Thus, it's not a surprise that Smith couldn't score at all in the second half without Kelce. Following intermission, Smith was just 5-of-10 for 33 yards. Smith is owed approximately $17 million in 2018, and Kansas City has a very promising quarterback in Patrick Mahomes in waiting. Smith could be traded this offseason, perhaps the Browns.    Three of Smith's drops came from Tyreek Hill. It was a very mixed game from Hill, whose drops really hurt the Chiefs. One drop should've been a deep completion on the opening play of the game. However, Hill reeled in a 45-yard reception on a third down, thanks to a missed tackle by John Cyprien. Hill led the Chiefs with seven catches for 87 yards. Kelce, meanwhile, was second in the box score despite missing more than a half of action. He finished with four catches for 66 yards and a touchdown. His injury was the key factor in this latest Kansas City disappointment.    The Chiefs led for most of this game, yet somehow, Kareem Hunt was given just 11 carries. This is par for the course for Reid, whose offenses tend to forget the running attack in key games. Hunt's 11 attempts went for 42 yards and a touchdown. He caught three passes, but for only five receiving yards.    Kansas City needs to fix its defense this offseason. The cornerback position, outside of Marcus Peters, has been a disaster. I have the Chiefs selecting a corner in my 2018 NFL Mock Draft.   ",
   "players":[
    {
     "player_id":"23085",
     "name":"Delanie Walker",
     "position":"TE",
     "height":"6-1",
     "weight":"241",
     "current_team":"Tennessee Titans",
     "birth_date":"1984-08-12",
     "birth_place":"Pomona, CA",
     "death_date":"None",
     "college":"Central Missouri St.",
     "high_school":"Pomona, CA",
     "draft_team":"San Francisco 49ers",
     "draft_round":"6",
     "draft_position":"175",
     "draft_year":"2006",
     "current_salary":"4,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9894",
     "name":"Tyreek Hill",
     "position":"WR",
     "height":"5-10",
     "weight":"185",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1994-03-01",
     "birth_place":"Douglas, GA",
     "death_date":"None",
     "college":"West Alabama",
     "high_school":"Coffee Co., GA",
     "draft_team":"Kansas City Chiefs",
     "draft_round":"5",
     "draft_position":"165",
     "draft_year":"2016",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"17453",
     "name":"Marcus Peters",
     "position":"CB",
     "height":"6-0",
     "weight":"198",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1993-01-09",
     "birth_place":"Oakland, CA",
     "death_date":"None",
     "college":"Washington",
     "high_school":"McClymonds, CA",
     "draft_team":"Kansas City Chiefs",
     "draft_round":"1",
     "draft_position":"18",
     "draft_year":"2015",
     "current_salary":"1,306,287",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14056",
     "name":"Marcus Mariota",
     "position":"QB",
     "height":"6-4",
     "weight":"215",
     "current_team":"Tennessee Titans",
     "birth_date":"1993-10-30",
     "birth_place":"Honolulu, HI",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Saint Louis, HI",
     "draft_team":"Tennessee Titans",
     "draft_round":"1",
     "draft_position":"2",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1632",
     "name":"Eric Berry",
     "position":"DB",
     "height":"6-0",
     "weight":"211",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1988-12-29",
     "birth_place":"Fairburn, GA",
     "death_date":"None",
     "college":"Tennessee",
     "high_school":"Creekside, GA",
     "draft_team":"Kansas City Chiefs",
     "draft_round":"1",
     "draft_position":"5",
     "draft_year":"2010",
     "current_salary":"900,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20509",
     "name":"Alex Smith",
     "position":"QB",
     "height":"6-4",
     "weight":"212",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1984-05-07",
     "birth_place":"Seattle, WA",
     "death_date":"None",
     "college":"Utah",
     "high_school":"Helix, CA",
     "draft_team":"San Francisco 49ers",
     "draft_round":"1",
     "draft_position":"1",
     "draft_year":"2005",
     "current_salary":"10,800,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"12018",
     "name":"Travis Kelce",
     "position":"TE",
     "height":"6-5",
     "weight":"255",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1989-10-05",
     "birth_place":"Westlake, OH",
     "death_date":"None",
     "college":"Cincinnati",
     "high_school":"Cleveland Heights, OH",
     "draft_team":"Kansas City Chiefs",
     "draft_round":"3",
     "draft_position":"63",
     "draft_year":"2013",
     "current_salary":"2,700,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10496",
     "name":"Kareem Hunt",
     "position":"RB",
     "height":"5-10",
     "weight":"216",
     "current_team":"Kansas City Chiefs",
     "birth_date":"1995-08-06",
     "birth_place":"None",
     "death_date":"None",
     "college":"Toledo",
     "high_school":"None",
     "draft_team":"Kansas City Chiefs",
     "draft_round":"3",
     "draft_position":"86",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9653",
     "name":"Derrick Henry",
     "position":"RB",
     "height":"6-3",
     "weight":"247",
     "current_team":"Tennessee Titans",
     "birth_date":"1994-01-04",
     "birth_place":"Yulee, FL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Yulee, FL",
     "draft_team":"Tennessee Titans",
     "draft_round":"2",
     "draft_position":"45",
     "draft_year":"2016",
     "current_salary":"695,815",
     "hof_induction_year":"None"
    },
    {
     "player_id":"5194",
     "name":"Corey Davis",
     "position":"WR",
     "height":"6-3",
     "weight":"209",
     "current_team":"Tennessee Titans",
     "birth_date":"1995-01-11",
     "birth_place":"None",
     "death_date":"None",
     "college":"West. Michigan",
     "high_school":"Wheaton-Warrenville South, IL",
     "draft_team":"Tennessee Titans",
     "draft_round":"1",
     "draft_position":"5",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Falcons",
    "Points":"26"
   },
   "Team 2":{
    "Name":"Rams",
    "Points":"13"
   },
   "comments":" The Rams, despite never being in the playoffs before with this current group, were near-touchdown favorites over a veteran squad that went to the Super Bowl a year ago. This obviously turned out to be a mistake, as the young team was very jittery and tight. The Rams made lots of mistakes, especially in the opening half. They trailed early as a result and were never able to obtain the lead. Despite this, the Rams were fortunate. The Falcons had three big plays go in their favor early, two of which were the result of Los Angeles mistakes. The Rams had a muffed punt and a fumbled kickoff return by Pharoh Cooper, and the third big play was a great Julio Jones end-around. The Falcons didn't take full advantage of the initial two plays, kicking field goals both times. The game easily could've been 14-0 early, but was 6-0 instead. However, the fumbled kickoff turned into a touchdown, when Alex Mack carried Devonta Freeman into the end zone. The Falcons were able to establish an insurmountable 13-0 lead. The Rams were better beginning at the end of the second quarter and following intermission. Atlanta's offense was as well, however, and the Falcons were able to drain the clock with two long drives, including the opening possession of the third quarter that lasted eight minutes. The Rams simply couldn't get into any sort of rhythm, as their offense couldn't get the ball back, thanks to injuries to Michael Brockers and Lamarcus Joyner. Los Angeles, however, still had Aaron Donald, who was an absolute monster in this game. He had 10 pressures in the 20 first-half passes, dominating the interior. The Falcons couldn't do much offensively in the beginning of the game as a result. Brockers got hurt in the second quarter, and Ryan was better after that, however, as he misfired just twice following intermission. He was 10-of-12 for 132 yards and a touchdown in the second half.    Ryan's overall numbers were 21-of-30 for 218 yards and a touchdown, a floater to Julio Jones. That was a remarkable throw by Ryan because his one foot slipped on the field just as he released the pass. The ball got to Jones, which was fortunate because an underthrown heave would've been a pick-six. The field surface, by the way, was atrocious. They put in new turf following the Rose Bowl, and the players had major trouble staying on their feet as a result. It's ridiculous that the Rams are playing in the same stadium as college football teams, but that will come to an end in 2020.    At any rate, Julio Jones had a huge performance, catching nine of his 10 targets for 94 yards and a touchdown. Jones limped off the field at one point in the second half, but he didn't sit out more than a play or two. Elsewhere in the receiving corps, the only other Falcon with more than 28 receiving yards was Mohamed Sanu (4-75), who saw most of his production come via a 52-yard completion in the fourth quarter. This set up the Jones touchdown. Austin Hooper (3-15) didn't do much aside from haul in a key third-down conversion.    The Falcons ran well against the Rams once Brockers went down. Freeman tallied 66 yards and a touchdown on 18 carries, while Tevin Coleman (14-40) picked up some nice gains and also caught three passes for 28 receiving yards.    For the Rams, this has to be taken as a learning experience. They overachieved this year, thanks to some great coaching. Sean McVay and Greg Olson were able to get the most out of Jared Goff, but the No. 1 overall pick will now have to take the next step. He'll need to begin reading defenses and coming through in clutch moments. He made some great passes in this game, but he struggled in several situations. Goff had some misfires early, barely completing half of his passes (10-of-19) in the first half. He also took numerous sacks despite playing behind a terrific offensive line. Goff eventually got going, beginning with a long pass to Robert Woods, who made a ridiculous, 38-yard diving catch at the end of the second quarter. Following intermission, Goff made a pinpoint throw after slipping and regaining his balance to Woods to pick up a third-and-10 with a 25-yard completion. He then made a third-and-15 conversion to Woods. Goff had a nice drive to get the Rams into scoring position to potentially make this a 26-20 game, but drops in the end zone by Tyler Higbee and Sammy Watkins ruined the Rams' chances. The final numbers for Goff were 24-of-45 for 259 yards and a touchdown. He's made great strides this year, so hopefully he continues to work hard to improve his game. He'll need to put in extra effort with Olson leaving for Oakland, but McVay's continued presence will obviously help.    Goff's completion percentage should've been better, but the Rams were guilty of several drops. In addition to the two drops by Higbee and Watkins, there were three mishandles by Todd Gurley. If playoffs were taken in consideration for the MVP race, Gurley's name would disappear from the list after this game. He rushed for 101 yards on 14 carries, but two of the three drops hurt (one was helpful, as it took time off the clock just prior to halftime). He was able to reel in four receptions, but for only 10 yards.    Woods, Gurley and Cooper Kupp were the only Rams with multiple catches. Woods had the best numbers with nine receptions for 142 yards, while Kupp logged eight catches for 69 yards and a touchdown.    While Goff needs to improve, the Rams' front office can fill some holes on defense. One is an edge rusher across from Robert Quinn. I have Los Angeles picking a defensive end in my 2018 NFL Mock Draft.   ",
   "players":[
    {
     "player_id":"5784",
     "name":"Aaron Donald",
     "position":"DT",
     "height":"6-1",
     "weight":"285",
     "current_team":"Los Angeles Rams",
     "birth_date":"1991-05-23",
     "birth_place":"Pittsburgh, PA",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Penn Hills, PA",
     "draft_team":"St. Louis Rams",
     "draft_round":"1",
     "draft_position":"13",
     "draft_year":"2014",
     "current_salary":"1,802,250",
     "hof_induction_year":"None"
    },
    {
     "player_id":"24649",
     "name":"Robert Woods",
     "position":"WR",
     "height":"6-1",
     "weight":"201",
     "current_team":"Los Angeles Rams",
     "birth_date":"1992-04-10",
     "birth_place":"Gardena, CA",
     "death_date":"None",
     "college":"USC",
     "high_school":"Junipero Serra, CA",
     "draft_team":"Buffalo Bills",
     "draft_round":"2",
     "draft_position":"41",
     "draft_year":"2013",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9792",
     "name":"Tyler Higbee",
     "position":"TE",
     "height":"6-5",
     "weight":"233",
     "current_team":"Los Angeles Rams",
     "birth_date":"1993-01-01",
     "birth_place":"Atlanta, GA",
     "death_date":"None",
     "college":"West. Kentucky",
     "high_school":"East Lake, FL",
     "draft_team":"Los Angeles Rams",
     "draft_round":"4",
     "draft_position":"110",
     "draft_year":"2016",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10180",
     "name":"Austin Hooper",
     "position":"TE",
     "height":"6-3",
     "weight":"248",
     "current_team":"Atlanta Falcons",
     "birth_date":"1994-10-29",
     "birth_place":"San Mateo, CA",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"De La Salle, CA",
     "draft_team":"Atlanta Falcons",
     "draft_round":"3",
     "draft_position":"81",
     "draft_year":"2016",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11634",
     "name":"Julio Jones",
     "position":"WR",
     "height":"6-4",
     "weight":"220",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-02-03",
     "birth_place":"Foley, AL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Foley, AL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"6",
     "draft_year":"2011",
     "current_salary":"11,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7342",
     "name":"Devonta Freeman",
     "position":"RB",
     "height":"5-8",
     "weight":"206",
     "current_team":"Atlanta Falcons",
     "birth_date":"1992-03-15",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Miami Central, FL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"4",
     "draft_position":"103",
     "draft_year":"2014",
     "current_salary":"1,297,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4520",
     "name":"Pharoh Cooper",
     "position":"WR",
     "height":"5-11",
     "weight":"208",
     "current_team":"Los Angeles Rams",
     "birth_date":"1995-03-07",
     "birth_place":"Havelock, NC",
     "death_date":"None",
     "college":"South Carolina",
     "high_school":"Havelock, NC",
     "draft_team":"Los Angeles Rams",
     "draft_round":"4",
     "draft_position":"117",
     "draft_year":"2016",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"8657",
     "name":"Todd Gurley",
     "position":"RB",
     "height":"6-1",
     "weight":"226",
     "current_team":"Los Angeles Rams",
     "birth_date":"1994-08-03",
     "birth_place":"Baltimore, MD",
     "death_date":"None",
     "college":"Georgia",
     "high_school":"Tarboro, NC",
     "draft_team":"St. Louis Rams",
     "draft_round":"1",
     "draft_position":"10",
     "draft_year":"2015",
     "current_salary":"1,691,653",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18100",
     "name":"Robert Quinn",
     "position":"DE",
     "height":"6-4",
     "weight":"270",
     "current_team":"Los Angeles Rams",
     "birth_date":"1990-05-18",
     "birth_place":"Ladson, SC",
     "death_date":"None",
     "college":"North Carolina",
     "high_school":"Fort Dorchester, SC",
     "draft_team":"St. Louis Rams",
     "draft_round":"1",
     "draft_position":"14",
     "draft_year":"2011",
     "current_salary":"6,161,616",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23393",
     "name":"Sammy Watkins",
     "position":"WR",
     "height":"6-1",
     "weight":"211",
     "current_team":"Los Angeles Rams",
     "birth_date":"1993-06-14",
     "birth_place":"Fort Myers, FL",
     "death_date":"None",
     "college":"Clemson",
     "high_school":"South Fort Myers, FL",
     "draft_team":"Buffalo Bills",
     "draft_round":"1",
     "draft_position":"4",
     "draft_year":"2014",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2454",
     "name":"Michael Brockers",
     "position":"DT",
     "height":"6-5",
     "weight":"322",
     "current_team":"Los Angeles Rams",
     "birth_date":"1990-12-21",
     "birth_place":"Houston, TX",
     "death_date":"None",
     "college":"LSU",
     "high_school":"Chavez, TX",
     "draft_team":"St. Louis Rams",
     "draft_round":"1",
     "draft_position":"14",
     "draft_year":"2012",
     "current_salary":"1,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19495",
     "name":"Mohamed Sanu",
     "position":"WR",
     "height":"6-2",
     "weight":"215",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-08-22",
     "birth_place":"New Brunswick, NJ",
     "death_date":"None",
     "college":"Rutgers",
     "high_school":"South Brunswick, NJ",
     "draft_team":"Cincinnati Bengals",
     "draft_round":"3",
     "draft_position":"83",
     "draft_year":"2012",
     "current_salary":"6,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"12701",
     "name":"Cooper Kupp",
     "position":"WR",
     "height":"6-2",
     "weight":"204",
     "current_team":"Los Angeles Rams",
     "birth_date":"1993-06-15",
     "birth_place":"None",
     "death_date":"None",
     "college":"East. Washington",
     "high_school":"None",
     "draft_team":"Los Angeles Rams",
     "draft_round":"3",
     "draft_position":"69",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11798",
     "name":"Lamarcus Joyner",
     "position":"CB",
     "height":"5-8",
     "weight":"184",
     "current_team":"Los Angeles Rams",
     "birth_date":"1990-11-27",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"St. Thomas Aquinas, FL",
     "draft_team":"St. Louis Rams",
     "draft_round":"2",
     "draft_position":"41",
     "draft_year":"2014",
     "current_salary":"1,105,934",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4263",
     "name":"Tevin Coleman",
     "position":"RB",
     "height":"6-0",
     "weight":"210",
     "current_team":"Atlanta Falcons",
     "birth_date":"1993-04-16",
     "birth_place":"Triley Park, IL",
     "death_date":"None",
     "college":"Indiana",
     "high_school":"Oak Forest, IL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"3",
     "draft_position":"73",
     "draft_year":"2015",
     "current_salary":"680,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13793",
     "name":"Alex Mack",
     "position":"C",
     "height":"6-4",
     "weight":"312",
     "current_team":"Atlanta Falcons",
     "birth_date":"1985-11-19",
     "birth_place":"Los Angeles, CA",
     "death_date":"None",
     "college":"California",
     "high_school":"San Marcus, CA",
     "draft_team":"Cleveland Browns",
     "draft_round":"1",
     "draft_position":"21",
     "draft_year":"2009",
     "current_salary":"5,750,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"8015",
     "name":"Jared Goff",
     "position":"QB",
     "height":"6-4",
     "weight":"210",
     "current_team":"Los Angeles Rams",
     "birth_date":"1994-10-14",
     "birth_place":"Novato, CA",
     "death_date":"None",
     "college":"California",
     "high_school":"Marin Catholic, CA",
     "draft_team":"Los Angeles Rams",
     "draft_round":"1",
     "draft_position":"1",
     "draft_year":"2016",
     "current_salary":"1,719,894",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Jaguars",
    "Points":"10"
   },
   "Team 2":{
    "Name":"Bills",
    "Points":"3"
   },
   "comments":" The Bills waited since 1999 to make the playoffs, but they apparently used all of their good fortune the previous weekend. Buffalo definitely could've won this game, but all of the breaks went against them. It's crazy how much bad luck the Bills endured in this contest. For example, Charles Clay made a clutch first-down catch in Jacksonville territory, but his foot was barely out of bounds. The Buffalo defenders dropped numerous interceptions. Some key players left the game with an injury (Micah Hyde, Tre'Davious White). Kelvin Benjamin was flagged for offensive pass interference in the end zone. A punt barely hit the end zone in the middle of the fourth quarter; otherwise, Jacksonville would've been pinned at the 1-yard line. On one late play, Blake Bortles dropped the ball, but managed to pick it up and scramble for a first down. A Deonte Thompson hold negated a 40-yard LeSean McCoy run. Oh, and let's not forget that Tyrod Taylor suffered a concussion on the final drive of the afternoon. All of these instances of bad breaks and misplays buried the Bills and allowed the Jaguars to win their first playoff game in a decade.    Buffalo will have to move forward with a new quarterback next year. Taylor is a fairly decent signal-caller, but he won't be the guy to take the team deep into the postseason. Taylor failed to complete half of his passes, going 17-of-37 for 134 yards and an interception. The pick wasn't his fault - Myles Jack made a great play to bat the ball into the air, and an ill Aaron Colvin made the diving catch - but Taylor made numerous other blunders. Granted, he was battling the top defense in the AFC, and he endured some drops, but he missed some makeable throws. He whiffed way too high on Zay Jones in the second quarter, and he overshot a couple of other receivers in the second half. He didn't see an open receiver downfield for a potential touchdown in the fourth quarter, and on the very next play, he didn't notice that an open wideout was available for what would've been a key first down. Taylor can use his legs well - seven carries, 27 rushing yards - and he does a good job of avoiding turnovers, but his field vision and accuracy are both very sub par. Here are the 2018 NFL Draft Quarterback Prospect Rankings. At any rate, Taylor's concussion made way for Nathan Peterman to perhaps etch his name into Buffalo lore with a potential game-tying drive. He started well, scrambling for a first down, and then throwing a nice pass, but he fired an interception to Jalen Ramsey right after that, ending the game.    There was no question that McCoy was the best offensive player for the Bills. Coming into this game questionable with an ankle sprain, McCoy was a warrior. He gained 75 yards on 19 carries to go along with six catches for 44 receiving yards. Those numbers don't look incredible, but they were considering his injury and the fact that he was battling such a great defense. McCoy had two huge gains. One was the aforementioned 40-yard run that was called back for a Thompson hold. Another was a 25-yard gain that featured a ridiculous spin move. There were no signs that McCoy was nursing an injured ankle.    Speaking of Thompson, he was atrocious. He caught two of his six targets for 23 yards. He had the aforementioned hold, and he was guilty of a drop that allowed the Jaguars to score three points, as they wouldn't have had enough time otherwise. Thompson also ran a poor route and was pushed out of bounds one yard shy of the first-down marker in the opening quarter. Elsewhere in the receiving corps, Benjamin was a big bust, though he wasn't completely healthy. He was flagged for offensive pass-interference on first-and-goal at the 1-yard line, which ruined a chance for a touchdown. He caught only one ball for nine yards. Zay Jones (2-20) dropped a pass on third down.    The Jaguars may have won this game, but they probably shouldn't have. The Bills legitimately outgained Jacksonville, 263-230, but lost because of the aforementioned blunders and unfortunate events. Save for one long drive in the third quarter, the Jaguars simply couldn't do anything offensively because of Bortles' incompetence. Jadeveon Clowney called Bortles garbage earlier in the year, and I always thought that was cruel, as it was a clear insult to garbage. Bortles is worse than that, and he should've lost this game for the Jaguars. His passes were so inaccurate that he couldn't hit simple screens. He was also extremely fortunate not to commit a turnover because the Bills dropped at least three possible interceptions. Bortles lost a fumble on one play as well, but Leonard Fournette pounced on the loose ball. Bortles finished 12-of-23 for only 87 yards and a short touchdown to Ben Koyack. He was utterly inept as a passer, but at least was able to scramble impressively. Showing off his great athleticism, Bortles rushed 10 times for 88 yards. Yes, he had more rushing yards than passing yards. Perhaps this is a good sign, as the Jaguars might be able to use Bortles as a gadget player once they find someone capable of completing routine passes.    As for Fournette, some may be surprised that he didn't find much running room against a struggling ground defense; Fournette gained 57 yards on 21 carries. However, the Bills, as Tony Romo mentioned repeatedly, were selling out against the run, daring Bortles to beat them. He didn't, but Buffalo did a good job of beating itself.    With Bortles' poor passing numbers, the receiving stats were obviously suppressed. Only four players caught passes: Dede Westbrook (5-48), Fournette (3-21), Marcedes Lewis (3-17) and Koyack (1-1).   ",
   "players":[
    {
     "player_id":"22171",
     "name":"Deonte Thompson",
     "position":"WR",
     "height":"6-0",
     "weight":"200",
     "current_team":"Buffalo Bills",
     "birth_date":"1989-02-14",
     "birth_place":"Belle Glades, FL",
     "death_date":"None",
     "college":"Florida",
     "high_school":"Glades Central, FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"501,471",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10714",
     "name":"Myles Jack",
     "position":"OLB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-09-03",
     "birth_place":"Scottsdale, AZ",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Bellevue, WA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"36",
     "draft_year":"2016",
     "current_salary":"737,929",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4032",
     "name":"Charles Clay",
     "position":"TE",
     "height":"6-3",
     "weight":"245",
     "current_team":"Buffalo Bills",
     "birth_date":"1989-02-13",
     "birth_place":"Little Rock, AR",
     "death_date":"None",
     "college":"Tulsa",
     "high_school":"Little Rock Central, AR",
     "draft_team":"Miami Dolphins",
     "draft_round":"6",
     "draft_position":"174",
     "draft_year":"2011",
     "current_salary":"4,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18175",
     "name":"Jalen Ramsey",
     "position":"FS",
     "height":"6-1",
     "weight":"209",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1994-10-24",
     "birth_place":"Smyrna, TN",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Brentwood Academy, TN",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"5",
     "draft_year":"2016",
     "current_salary":"1,511,409",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10588",
     "name":"Micah Hyde",
     "position":"CB",
     "height":"6-0",
     "weight":"197",
     "current_team":"Buffalo Bills",
     "birth_date":"1990-12-31",
     "birth_place":"Toledo, OH",
     "death_date":"None",
     "college":"Iowa",
     "high_school":"Fostoria, OH",
     "draft_team":"Green Bay Packers",
     "draft_round":"5",
     "draft_position":"159",
     "draft_year":"2013",
     "current_salary":"2,300,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"12567",
     "name":"Ben Koyack",
     "position":"TE",
     "height":"6-5",
     "weight":"249",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-04-09",
     "birth_place":"Oil City, PA",
     "death_date":"None",
     "college":"Notre Dame",
     "high_school":"Oil City, PA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"7",
     "draft_position":"229",
     "draft_year":"2015",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4110",
     "name":"Jadeveon Clowney",
     "position":"DE",
     "height":"6-5",
     "weight":"266",
     "current_team":"Houston Texans",
     "birth_date":"1993-02-14",
     "birth_place":"Rock Hill, SC",
     "death_date":"None",
     "college":"South Carolina",
     "high_school":"South Pointe, SC",
     "draft_team":"Houston Texans",
     "draft_round":"1",
     "draft_position":"1",
     "draft_year":"2014",
     "current_salary":"690,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7203",
     "name":"Leonard Fournette",
     "position":"RB",
     "height":"6-0",
     "weight":"240",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-01-18",
     "birth_place":"New Orleans, LA",
     "death_date":"None",
     "college":"LSU",
     "high_school":"St. Augustine, LA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"4",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"17444",
     "name":"Nathan Peterman",
     "position":"QB",
     "height":"6-2",
     "weight":"226",
     "current_team":"Buffalo Bills",
     "birth_date":"1994-05-04",
     "birth_place":"Jacksonville, FL",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Bartram Trail, FL",
     "draft_team":"Buffalo Bills",
     "draft_round":"5",
     "draft_position":"171",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13302",
     "name":"Marcedes Lewis",
     "position":"TE",
     "height":"6-6",
     "weight":"255",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1984-05-19",
     "birth_place":"Long Beach, CA",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Long Beach Polytechnic, CA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"28",
     "draft_year":"2006",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11731",
     "name":"Zay Jones",
     "position":"WR",
     "height":"6-2",
     "weight":"201",
     "current_team":"Buffalo Bills",
     "birth_date":"1995-03-30",
     "birth_place":"Dallas, TX",
     "death_date":"None",
     "college":"East Carolina",
     "high_school":"Stephen F. Austin, TX",
     "draft_team":"Buffalo Bills",
     "draft_round":"2",
     "draft_position":"37",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2038",
     "name":"Blake Bortles",
     "position":"QB",
     "height":"6-5",
     "weight":"232",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1992-04-28",
     "birth_place":"Oviedo, FL",
     "death_date":"None",
     "college":"Central Florida",
     "high_school":"Oviedo, FL",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"3",
     "draft_year":"2014",
     "current_salary":"3,236,565",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23665",
     "name":"Dede Westbrook",
     "position":"WR",
     "height":"6-0",
     "weight":"178",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-11-21",
     "birth_place":"None",
     "death_date":"None",
     "college":"Oklahoma",
     "high_school":"None",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"4",
     "draft_position":"110",
     "draft_year":"2017",
     "current_salary":"348,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"21908",
     "name":"Tyrod Taylor",
     "position":"QB",
     "height":"6-0",
     "weight":"221",
     "current_team":"Buffalo Bills",
     "birth_date":"1989-08-03",
     "birth_place":"Hampton, VA",
     "death_date":"None",
     "college":"Virginia Tech",
     "high_school":"Hampton, VA",
     "draft_team":"Baltimore Ravens",
     "draft_round":"6",
     "draft_position":"180",
     "draft_year":"2011",
     "current_salary":"7,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14591",
     "name":"LeSean McCoy",
     "position":"RB",
     "height":"5-10",
     "weight":"215",
     "current_team":"Buffalo Bills",
     "birth_date":"1988-07-12",
     "birth_place":"Harrisburg, PA",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Bishop McDevitt, PA",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"2",
     "draft_position":"53",
     "draft_year":"2009",
     "current_salary":"6,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4355",
     "name":"Aaron Colvin",
     "position":"CB",
     "height":"5-11",
     "weight":"177",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1991-10-02",
     "birth_place":"Tulsa, OK",
     "death_date":"None",
     "college":"Oklahoma",
     "high_school":"Owasso, OK",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"4",
     "draft_position":"114",
     "draft_year":"2014",
     "current_salary":"1,797,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1520",
     "name":"Kelvin Benjamin",
     "position":"WR",
     "height":"6-5",
     "weight":"240",
     "current_team":"Buffalo Bills",
     "birth_date":"1991-02-05",
     "birth_place":"Belle Glade, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Glades Central, FL",
     "draft_team":"Carolina Panthers",
     "draft_round":"1",
     "draft_position":"28",
     "draft_year":"2014",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Saints",
    "Points":"31"
   },
   "Team 2":{
    "Name":"Panthers",
    "Points":"26"
   },
   "comments":" The Saints never trailed in this game, but during the early and late stages, it appeared as though they were going to lose. In the initial portion of the contest, the Saints went three-and-out twice and then saw the Panthers drive down the field and into the red zone. Cam Newton seemed to fire a touchdown to Kaelin Clay, but the receiver dropped the ball. Graham Gano then somehow whiffed on a 25-yard field goal. Drew Brees responded with an 80-yard touchdown to Ted Ginn to give New Orleans a lead that it wouldn't relinquish. That was the theme of the opening half, as the Saints scored three touchdowns, while the Panthers kicked three field goals. Carolina caught fire in the second half. Despite Newton being knocked around fiercely - after getting crushed so hard, he collapsed prior to getting to the sideline, and Derek Anderson had to throw a pass on his sole snap - the Panthers nearly came back from down 31-19. Newton hit Christian McCaffrey with a short toss, and McCaffrey dodged linebacker Craig Robertson to score on a 56-yard touchdown. The Panthers got the ball back after a questionable decision for Sean Payton to go for it on a fourth-and-2 near midfield, and they drove deep into New Orleans territory. However, Newton took an intentional-grounding penalty and then a sack to clinch the victory for New Orleans.    Brees was great at times in this game. Following a slow start, he finished 23-of-33 for 376 yards, two touchdowns and an interception, which occurred when Brees threw the ball up for grabs on that aforementioned fourth-and-2 try. It actually would've been better for the Panthers had safety Mike Adams dropped the ball, but it was a split-second decision, so it's difficult to blame him for that mistake. Brees threw some dimes versus the Panthers, including an amazing, back-shoulder throw to Josh Hill for a gain of 24 yards. He was able to torch Carolina's secondary mercilessly for the third time this year. The Panthers desperately need cornerback help; here are the 2018 NFL Draft Cornerback Prospect Rankings.    Despite Brees' brilliance, I feel as though the Saints should've had more offensive success. There were two problems. The first was that they spent too much energy running the ball against Carolina's prolific rush defense. It was obvious this wouldn't be effective, especially when guard Andrus Peat left the game in the opening half with a broken leg. Alvin Kamara mustered just 23 yards and a touchdown on 10 carries, while Mark Ingram was limited to only 22 yards on nine attempts. Fullback Zach Line vultured a touchdown from the two prolific backs. The ground attack has been a big reason why the Saints have been so successful this year, but Carolina is especially weak in the secondary, so Brees should've been allowed to attack it even more frequently. The second problem was that Kamara was not featured in the passing game nearly enough. Kamara is one of the most dynamic players in the NFL, especially as a pass-catcher, yet he saw just three targets for some reason. By comparison, Brandon Coleman was thrown to more often (5 targets), which is inexcusable. If the Saints show up with this sort of flimsy game plan in Minnesota, they will lose.    Speaking of Coleman, he had four catches for 44 yards. He also fumbled in Carolina territory, which is nothing new. For those of you who bet the Saints versus the Jets in Week 15, you may recall that Coleman was guilty of two lost fumbles in the red zone. It's unclear why he's still being featured. Elsewhere in the receiving corps, Michael Thomas caught eight of his nine targets for 131 yards. Contrary to Coleman, he was prolific. He made contested catches and juked defenders to pick up more yards. Ginn (4-115) and Hill (3-49) both caught touchdowns.    As for the Panthers, Newton finished 24-of-40 for 349 yards and two touchdowns. This was a very gritty performance by Newton, who was constantly limping around and getting checked out on the sideline. His offensive line let him down on too many occasions. Yet, Newton should've generated better numbers. Clay, as mentioned, dropped a touchdown. Some of his receivers also drew interference and holding penalties. I mentioned that Newton had some protection issues, and this was an issue down the stretch of the season. Left tackle Matt Kalil has been a major weakness, and Cameron Jordan was a big problem for Carolina in this game. Here are the 2018 NFL Draft Offensive Tackle Prospect Rankings.    Greg Olsen was barely a factor last week. He caught one pass, but didn't appear healthy, and there was some concern about him playing on an artificial surface. I figured this would be the case again this week, but Olsen looked a billion times healthier than he did in Atlanta. Olsen caught eight of his 12 targets for 107 yards and a touchdown. Elsewhere in the receiving corps, Clay (3-32) made up for his dropped touchdown by making a great sideline grab in the fourth quarter. Devin Funchess (4-79) nearly came up with a touchdown on the final drive, but he couldn't come up with the catch. Funchess left the game on numerous occasions, as he was ailing with an injury.    Jonathan Stewart broke free for an early 29-yard burst, but didn't do much else after that, finishing with 51 yards on 11 carries. McCaffrey, meanwhile, didn't accomplish much on the ground (6-16), but he had the long receiving touchdown. He was a huge factor as a receiver with six grabs for 101 receiving yards and the score. For more thoughts, check out my updated   ",
   "players":[
    {
     "player_id":"4227",
     "name":"Brandon Coleman",
     "position":"WR",
     "height":"6-6",
     "weight":"225",
     "current_team":"New Orleans Saints",
     "birth_date":"1992-06-22",
     "birth_place":"Accokeek, MD",
     "death_date":"None",
     "college":"Rutgers",
     "high_school":"Bishop McNamara, MD",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"84",
     "name":"Mike Adams",
     "position":"DB",
     "height":"5-10",
     "weight":"195",
     "current_team":"Carolina Panthers",
     "birth_date":"1981-03-24",
     "birth_place":"Paterson, NJ",
     "death_date":"None",
     "college":"Delaware",
     "high_school":"Passaic Co. Tech, NJ",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9863",
     "name":"Josh Hill",
     "position":"TE",
     "height":"6-5",
     "weight":"229",
     "current_team":"New Orleans Saints",
     "birth_date":"1990-05-21",
     "birth_place":"Blackfoot, ID",
     "death_date":"None",
     "college":"Idaho St.",
     "high_school":"Blackfoot, ID",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,650,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7916",
     "name":"Ted Ginn",
     "position":"WR",
     "height":"5-11",
     "weight":"178",
     "current_team":"New Orleans Saints",
     "birth_date":"1985-04-12",
     "birth_place":"Cleveland, OH",
     "death_date":"None",
     "college":"Ohio St.",
     "high_school":"Glenville, OH",
     "draft_team":"Miami Dolphins",
     "draft_round":"1",
     "draft_position":"9",
     "draft_year":"2007",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14460",
     "name":"Christian McCaffrey",
     "position":"RB",
     "height":"5-11",
     "weight":"202",
     "current_team":"Carolina Panthers",
     "birth_date":"1996-06-07",
     "birth_place":"Castle Rock, CO",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Valor Christian, CO",
     "draft_team":"Carolina Panthers",
     "draft_round":"1",
     "draft_position":"8",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11877",
     "name":"Alvin Kamara",
     "position":"RB",
     "height":"5-10",
     "weight":"214",
     "current_team":"New Orleans Saints",
     "birth_date":"1995-07-25",
     "birth_place":"None",
     "death_date":"None",
     "college":"Tennessee",
     "high_school":"None",
     "draft_team":"New Orleans Saints",
     "draft_round":"3",
     "draft_position":"67",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"434",
     "name":"Derek Anderson",
     "position":"QB",
     "height":"6-6",
     "weight":"229",
     "current_team":"Carolina Panthers",
     "birth_date":"1983-06-15",
     "birth_place":"Portland, OR",
     "death_date":"None",
     "college":"Oregon St.",
     "high_school":"Scappoose, OR",
     "draft_team":"Baltimore Ravens",
     "draft_round":"6",
     "draft_position":"213",
     "draft_year":"2005",
     "current_salary":"1,550,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"21291",
     "name":"Jonathan Stewart",
     "position":"RB",
     "height":"5-11",
     "weight":"235",
     "current_team":"Carolina Panthers",
     "birth_date":"1987-03-21",
     "birth_place":"Fort Lewis, WA",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Timberline, WA",
     "draft_team":"Carolina Panthers",
     "draft_round":"1",
     "draft_position":"13",
     "draft_year":"2008",
     "current_salary":"1,100,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7461",
     "name":"Devin Funchess",
     "position":"WR",
     "height":"6-5",
     "weight":"230",
     "current_team":"Carolina Panthers",
     "birth_date":"1994-05-21",
     "birth_place":"Farmington Hill, MI",
     "death_date":"None",
     "college":"Michigan",
     "high_school":"Harrison, MI",
     "draft_team":"Carolina Panthers",
     "draft_round":"2",
     "draft_position":"41",
     "draft_year":"2015",
     "current_salary":"836,900",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10635",
     "name":"Mark Ingram",
     "position":"RB",
     "height":"5-10",
     "weight":"215",
     "current_team":"New Orleans Saints",
     "birth_date":"1989-12-21",
     "birth_place":"Hackensack, NJ",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Southwestern Academy, MI",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"28",
     "draft_year":"2011",
     "current_salary":"3,100,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"17301",
     "name":"Andrus Peat",
     "position":"OT",
     "height":"6-7",
     "weight":"312",
     "current_team":"New Orleans Saints",
     "birth_date":"1993-11-04",
     "birth_place":"Mesa, AZ",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Corona del Sol, AZ",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"13",
     "draft_year":"2015",
     "current_salary":"1,470,773",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4036",
     "name":"Kaelin Clay",
     "position":"WR",
     "height":"5-10",
     "weight":"190",
     "current_team":"Carolina Panthers",
     "birth_date":"1992-01-02",
     "birth_place":"Long Beach, CA",
     "death_date":"None",
     "college":"Utah",
     "high_school":"Long Beach Polytechnic, CA",
     "draft_team":"Tampa Bay Buccaneers",
     "draft_round":"6",
     "draft_position":"184",
     "draft_year":"2015",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16815",
     "name":"Greg Olsen",
     "position":"TE",
     "height":"6-6",
     "weight":"254",
     "current_team":"Carolina Panthers",
     "birth_date":"1985-03-11",
     "birth_place":"Paterson, NJ",
     "death_date":"None",
     "college":"Miami (FL)",
     "high_school":"Wayne Hills, NJ",
     "draft_team":"Chicago Bears",
     "draft_round":"1",
     "draft_position":"31",
     "draft_year":"2007",
     "current_salary":"6,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22094",
     "name":"Michael Thomas",
     "position":"S",
     "height":"5-11",
     "weight":"196",
     "current_team":"Miami Dolphins",
     "birth_date":"1989-03-17",
     "birth_place":"Houston, TX",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Nimitz, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,797,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22095",
     "name":"Michael Thomas",
     "position":"WR",
     "height":"6-3",
     "weight":"212",
     "current_team":"New Orleans Saints",
     "birth_date":"1993-03-03",
     "birth_place":"Los Angeles, CA",
     "death_date":"None",
     "college":"Ohio St.",
     "high_school":"Fork Union Military Academy, VA",
     "draft_team":"New Orleans Saints",
     "draft_round":"2",
     "draft_position":"47",
     "draft_year":"2016",
     "current_salary":"682,681",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11740",
     "name":"Cameron Jordan",
     "position":"DE",
     "height":"6-4",
     "weight":"287",
     "current_team":"New Orleans Saints",
     "birth_date":"1989-07-10",
     "birth_place":"Chandler, AZ",
     "death_date":"None",
     "college":"California",
     "high_school":"Chandler, AZ",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"24",
     "draft_year":"2011",
     "current_salary":"7,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13388",
     "name":"Zach Line",
     "position":"FB",
     "height":"6-1",
     "weight":"230",
     "current_team":"New Orleans Saints",
     "birth_date":"1990-04-26",
     "birth_place":"Oxford, MI",
     "death_date":"None",
     "college":"SMU",
     "high_school":"Oxford, MI",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2328",
     "name":"Drew Brees",
     "position":"QB",
     "height":"6-0",
     "weight":"209",
     "current_team":"New Orleans Saints",
     "birth_date":"1979-01-15",
     "birth_place":"Austin, TX",
     "death_date":"None",
     "college":"Purdue",
     "high_school":"Westlake, TX",
     "draft_team":"San Diego Chargers",
     "draft_round":"2",
     "draft_position":"32",
     "draft_year":"2001",
     "current_salary":"13,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11865",
     "name":"Matt Kalil",
     "position":"OT",
     "height":"6-6",
     "weight":"306",
     "current_team":"Carolina Panthers",
     "birth_date":"1989-07-06",
     "birth_place":"Corona, CA",
     "death_date":"None",
     "college":"USC",
     "high_school":"Servite, CA",
     "draft_team":"Minnesota Vikings",
     "draft_round":"1",
     "draft_position":"4",
     "draft_year":"2012",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18814",
     "name":"Craig Robertson",
     "position":"LB",
     "height":"6-1",
     "weight":"229",
     "current_team":"New Orleans Saints",
     "birth_date":"1988-02-11",
     "birth_place":"Stafford, TX",
     "death_date":"None",
     "college":"North Texas",
     "high_school":"Stafford, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,105,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7575",
     "name":"Graham Gano",
     "position":"P",
     "height":"6-0",
     "weight":"192",
     "current_team":"Carolina Panthers",
     "birth_date":"1987-04-09",
     "birth_place":"Arbroath, Scotland",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"J.M. Tate, FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"3,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16363",
     "name":"Cam Newton",
     "position":"QB",
     "height":"6-6",
     "weight":"260",
     "current_team":"Carolina Panthers",
     "birth_date":"1989-05-11",
     "birth_place":"College Park, GA",
     "death_date":"None",
     "college":"Auburn",
     "high_school":"Westlake, GA",
     "draft_team":"Carolina Panthers",
     "draft_round":"1",
     "draft_position":"1",
     "draft_year":"2011",
     "current_salary":"13,166,666",
     "hof_induction_year":"None"
    }
   ]
  }
 ]
}
