{
 "week":"19",
 "year":"2017",
 "numberOfGames":"4",
 "games":[
  {
   "Team 1":{
    "Name":"Eagles",
    "Points":"15"
   },
   "Team 2":{
    "Name":"Falcons",
    "Points":"10"
   },
   "comments":" No one seemed to give the Eagles much of a chance entering this game, and the Philadelphia players seemed to agree with that notion based on how they played to start this divisional-round matchup. They made some glaring mistakes early, as Jay Ajayi lost a fumble in Atlanta territory, and there was a muffed punt when the ball deflected on an unaware player's foot to set up a Falcon touchdown. This gave the Falcons a 10-6 lead that almost seemed insurmountable, given Nick Foles' initial passing struggles. And then, the Eagles rammed the ball down Atlanta's throat. Philadelphia rushed extremely effectively with all of their backs, especially Ajayi, who seemed determined to atone for his blunder. The Eagles put together numerous impressive drives, particularly in the second half. Down 10-9, they moved deep into Atlanta territory despite getting possession on their own 6-yard line. Later, they held the ball for eight minutes to set up another field goal. This gave them a 15-10 lead with about six minutes remaining in regulation. Matt Ryan had one more chance to give his team the victory. He drove all the way down to the Philadelphia 2-yard line, thanks in part to a Julio Jones fourth-and-6 conversion. However, on the final significant play of the game, Ryan looked toward Jones in the end zone, but Jones slipped. This ruined Atlanta's chances and gave the Eagles the unlikely victory.    The Eagles were fortunate they weren't blown out early, based on how Foles started. His first pass was a helpless duck that was underthrown by about 10 yards. He was bailed out by a pass-interference call. Foles followed that up by overthrowing Zach Ertz in the flat, and he was lucky to pick up a first down on a bogus pass-interference call on Desmond Trufant, when it was apparent that Mack Hollins pushed off. After that, Foles missed a wide-open Trey Burton for what should've been a gain of about 30 yards. Foles looked like he was going to self-destruct - just prior to halftime, he fired an interception right to Keanu Neal that generated at least a six-point swing - but the Eagles' ability to pound the rock so forcefully put Foles in a great position to make some easy throws. Foles went from throwing horrible wobblers and dropped interceptions to accurate, short passes in the second half. While he finished 23-of-30 for 246 yards for the entire game, his numbers in the second half were better, as he went 12-of-15 for 145 yards following intermission. His ability to convert third downs in between the 20s kept Atlanta's offense off the field in the second half.    Ajayi's final numbers don't look too impressive - 15 carries, 54 rush yards - but he was able to rip off some decent runs to convert first downs and give Foles several easy third-and-short opportunities. He was also a big factor in the passing game, catching three passes for 44 receiving yards, though he was guilty of a drop in the third quarter. Meanwhile, LeGarrette Blount (9-19) scored Philadelphia's sole touchdown.    The only Eagle with more receiving yards than Ajayi happened to be Alshon Jeffery, who caught four of his five targets for 61 yards. Torrey Smith (3-39) had a big play, a 20-yard reception right before halftime. It was a crazy sequence in which Neal dropped a Foles interception, and the ball bounced off his knee and into the hands of Smith. This set up a field goal. If it wasn't for that lucky deflection, the Falcons probably win this game, 13-12. Elsewhere in the receiving corps, Zach Ertz caught three passes for 32 yards, while Nelson Agholor (2-24) had a key gain to set up Blount's touchdown, where he had a 21-yard run on a great play-call. <div class=dfpAdSlots>    As for the Falcons, they simply couldn't put together enough consistent drives to make up for their soft defense. Ryan made some nice third- and fourth-down conversions, but Philadelphia's elite defense was able to be disruptive enough to restrict the Falcons to 281 net yards and 4.8 yards per play. Ryan finished 22-of-36 for 210 yards and a touchdown. He nearly threw an interception on a deep shot; as with Foles' pass, the ball fluttered in the heavy wind, and Julio Jones had to make a great play to break up the pass. Ryan was excellent on the final drive to put his team in a position to potentially win, but as mentioned, Jones fell down in the end zone to disrupt the timing of the play. Jones was able to get back up, but it was already too late. Ryan had to fire a pass under duress, and it floated a bit too high toward his elite receiver.    Part of the problem for Atlanta's offense was Devonta Freeman's struggles. Freeman caught the Falcons' sole touchdown, but he couldn't run the ball at all. He and Tevin Coleman each received 10 carries, and Coleman outgained Freeman, 79-7. Coleman is the better runner, and I remain shocked that Atlanta's front office gave Freeman so much money last offseason. Freeman is great in the passing game - he caught five passes for 26 receiving yards to go along with his score - but it was still an obvious overpay. Coleman should've been give more work in this contest.    Jones, meanwhile, was excellent, as expected. He caught nine passes for 101 yards, which includes the aforementioned fourth-and-6 conversion. He also caught a key pass to take Atlanta down to the 2-yard line on the final drive. However, Jones will remember that he slipped in the end zone on the most important play of the game. The only Atlanta player with more than 14 receiving yards, excluding Jones and Freeman, was Mohamed Sanu, who snatched three balls for 50 yards. Ryan didn't have the best protection to get it to his weapons as much as he would like, and it's clear that the Falcons have to bolster their offensive line. Here are the . <div class=dfpAdSlots>   ",
   "players":[
    {
     "player_id":"137",
     "name":"Nelson Agholor",
     "position":"WR",
     "height":"6-1",
     "weight":"190",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1993-05-24",
     "birth_place":"Lagos, Nigeria",
     "death_date":"None",
     "college":"USC",
     "high_school":"Berkeley Prep, FL",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"1",
     "draft_position":"20",
     "draft_year":"2015",
     "current_salary":"1,287,489",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19319",
     "name":"Matt Ryan",
     "position":"QB",
     "height":"6-4",
     "weight":"217",
     "current_team":"Atlanta Falcons",
     "birth_date":"1985-05-17",
     "birth_place":"Exton, PA",
     "death_date":"None",
     "college":"Boston Col.",
     "high_school":"William Penn Charter School, PA",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"3",
     "draft_year":"2008",
     "current_salary":"15,750,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22538",
     "name":"Desmond Trufant",
     "position":"CB",
     "height":"6-0",
     "weight":"190",
     "current_team":"Atlanta Falcons",
     "birth_date":"1990-09-10",
     "birth_place":"Tacoma, WA",
     "death_date":"None",
     "college":"Washington",
     "high_school":"Wilson, WA",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"22",
     "draft_year":"2013",
     "current_salary":"1,526,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20801",
     "name":"Torrey Smith",
     "position":"WR",
     "height":"6-1",
     "weight":"205",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1989-01-26",
     "birth_place":"Colonial Beach, VA",
     "death_date":"None",
     "college":"Maryland",
     "high_school":"Stafford, VA",
     "draft_team":"Baltimore Ravens",
     "draft_round":"2",
     "draft_position":"58",
     "draft_year":"2011",
     "current_salary":"4,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"3101",
     "name":"Trey Burton",
     "position":"TE",
     "height":"6-3",
     "weight":"228",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1991-10-29",
     "birth_place":"Venice, FL",
     "death_date":"None",
     "college":"Florida",
     "high_school":"Venice, FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,746,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11634",
     "name":"Julio Jones",
     "position":"WR",
     "height":"6-4",
     "weight":"220",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-02-03",
     "birth_place":"Foley, AL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Foley, AL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"6",
     "draft_year":"2011",
     "current_salary":"11,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"6520",
     "name":"Zach Ertz",
     "position":"TE",
     "height":"6-5",
     "weight":"249",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1990-11-10",
     "birth_place":"Orange, CA",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Monte Vista, CA",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"2",
     "draft_position":"35",
     "draft_year":"2013",
     "current_salary":"775,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7084",
     "name":"Nick Foles",
     "position":"QB",
     "height":"6-5",
     "weight":"244",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1989-01-20",
     "birth_place":"Austin, TX",
     "death_date":"None",
     "college":"Arizona",
     "high_school":"Westlake, TX",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"3",
     "draft_position":"88",
     "draft_year":"2012",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11012",
     "name":"Alshon Jeffery",
     "position":"WR",
     "height":"6-4",
     "weight":"230",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1990-02-14",
     "birth_place":"St. Matthews, SC",
     "death_date":"None",
     "college":"South Carolina",
     "high_school":"Calhoun County, SC",
     "draft_team":"Chicago Bears",
     "draft_round":"2",
     "draft_position":"45",
     "draft_year":"2012",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16215",
     "name":"Keanu Neal",
     "position":"FS",
     "height":"6-0",
     "weight":"211",
     "current_team":"Atlanta Falcons",
     "birth_date":"1995-07-26",
     "birth_place":"Webster, FL",
     "death_date":"None",
     "college":"Florida",
     "high_school":"South Sumter, FL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"17",
     "draft_year":"2016",
     "current_salary":"938,075",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10086",
     "name":"Mack Hollins",
     "position":"WR",
     "height":"6-4",
     "weight":"221",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1993-09-16",
     "birth_place":"None",
     "death_date":"None",
     "college":"North Carolina",
     "high_school":"None",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"4",
     "draft_position":"118",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19495",
     "name":"Mohamed Sanu",
     "position":"WR",
     "height":"6-2",
     "weight":"215",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-08-22",
     "birth_place":"New Brunswick, NJ",
     "death_date":"None",
     "college":"Rutgers",
     "high_school":"South Brunswick, NJ",
     "draft_team":"Cincinnati Bengals",
     "draft_round":"3",
     "draft_position":"83",
     "draft_year":"2012",
     "current_salary":"6,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4263",
     "name":"Tevin Coleman",
     "position":"RB",
     "height":"6-0",
     "weight":"210",
     "current_team":"Atlanta Falcons",
     "birth_date":"1993-04-16",
     "birth_place":"Triley Park, IL",
     "death_date":"None",
     "college":"Indiana",
     "high_school":"Oak Forest, IL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"3",
     "draft_position":"73",
     "draft_year":"2015",
     "current_salary":"680,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1890",
     "name":"LeGarrette Blount",
     "position":"RB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1986-12-05",
     "birth_place":"Madison, FL",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Taylor Co., FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"160",
     "name":"Jay Ajayi",
     "position":"RB",
     "height":"6-0",
     "weight":"216",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1993-06-15",
     "birth_place":"London, England",
     "death_date":"None",
     "college":"Boise St.",
     "high_school":"Liberty, TX",
     "draft_team":"Miami Dolphins",
     "draft_round":"5",
     "draft_position":"149",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Patriots",
    "Points":"35"
   },
   "Team 2":{
    "Name":"Titans",
    "Points":"14"
   },
   "comments":" Some wondered if the Patriots would be distracted in the wake of the fake-news article ESPN published about them during the week. Anyone wondering this obviously haven't been paying attention to what the Patriots have done over the years, as they've always stepped up when there has been adversity. And that's exactly what New England did in this contest, completely dominating an overmatched Tennessee squad in the final three quarters. For a while, it seemed like this might be a close contest. The Patriots weren't doing much on their first couple of drives, and Tennessee took the lead with a Corey Davis one-handed touchdown. Two things happened after that, however, to completely change the course of the game. One was Tom Brady completely figuring out what the Titans were trying to do defensively, as well as finding all of Tennessee's weaknesses and exploiting them. The other was that Titans right tackle Jack Conklin suffered a leg injury and never returned. Tennessee couldn't block New England as a consequence.    Going with the first aspect, Brady dissected Tennessee masterfully, which couldn't have been a surprise, given the team's struggles in pass defense. Brady made sure to expose Tennessee's liabilities against pass-catching running backs, throwing to Dion Lewis and James White a combined 17 times. Brady also threw on disappointing safety John Cyprien, who has taken a major step backward this season after thriving in Jacksonville in 2016. Brady finished 35-of-53 for 337 yards and three touchdowns. He nearly had a fourth score, but missed Danny Amendola in the end zone one of his rare errant throws during the evening. Fifty-three attempted passes is a ton for a victorious team, but Brady basically used short tosses to his running backs as an extension of the running game.    Speaking of those backs, Dion Lewis had a huge performance. He rushed for 62 yards on 15 carries and caught nine of his 10 targets for 79 receiving yards. Lewis appeared to score New England's first touchdown of the game, but replay review showed that he was barely ruled down. That didn't end up mattering, as Brady pitched the ball to James White for a score just a couple of plays later. White also scored as a rusher and also caught four passes for 29 receiving yards.    Brady's other touchdowns went to Rob Gronkowski (6-81) and Chris Hogan (1-4). The Titans had stellar safety Kevin Byard on Gronkowski at times, but it didn't matter. Gronkowski was unstoppable, and you have to wonder if the Chiefs would've played in this game had their Pro Bowl tight end not gotten hurt last week. Elsewhere in the receiving corps, Danny Amendola led the Patriots with 11 catches for 112 yards. Brandin Cooks (3-32) didn't post good numbers, but almost reeled in a deep pass late in the game. <div class=dfpAdSlots>    The second aspect, meanwhile, ruined Tennessee's offense. It was apparent how much the Titans missed their stud right tackle. Conklin is a very skilled blocker, and the Patriots made sure to take advantage of his absence. As a result, Marcus Mariota took a ridiculous eight sacks, and the Titans had just as many penalties as first downs through three quarters. Mariota finished 22-of-37 for 254 yards and two touchdowns, but those numbers are very misleading because of garbage-time stats. Mariota, at one point, was 15-of-24 for 138 yards and a touchdown, and most of that yardage came on one drive in the opening half. Mariota needed his blocking to hold up, and it couldn't without Conklin.    The poor blocking also affected the ground attack. Derrick Henry mustered just 28 yards on 12 carries. The Titans clearly missed DeMarco Murray; not as a runner, but as a receiving back, as he could've neutralized some of that poor pass protection.    Eric Decker led the Titans with six catches for 85 yards. Decker was called for offensive pass interference and a false start. The initial call was very questionable, and it was one of a few shaky penalties that went New England's way. There was one instance just before halftime where the clock stood at one second for an eternity, allowing the Patriots to kick a field goal. The attempt was no good, but it was still very dubious officiating. The worst example of poor officiating took place when the Patriots were punting deep in their own territory. They were up just 14-7, so it was still a close game, but New England strangely was given a free first down because, well, I don't know. New England false started, but the Titans were penalized for some reason. The Patriots continued the drive and scored to go up 21-7. At any rate, Tennessee's other receiver of note was Davis, who caught five passes for 63 yards and two touchdowns. Both end-zone catches were spectacular, and it gives the Titans great hope for their dynamic wideout moving forward. Delanie Walker, meanwhile, caught three passes for 49 yards.    The Titans need to improve their offensive line. Conklin's injury obviously played a big factor, but their interior isn't very good. I have Tennessee addressing this issue in my . <div class=dfpAdSlots>   ",
   "players":[
    {
     "player_id":"16086",
     "name":"DeMarco Murray",
     "position":"RB",
     "height":"6-0",
     "weight":"214",
     "current_team":"Tennessee Titans",
     "birth_date":"1988-02-12",
     "birth_place":"Las Vegas, NV",
     "death_date":"None",
     "college":"Oklahoma",
     "high_school":"Bishop Gorman, NV",
     "draft_team":"Dallas Cowboys",
     "draft_round":"3",
     "draft_position":"71",
     "draft_year":"2011",
     "current_salary":"6,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23085",
     "name":"Delanie Walker",
     "position":"TE",
     "height":"6-1",
     "weight":"241",
     "current_team":"Tennessee Titans",
     "birth_date":"1984-08-12",
     "birth_place":"Pomona, CA",
     "death_date":"None",
     "college":"Central Missouri St.",
     "high_school":"Pomona, CA",
     "draft_team":"San Francisco 49ers",
     "draft_round":"6",
     "draft_position":"175",
     "draft_year":"2006",
     "current_salary":"4,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23774",
     "name":"James White ",
     "position":"RB",
     "height":"5-9",
     "weight":"204",
     "current_team":"New England Patriots",
     "birth_date":"1992-02-03",
     "birth_place":"Fort Lauderdale, FL",
     "death_date":"None",
     "college":"Wisconsin",
     "high_school":"St. Thomas Aquinas, FL",
     "draft_team":"New England Patriots",
     "draft_round":"4",
     "draft_position":"130",
     "draft_year":"2014",
     "current_salary":"690,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4480",
     "name":"Brandin Cooks",
     "position":"WR",
     "height":"5-10",
     "weight":"189",
     "current_team":"New England Patriots",
     "birth_date":"1993-09-25",
     "birth_place":"Stockton, CA",
     "death_date":"None",
     "college":"Oregon St.",
     "high_school":"Lincoln, CA",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"20",
     "draft_year":"2014",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2240",
     "name":"Tom Brady ",
     "position":"QB",
     "height":"6-4",
     "weight":"225",
     "current_team":"New England Patriots",
     "birth_date":"1977-08-03",
     "birth_place":"San Mateo, CA",
     "death_date":"None",
     "college":"Michigan",
     "high_school":"Junipero Serra, CA",
     "draft_team":"New England Patriots",
     "draft_round":"6",
     "draft_position":"199",
     "draft_year":"2000",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14056",
     "name":"Marcus Mariota",
     "position":"QB",
     "height":"6-4",
     "weight":"215",
     "current_team":"Tennessee Titans",
     "birth_date":"1993-10-30",
     "birth_place":"Honolulu, HI",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Saint Louis, HI",
     "draft_team":"Tennessee Titans",
     "draft_round":"1",
     "draft_position":"2",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"382",
     "name":"Danny Amendola",
     "position":"WR",
     "height":"5-11",
     "weight":"183",
     "current_team":"New England Patriots",
     "birth_date":"1985-11-02",
     "birth_place":"The Woodlands, TX",
     "death_date":"None",
     "college":"Texas Tech",
     "high_school":"The Woodlands, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4396",
     "name":"Jack Conklin",
     "position":"OT",
     "height":"6-6",
     "weight":"308",
     "current_team":"Tennessee Titans",
     "birth_date":"1994-08-17",
     "birth_place":"Plainwell, MI",
     "death_date":"None",
     "college":"Michigan St.",
     "high_school":"Plainwell, MI",
     "draft_team":"Tennessee Titans",
     "draft_round":"1",
     "draft_position":"8",
     "draft_year":"2016",
     "current_salary":"1,172,621",
     "hof_induction_year":"None"
    },
    {
     "player_id":"3187",
     "name":"Kevin Byard",
     "position":"S",
     "height":"5-11",
     "weight":"216",
     "current_team":"Tennessee Titans",
     "birth_date":"1993-08-17",
     "birth_place":"Philadelphia, PA",
     "death_date":"None",
     "college":"Middle Tenn. St.",
     "high_school":"Martin Luther King, GA",
     "draft_team":"Tennessee Titans",
     "draft_round":"3",
     "draft_position":"64",
     "draft_year":"2016",
     "current_salary":"618,566",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13269",
     "name":"Dion Lewis",
     "position":"RB",
     "height":"5-8",
     "weight":"195",
     "current_team":"New England Patriots",
     "birth_date":"1990-09-27",
     "birth_place":"Brooklyn, NY",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Albany, NY",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"5",
     "draft_position":"149",
     "draft_year":"2011",
     "current_salary":"1,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"8573",
     "name":"Rob Gronkowski",
     "position":"TE",
     "height":"6-6",
     "weight":"265",
     "current_team":"New England Patriots",
     "birth_date":"1989-05-14",
     "birth_place":"Amherst, NY",
     "death_date":"None",
     "college":"Arizona",
     "high_school":"Williamsville North, NY",
     "draft_team":"New England Patriots",
     "draft_round":"2",
     "draft_position":"42",
     "draft_year":"2010",
     "current_salary":"4,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"5403",
     "name":"Eric Decker",
     "position":"WR",
     "height":"6-3",
     "weight":"206",
     "current_team":"Tennessee Titans",
     "birth_date":"1987-03-15",
     "birth_place":"Cold Spring, MN",
     "death_date":"None",
     "college":"Minnesota",
     "high_school":"Rocori, MN",
     "draft_team":"Denver Broncos",
     "draft_round":"3",
     "draft_position":"87",
     "draft_year":"2010",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10016",
     "name":"Chris Hogan ",
     "position":"WR",
     "height":"6-1",
     "weight":"220",
     "current_team":"New England Patriots",
     "birth_date":"1988-10-24",
     "birth_place":"Ramapo, NJ",
     "death_date":"None",
     "college":"Monmouth",
     "high_school":"Ramapo, NJ",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9653",
     "name":"Derrick Henry ",
     "position":"RB",
     "height":"6-3",
     "weight":"247",
     "current_team":"Tennessee Titans",
     "birth_date":"1994-01-04",
     "birth_place":"Yulee, FL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Yulee, FL",
     "draft_team":"Tennessee Titans",
     "draft_round":"2",
     "draft_position":"45",
     "draft_year":"2016",
     "current_salary":"695,815",
     "hof_induction_year":"None"
    },
    {
     "player_id":"5194",
     "name":"Corey Davis ",
     "position":"WR",
     "height":"6-3",
     "weight":"209",
     "current_team":"Tennessee Titans",
     "birth_date":"1995-01-11",
     "birth_place":"None",
     "death_date":"None",
     "college":"West. Michigan",
     "high_school":"Wheaton-Warrenville South, IL",
     "draft_team":"Tennessee Titans",
     "draft_round":"1",
     "draft_position":"5",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Jaguars",
    "Points":"45"
   },
   "Team 2":{
    "Name":"Steelers",
    "Points":"42"
   },
   "comments":" Everyone assumed that the Patriots and Steelers would once again meet in the AFC Championship, especially after Jacksonville struggled to beat Buffalo the previous week. Instead, the Jaguars spoiled the party by dominating this game from start to finish. The final score may say that the Steelers lost by just three points, but they trailed throughout, and even were down 28-7 at one point. They kept trying to come back, but several factors prevented them from getting over the hump. One happened to be their own stupidity. There were many examples of poor coaching throughout this game. The Steelers had two key fourth-and-1 attempts in this contest, yet failed on both. One was a long-developing pitch to Le'Veon Bell, which had no chance against a speedy defense. The other was a downfield shot to JuJu Smith-Schuster, who couldn't quite make the diving attempt. In both instances, Ben Roethlisberger probably could've picked up the first down with a sneak, so it's unclear why offensive coordinator Todd Haley opted not to go with that option. Haley isn't the only coach to blame. Mike Tomlin made the foolish decision to attempt an onside kick after drawing to within 42-35. The Steelers still had two timeouts remaining with 2:18 on the clock. Because they failed to recover the onside kick, the Jaguars were in position to kick a field goal. As it turns out, those three points really mattered because Pittsburgh was able to drive down the field and reach the end zone with just one second remaining in regulation. The other major factor in this loss was Ryan Shazier's absence. Many will point out that Pittsburgh was looking ahead to New England, but the truth is that the Steelers haven't been a good team without Shazier. They nearly lost to the Bengals and Ravens without Shazier, and their sole impressive victory was against the T.J. Yates-led Texans. Pittsburgh hasn't been able to stop the run without Shazier, and that would explain why Leonard Fournette was able to gash the Steelers so effectively in the opening half. Fournette gained 82 yards and two touchdowns on his first 12 carries. He hurt his ankle and limped off the field in the middle of the second quarter, but was able to return after halftime. Fournette didn't look quite the same after that, as his 13 second-half attempts went for just 27 yards. This is something to monitor next week. If Fournette (25-109-3) isn't 100 percent, it'll clearly impact Jacksonville's ability to pull another stunning upset.    Another reason the Jaguars may not be able to prevail in New England is Blake Bortles. The inconsistent quarterback made some clutch throws in this contest, but was doing so against a poor defense. He struggled mightily last week against the Bills, and New England's defense is closer to Buffalo than Shazier-less Pittsburgh. Also, Bill Belichick will effectively scheme against Bortles pretty easily. Bortles had a mixed performance in this contest. He barely completed half of his passes, going 14-of-26 for 214 yards and a touchdown. He threw some passes that could've been intercepted, as a couple of attempts were horrible downfield shots into double coverage. However, Bortles did well on play-action on the opening drive, and later in the game, he did a great job of moving the chains on a couple of drives. On one sequence, Bortles went through his progressions on a third down to find T.J. Yeldon for a short toss, which Yeldon turned into a gain of 40 yards. Bortles then hit Dede Westbrook for an 8-yard conversion on third-and-4. He capped off the drive by lofting a touch pass to a wide-open Tommy Bohanon for a touchdown to put the Jaguars up 42-28. Bortles also ran well, scrambling five times for 35 rushing yards. In two weeks, we've seen the bad and good Bortles. The Jaguars need the latter Bortles to show up in New England; otherwise, they won't have much of a chance versus Tom Brady.    Thanks to the 40-yard catch, Yeldon led the Jaguars in receiving, as he caught three passes for 57 yards. Keelan Cole was the only other Jaguar to eclipse 30 receiving yards, as he was able to snatch a 45-yard bomb in the fourth quarter to set up a quick touchdown. As for Marqise Lee, he caught three passes for 28 yards. He limped off the field at the beginning of the game, but didn't miss much action. <div class=dfpAdSlots>    Going back to the Steelers, Ben Roethlisberger posted some ridiculous numbers - 37-of-58, 469 yards, five touchdowns, one interception - so congratulations if you used him in FanDuel. However, Roethlisberger didn't perform up to those stats. He was lucky to get away with only one pick, though that interception was an incredible play by Myles Jack where the talented linebacker tipped the ball to himself, then controlled it just as he got both feet inbounds prior to falling out of play. In the second quarter, Roethlisberger held on to the ball too long and was strip-sacked. Telvin Smith scooped up the ball and ran back the other way for six. Those were Roethlisberger's only turnovers, but he could've had several more. Paul Posluszny dropped a pick when the Jaguars were up 21-0. A couple of other passes of his were tipped into the air and nearly intercepted. There was another dropped pick just prior to a touchdown that trimmed the margin to 35-28. Despite the loss, this game could've gone so much worse for Roethlisberger. Speaking of Roethlisberger, I have Pittsburgh selecting his successor in my .    Antonio Brown made his return from injury, but anyone who hasn't been paying attention to football could've never guessed that he was playing in his first game back after getting hurt. Brown made some clutch catches, reeling in seven of his 11 targets for 132 yards and two touchdowns. His first score was a perfect drop-in-the-bucket pass by Roethlisberger, while the second was a desperation catch on fourth down to make the game 35-28. Elsewhere in the receiving corps, Vance McDonald had a big performance, catching a ridiculous 10 passes for 112 yards. Meanwhile, Martavis Bryant (2-78) and Smith-Schuster (3-5) both caught touchdowns.    Like Brown, Bell was exceptional. He didn't get many opportunities on the ground because the Steelers were constantly trailing, so he was limited to 67 yards on 16 carries. However, he was a big factor in the passing attack, catching nine passes for 88 receiving yards. He scored twice. <div class=dfpAdSlots>   ",
   "players":[
    {
     "player_id":"10714",
     "name":"Myles Jack",
     "position":"OLB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-09-03",
     "birth_place":"Scottsdale, AZ",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Bellevue, WA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"36",
     "draft_year":"2016",
     "current_salary":"737,929",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4208",
     "name":"Keelan Cole",
     "position":"WR",
     "height":"6-1",
     "weight":"194",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-04-20",
     "birth_place":"None",
     "death_date":"None",
     "college":"None",
     "high_school":"None",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20043",
     "name":"Ryan Shazier",
     "position":"OLB",
     "height":"6-1",
     "weight":"237",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1992-09-06",
     "birth_place":"Fort Lauderdale, FL",
     "death_date":"None",
     "college":"Ohio St.",
     "high_school":"Plantation, FL",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"1",
     "draft_position":"15",
     "draft_year":"2014",
     "current_salary":"1,716,438",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7203",
     "name":"Leonard Fournette ",
     "position":"RB",
     "height":"6-0",
     "weight":"240",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-01-18",
     "birth_place":"New Orleans, LA",
     "death_date":"None",
     "college":"LSU",
     "high_school":"St. Augustine, LA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"4",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20789",
     "name":"Telvin Smith",
     "position":"ILB",
     "height":"6-3",
     "weight":"218",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1991-04-11",
     "birth_place":"Valdosta, GA",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Lowndes, GA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"5",
     "draft_position":"144",
     "draft_year":"2014",
     "current_salary":"1,797,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14688",
     "name":"Vance McDonald",
     "position":"TE",
     "height":"6-4",
     "weight":"267",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1990-06-13",
     "birth_place":"Winnie, TX",
     "death_date":"None",
     "college":"Rice",
     "high_school":"East Chambers, TX",
     "draft_team":"San Francisco 49ers",
     "draft_round":"2",
     "draft_position":"55",
     "draft_year":"2013",
     "current_salary":"2,100,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23665",
     "name":"Dede Westbrook",
     "position":"WR",
     "height":"6-0",
     "weight":"178",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-11-21",
     "birth_place":"None",
     "death_date":"None",
     "college":"Oklahoma",
     "high_school":"None",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"4",
     "draft_position":"110",
     "draft_year":"2017",
     "current_salary":"348,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"17827",
     "name":"Paul Posluszny",
     "position":"LB",
     "height":"6-2",
     "weight":"238",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1984-10-10",
     "birth_place":"Butler, PA",
     "death_date":"None",
     "college":"Penn St.",
     "high_school":"Hopewell, PA",
     "draft_team":"Buffalo Bills",
     "draft_round":"2",
     "draft_position":"34",
     "draft_year":"2007",
     "current_salary":"3,950,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18977",
     "name":"Ben Roethlisberger",
     "position":"QB",
     "height":"6-5",
     "weight":"240",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1982-03-02",
     "birth_place":"Lima, OH",
     "death_date":"None",
     "college":"Miami (OH)",
     "high_school":"Findlay, OH",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"1",
     "draft_position":"11",
     "draft_year":"2004",
     "current_salary":"12,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1465",
     "name":"Le'Veon Bell",
     "position":"RB",
     "height":"6-2",
     "weight":"230",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1992-02-18",
     "birth_place":"Reynoldsburg, OH",
     "death_date":"None",
     "college":"Michigan St.",
     "high_school":"Groveport Madison, OH",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"2",
     "draft_position":"48",
     "draft_year":"2013",
     "current_salary":"12,120,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"24845",
     "name":"T.J. Yeldon",
     "position":"RB",
     "height":"6-2",
     "weight":"221",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-10-02",
     "birth_place":"Daphne, AL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Daphne, AL",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"36",
     "draft_year":"2015",
     "current_salary":"972,617",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1942",
     "name":"Tommy Bohanon",
     "position":"FB",
     "height":"6-1",
     "weight":"246",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1990-09-10",
     "birth_place":"Cape Coral, FL",
     "death_date":"None",
     "college":"Wake Forest",
     "high_school":"North Fort Myers, FL",
     "draft_team":"New York Jets",
     "draft_round":"7",
     "draft_position":"215",
     "draft_year":"2013",
     "current_salary":"690,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2857",
     "name":"Martavis Bryant",
     "position":"WR",
     "height":"6-4",
     "weight":"211",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1991-12-20",
     "birth_place":"Calhoun Falls, SC",
     "death_date":"None",
     "college":"Clemson",
     "high_school":"T.L. Hanna, SC",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"4",
     "draft_position":"118",
     "draft_year":"2014",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2544",
     "name":"Antonio Brown ",
     "position":"WR",
     "height":"5-10",
     "weight":"180",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1988-07-10",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Central Michigan",
     "high_school":"Norland, FL",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"6",
     "draft_position":"195",
     "draft_year":"2010",
     "current_salary":"910,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20827",
     "name":"JuJu Smith-Schuster",
     "position":"WR",
     "height":"6-1",
     "weight":"215",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1996-11-22",
     "birth_place":"None",
     "death_date":"None",
     "college":"USC",
     "high_school":"None",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"2",
     "draft_position":"62",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Vikings",
    "Points":"29"
   },
   "Team 2":{
    "Name":"Saints",
    "Points":"24"
   },
   "comments":" It's amazing how the Vikings keep blowing games in the playoffs. Whether it's missed field goals in overtime, errant chip-shot kicks at the end of regulation, or horrible interceptions on the final possession of the game, Minnesota somehow finds ways to lose postseason contests to break the hearts of their fans. So, when something like this happens, you have to wonder if this is a team of destiny. Minnesota led 17-0, but had a fourth-quarter collapse. The defense, missing concussed safety Andrew Sendejo, suddenly couldn't stop Drew Brees. The officials were doing all they could as well, somehow not calling an obvious pass interference on Adam Thielen that would've extended a Viking drive into New Orleans territory. The Saints followed that up with a blocked punt, and following a series of field goals, the Vikings were down 24-23 with 25 seconds left. Minnesota moved to its own 39-yard line with 10 seconds and no timeouts remaining, and all hope seemed to be lost. Case Keenum launched a pass to Stefon Diggs to perhaps get somewhat close to borderline field-goal range. However, safety Marcus Williams took a horrible angle and missed Diggs, and the stellar wideout was able to go the distance. It was a 61-yard touchdown to win the game as time expired. Incredible. Viking fans have waited their entire lifetime for a playoff win like this. I'm sure they'll still be guarded, given what they've seen throughout their team's history, but perhaps they're starting to believe that this team will finally be the one to give the franchise its first Super Bowl victory.    Keenum certainly had a roller-coaster game. He thrived in the opening half, completing 12-of-18 passes for 113 yards. He was exceptional on third down, converting eight of his first 10 attempts. He took a 17-0 lead into the break, a score that would've been 20-0 had Kai Forbath not missed a 49-yard field goal. Keenum struggled after that, taking a bad sack from Sheldon Rankins to move out of field-goal range and then throwing a miserable interception, which he lofted up for grabs amid pressure. This set up a New Orleans touchdown, and the Saints drew to within three. Keenum improved after that, connecting on a 27-yard pass and then converting a key third down. Keenum then found Adam Thielen for a 24-yard gain, as Thielen made a ridiculous leaping catch. That set up a 53-yard field goal that gave the Vikings the lead with about 1:20 remaining. The Saints hit a field goal of their own, but then the magical finish happened to save Minnesota's season. Keenum's final numbers were 25-of-40 for 318 yards, one touchdown and a pick. His numbers obviously didn't look as good prior to Diggs' 61-yard score to win the game, but Keenum also could've posted better stats had New Orleans defenders not interfered with his receivers repeatedly. Quarterbacks making their first playoff start tend to struggle, so outside of that one horrible interception, this was a strong performance overall by the upstart signal-caller.    Diggs, the hero, was able to lead the Vikings in receiving even before the decisive score. He caught six of his 10 targets for 137 yards and the touchdown, and those numbers don't include two pass-interference flags that he drew. Thielen, meanwhile, made six grabs for 94 yards, which includes two incredible leaping receptions. Kyle Rudolph (5-28) wasn't as productive despite seeing eight targets.    The Vikings continued to pound the rock with their two running backs, and both found the end zone. Latavius Murray mustered 50 yards on 19 carries, while Jerick McKinnon tallied 34 yards on eight attempts. Saints cornerback Ken Crawley, who was flagged for two pass interferences on Minnesota's second drive (one legit, one bogus) made a great stop on McKinnon on a third-and-1 attempt. <div class=dfpAdSlots>    Unlike Keenum, Drew Brees struggled early. He failed to complete 50 percent of his passes in the opening half, connecting on eight of his 18 throws. He threw two interceptions, one of which was a deep shot, while the other was the result of a tipped pass in the red zone. He also fumbled, but center Max Unger recovered. Brees appeared to throw a touchdown to Ted Ginn in the second quarter, but that was wiped out by an illegal shift. Brees, however, came to life following halftime. Thanks in part to Sendejo's injury, Brees was 17-of-26 for 177 yards and three touchdowns in the second half. He did a great job of putting together what should've been the game-winning drive, completing a pass to Willie Snead on fourth-and-10 to move Wil Lutz into position to attempt a 43-yard field goal. Brees did what he could versus a monstrous defense, yet came up short because of a miraculous play.    Alvin Kamara was a huge part of the game plan, as expected, though he was given just two carries in the opening half. He was on the field much more than Mark Ingram in the second half, however, and he actually ended up with more attempts, 11-10. The Vikings did a great job against Kamara on the ground - 11 carries, 43 rushing yards - but he did most of his work as a receiver, hauling in four balls for 62 receiving yards and a touchdown. Ingram, meanwhile, was limited to 25 yards on 10 attempts. He was stuffed on an early third-and-1.    Michael Thomas led the Saints in receiving with seven grabs for 85 yards and two touchdowns. One of the scores occurred when Xavier Rhodes left the game temporarily, but he still had a great performance, especially considering that he was responsible for knocking out Sendejo. Ted Ginn (8-72) also was a key contributor.    The Saints could add to their secondary this April. I have them taking a safety in my . <div class=dfpAdSlots> <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span>   ",
   "players":[
    {
     "player_id":"24171",
     "name":"Marcus Williams",
     "position":"CB",
     "height":"5-11",
     "weight":"196",
     "current_team":"Houston Texans",
     "birth_date":"1991-03-24",
     "birth_place":"Minneapolis, MN",
     "death_date":"None",
     "college":"North Dakota St.",
     "high_school":"Hopkins, MN",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,746,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19930",
     "name":"Andrew Sendejo",
     "position":"DB",
     "height":"6-1",
     "weight":"225",
     "current_team":"Minnesota Vikings",
     "birth_date":"1987-09-09",
     "birth_place":"San Antonio, TX",
     "death_date":"None",
     "college":"Rice",
     "high_school":"Smithson Valley, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,950,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7916",
     "name":"Ted Ginn",
     "position":"WR",
     "height":"5-11",
     "weight":"178",
     "current_team":"New Orleans Saints",
     "birth_date":"1985-04-12",
     "birth_place":"Cleveland, OH",
     "death_date":"None",
     "college":"Ohio St.",
     "high_school":"Glenville, OH",
     "draft_team":"Miami Dolphins",
     "draft_round":"1",
     "draft_position":"9",
     "draft_year":"2007",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11999",
     "name":"Case Keenum",
     "position":"QB",
     "height":"6-2",
     "weight":"209",
     "current_team":"Minnesota Vikings",
     "birth_date":"1988-02-17",
     "birth_place":"Abilene, TX",
     "death_date":"None",
     "college":"Houston",
     "high_school":"Wylie, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"950,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11877",
     "name":"Alvin Kamara",
     "position":"RB",
     "height":"5-10",
     "weight":"214",
     "current_team":"New Orleans Saints",
     "birth_date":"1995-07-25",
     "birth_place":"None",
     "death_date":"None",
     "college":"Tennessee",
     "high_school":"None",
     "draft_team":"New Orleans Saints",
     "draft_round":"3",
     "draft_position":"67",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"24172",
     "name":"Marcus Williams ",
     "position":"S",
     "height":"6-1",
     "weight":"202",
     "current_team":"New Orleans Saints",
     "birth_date":"1996-09-08",
     "birth_place":"None",
     "death_date":"None",
     "college":"Utah",
     "high_school":"None",
     "draft_team":"New Orleans Saints",
     "draft_round":"2",
     "draft_position":"42",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20837",
     "name":"Willie Snead ",
     "position":"WR",
     "height":"5-11",
     "weight":"195",
     "current_team":"New Orleans Saints",
     "birth_date":"1992-10-17",
     "birth_place":"Winter Park, FL",
     "death_date":"None",
     "college":"Ball St.",
     "high_school":"Muskegon Heights, MI",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10635",
     "name":"Mark Ingram",
     "position":"RB",
     "height":"5-10",
     "weight":"215",
     "current_team":"New Orleans Saints",
     "birth_date":"1989-12-21",
     "birth_place":"Hackensack, NJ",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Southwestern Academy, MI",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"28",
     "draft_year":"2011",
     "current_salary":"3,100,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13722",
     "name":"Wil Lutz",
     "position":"K",
     "height":"5-11",
     "weight":"184",
     "current_team":"New Orleans Saints",
     "birth_date":"1994-07-07",
     "birth_place":"Newnan, GA",
     "death_date":"None",
     "college":"Georgia St.",
     "high_school":"Northgate, GA",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18208",
     "name":"Sheldon Rankins",
     "position":"DT",
     "height":"6-1",
     "weight":"299",
     "current_team":"New Orleans Saints",
     "birth_date":"1994-04-02",
     "birth_place":"Covington, GA",
     "death_date":"None",
     "college":"Louisville",
     "high_school":"Eastside, GA",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"12",
     "draft_year":"2016",
     "current_salary":"1,031,893",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14897",
     "name":"Jerick McKinnon ",
     "position":"RB",
     "height":"5-9",
     "weight":"205",
     "current_team":"Minnesota Vikings",
     "birth_date":"1992-05-03",
     "birth_place":"Atlanta, GA",
     "death_date":"None",
     "college":"Georgia Southern",
     "high_school":"Sprayberry, GA",
     "draft_team":"Minnesota Vikings",
     "draft_round":"3",
     "draft_position":"96",
     "draft_year":"2014",
     "current_salary":"700,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7114",
     "name":"Kai Forbath",
     "position":"K",
     "height":"5-11",
     "weight":"191",
     "current_team":"Minnesota Vikings",
     "birth_date":"1987-09-02",
     "birth_place":"Santa Monica, CA",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Notre Dame, CA",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"775,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"21992",
     "name":"Adam Thielen",
     "position":"WR",
     "height":"6-3",
     "weight":"200",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-08-22",
     "birth_place":"Detroit Lakes, MN",
     "death_date":"None",
     "college":"Minnesota St.",
     "high_school":"Detroit Lakes, MN",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,746,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22094",
     "name":"Michael Thomas",
     "position":"S",
     "height":"5-11",
     "weight":"196",
     "current_team":"Miami Dolphins",
     "birth_date":"1989-03-17",
     "birth_place":"Houston, TX",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Nimitz, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,797,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19223",
     "name":"Kyle Rudolph ",
     "position":"TE",
     "height":"6-5",
     "weight":"265",
     "current_team":"Minnesota Vikings",
     "birth_date":"1989-11-09",
     "birth_place":"Cincinnati, OH",
     "death_date":"None",
     "college":"Notre Dame",
     "high_school":"Elder, OH",
     "draft_team":"Minnesota Vikings",
     "draft_round":"2",
     "draft_position":"43",
     "draft_year":"2011",
     "current_salary":"5,150,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22095",
     "name":"Michael Thomas",
     "position":"WR",
     "height":"6-3",
     "weight":"212",
     "current_team":"New Orleans Saints",
     "birth_date":"1993-03-03",
     "birth_place":"Los Angeles, CA",
     "death_date":"None",
     "college":"Ohio St.",
     "high_school":"Fork Union Military Academy, VA",
     "draft_team":"New Orleans Saints",
     "draft_round":"2",
     "draft_position":"47",
     "draft_year":"2016",
     "current_salary":"682,681",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16093",
     "name":"Latavius Murray",
     "position":"RB",
     "height":"6-3",
     "weight":"225",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-01-18",
     "birth_place":"Titusville, FL",
     "death_date":"None",
     "college":"Central Florida",
     "high_school":"Onondaga Central, NY",
     "draft_team":"Oakland Raiders",
     "draft_round":"6",
     "draft_position":"181",
     "draft_year":"2013",
     "current_salary":"900,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"22747",
     "name":"Max Unger",
     "position":"C",
     "height":"6-4",
     "weight":"299",
     "current_team":"New Orleans Saints",
     "birth_date":"1986-04-14",
     "birth_place":"Kailua-Kona, HI",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Hawaii Prep Academy, HI",
     "draft_team":"Seattle Seahawks",
     "draft_round":"2",
     "draft_position":"49",
     "draft_year":"2009",
     "current_salary":"1,700,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2328",
     "name":"Drew Brees",
     "position":"QB",
     "height":"6-0",
     "weight":"209",
     "current_team":"New Orleans Saints",
     "birth_date":"1979-01-15",
     "birth_place":"Austin, TX",
     "death_date":"None",
     "college":"Purdue",
     "high_school":"Westlake, TX",
     "draft_team":"San Diego Chargers",
     "draft_round":"2",
     "draft_position":"32",
     "draft_year":"2001",
     "current_salary":"13,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"5642",
     "name":"Stefon Diggs",
     "position":"WR",
     "height":"6-0",
     "weight":"195",
     "current_team":"Minnesota Vikings",
     "birth_date":"1993-11-29",
     "birth_place":"Gaithersburg, MD",
     "death_date":"None",
     "college":"Maryland",
     "high_school":"Our Lady of Good Counsel, MD",
     "draft_team":"Minnesota Vikings",
     "draft_round":"5",
     "draft_position":"146",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4751",
     "name":"Ken Crawley",
     "position":"DB",
     "height":"6-1",
     "weight":"180",
     "current_team":"New Orleans Saints",
     "birth_date":"1993-04-08",
     "birth_place":"None",
     "death_date":"None",
     "college":"Colorado",
     "high_school":"None",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18545",
     "name":"Xavier Rhodes",
     "position":"CB",
     "height":"6-2",
     "weight":"210",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-06-19",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Norland, FL",
     "draft_team":"Minnesota Vikings",
     "draft_round":"1",
     "draft_position":"25",
     "draft_year":"2013",
     "current_salary":"8,026,000",
     "hof_induction_year":"None"
    }
   ]
  }
 ]
}
