{
 "week":"20",
 "year":"2017",
 "numberOfGames":"2",
 "games":[
  {
   "Team 1":{
    "Name":"Patriots",
    "Points":"24"
   },
   "Team 2":{
    "Name":"Jaguars",
    "Points":"20"
   },
   "comments":" It looked like the Patriots might lose in the AFC Championship for a while. Save for an early 3-0 advantage, they didn't have the lead until very late in the game. In fact, they trailed by double digits with nine minutes remaining in regulation. And yet, no one was going to give up on the greatest coach-and-quarterback combinations of all time, especially after they came back from down 28-3 in last year's Super Bowl. The Patriots predictably rallied to make their eighth trip to the Super Bowl under this current regime. The Patriots were down by 10 in the final quarter because they blew some key scoring opportunities. Brandin Cooks dropped a 30-yard pass in the third quarter to set up a potential possession in the red zone. Dion Lewis took a big gain on a crazy trick play deep into Jacksonville territory, but Myles Jack stripped the ball away from him. And then there was Rob Gronkowski's injury; the All-Pro tight end suffered a concussion when Barry Church slammed his helmet into Gronkowski's. As a result, Gronkowski was out for the entire second half, and this made it easier for the Jaguars to stop the Patriots in the third quarter. Sure, New England made a couple of major blunders, but the team also had some stalled drives, thanks to Gronkowski's absence. Of course, Tom Brady would not be denied. The key play of the game was a third-and-18 he faced while down 20-10 in the fourth quarter. He threw a 21-yard strike to Danny Amendola to move the chains, and the drive ultimately concluded with an Amendola touchdown. Following a stop by the New England defense where James Harrison pressured Blake Bortles on third down, the Jaguars were guilty of a bad punt. James White had a big gain, and this set up yet another Amendola touchdown to give the Patriots the lead for good. The Jaguars had one more chance. They drove just over midfield, but a Harrison sack put Bortles into a third-and-long situation. The Patriots took over soon after, and a Lewis run for a first down clinched the victory for New England. <div class=dfpAdSlots>    Brady, proving once again that he's the greatest quarterback of all time, went 26-of-38 for 290 yards and two touchdowns versus the league's top pass defense. There was major concern about his injured hand heading into this game - so much so that the spread dropped 1.5 points - but he proved that everything was OK when he hit Cooks with a 31-yard completion on his second throw of the afternoon. And in case there still were skeptics, Brady then dropped the ball right into the bucket to Amendola for a gain of 21. This opening drive culminated with a field goal, thanks to a third-down sack. Brady looked like he was having issues with the pass rush in the early going. There was one play where Brady saw phantom pressure, as he ducked to avoid a defender who wasn't there. Brady eventually took a sack on that play anyway, and thanks to the heat he saw, he nearly had an interception when Tashaun Gipson dropped the ball. However, New England's offensive line did much better in the second half. He saw very few pressures during his fourth-quarter comeback. It's also worth noting that Brady's numbers could've been much better. I mentioned Cooks' dropped 30-yard pass. Gronkowski also had a miscue on a long play, letting a potential 40-yard completion slip through his hands. Brady easily could've eclipsed the 300-yard barrier, and the Patriots probably should've won by more than just four points. The Jaguars played as well as they could, but it just wasn't enough.    Cooks, despite his big drop, led the Patriots with six catches for 100 yards. He also drew two long pass-interference penalties, so his stats could have been much better as well. Amendola, meanwhile, was the only other Patriot with more than 32 receiving yards. His seven catches went for 84 yards, and he came up with two touchdowns in the final quarter. Gronkowski, meanwhile, managed just one reception for 21 yards, thanks to his absence in the entire second half. He was legitimately concussed, as he was wobbly after getting up. Fortunately for the Patriots, Gronkowski will have two weeks to clear concussion protocol.    The Patriots struggled to run the ball, but they had an 18-yard run to complete the game. Lewis led the way with 34 yards on nine carries. His aforementioned fumble appeared as though it was going to cost New England, but Lewis made amends for it. <div class=dfpAdSlots>    As for the Jaguars, Bortles actually had a similar numbers compared to Brady, as he finished 23-of-36 for 293 yards and a touchdown. Stats are sometimes misleading, but Bortles' certainly weren't. He played one of the best games of his career, and he even completed 12 passes at one point. It was bizarre, especially after he was so woeful two weeks ago versus Buffalo. If that Bortles showed up, the Patriots would've won this contest very easily. Bortles began the game with a miscue, throwing behind Marqise Lee on third down. He improved a lot after that, as the coaching staff did a good job of building his confidence by giving him easy throws. The next possession culminated with a touchdown throw to Marcedes Lewis, and the Jaguars marched down the field very easily on the next drive to establish a 14-3 lead. Bortles' best throw of the afternoon was a ridiculous back-shoulder pass to Keelan Cole to pick up a third-and-10. Bortles made another tremendous throw after that to apparently move the chains once again, hitting Lewis near the sideline, but the play was nullified by an inexplicable delay-of-game penalty coming off a timeout. That was one of the turning points of the game, as the Jaguars would've been in field-goal range to potentially go up 17-3. Poor protection was ultimately Bortles' downfall, as the line failed to shield him on his final two drives. I have Jacksonville selecting a tackle in my .    Part of the reason Bortles was so successful prior to the fourth quarter was because the Patriots had trouble stopping the run. Alan Branch's absence allowed Leonard Fournette to have some big gains; he picked up 40 yards and a touchdown on his initial 11 carries. However, he failed to gain three yards per carry following intermission, as New England made the correct adjustments. Fournette finished with 76 yards and a touchdown on 24 attempts.    Jacksonville needs to find a No. 1 receiver if Allen Robinson departs in free agency. Allen Hurns was the leading wideout, catching six passes for 80 yards. Lee (4-41) saw the most targets (8). Here are the . <div class=dfpAdSlots> <div class=dfpAdSlots> <div class=dfpAdSlots> <div class=dfpAdSlots>   ",
   "players":[
    {
     "player_id":"3897",
     "name":"Barry Church",
     "position":"DB",
     "height":"6-1",
     "weight":"222",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1988-02-11",
     "birth_place":"Pittsburgh, PA",
     "death_date":"None",
     "college":"Toledo",
     "high_school":"Penn Hills, PA",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10714",
     "name":"Myles Jack",
     "position":"OLB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-09-03",
     "birth_place":"Scottsdale, AZ",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Bellevue, WA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"36",
     "draft_year":"2016",
     "current_salary":"737,929",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7921",
     "name":"Tashaun Gipson",
     "position":"DB",
     "height":"5-11",
     "weight":"206",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1990-08-07",
     "birth_place":"Waynesville, MO",
     "death_date":"None",
     "college":"Wyoming",
     "high_school":"Justin F. Kimball, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"5,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4208",
     "name":"Keelan Cole",
     "position":"WR",
     "height":"6-1",
     "weight":"194",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-04-20",
     "birth_place":"None",
     "death_date":"None",
     "college":"None",
     "high_school":"None",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23774",
     "name":"James White",
     "position":"RB",
     "height":"5-9",
     "weight":"204",
     "current_team":"New England Patriots",
     "birth_date":"1992-02-03",
     "birth_place":"Fort Lauderdale, FL",
     "death_date":"None",
     "college":"Wisconsin",
     "high_school":"St. Thomas Aquinas, FL",
     "draft_team":"New England Patriots",
     "draft_round":"4",
     "draft_position":"130",
     "draft_year":"2014",
     "current_salary":"690,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13113",
     "name":"Marqise Lee",
     "position":"WR",
     "height":"6-0",
     "weight":"192",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1991-11-25",
     "birth_place":"Inglewood, CA",
     "death_date":"None",
     "college":"USC",
     "high_school":"Junipera Serra, CA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"39",
     "draft_year":"2014",
     "current_salary":"1,125,549",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7203",
     "name":"Leonard Fournette",
     "position":"RB",
     "height":"6-0",
     "weight":"240",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1995-01-18",
     "birth_place":"New Orleans, LA",
     "death_date":"None",
     "college":"LSU",
     "high_school":"St. Augustine, LA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"4",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13302",
     "name":"Marcedes Lewis",
     "position":"TE",
     "height":"6-6",
     "weight":"255",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1984-05-19",
     "birth_place":"Long Beach, CA",
     "death_date":"None",
     "college":"UCLA",
     "high_school":"Long Beach Polytechnic, CA",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"28",
     "draft_year":"2006",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4480",
     "name":"Brandin Cooks",
     "position":"WR",
     "height":"5-10",
     "weight":"189",
     "current_team":"New England Patriots",
     "birth_date":"1993-09-25",
     "birth_place":"Stockton, CA",
     "death_date":"None",
     "college":"Oregon St.",
     "high_school":"Lincoln, CA",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"20",
     "draft_year":"2014",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2240",
     "name":"Tom Brady",
     "position":"QB",
     "height":"6-4",
     "weight":"225",
     "current_team":"New England Patriots",
     "birth_date":"1977-08-03",
     "birth_place":"San Mateo, CA",
     "death_date":"None",
     "college":"Michigan",
     "high_school":"Junipero Serra, CA",
     "draft_team":"New England Patriots",
     "draft_round":"6",
     "draft_position":"199",
     "draft_year":"2000",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2038",
     "name":"Blake Bortles",
     "position":"QB",
     "height":"6-5",
     "weight":"232",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1992-04-28",
     "birth_place":"Oviedo, FL",
     "death_date":"None",
     "college":"Central Florida",
     "high_school":"Oviedo, FL",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"1",
     "draft_position":"3",
     "draft_year":"2014",
     "current_salary":"3,236,565",
     "hof_induction_year":"None"
    },
    {
     "player_id":"382",
     "name":"Danny Amendola",
     "position":"WR",
     "height":"5-11",
     "weight":"183",
     "current_team":"New England Patriots",
     "birth_date":"1985-11-02",
     "birth_place":"The Woodlands, TX",
     "death_date":"None",
     "college":"Texas Tech",
     "high_school":"The Woodlands, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9258",
     "name":"James Harrison",
     "position":"LB",
     "height":"6-0",
     "weight":"242",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1978-05-04",
     "birth_place":"Akron, OH",
     "death_date":"None",
     "college":"Kent St.",
     "high_school":"Coventry, OH",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"1,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13269",
     "name":"Dion Lewis",
     "position":"RB",
     "height":"5-8",
     "weight":"195",
     "current_team":"New England Patriots",
     "birth_date":"1990-09-27",
     "birth_place":"Brooklyn, NY",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Albany, NY",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"5",
     "draft_position":"149",
     "draft_year":"2011",
     "current_salary":"1,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"8573",
     "name":"Rob Gronkowski",
     "position":"TE",
     "height":"6-6",
     "weight":"265",
     "current_team":"New England Patriots",
     "birth_date":"1989-05-14",
     "birth_place":"Amherst, NY",
     "death_date":"None",
     "college":"Arizona",
     "high_school":"Williamsville North, NY",
     "draft_team":"New England Patriots",
     "draft_round":"2",
     "draft_position":"42",
     "draft_year":"2010",
     "current_salary":"4,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10549",
     "name":"Allen Hurns",
     "position":"WR",
     "height":"6-3",
     "weight":"195",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1991-11-12",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Miami (FL)",
     "high_school":"Miami Carol City, FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"7,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2256",
     "name":"Alan Branch",
     "position":"DT",
     "height":"6-6",
     "weight":"324",
     "current_team":"New England Patriots",
     "birth_date":"1984-12-29",
     "birth_place":"Albuquerque, NM",
     "death_date":"None",
     "college":"Michigan",
     "high_school":"Cibola, NM",
     "draft_team":"Arizona Cardinals",
     "draft_round":"2",
     "draft_position":"33",
     "draft_year":"2007",
     "current_salary":"1,750,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18833",
     "name":"Allen Robinson",
     "position":"WR",
     "height":"6-3",
     "weight":"220",
     "current_team":"Jacksonville Jaguars",
     "birth_date":"1993-08-24",
     "birth_place":"Detroit, MI",
     "death_date":"None",
     "college":"Penn St.",
     "high_school":"St. Mary's Prep, MI",
     "draft_team":"Jacksonville Jaguars",
     "draft_round":"2",
     "draft_position":"61",
     "draft_year":"2014",
     "current_salary":"898,755",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Eagles",
    "Points":"38"
   },
   "Team 2":{
    "Name":"Vikings",
    "Points":"7"
   },
   "comments":" When Carson Wentz suffered a season-ending torn ACL against the Rams, some in Philadelphia remained confident that their team could still make a run to the Super Bowl. That belief was seemingly shattered when the Eagles had trouble beating the Giants and Raiders. In fact, their offense was so poor versus Oakland that Doug Pederson wanted Nick Foles to play about a quarter of a meaningless game versus Dallas. Foles had issues completing forward passes in that contest, and things looked bleak. Now, the Eagles are inexplicably going to the Super Bowl, thanks to an otherworldly performance by Foles against the best defense in the NFC. And I'm still not sure how it happened. The Vikings, despite losing 38-7, actually led by a touchdown in this game. They opened with a nine-play drive that culminated with a touchdown pass to Kyle Rudolph. The Eagles punted after that, and Minnesota engineered another promising drive that featured a third-and-10 conversion to Stefon Diggs. It appeared as though the Vikings might score again to go up double digits, but Chris Long made one of the key plays of the game. He hit Case Keenum's arm, and the ball fluttered as a consequence. Philadelphia cornerback Patrick Robinson caught it and ran back the other way for a touchdown. This still seemed like Minnesota's game, as the pick-six appeared to be a hiccup. Surely, their defense would crush Foles, but the opposite happened. Foles made sharp throws throughout the evening, particularly on third down. He converted eight of his initial 10 third downs, and some of them happened to be long-yardage situations. For instance, he stepped up in the pocket to avoid pressure on a third-and-8 to find Zach Ertz for a 15-yard gain on one of his early conversions. Foles finished 26-of-33 for 352 yards and three touchdowns, and he was every bit as good as those numbers indicate. He did more than just convert third downs, which is no easy feat. He completed multiple deep bombs. The first occurred when he was under heavy pressure, and he launched a 53-yard touchdown to Alshon Jeffery, who was able to break loose from Terence Newman. With Xavier Rhodes temporarily sidelined, Newman had no chance to cover Jeffery on the play. Foles followed that up by hitting Zach Ertz for a 36-yard completion right down the sideline right before halftime to set up a field goal. Foles wasn't done despite owning a big lead in the third quarter. He drilled Torrey Smith with a 41-yard touchdown on a flea flicker. In total, Foles had four completions of 36 yards or longer. This type of performance was extremely inexplicable, especially when considering that Foles struggled to complete forward passes versus inferior defenses. Foles was battling the best stop unit in the NFC, and yet he tore through it like tissue paper. Everyone associated with the Vikings' organization, particularly Mike Zimmer, needs to be embarrassed by this performance. No one would've criticized Minnesota too harshly for just losing, but to allow 31 points to Philadelphia's struggling offense was inexcusable.    Ertz led the Eagles with eight receptions for 93 yards, while Jeffery (5-85) snatched two touchdowns. Smith (5-68) secured the other score, while Nelson Agholor (3-59) also caught a deep pass, a 42-yarder.    Jay Ajayi didn't have a great stat line, but he had some surprising, punishing runs against a Minnesota stop unit that shut down the Saints' rushing attack. Ajayi picked up 73 yards on 18 carries. He lost a touchdown to LeGarrette Blount (6-21), who plowed through the Vikings on his way into the end zone. <div class=dfpAdSlots>    Though the Vikings scored just seven points, Case Keenum can't exactly be blamed for this loss. He had a great first drive, and he converted some third downs to keep the chains moving. However, Philadelphia's pressure forced three turnovers. The pick-six was mentioned. Keenum was then strip-sacked in the red zone on what appeared to be a promising possession. The tight end whiffed on a block, and Derek Barnett was able to knock the ball out of Keenum's hand. The third give-away was a red-zone interception in the fourth quarter, but the game was decided by then. Keenum finished 28-of-48 for 271 yards, one touchdown, two interceptions and a lost fumble. All three of Minnesota's quarterbacks are impending free agents in March, so it'll be interesting to see what the Vikings do with them. What is certain is that Minnesota needs to upgrade its offensive line, and I have that happening in my with guard Isaiah Wynn.    Adam Thielen came into this game with an injured back, but I don't think that would explain why he caught just three passes for 28 yards. Thielen nearly snatched a touchdown, but the ball barely hit the ground. That play occurred on a fourth down in the third quarter. It was initially ruled a score, but replay review showed it was a drop. That play effectively ended all hope for Minnesota. Diggs was more productive - eight catches, 70 yards - but hurt his lower back in the opening quarter right after he dropped a pass. Diggs didn't miss much action, and it's not clear if the injury impacted him at all. Elsewhere in the receiving corps, Rudolph's 25-yard touchdown on the opening drive was his only catch of the game. Minnesota's leader in receiving yardage was actually running back Jerick McKinnon, who caught 11 passes for 86 yards. This was not a surprise, as the Eagles don't defend pass-catching running backs particularly well. Philadelphia will need to versus New England because Dion Lewis and James White will prove to be problematic.    McKinnon also led the Vikings on the ground with 40 yards on 10 carries. Latavius Murray didn't get to do much - six carries, 18 yards - because the Vikings trailed for three quarters. <div class=dfpAdSlots> <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span>   ",
   "players":[
    {
     "player_id":"11999",
     "name":"Case Keenum",
     "position":"QB",
     "height":"6-2",
     "weight":"209",
     "current_team":"Minnesota Vikings",
     "birth_date":"1988-02-17",
     "birth_place":"Abilene, TX",
     "death_date":"None",
     "college":"Houston",
     "high_school":"Wylie, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"950,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"137",
     "name":"Nelson Agholor",
     "position":"WR",
     "height":"6-1",
     "weight":"190",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1993-05-24",
     "birth_place":"Lagos, Nigeria",
     "death_date":"None",
     "college":"USC",
     "high_school":"Berkeley Prep, FL",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"1",
     "draft_position":"20",
     "draft_year":"2015",
     "current_salary":"1,287,489",
     "hof_induction_year":"None"
    },
    {
     "player_id":"20801",
     "name":"Torrey Smith",
     "position":"WR",
     "height":"6-1",
     "weight":"205",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1989-01-26",
     "birth_place":"Colonial Beach, VA",
     "death_date":"None",
     "college":"Maryland",
     "high_school":"Stafford, VA",
     "draft_team":"Baltimore Ravens",
     "draft_round":"2",
     "draft_position":"58",
     "draft_year":"2011",
     "current_salary":"4,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23774",
     "name":"James White",
     "position":"RB",
     "height":"5-9",
     "weight":"204",
     "current_team":"New England Patriots",
     "birth_date":"1992-02-03",
     "birth_place":"Fort Lauderdale, FL",
     "death_date":"None",
     "college":"Wisconsin",
     "high_school":"St. Thomas Aquinas, FL",
     "draft_team":"New England Patriots",
     "draft_round":"4",
     "draft_position":"130",
     "draft_year":"2014",
     "current_salary":"690,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"23623",
     "name":"Carson Wentz",
     "position":"QB",
     "height":"6-5",
     "weight":"237",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1992-12-30",
     "birth_place":"Bismarck, ND",
     "death_date":"None",
     "college":"North Dakota St.",
     "high_school":"Bismarck Century, ND",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"1",
     "draft_position":"2",
     "draft_year":"2016",
     "current_salary":"1,662,561",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1124",
     "name":"Derek Barnett",
     "position":"DE",
     "height":"6-3",
     "weight":"259",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1996-06-25",
     "birth_place":"Nashville, TN",
     "death_date":"None",
     "college":"Tennessee",
     "high_school":"Brentwood Academy, TN",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"1",
     "draft_position":"14",
     "draft_year":"2017",
     "current_salary":"465,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13534",
     "name":"Chris Long",
     "position":"DE",
     "height":"6-4",
     "weight":"275",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1985-03-28",
     "birth_place":"Santa Monica, CA",
     "death_date":"None",
     "college":"Virginia",
     "high_school":"St. Anne's-Belfield, VA",
     "draft_team":"St. Louis Rams",
     "draft_round":"1",
     "draft_position":"2",
     "draft_year":"2008",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"14897",
     "name":"Jerick McKinnon",
     "position":"RB",
     "height":"5-9",
     "weight":"205",
     "current_team":"Minnesota Vikings",
     "birth_date":"1992-05-03",
     "birth_place":"Atlanta, GA",
     "death_date":"None",
     "college":"Georgia Southern",
     "high_school":"Sprayberry, GA",
     "draft_team":"Minnesota Vikings",
     "draft_round":"3",
     "draft_position":"96",
     "draft_year":"2014",
     "current_salary":"700,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16346",
     "name":"Terence Newman",
     "position":"DB",
     "height":"5-11",
     "weight":"188",
     "current_team":"Minnesota Vikings",
     "birth_date":"1978-09-04",
     "birth_place":"Salina, KS",
     "death_date":"None",
     "college":"Kansas St.",
     "high_school":"Central, KS",
     "draft_team":"Dallas Cowboys",
     "draft_round":"1",
     "draft_position":"5",
     "draft_year":"2003",
     "current_salary":"2,400,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"21992",
     "name":"Adam Thielen",
     "position":"WR",
     "height":"6-3",
     "weight":"200",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-08-22",
     "birth_place":"Detroit Lakes, MN",
     "death_date":"None",
     "college":"Minnesota St.",
     "high_school":"Detroit Lakes, MN",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,746,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19223",
     "name":"Kyle Rudolph",
     "position":"TE",
     "height":"6-5",
     "weight":"265",
     "current_team":"Minnesota Vikings",
     "birth_date":"1989-11-09",
     "birth_place":"Cincinnati, OH",
     "death_date":"None",
     "college":"Notre Dame",
     "high_school":"Elder, OH",
     "draft_team":"Minnesota Vikings",
     "draft_round":"2",
     "draft_position":"43",
     "draft_year":"2011",
     "current_salary":"5,150,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16093",
     "name":"Latavius Murray",
     "position":"RB",
     "height":"6-3",
     "weight":"225",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-01-18",
     "birth_place":"Titusville, FL",
     "death_date":"None",
     "college":"Central Florida",
     "high_school":"Onondaga Central, NY",
     "draft_team":"Oakland Raiders",
     "draft_round":"6",
     "draft_position":"181",
     "draft_year":"2013",
     "current_salary":"900,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"13269",
     "name":"Dion Lewis",
     "position":"RB",
     "height":"5-8",
     "weight":"195",
     "current_team":"New England Patriots",
     "birth_date":"1990-09-27",
     "birth_place":"Brooklyn, NY",
     "death_date":"None",
     "college":"Pittsburgh",
     "high_school":"Albany, NY",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"5",
     "draft_position":"149",
     "draft_year":"2011",
     "current_salary":"1,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"6520",
     "name":"Zach Ertz",
     "position":"TE",
     "height":"6-5",
     "weight":"249",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1990-11-10",
     "birth_place":"Orange, CA",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"Monte Vista, CA",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"2",
     "draft_position":"35",
     "draft_year":"2013",
     "current_salary":"775,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7084",
     "name":"Nick Foles",
     "position":"QB",
     "height":"6-5",
     "weight":"244",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1989-01-20",
     "birth_place":"Austin, TX",
     "death_date":"None",
     "college":"Arizona",
     "high_school":"Westlake, TX",
     "draft_team":"Philadelphia Eagles",
     "draft_round":"3",
     "draft_position":"88",
     "draft_year":"2012",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11012",
     "name":"Alshon Jeffery",
     "position":"WR",
     "height":"6-4",
     "weight":"230",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1990-02-14",
     "birth_place":"St. Matthews, SC",
     "death_date":"None",
     "college":"South Carolina",
     "high_school":"Calhoun County, SC",
     "draft_team":"Chicago Bears",
     "draft_round":"2",
     "draft_position":"45",
     "draft_year":"2012",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"5642",
     "name":"Stefon Diggs",
     "position":"WR",
     "height":"6-0",
     "weight":"195",
     "current_team":"Minnesota Vikings",
     "birth_date":"1993-11-29",
     "birth_place":"Gaithersburg, MD",
     "death_date":"None",
     "college":"Maryland",
     "high_school":"Our Lady of Good Counsel, MD",
     "draft_team":"Minnesota Vikings",
     "draft_round":"5",
     "draft_position":"146",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1890",
     "name":"LeGarrette Blount",
     "position":"RB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1986-12-05",
     "birth_place":"Madison, FL",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Taylor Co., FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18545",
     "name":"Xavier Rhodes",
     "position":"CB",
     "height":"6-2",
     "weight":"210",
     "current_team":"Minnesota Vikings",
     "birth_date":"1990-06-19",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Norland, FL",
     "draft_team":"Minnesota Vikings",
     "draft_round":"1",
     "draft_position":"25",
     "draft_year":"2013",
     "current_salary":"8,026,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"160",
     "name":"Jay Ajayi",
     "position":"RB",
     "height":"6-0",
     "weight":"216",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1993-06-15",
     "birth_place":"London, England",
     "death_date":"None",
     "college":"Boise St.",
     "high_school":"Liberty, TX",
     "draft_team":"Miami Dolphins",
     "draft_round":"5",
     "draft_position":"149",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18899",
     "name":"Patrick Robinson",
     "position":"DB",
     "height":"5-11",
     "weight":"190",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1987-09-07",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"South Miami, FL",
     "draft_team":"New Orleans Saints",
     "draft_round":"1",
     "draft_position":"32",
     "draft_year":"2010",
     "current_salary":"None",
     "hof_induction_year":"None"
    }
   ]
  }
 ]
}
