{
  "week": "07",
  "year": "2015",
  "numberOfGames": "14",
  "games": [
    {
      "Team 1": {
        "Name": "Seahawks",
        "Points": "20"
      },
      "Team 2": {
        "Name": "49ers",
        "Points": "3"
      },
      "comments": " The Seahawks absolutely had to win this game to stay alive in the NFC West race. At 2-4, they definitely couldn't afford another loss. They managed to get the job done, albeit amid some struggles that will be a concern going forward. The primary issue for Seattle is the team's pass protection. Despite leading throughout - the Seahawks marched down the field on the opening drive for a touchdown - Russell Wilson was sacked five times. The offensive line is an abomination, and it doesn't seem to be getting any better. With a huge lead, Wilson shouldn't have been under much pressure, but instead, San Francisco was able to smother him to derail some drives. Some penalties by the linemen ruined a couple of possessions as well. Wilson's decision-making is also disconcerting. On three occasions this evening, Wilson tried to squeeze the ball into double coverage and didn't have any success doing so. The first time came in the red zone toward the end of the first half, when he was picked off. The second was a deep bomb downfield to Jermaine Kearse, which was also intercepted. The third was a dropped pick on a dart to Jimmy Graham. Wilson finished 18-of-24 for 235 yards, one touchdown and the two picks. He also registered 20 rushing yards on seven scrambles. Wilson made plenty of good plays, as he was his usual, elusive self. However, the pair of interceptions - as well as a third pick - would've ended up costing him against a better opponent. It's not like he was trailing and was trying to make things happen. With a lead, Wilson should've been more careful with the football.    The bright spot for the Seahawks was Marshawn Lynch. The 49ers had no answers for him, as he trampled them all night. He gained 122 yards and a touchdown on 27 carries - a very impressive YPC average, especially when considering that he had several failed short-yardage tries on the opening possession. This wasn't a surprise, as Seattle has been bad in short yardage dating back to the Super Bowl. However, Lynch eventually plunged into the end zone to give the Seahawks a lead that they never relinquished.    Seattle's leading receiver was Tyler Lockett, who caught all five targets thrown to him for 79 yards, including a 43-yard bomb for a touchdown. Meanwhile, Graham disappointed, hauling in just two of his five targets for 31 yards. Graham exploded last week, but it appears as though that was a fluke. Wilson has to move around too much, so he doesn't have the time to find his athletic tight end.    As for the 49ers, they had yet another dreadful performance. They kept it close against the Giants and upset the Ravens, but those were two injured/bad teams. The Seahawks were far superior, so the 49ers had no chance with their depleted roster. They are, without a doubt, one of the worst squads in the NFL, and quite frankly, the organization deserves this after running Jim Harbaugh out of town. Getting rid of a top-three NFL coach and replacing him with someone who looks like a pizza delivery guy is not a good idea, as it turns out. Jim Tomsula is utterly clueless, as highlighted by this exchange with Tracy Wolfson right before halftime: Wolfson: Coach, how do you find a rhythm in the second half? Tomsula: We gotta find a rhythm. My girlfriend, who doesn't know much about football, even laughed at this. Tomsula is a man with no answers, and he doesn't have the personnel to even find any.    Colin Kaepernick had a miserable evening. It's hard to completely blame him, as he was sacked six times - including 3.5 times by Michael Bennett - but even when he had time, he'd sail ugly passes out of bounds. He didn't even give the Seahawks a chance to pick off his passes because many of his throws weren't in the field of play. Making matters worse, Kaepernick, for whatever reason, didn't have a single rushing attempt. That's inexcusable, and it's not like he didn't have the chances; he could've easily picked up a first down with his legs on a third-and-2, for example, but didn't even bother trying. Kaepernick finished 13-of-24 for only 124 yards, giving him an awful YPA of 5.2. In the offseason, he told the media that he wanted to be himself going forward, but he just looks like a lost soul. There's literally no excuse for him not scrambling at all. His legs are his best attribute, and refusing to use them is just a recipe for failure.    If there's a silver lining for the 49ers, it's that Vernon Davis finally showed signs of life. Davis caught four passes for 61 yards, leading the team in both categories. Sadly, Anquan Boldin (3-39) and Reggie Bush (3-13) were the only other players with more than one reception. Bush sucked yet again; he dropped a pass on third down during the opening drive and then missed a big hole for a long gain, choosing to go outside for barely any yardage. He is a terrible player the 49ers should not be using right now. It's a complete mystery as to why he's ahead of Jarryd Hayne on the depth chart. Hayne should've been active tonight instead of Bush, but Tomsula is too busy delivering pizzas to realize this.    Another receiver worth mentioning is Torrey Smith, who didn't catch a single pass. He was targeted only once, which was a drop. Smith shouldn't be owned in any 12-team fantasy league.    Carlos Hyde had some solid runs in this contest, but he nearly hurt his team with two fumbles. Hyde was fortunate that his teammates pounced on both loose balls, especially considering that K.J. Wright appeared to fall on it the first time. I still have no clue how he didn't recover.    I called for Phil Simms' firing a couple of weeks ago, and I'm once again going to repeat that he's one of the worst NFL announcers. He's so horrible that I feel like I'm betting against him every Thursday. Simms, at one point, told Jim Nantz he can't afford massages. He was obviously not being serious, as his CBS salary is in the seven-figure range, but it just didn't sound quite right. The comment that sparked this bullet point, however, was when Simms stated that the 49ers, down 17 with 3:15 remaining, should punt on a fourth-and-4. Sure, a comeback wasn't likely at all, but the 49ers could've kept moving the chains and given their quarterback some confidence for next week. There was literally no downside to going for it, yet Simms agreed with the Tomsula brain trust in terms of kicking it away. Simms, who also said that the Seahawks were the defending Super Bowl champions at one point, needs to be fired. He's bland, he offers no ideas, and he's infuriating to listen to. And if I have to hear him say, You know, Jim, one more time, I might just have a seizure. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "9462",
          "name": "Jarryd Hayne",
          "position": "RB",
          "height": "6-2",
          "weight": "220",
          "current_team": "None",
          "birth_date": "1988-02-15",
          "birth_place": "Sydney, Australia",
          "death_date": "None",
          "college": "none",
          "high_school": "Westfield Sports, Australia",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10586",
          "name": "Carlos Hyde",
          "position": "RB",
          "height": "6-0",
          "weight": "230",
          "current_team": "San Francisco 49ers",
          "birth_date": "1990-09-20",
          "birth_place": "Naples, FL",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Naples, FL",
          "draft_team": "San Francisco 49ers",
          "draft_round": "2",
          "draft_position": "57",
          "draft_year": "2014",
          "current_salary": "822,047",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1546",
          "name": "Michael Bennett ",
          "position": "DE",
          "height": "6-4",
          "weight": "271",
          "current_team": "Seattle Seahawks",
          "birth_date": "1985-11-13",
          "birth_place": "Avondale, LA",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Alief Taylor, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "6,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11975",
          "name": "Jermaine Kearse",
          "position": "WR",
          "height": "6-1",
          "weight": "212",
          "current_team": "New York Jets",
          "birth_date": "1990-02-06",
          "birth_place": "Lakewood, WA",
          "death_date": "None",
          "college": "Washington",
          "high_school": "Lakes, WA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24421",
          "name": "Russell Wilson",
          "position": "QB",
          "height": "5-11",
          "weight": "203",
          "current_team": "Seattle Seahawks",
          "birth_date": "1988-11-29",
          "birth_place": "Richmond, VA",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Collegiate School, VA",
          "draft_team": "Seattle Seahawks",
          "draft_round": "3",
          "draft_position": "75",
          "draft_year": "2012",
          "current_salary": "12,600,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20801",
          "name": "Torrey Smith",
          "position": "WR",
          "height": "6-1",
          "weight": "205",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1989-01-26",
          "birth_place": "Colonial Beach, VA",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Stafford, VA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "2",
          "draft_position": "58",
          "draft_year": "2011",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24740",
          "name": "K.J. Wright",
          "position": "LB",
          "height": "6-3",
          "weight": "246",
          "current_team": "Seattle Seahawks",
          "birth_date": "1989-07-23",
          "birth_place": "Olive Branch, MS",
          "death_date": "None",
          "college": "Mississippi St.",
          "high_school": "Olive Branch, MS",
          "draft_team": "Seattle Seahawks",
          "draft_round": "4",
          "draft_position": "99",
          "draft_year": "2011",
          "current_salary": "5,800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1961",
          "name": "Anquan Boldin",
          "position": "WR",
          "height": "6-1",
          "weight": "218",
          "current_team": "None",
          "birth_date": "1980-10-03",
          "birth_place": "Pahokee, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Pahokee, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "2",
          "draft_position": "54",
          "draft_year": "2003",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1547",
          "name": "Michael Bennett",
          "position": "DT",
          "height": "6-2",
          "weight": "288",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1989-02-23",
          "birth_place": "Centerville, OH",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Centerville, OH",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "6",
          "draft_position": "180",
          "draft_year": "2015",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8220",
          "name": "Jimmy Graham",
          "position": "TE",
          "height": "6-7",
          "weight": "260",
          "current_team": "Seattle Seahawks",
          "birth_date": "1986-11-24",
          "birth_place": "Goldsboro, NC",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Charis Prep, NC",
          "draft_team": "New Orleans Saints",
          "draft_round": "3",
          "draft_position": "95",
          "draft_year": "2010",
          "current_salary": "7,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11849",
          "name": "Colin Kaepernick",
          "position": "QB",
          "height": "6-4",
          "weight": "225",
          "current_team": "None",
          "birth_date": "1987-11-03",
          "birth_place": "Milwaukee, WI",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Turlock, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5325",
          "name": "Vernon Davis ",
          "position": "TE",
          "height": "6-3",
          "weight": "250",
          "current_team": "Washington Redskins",
          "birth_date": "1984-01-31",
          "birth_place": "Washington, DC",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Dunbar, DC",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "6",
          "draft_year": "2006",
          "current_salary": "2,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3116",
          "name": "Reggie Bush",
          "position": "RB",
          "height": "6-0",
          "weight": "200",
          "current_team": "None",
          "birth_date": "1985-03-02",
          "birth_place": "Spring Valley, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Helix, CA",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13473",
          "name": "Tyler Lockett",
          "position": "WR",
          "height": "5-10",
          "weight": "181",
          "current_team": "Seattle Seahawks",
          "birth_date": "1992-09-28",
          "birth_place": "Tulsa, OK",
          "death_date": "None",
          "college": "Kansas St.",
          "high_school": "Booker T. Washington, OK",
          "draft_team": "Seattle Seahawks",
          "draft_round": "3",
          "draft_position": "69",
          "draft_year": "2015",
          "current_salary": "695,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Jaguars",
        "Points": "34"
      },
      "Team 2": {
        "Name": "Bills",
        "Points": "31"
      },
      "comments": " A year ago, the Dolphins came into London amid controversy. Ryan Tannehill and Joe Philbin were at odds, but battling a horrible Oakland team provided the remedy they needed. The Bills, mired in similar distractions this week when several defensive players called out Rex Ryan, didn't rebound similarly. Instead, they made the same mistakes they always do. It goes without saying that there are major issues in Buffalo. Losing to the worst team in football is obviously a major red flag. The only silver lining is that Tyrod Taylor and Sammy Watkins were both out, but the fact that the stop unit couldn't prevent Blake Bortles from marching down the field for two early touchdowns and the winning score at the end, thanks to blown coverages and bad tackling, is very disconcerting. The story of this game, however, is how bad E.J. Manuel was. The coaching staff told Manuel to rip it prior to the game. That backfired big time; in the first 20 minutes of the contest, Manuel lost a fumble that was returned for a touchdown and then followed that up with a pick-six on the very next play. After that, he fired an interception into double coverage on a third-and-16. Manuel also failed to hit a tight end in stride earlier, negating a touchdown, and then overthrew an open receiver in the end zone. During the opening 20 minutes, Manuel was 4-of-12 for 50 yards, two picks and a lost fumble. Manuel played better later, though only by default. He finished 24-of-42 for 298 yards, two touchdowns and the two picks. However, he was responsible for some horrible clock management on the final drive and was lucky to get away with a fumble on a horrible sneak attempt. Manuel also saw one of his teammates recover another one of his fumbles, and he spent the afternoon overthrowing receivers downfield. He was absolutely terrible, and he wouldn't even be in the NFL right now if he didn't happen to be a first-round pick. Manuel needs to begin reaching out to CFL teams because that's where he's going to be in a couple of years.    Meanwhile, the Buffalo defense played like hot garbage. Surrendering that final score was inexcusable. Granted, Nickell Robey was whistled for one of the worst pass interferences you'll ever see on a third-and-15, but the Jaguars were able to punch it into the end zone with a deep pass after that. The Bills are in deep trouble now at 3-4.    I'd like to give Blake Bortles credit for engineering a winning drive, but he nearly gave the game away right before that with a pick-six on a late throw over the middle. Bortles went 13-of-29 for 182 yards, two touchdowns and that interception. Save for a couple of drives, Bortles was a train wreck.    The Jaguars moved the chains primarily on the ground. T.J. Yeldon racked up 115 yards and a touchdown on 20 carries. Despite his success, the Jaguars foolishly ran the ball with Toby Gerhart on four consecutive plays near the goal line. They predictably failed, as Gerhart was stuffed on all four occasions. Gerhart is a horrible player, so there was no reason he should've received such crucial touches, especially with Yeldon available.    Bortles' touchdowns went to his usual suspects, Allen Robinson (6-98) and Allen Hurns (2-53). Julius Thomas did nothing, catching just one of his five targets for four yards. However, he had a big play negated by hold in the first half.    Going back to the Bills, LeSean McCoy and Robert Woods were some of the only players who performed well. McCoy was elusive, gaining 68 yards on 16 carries to go along with two catches for 36 receiving yards. Woods, meanwhile, logged nine receptions for 84 yards and a touchdown.    Manuel threw most to Woods (13 targets), Chris Hogan (11 targets, 6 catches, 56 yards) and Chris Gragg (7 targets, 2 catches, 35 yards). With Watkins out, Manuel didn't have anyone talented to work with. Hogan dropped a pass, while Gragg predictably proved to be highly inefficient.   ",
      "players": [
        {
          "player_id": "22075",
          "name": "Julius Thomas",
          "position": "TE",
          "height": "6-4",
          "weight": "251",
          "current_team": "Miami Dolphins",
          "birth_date": "1988-06-27",
          "birth_place": "Stockton, CA",
          "death_date": "None",
          "college": "Portland St.",
          "high_school": "Tokay, CA",
          "draft_team": "Denver Broncos",
          "draft_round": "4",
          "draft_position": "129",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8198",
          "name": "Chris Gragg",
          "position": "TE",
          "height": "6-3",
          "weight": "244",
          "current_team": "New York Jets",
          "birth_date": "1990-06-30",
          "birth_place": "Warren, AR",
          "death_date": "None",
          "college": "Arkansas",
          "high_school": "Warren, AR",
          "draft_team": "Buffalo Bills",
          "draft_round": "7",
          "draft_position": "222",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21763",
          "name": "Ryan Tannehill",
          "position": "QB",
          "height": "6-4",
          "weight": "220",
          "current_team": "Miami Dolphins",
          "birth_date": "1988-07-27",
          "birth_place": "Big Spring, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Big Spring, TX",
          "draft_team": "Miami Dolphins",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2012",
          "current_salary": "17,975,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24649",
          "name": "Robert Woods",
          "position": "WR",
          "height": "6-1",
          "weight": "201",
          "current_team": "Los Angeles Rams",
          "birth_date": "1992-04-10",
          "birth_place": "Gardena, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Junipero Serra, CA",
          "draft_team": "Buffalo Bills",
          "draft_round": "2",
          "draft_position": "41",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7783",
          "name": "Toby Gerhart ",
          "position": "RB",
          "height": "6-0",
          "weight": "234",
          "current_team": "None",
          "birth_date": "1987-03-28",
          "birth_place": "Norco, CA",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Norco, CA",
          "draft_team": "Minnesota Vikings",
          "draft_round": "2",
          "draft_position": "51",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2038",
          "name": "Blake Bortles ",
          "position": "QB",
          "height": "6-5",
          "weight": "232",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1992-04-28",
          "birth_place": "Oviedo, FL",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Oviedo, FL",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2014",
          "current_salary": "3,236,565",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23393",
          "name": "Sammy Watkins",
          "position": "WR",
          "height": "6-1",
          "weight": "211",
          "current_team": "Los Angeles Rams",
          "birth_date": "1993-06-14",
          "birth_place": "Fort Myers, FL",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "South Fort Myers, FL",
          "draft_team": "Buffalo Bills",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21908",
          "name": "Tyrod Taylor",
          "position": "QB",
          "height": "6-0",
          "weight": "221",
          "current_team": "Buffalo Bills",
          "birth_date": "1989-08-03",
          "birth_place": "Hampton, VA",
          "death_date": "None",
          "college": "Virginia Tech",
          "high_school": "Hampton, VA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "6",
          "draft_position": "180",
          "draft_year": "2011",
          "current_salary": "7,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14591",
          "name": "LeSean McCoy",
          "position": "RB",
          "height": "5-10",
          "weight": "215",
          "current_team": "Buffalo Bills",
          "birth_date": "1988-07-12",
          "birth_place": "Harrisburg, PA",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Bishop McDevitt, PA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "53",
          "draft_year": "2009",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10549",
          "name": "Allen Hurns",
          "position": "WR",
          "height": "6-3",
          "weight": "195",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1991-11-12",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Miami Carol City, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10016",
          "name": "Chris Hogan ",
          "position": "WR",
          "height": "6-1",
          "weight": "220",
          "current_team": "New England Patriots",
          "birth_date": "1988-10-24",
          "birth_place": "Ramapo, NJ",
          "death_date": "None",
          "college": "Monmouth",
          "high_school": "Ramapo, NJ",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24845",
          "name": "T.J. Yeldon",
          "position": "RB",
          "height": "6-2",
          "weight": "221",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1993-10-02",
          "birth_place": "Daphne, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Daphne, AL",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2015",
          "current_salary": "972,617",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18833",
          "name": "Allen Robinson",
          "position": "WR",
          "height": "6-3",
          "weight": "220",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1993-08-24",
          "birth_place": "Detroit, MI",
          "death_date": "None",
          "college": "Penn St.",
          "high_school": "St. Mary's Prep, MI",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "2",
          "draft_position": "61",
          "draft_year": "2014",
          "current_salary": "898,755",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Rams",
        "Points": "24"
      },
      "Team 2": {
        "Name": "Browns",
        "Points": "6"
      },
      "comments": " Everyone expected Todd Gurley to have his way with the Browns, and that was the case as the star rookie ran all over them. Gurley and the Rams' defense overwhelmed Cleveland to help St. Louis remain in the playoff race. To make things even harder for the Cleveland defense, the Browns had a serious case of fumblitis, putting the ball on the ground four times. If Gurley can stay healthy, he's going to be star.    On the Browns' first offensive snap of the game, the Rams' defense scored a touchdown. A quick pass to Taylor Gabriel was fumbled away after a hard hit from Janoris Jenkins. Rodney McLeod scooped up the loose ball and ran 20 yards for the quick score. The next offensive possession for Cleveland had a similar result, as William Hayes recorded a strip-sack off the right side that was recovered by Akeem Ayers. That spotted the Rams three more points. Cleveland responded with a field goal drive that was aided by some Ram penalties. In the second quarter, St. Louis started moving the ball with Gurley and some short passes from Foles, but Donte Whitner forced a fumble from Jared Cook that was recovered by Cleveland. Aside from Gurley, the offenses were largely ineffective, and the Rams took a 10-3 lead into the third quarter. Cleveland started better in the second half with a 27-yard pass to Gary Barnidge and a 22-yard run by Robert Turbin. The drive stalled out for a 44-yard field goal. St. Louis answered with a screen to Tavon Austin for 11 yards. He had a great block on the next play to help spring Gurley for a 48-yard run. The drive was killed by a sack from Randy Starks, and Greg Zuerlein missed a 35-yard field goal. Barnidge climbed the ladder to make a 33-yard reception down the middle of the field. A Joe Thomas holding on Robert Quinn took away a great 36-yard catch by Travis Benjamin, and once again, Cleveland punted away after starting a drive well. Foles threw a beautiful 41-yard pass to Kenny Britt to the Browns' 1-yard line. Gurley finished the drive with his first NFL touchdown. In the fourth quarter, the Rams' defense struck again. T.J. McDonald dislodged the ball from Benjamin, while Nick Fairley recovered the ball. Hilariously, Fairley ran the wrong direction with the fumble for a loss of five yards on his return, but at least, he secured the turnover. The St. Louis offense moved the ball from midfield before Gurley charged through three tackles from 16 yards out for the final score of the game. The Rams' defense did the rest. William Hayes beat right tackle Mitchell Schwartz to strip McCown of the ball, and Eugene Sims recovered the fumble. After McCown was pummeled by St. Louis' defense, Johnny Manziel came in for the final drive and moved the Browns about 30 yards before Cleveland stalled out.    Todd Gurley ran for 128 yards on 19 carries with two touchdowns. His combination of power and speed is tremendous.    Nick Foles completed 15-of-23 passes for 163 yards, while Tavon Austin led the Rams' receivers with 43 yards on four receptions.    Josh McCown completed 26-of-32 pass for 270 yards with no touchdowns, no interceptions and two fumbles. He actually didn't play poorly, but his offensive line was destroyed by the Rams.    St. Louis' run defense has been vulnerable this year, but shut down the Cleveland ground attack. Robert Turbin had 30 yards on five carries.    Cleveland was led through the air by tight end Gary Barnidge. He had six receptions for 101 yards. Running back Duke Johnson (7-73) and Travis Benjamin (4-47) were the other top targets.    The Rams' defensive line was just tremendous. Aaron Donald embarrassed Joel Bitonio on number of plays. Robert Quinn, William Hayes, Janoris Jenkins and Mark Barron all had good games for St. Louis. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "14580",
          "name": "Josh McCown",
          "position": "QB",
          "height": "6-4",
          "weight": "212",
          "current_team": "New York Jets",
          "birth_date": "1979-07-04",
          "birth_place": "Jacksonville, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Jacksonville, TX",
          "draft_team": "Arizona Cardinals",
          "draft_round": "3",
          "draft_position": "81",
          "draft_year": "2002",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2425",
          "name": "Kenny Britt",
          "position": "WR",
          "height": "6-3",
          "weight": "215",
          "current_team": "Cleveland Browns",
          "birth_date": "1988-09-19",
          "birth_place": "Bayonne, NJ",
          "death_date": "None",
          "college": "Rutgers",
          "high_school": "Bayonne, NJ",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "30",
          "draft_year": "2009",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5784",
          "name": "Aaron Donald",
          "position": "DT",
          "height": "6-1",
          "weight": "285",
          "current_team": "Los Angeles Rams",
          "birth_date": "1991-05-23",
          "birth_place": "Pittsburgh, PA",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Penn Hills, PA",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2014",
          "current_salary": "1,802,250",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1524",
          "name": "Travis Benjamin",
          "position": "WR",
          "height": "5-10",
          "weight": "172",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1989-12-29",
          "birth_place": "Belle Glade, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Glades Central, FL",
          "draft_team": "Cleveland Browns",
          "draft_round": "4",
          "draft_position": "100",
          "draft_year": "2012",
          "current_salary": "5,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1142",
          "name": "Gary Barnidge",
          "position": "TE",
          "height": "6-5",
          "weight": "240",
          "current_team": "None",
          "birth_date": "1985-09-22",
          "birth_place": "Middleburg, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Middleburg, FL",
          "draft_team": "Carolina Panthers",
          "draft_round": "5",
          "draft_position": "141",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4469",
          "name": "Jared Cook",
          "position": "TE",
          "height": "6-4",
          "weight": "235",
          "current_team": "Oakland Raiders",
          "birth_date": "1987-04-07",
          "birth_place": "Birmingham, AL",
          "death_date": "None",
          "college": "South Carolina",
          "high_school": "North Gwinnett, GA",
          "draft_team": "Tennessee Titans",
          "draft_round": "3",
          "draft_position": "89",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14013",
          "name": "Johnny Manziel",
          "position": "QB",
          "height": "6-0",
          "weight": "207",
          "current_team": "None",
          "birth_date": "1992-12-06",
          "birth_place": "Tyler, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Tivy, TX",
          "draft_team": "Cleveland Browns",
          "draft_round": "1",
          "draft_position": "22",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14684",
          "name": "T.J. McDonald",
          "position": "FS",
          "height": "6-3",
          "weight": "219",
          "current_team": "Miami Dolphins",
          "birth_date": "1991-01-26",
          "birth_place": "Fresno, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Edison, CA",
          "draft_team": "St. Louis Rams",
          "draft_round": "3",
          "draft_position": "71",
          "draft_year": "2013",
          "current_salary": "944,445",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22067",
          "name": "Joe Thomas",
          "position": "LB",
          "height": "6-1",
          "weight": "227",
          "current_team": "Green Bay Packers",
          "birth_date": "1991-05-06",
          "birth_place": "Blackville, SC",
          "death_date": "None",
          "college": "South Carolina St.",
          "high_school": "Hilda, SC",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11047",
          "name": "Janoris Jenkins ",
          "position": "CB",
          "height": "5-10",
          "weight": "191",
          "current_team": "New York Giants",
          "birth_date": "1988-10-29",
          "birth_place": "Pahokee, FL",
          "death_date": "None",
          "college": "North Alabama",
          "high_school": "Pahokee, FL",
          "draft_team": "St. Louis Rams",
          "draft_round": "2",
          "draft_position": "39",
          "draft_year": "2012",
          "current_salary": "12,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22066",
          "name": "Joe Thomas",
          "position": "T",
          "height": "6-7",
          "weight": "311",
          "current_team": "Cleveland Browns",
          "birth_date": "1984-12-04",
          "birth_place": "Brookfield, WI",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Brookfield Central, WI",
          "draft_team": "Cleveland Browns",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2007",
          "current_salary": "8,800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6651",
          "name": "Nick Fairley",
          "position": "DT",
          "height": "6-5",
          "weight": "291",
          "current_team": "New Orleans Saints",
          "birth_date": "1988-01-23",
          "birth_place": "Mobile, AL",
          "death_date": "None",
          "college": "Auburn",
          "high_school": "Lillie B. Williamson, AL",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2011",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14931",
          "name": "Rodney McLeod",
          "position": "S",
          "height": "5-11",
          "weight": "183",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1990-06-23",
          "birth_place": "Hyattsville, MD",
          "death_date": "None",
          "college": "Virginia",
          "high_school": "DeMatha Catholic, MD",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9455",
          "name": "William Hayes",
          "position": "DE",
          "height": "6-2",
          "weight": "258",
          "current_team": "Miami Dolphins",
          "birth_date": "1985-05-02",
          "birth_place": "High Point, NC",
          "death_date": "None",
          "college": "Winston-Salem St.",
          "high_school": "Andrews, NC",
          "draft_team": "Tennessee Titans",
          "draft_round": "4",
          "draft_position": "103",
          "draft_year": "2008",
          "current_salary": "2,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23858",
          "name": "Donte Whitner",
          "position": "DB",
          "height": "5-11",
          "weight": "205",
          "current_team": "None",
          "birth_date": "1985-07-24",
          "birth_place": "Cleveland, OH",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Glenville, OH",
          "draft_team": "Buffalo Bills",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1173",
          "name": "Mark Barron",
          "position": "LB",
          "height": "6-1",
          "weight": "213",
          "current_team": "Los Angeles Rams",
          "birth_date": "1989-10-27",
          "birth_place": "Mobile, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "St. Paul's Episcopal, AL",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "7",
          "draft_year": "2012",
          "current_salary": "5,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21136",
          "name": "Randy Starks",
          "position": "DT",
          "height": "6-3",
          "weight": "312",
          "current_team": "None",
          "birth_date": "1983-12-14",
          "birth_place": "Petersburg, VA",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Westlake, MD",
          "draft_team": "Tennessee Titans",
          "draft_round": "3",
          "draft_position": "71",
          "draft_year": "2004",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1774",
          "name": "Joel Bitonio",
          "position": "OT",
          "height": "6-4",
          "weight": "302",
          "current_team": "Cleveland Browns",
          "birth_date": "1991-10-11",
          "birth_place": "San Pedro, CA",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Woodrow Wilson Classical, CA",
          "draft_team": "Cleveland Browns",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2014",
          "current_salary": "3,164,777",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19747",
          "name": "Mitchell Schwartz",
          "position": "T",
          "height": "6-5",
          "weight": "317",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1989-06-08",
          "birth_place": "Pacific Palisades, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Palisades Charter, CA",
          "draft_team": "Cleveland Browns",
          "draft_round": "2",
          "draft_position": "37",
          "draft_year": "2012",
          "current_salary": "4,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8657",
          "name": "Todd Gurley",
          "position": "RB",
          "height": "6-1",
          "weight": "226",
          "current_team": "Los Angeles Rams",
          "birth_date": "1994-08-03",
          "birth_place": "Baltimore, MD",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Tarboro, NC",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "10",
          "draft_year": "2015",
          "current_salary": "1,691,653",
          "hof_induction_year": "None"
        },
        {
          "player_id": "756",
          "name": "Tavon Austin",
          "position": "WR",
          "height": "5-9",
          "weight": "174",
          "current_team": "Los Angeles Rams",
          "birth_date": "1991-03-15",
          "birth_place": "Baltimore, MD",
          "death_date": "None",
          "college": "West Virginia",
          "high_school": "Paul Laurence Dunbar, MD",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2013",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7480",
          "name": "Taylor Gabriel",
          "position": "WR",
          "height": "5-8",
          "weight": "167",
          "current_team": "Atlanta Falcons",
          "birth_date": "1991-02-17",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Abilene Christian",
          "high_school": "John Horn, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7084",
          "name": "Nick Foles",
          "position": "QB",
          "height": "6-5",
          "weight": "244",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1989-01-20",
          "birth_place": "Austin, TX",
          "death_date": "None",
          "college": "Arizona",
          "high_school": "Westlake, TX",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "3",
          "draft_position": "88",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18100",
          "name": "Robert Quinn",
          "position": "DE",
          "height": "6-4",
          "weight": "270",
          "current_team": "Los Angeles Rams",
          "birth_date": "1990-05-18",
          "birth_place": "Ladson, SC",
          "death_date": "None",
          "college": "North Carolina",
          "high_school": "Fort Dorchester, SC",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "14",
          "draft_year": "2011",
          "current_salary": "6,161,616",
          "hof_induction_year": "None"
        },
        {
          "player_id": "784",
          "name": "Akeem Ayers",
          "position": "LB",
          "height": "6-3",
          "weight": "255",
          "current_team": "New York Giants",
          "birth_date": "1989-07-10",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "UCLA",
          "high_school": "Verbum Dei, CA",
          "draft_team": "Tennessee Titans",
          "draft_round": "2",
          "draft_position": "39",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20344",
          "name": "Eugene Sims",
          "position": "LB",
          "height": "6-5",
          "weight": "240",
          "current_team": "None",
          "birth_date": "1986-03-18",
          "birth_place": "Mt.Olive, MS",
          "death_date": "None",
          "college": "West Texas A&M;",
          "high_school": "Mize, MS",
          "draft_team": "St. Louis Rams",
          "draft_round": "6",
          "draft_position": "189",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22612",
          "name": "Robert Turbin",
          "position": "RB",
          "height": "5-10",
          "weight": "222",
          "current_team": "Indianapolis Colts",
          "birth_date": "1989-12-02",
          "birth_place": "Oakland, CA",
          "death_date": "None",
          "college": "Utah St.",
          "high_school": "Irvington, CA",
          "draft_team": "Seattle Seahawks",
          "draft_round": "4",
          "draft_position": "106",
          "draft_year": "2012",
          "current_salary": "800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "25034",
          "name": "Greg Zuerlein",
          "position": "K",
          "height": "6-0",
          "weight": "187",
          "current_team": "Los Angeles Rams",
          "birth_date": "1987-12-27",
          "birth_place": "Lincoln, NE",
          "death_date": "None",
          "college": "Missouri Western St.",
          "high_school": "Lincoln Pius X, NE",
          "draft_team": "St. Louis Rams",
          "draft_round": "6",
          "draft_position": "171",
          "draft_year": "2012",
          "current_salary": "1,375,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11246",
          "name": "Duke Johnson",
          "position": "RB",
          "height": "5-9",
          "weight": "206",
          "current_team": "Cleveland Browns",
          "birth_date": "1993-09-23",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Norland, FL",
          "draft_team": "Cleveland Browns",
          "draft_round": "3",
          "draft_position": "77",
          "draft_year": "2015",
          "current_salary": "642,500",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Chiefs",
        "Points": "23"
      },
      "Team 2": {
        "Name": "Steelers",
        "Points": "13"
      },
      "comments": " Both of these teams were down key players going into the game. Ben Roethlisberger, Jamaal Charles and Jeremy Maclin all were out for this tilt, and it showed. At halftime, Kansas City led 9-3 in a field goal party.    Out of the gate, it looked like the Steelers' third-string quarterback, Landry Jones, might be able to do some damage as he hit Martavis Bryant on the first pass for 19 yards and then almost connected with him on the sideline on a deeper play, but then Jones settled in as the game manager and was off-target when he did throw the ball. By halftime, Jones had the ugly line of five completions on 12 attempts for 73 yards and an interception.    Alex Smith, on the other hand, was moving the ball with 160 yards at halftime, but no touchdowns and three Cairo Santos field goals. This has been a familiar refrain for this Kansas City offense.    After half, Kansas City found the end zone as Charcandrick West saw three goal-line attempts, but was able to get in for his first touchdown of his career and the first rushing touchdown the Steelers had allowed this season. West had a bad unsportsmanlike conduct penalty, but overall played a nice game, rushing for 110 yards on 22 carries for five yards per attempt. This comes against a Steelers' defense that had been giving up just 3.5 yards per carry on the season.    West's touchdown was then matched when Jones hit Bryant again, but this time for a 19-yard touchdown, bringing the Steelers within six points just before the third quarter ended. Bryant now has three touchdown receptions in his first two games back and amazingly, Bryant caught all of those touchdown passes from Landry Jones. When Ben Roethlisberger returns, this offense could be special.    The Steelers then made another push, aided by Le'Veon Bell and Antonio Brown, who, even though Jones was inaccurate, were aided by him tossing the ball farther than five yards down the field and keeping the defense somewhat honest. Pittsburgh's final push ended in a field goal that brought them within three, but it wasn't enough, as Alex Smith led his team down the field, finishing off the drive with a 5-yard touchdown pass to Chris Conley.    Smith was in game-manager mode for most of the afternoon, as he completed 21-of-32 passes for 251 yard, one touchdown and no interceptions. And those zero interceptions were the key, especially with Landry Jones turning the ball over three times. The picks weren't all his fault, but they happened, and the final play of the game was a Tamba Hali strip-sack, which sealed the deal.    With Jeremy Maclin out, Travis Kelce, Albert Wilson, Chris Conley and West all had from five to seven targets, as Smith spread the ball around. Conley led the way in receptions, catching six of his seven targets for 63 yards and the game-winning touchdown. Kelce had some nice grabs, but his game-changing ability is not going to emerge that often in this offense. Even with Maclin out, Kelce still finished with five receptions for 73 yards and no touchdowns. Smith doesn't have the arm to throw into good coverage, so he will continue to spread the ball around to open, usually, close pass-catchers.    The Steelers, on the other hand, even with Jones at quarterback, were able to give their best players enough work to have nice statistical games, i.e. they didn't hurt you in fantasy. Antonio Brown finally started a new five-reception/50+-yard streak, as he caught 6-of-8 targets for 124 yards. And Pittsburgh's other stud player, Le'Veon Bell, looked in top form as he rushed 17 times for 121 yards, including a Gale Sayer-esque 42-yard run, where he cut while going full speed, making a defender miss.    In the end, this was a win for the home team, but these teams are going in opposite directions, as the Steelers will get Roethlisberger back next week, while Kansas City won't get Charles back until next season.   ",
      "players": [
        {
          "player_id": "3772",
          "name": "Jamaal Charles",
          "position": "RB",
          "height": "5-11",
          "weight": "199",
          "current_team": "Denver Broncos",
          "birth_date": "1986-12-27",
          "birth_place": "Port Arthur, TX",
          "death_date": "None",
          "college": "Texas",
          "high_school": "Memorial, TX",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "3",
          "draft_position": "73",
          "draft_year": "2008",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23645",
          "name": "Charcandrick West ",
          "position": "RB",
          "height": "5-10",
          "weight": "205",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1991-06-02",
          "birth_place": "Cullen, LA",
          "death_date": "None",
          "college": "Abilene Christian",
          "high_school": "Springhill, LA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "700,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8777",
          "name": "Tamba Hali",
          "position": "DE",
          "height": "6-2",
          "weight": "265",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1983-11-03",
          "birth_place": "Gbanga, Liberia",
          "death_date": "None",
          "college": "Penn St.",
          "high_school": "Teaneck, NJ",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "1",
          "draft_position": "20",
          "draft_year": "2006",
          "current_salary": "5,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20509",
          "name": "Alex Smith",
          "position": "QB",
          "height": "6-4",
          "weight": "212",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1984-05-07",
          "birth_place": "Seattle, WA",
          "death_date": "None",
          "college": "Utah",
          "high_school": "Helix, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2005",
          "current_salary": "10,800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18977",
          "name": "Ben Roethlisberger",
          "position": "QB",
          "height": "6-5",
          "weight": "240",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1982-03-02",
          "birth_place": "Lima, OH",
          "death_date": "None",
          "college": "Miami (OH)",
          "high_school": "Findlay, OH",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "1",
          "draft_position": "11",
          "draft_year": "2004",
          "current_salary": "12,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12018",
          "name": "Travis Kelce",
          "position": "TE",
          "height": "6-5",
          "weight": "255",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1989-10-05",
          "birth_place": "Westlake, OH",
          "death_date": "None",
          "college": "Cincinnati",
          "high_school": "Cleveland Heights, OH",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "3",
          "draft_position": "63",
          "draft_year": "2013",
          "current_salary": "2,700,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11648",
          "name": "Landry Jones",
          "position": "QB",
          "height": "6-4",
          "weight": "225",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1989-04-04",
          "birth_place": "Artesia, NM",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Artesia, NM",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "4",
          "draft_position": "115",
          "draft_year": "2013",
          "current_salary": "1,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19493",
          "name": "Cairo Santos",
          "position": "K",
          "height": "5-8",
          "weight": "160",
          "current_team": "Chicago Bears",
          "birth_date": "1991-11-21",
          "birth_place": "Sao Paulo, Brazil",
          "death_date": "None",
          "college": "Tulane",
          "high_school": "St. Joseph's Academy, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "243,529",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1465",
          "name": "Le'Veon Bell",
          "position": "RB",
          "height": "6-2",
          "weight": "230",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1992-02-18",
          "birth_place": "Reynoldsburg, OH",
          "death_date": "None",
          "college": "Michigan St.",
          "high_school": "Groveport Madison, OH",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "2",
          "draft_position": "48",
          "draft_year": "2013",
          "current_salary": "12,120,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4400",
          "name": "Chris Conley",
          "position": "WR",
          "height": "6-2",
          "weight": "207",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1992-10-25",
          "birth_place": "Dallas, GA",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "North Paulding, GA",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "3",
          "draft_position": "76",
          "draft_year": "2015",
          "current_salary": "635,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24336",
          "name": "Albert Wilson",
          "position": "WR",
          "height": "5-9",
          "weight": "200",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1992-07-12",
          "birth_place": "Port St. Lucie, FL",
          "death_date": "None",
          "college": "Georgia St.",
          "high_school": "Port St. Lucie, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,797,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2857",
          "name": "Martavis Bryant",
          "position": "WR",
          "height": "6-4",
          "weight": "211",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1991-12-20",
          "birth_place": "Calhoun Falls, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "T.L. Hanna, SC",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "4",
          "draft_position": "118",
          "draft_year": "2014",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2544",
          "name": "Antonio Brown ",
          "position": "WR",
          "height": "5-10",
          "weight": "180",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1988-07-10",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Central Michigan",
          "high_school": "Norland, FL",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "6",
          "draft_position": "195",
          "draft_year": "2010",
          "current_salary": "910,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20508",
          "name": "Alex Smith",
          "position": "TE",
          "height": "6-4",
          "weight": "258",
          "current_team": "None",
          "birth_date": "1982-05-22",
          "birth_place": "Denver, CO",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "J.K. Mullen, CO",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "3",
          "draft_position": "71",
          "draft_year": "2005",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13822",
          "name": "Jeremy Maclin",
          "position": "WR",
          "height": "6-0",
          "weight": "200",
          "current_team": "Baltimore Ravens",
          "birth_date": "1988-05-11",
          "birth_place": "St. Louis, MO",
          "death_date": "None",
          "college": "Missouri",
          "high_school": "Kirkwood, MO",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "1",
          "draft_position": "19",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Redskins",
        "Points": "31"
      },
      "Team 2": {
        "Name": "Buccaneers",
        "Points": "30"
      },
      "comments": " Last week, I wrote about how the Tampa Bay Buccaneers were on the verge of turning the corner. Stupid me. I should have known better. The Bucs aren't going anywhere. I should have known the Bucs, who have lost plenty of winnable games in franchise history, are capable of losing any game, no matter how big a lead they have. That now includes what they did Sunday, which had historic implications. The Redskins beat the Bucs 31-30, but the story of the day goes well beyond that. The Bucs (2-4) jumped out to a 24-0 lead in the second quarter, but still found a way to lose. It was the biggest deficit the Redskins (3-4) have ever come from behind to win in the regular season.    Forget all that talk about a quarterback controversy in Washington. Kirk Cousins is the starter, and that's not going to change after this game. Cousins was pretty close to perfection with plenty of help from the Tampa Bay defense. He completed 33-of-40 passes for 317 yards with three touchdowns and also ran for another score. Cousins isn't a bad fantasy option if your quarterback is injured.    Washington didn't get big production from its wide receivers, but tight end Jordan Reed made up for it. Reed had 11 catches for 72 yards and two touchdowns. Reed is a guy you have to use in daily fantasy.    Although it always is easy to blame a loss on the quarterback, you can't pin this loss on Tampa Bay's Jameis Winston. He had a solid game, completing 21-of-29 passes for 297 yards and two touchdowns. That's the kind of performance the Bucs would be happy to see from Winston every week. They want Winston to be a game manager. That's what Winston was Sunday, but his defense let him down in the second half.    Tampa Bay running back Doug Martin had his third-straight big game with 19 carries for 136 yards. But the Bucs didn't do a very good job of using Martin to attempt to run the clock out in the second half.    Washington took a big gamble on a third-quarter kickoff that might have been the turning point of the game. The Redskins recovered an onside kick to set up a touchdown. Around the league, there had been 24 onside kicks this season. Washington's was the first successful onside kick of the season.    Although he was sick with flu-like symptoms, wide receiver Mike Evans had his best game of the season. That shouldn't be a surprise. Evans had eight catches for 164 yards and a touchdown.    The downside of the win for the Redskins was that they suffered a major injury. Linebacker Ryan Kerrigan sustained a broken hand.   ",
      "players": [
        {
          "player_id": "18350",
          "name": "Jordan Reed",
          "position": "TE",
          "height": "6-3",
          "weight": "236",
          "current_team": "Washington Redskins",
          "birth_date": "1990-07-03",
          "birth_place": "New London, CT",
          "death_date": "None",
          "college": "Florida",
          "high_school": "New London, CT",
          "draft_team": "Washington Redskins",
          "draft_round": "3",
          "draft_position": "85",
          "draft_year": "2013",
          "current_salary": "3,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14151",
          "name": "Doug Martin ",
          "position": "RB",
          "height": "5-9",
          "weight": "223",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1989-01-13",
          "birth_place": "Stockton, CA",
          "death_date": "None",
          "college": "Boise St.",
          "high_school": "St. Mary's, CA",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "31",
          "draft_year": "2012",
          "current_salary": "5,764,706",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6598",
          "name": "Mike Evans",
          "position": "WR",
          "height": "6-5",
          "weight": "231",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1993-08-21",
          "birth_place": "Galveston, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Ball, TX",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "7",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24497",
          "name": "Jameis Winston",
          "position": "QB",
          "height": "6-4",
          "weight": "232",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1994-01-06",
          "birth_place": "Bessemer, AL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Hueytown, AL",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12163",
          "name": "Ryan Kerrigan",
          "position": "DE",
          "height": "6-3",
          "weight": "255",
          "current_team": "Washington Redskins",
          "birth_date": "1988-08-16",
          "birth_place": "Muncie, IN",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Muncie Central, IN",
          "draft_team": "Washington Redskins",
          "draft_round": "1",
          "draft_position": "16",
          "draft_year": "2011",
          "current_salary": "8,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4644",
          "name": "Kirk Cousins",
          "position": "QB",
          "height": "6-3",
          "weight": "214",
          "current_team": "Washington Redskins",
          "birth_date": "1988-08-19",
          "birth_place": "Holland, MI",
          "death_date": "None",
          "college": "Michigan St.",
          "high_school": "Holland Christian, MI",
          "draft_team": "Washington Redskins",
          "draft_round": "4",
          "draft_position": "102",
          "draft_year": "2012",
          "current_salary": "23,943,600",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Saints",
        "Points": "27"
      },
      "Team 2": {
        "Name": "Colts",
        "Points": "21"
      },
      "comments": " Contrary to popular belief, the New Orleans Saints aren't out of the NFC South race just yet. The Saints (3-4) jumped out to a big early lead and held on despite a strong comeback attempt by the Indianapolis Colts (3-4) for a 27-21 victory. The Saints now have won three of their last four games and have shown signs they're capable of much more than they displayed early in the season while getting their first road win of the season. Carolina and Atlanta may have better records, but New Orleans suddenly might be the hottest team in the NFC South and could make a move for the division title before all is said and done. The loss puts the Colts at 3-4 and creates more uncertainty about the future of coach Chuck Pagano, whose contract is up at the end of this season. With a few more losses, Pagano could find himself out of a job.    From a fantasy perspective, New Orleans' Mark Ingram was a stud. He had 14 carries for 143 yards with one touchdown. But Ingram's fantasy value was held back a bit by the fact that the Saints handed the ball to Khiry Robinson, who ran for two touchdowns.    Drew Brees had a pretty ordinary day from a fantasy perspective. Brees completed 28-of-45 passes for 255 yards with one touchdown and one interception. He was able to get the Saints out to a big early lead, but he was quiet late in the game.    Despite solid numbers from Brees, the Saints didn't get a lot out of their wide receivers. Brandin Cooks led the way with six catches for 81 yards. Marques Colston had just one catch for 20 yards. Colston is no longer a factor in fantasy leagues.    For Indianapolis, Andrew Luck put up some numbers (333 passing yards and three touchdowns). But Luck was intercepted twice and sacked four times.    New Orleans defensive end Cameron Jordan had two sacks.    T.Y. Hilton did a nice job of putting the Colts back in the game after they trailed big early. Hilton had four catches for 150 yards and two touchdowns.    The Colts didn't have much of a running game. Frank Gore led the way with 43 yards on eight carries. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "4350",
          "name": "Marques Colston",
          "position": "WR",
          "height": "6-4",
          "weight": "225",
          "current_team": "None",
          "birth_date": "1983-06-05",
          "birth_place": "Harrisburg, PA",
          "death_date": "None",
          "college": "Hofstra",
          "high_school": "Susquehanna Twp., PA",
          "draft_team": "New Orleans Saints",
          "draft_round": "7",
          "draft_position": "252",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8152",
          "name": "Frank Gore",
          "position": "RB",
          "height": "5-9",
          "weight": "215",
          "current_team": "Indianapolis Colts",
          "birth_date": "1983-05-14",
          "birth_place": "Coral Gables, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Coral Gables, FL",
          "draft_team": "San Francisco 49ers",
          "draft_round": "3",
          "draft_position": "65",
          "draft_year": "2005",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9921",
          "name": "T.Y. Hilton",
          "position": "WR",
          "height": "5-10",
          "weight": "183",
          "current_team": "Indianapolis Colts",
          "birth_date": "1989-11-14",
          "birth_place": "Miami Springs, FL",
          "death_date": "None",
          "college": "Florida International",
          "high_school": "Miami Springs, FL",
          "draft_team": "Indianapolis Colts",
          "draft_round": "3",
          "draft_position": "92",
          "draft_year": "2012",
          "current_salary": "8,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10635",
          "name": "Mark Ingram",
          "position": "RB",
          "height": "5-10",
          "weight": "215",
          "current_team": "New Orleans Saints",
          "birth_date": "1989-12-21",
          "birth_place": "Hackensack, NJ",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Southwestern Academy, MI",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "28",
          "draft_year": "2011",
          "current_salary": "3,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4480",
          "name": "Brandin Cooks",
          "position": "WR",
          "height": "5-10",
          "weight": "189",
          "current_team": "New England Patriots",
          "birth_date": "1993-09-25",
          "birth_place": "Stockton, CA",
          "death_date": "None",
          "college": "Oregon St.",
          "high_school": "Lincoln, CA",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "20",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13674",
          "name": "Andrew Luck ",
          "position": "QB",
          "height": "6-4",
          "weight": "240",
          "current_team": "Indianapolis Colts",
          "birth_date": "1989-09-12",
          "birth_place": "Washington, DC",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Stratford, TX",
          "draft_team": "Indianapolis Colts",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2012",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11740",
          "name": "Cameron Jordan",
          "position": "DE",
          "height": "6-4",
          "weight": "287",
          "current_team": "New Orleans Saints",
          "birth_date": "1989-07-10",
          "birth_place": "Chandler, AZ",
          "death_date": "None",
          "college": "California",
          "high_school": "Chandler, AZ",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2011",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18884",
          "name": "Khiry Robinson",
          "position": "RB",
          "height": "6-0",
          "weight": "220",
          "current_team": "None",
          "birth_date": "1989-12-28",
          "birth_place": "Midland, TX",
          "death_date": "None",
          "college": "West Texas A&M;",
          "high_school": "Belton, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2328",
          "name": "Drew Brees",
          "position": "QB",
          "height": "6-0",
          "weight": "209",
          "current_team": "New Orleans Saints",
          "birth_date": "1979-01-15",
          "birth_place": "Austin, TX",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Westlake, TX",
          "draft_team": "San Diego Chargers",
          "draft_round": "2",
          "draft_position": "32",
          "draft_year": "2001",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Patriots",
        "Points": "30"
      },
      "Team 2": {
        "Name": "Jets",
        "Points": "23"
      },
      "comments": " Even though New York came up short on the road in New England, the Jets showed that their improved record is no fluke as they played the defending champs very toughly. The Patriots were able to get just a little more out of Tom Brady, Rob Gronkowski and their receivers to make the difference over the Jets. Still, Todd Bowles clearly has this New York team as a legitimate wild-card contender.    On the second play of the game, Chandler Jones tracked down Ryan Fitzpatrick from behind to get a strip-sack that was recovered by Dont'a Hightower. That set up Brady at the Jets' 19-yard line. A sack from Muhammed Wilkerson though forced the Patriots to settle for a field goal. New York answered with a drive into New England territory led by passes of 24 and 11 yards to Eric Decker. The drive stalled inside the five, and the Jets settled for a field goal. They went on to open up a 10-3 lead as a 17-yard pass to Decker set up a short touchdown toss to Jeremy Kerley (3-27). The Patriots' offense finally got moving with a drive that started at midfield. A pass to Danny Amendola went for 23 yards did a lot of the distance, and after a few short gains, Brady scrambled to the Jets' 1-yard line with an 11-yard gain. He then dived into the end zone from a yard out on third down to tie the game at 10. New England got in position to take the lead with a 26-yard pass to Gronkowski. That set up a Patriot field goal for a 13-10 lead at the half. In the third quarter, the Patriots got moving when Scott Chandler out-jumped Calvin Pryor for a 26-yard gain. A few more short throws moved the ball to the Jets' 6-yard line before the drive stalled and ended in another field goal. The Jets finally put together a nice drive after falling dormant in the middle of the game. They methodically moved the ball down the field before Chris Ivory made a nifty catch for a 9-yard touchdown pass. New York moved close to the end zone again, but Brandon Marshall dropped a perfectly thrown touchdown pass from Fitzpatrick. Nick Folk added a field goal to make it 20-16 early in the fourth quarter. That drop proved to be huge. Brady got on the move with a 27-yard pass to Julian Edelman to get the drive started. Gronkowski added receptions of 11 and 12 yards, including giving Marcus Gilchrist for a ride on his back. The Patriots took the lead as Edelman made a tremendous leaping catch over Gilchrist for an 8-yard score. With the Patriots up 23-20, New England quickly got the ball back and a leaping grab by Amendola put the Patriots in New York's territory. The Jets brought the house on a blitz, and that left Gronkowski completely alone in the middle of the field for a 15-yard score. New England's defense allowed a field goal drive, but there were only seconds remaining. Shockingly, Brandon Marshall recovered the onside kick. A short pass to Decker and then a penalty on Marshall ran out the clock. Unfortunately, the Jets lost center Nick Mangold to scary injury late in the fourth quarter. It looked a hard hit to the head or neck that could be serious.    Tom Brady completed 34-of-54 passes for 355 yards with two touchdowns and no interceptions. He also led the Patriots on the ground with 15 yards on four carries. Brady was the MVP as he carried the New England offense.    Dion Lewis was inactive, but the excitement for LeGarrette Blount fantasy owners like myself was turned into a huge disappointment as he totaled minus-3 yards on three carries.    Gronkowski led New England through the air with 11 receptions for 108 yards and a score. He really hurt the Jets' defense. It was Gronkowski's 18th career 100-yard game. Danny Amendola (8-86-1) and Julian Edelman (5-54) chipped in some critical receptions. Brandon LaFell (2-25) returned to the field with a terrible performance of six dropped passes.    Ryan Fitzpatrick was 22-of-39 for 295 yards with two touchdowns. He had some good passes dropped by receivers.    Chris Ivory ran for 41 yards on 17 carries with two receptions for 12 yards and a touchdown. He injured a hamstring at the start of the game and didn't look like himself, but gutted it out.    Decker had six receptions for 94 yards, and Marshall had four catches for 67 yards, but his dropped touchdown was massive.    Defensively, the Jets received nice performances out of Sheldon Richardson, Calvin Pace and Muhammed Wilkerson. New England's defense was led by Rob Ninkovich with four passes batted. Jaime Collins had a sack, Chandler Jones had a strip-sack, and Dont'a Hightower totaled 10 tackles and a fumble recovery.   ",
      "players": [
        {
          "player_id": "14098",
          "name": "Brandon Marshall",
          "position": "OLB",
          "height": "6-1",
          "weight": "242",
          "current_team": "Denver Broncos",
          "birth_date": "1989-09-10",
          "birth_place": "Las Vegas, NV",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Cimarron-Memorial, NV",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "5",
          "draft_position": "142",
          "draft_year": "2012",
          "current_salary": "2,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7874",
          "name": "Marcus Gilchrist",
          "position": "DB",
          "height": "5-10",
          "weight": "193",
          "current_team": "Houston Texans",
          "birth_date": "1988-12-08",
          "birth_place": "High Point, NC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "T. Wingate Andrews, NC",
          "draft_team": "San Diego Chargers",
          "draft_round": "2",
          "draft_position": "50",
          "draft_year": "2011",
          "current_salary": "1,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13955",
          "name": "Nick Mangold",
          "position": "C",
          "height": "6-3",
          "weight": "295",
          "current_team": "None",
          "birth_date": "1984-01-13",
          "birth_place": "Centerville, OH",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Archbishop Alter, OH",
          "draft_team": "New York Jets",
          "draft_round": "1",
          "draft_position": "29",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6975",
          "name": "Ryan Fitzpatrick",
          "position": "QB",
          "height": "6-2",
          "weight": "221",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1982-11-24",
          "birth_place": "Gilbert, AZ",
          "death_date": "None",
          "college": "Harvard",
          "high_school": "Highland, AZ",
          "draft_team": "St. Louis Rams",
          "draft_round": "7",
          "draft_position": "250",
          "draft_year": "2005",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12762",
          "name": "Brandon LaFell",
          "position": "WR",
          "height": "6-2",
          "weight": "208",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1986-11-04",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Mirabeau B. Lamar, TX",
          "draft_team": "Carolina Panthers",
          "draft_round": "3",
          "draft_position": "78",
          "draft_year": "2010",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16427",
          "name": "Rob Ninkovich",
          "position": "DE",
          "height": "6-3",
          "weight": "251",
          "current_team": "None",
          "birth_date": "1984-02-01",
          "birth_place": "New Lenox, IL",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Lincoln Way Central, IL",
          "draft_team": "New Orleans Saints",
          "draft_round": "5",
          "draft_position": "135",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3751",
          "name": "Scott Chandler",
          "position": "TE",
          "height": "6-7",
          "weight": "270",
          "current_team": "None",
          "birth_date": "1985-07-23",
          "birth_place": "Bedford, TX",
          "death_date": "None",
          "college": "Iowa",
          "high_school": "Southlake Carroll, TX",
          "draft_team": "San Diego Chargers",
          "draft_round": "4",
          "draft_position": "129",
          "draft_year": "2007",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6236",
          "name": "Julian Edelman",
          "position": "WR",
          "height": "6-0",
          "weight": "198",
          "current_team": "New England Patriots",
          "birth_date": "1986-05-22",
          "birth_place": "Redwood City, CA",
          "death_date": "None",
          "college": "Kent St.",
          "high_school": "Woodside, CA",
          "draft_team": "New England Patriots",
          "draft_round": "7",
          "draft_position": "232",
          "draft_year": "2009",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7093",
          "name": "Nick Folk",
          "position": "K",
          "height": "6-2",
          "weight": "211",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1984-11-05",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "Arizona",
          "high_school": "Notre Dame, CA",
          "draft_team": "Dallas Cowboys",
          "draft_round": "6",
          "draft_position": "178",
          "draft_year": "2007",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2240",
          "name": "Tom Brady ",
          "position": "QB",
          "height": "6-4",
          "weight": "225",
          "current_team": "New England Patriots",
          "birth_date": "1977-08-03",
          "birth_place": "San Mateo, CA",
          "death_date": "None",
          "college": "Michigan",
          "high_school": "Junipero Serra, CA",
          "draft_team": "New England Patriots",
          "draft_round": "6",
          "draft_position": "199",
          "draft_year": "2000",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11527",
          "name": "Chandler Jones",
          "position": "DE",
          "height": "6-5",
          "weight": "247",
          "current_team": "Arizona Cardinals",
          "birth_date": "1990-07-12",
          "birth_place": "Brownsburg, IN",
          "death_date": "None",
          "college": "Syracuse",
          "high_school": "Union Endicott, NY",
          "draft_team": "New England Patriots",
          "draft_round": "1",
          "draft_position": "21",
          "draft_year": "2012",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "382",
          "name": "Danny Amendola",
          "position": "WR",
          "height": "5-11",
          "weight": "183",
          "current_team": "New England Patriots",
          "birth_date": "1985-11-02",
          "birth_place": "The Woodlands, TX",
          "death_date": "None",
          "college": "Texas Tech",
          "high_school": "The Woodlands, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13269",
          "name": "Dion Lewis",
          "position": "RB",
          "height": "5-8",
          "weight": "195",
          "current_team": "New England Patriots",
          "birth_date": "1990-09-27",
          "birth_place": "Brooklyn, NY",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Albany, NY",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "5",
          "draft_position": "149",
          "draft_year": "2011",
          "current_salary": "1,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8573",
          "name": "Rob Gronkowski",
          "position": "TE",
          "height": "6-6",
          "weight": "265",
          "current_team": "New England Patriots",
          "birth_date": "1989-05-14",
          "birth_place": "Amherst, NY",
          "death_date": "None",
          "college": "Arizona",
          "high_school": "Williamsville North, NY",
          "draft_team": "New England Patriots",
          "draft_round": "2",
          "draft_position": "42",
          "draft_year": "2010",
          "current_salary": "4,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9811",
          "name": "Dont'a Hightower ",
          "position": "ILB",
          "height": "6-2",
          "weight": "266",
          "current_team": "New England Patriots",
          "birth_date": "1990-03-12",
          "birth_place": "Lewisburg, TN",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Marshall County, TN",
          "draft_team": "New England Patriots",
          "draft_round": "1",
          "draft_position": "25",
          "draft_year": "2012",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5403",
          "name": "Eric Decker",
          "position": "WR",
          "height": "6-3",
          "weight": "206",
          "current_team": "Tennessee Titans",
          "birth_date": "1987-03-15",
          "birth_place": "Cold Spring, MN",
          "death_date": "None",
          "college": "Minnesota",
          "high_school": "Rocori, MN",
          "draft_team": "Denver Broncos",
          "draft_round": "3",
          "draft_position": "87",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1890",
          "name": "LeGarrette Blount",
          "position": "RB",
          "height": "6-1",
          "weight": "245",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1986-12-05",
          "birth_place": "Madison, FL",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Taylor Co., FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16969",
          "name": "Calvin Pace",
          "position": "DE",
          "height": "6-4",
          "weight": "262",
          "current_team": "None",
          "birth_date": "1980-10-28",
          "birth_place": "Detroit, MI",
          "death_date": "None",
          "college": "Wake Forest",
          "high_school": "Lithia Springs, GA",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "18",
          "draft_year": "2003",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18014",
          "name": "Calvin Pryor",
          "position": "FS",
          "height": "5-11",
          "weight": "207",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1992-07-02",
          "birth_place": "Port St. Joe, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Port St. Joe, FL",
          "draft_team": "New York Jets",
          "draft_round": "1",
          "draft_position": "18",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12147",
          "name": "Jeremy Kerley",
          "position": "WR",
          "height": "5-9",
          "weight": "188",
          "current_team": "New York Jets",
          "birth_date": "1988-11-08",
          "birth_place": "Hutto, TX",
          "death_date": "None",
          "college": "TCU",
          "high_school": "Hutto, TX",
          "draft_team": "New York Jets",
          "draft_round": "5",
          "draft_position": "153",
          "draft_year": "2011",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14097",
          "name": "Brandon Marshall",
          "position": "WR",
          "height": "6-4",
          "weight": "229",
          "current_team": "New York Giants",
          "birth_date": "1984-03-23",
          "birth_place": "Pittsburgh, PA",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Lake Howell, FL",
          "draft_team": "Denver Broncos",
          "draft_round": "4",
          "draft_position": "119",
          "draft_year": "2006",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10701",
          "name": "Chris Ivory",
          "position": "RB",
          "height": "6-0",
          "weight": "222",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1988-03-22",
          "birth_place": "Longview, TX",
          "death_date": "None",
          "college": "Washington St.",
          "high_school": "Longview, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "4,500,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Dolphins",
        "Points": "44"
      },
      "Team 2": {
        "Name": "Texans",
        "Points": "26"
      },
      "comments": " Apparently, Dan Campbell was the answer for the Dolphins because they had their second-straight game of inspired football. This game was complete domination from start to finish, and it is incomprehensible to think that this is the same Miami team that looked abysmal in London a few weeks ago. For Houston, this game was uglier than the final score. The defense was putrid, and the offense opened the game with with six three-and-outs and a pick-six before recording a first down. Early in the second quarter, this game was all but over.    On the Dolphins' first drive of the game, they moved the ball on Houston before Ryan Tannehill hit Rishard Matthews in stride on a slant, and he took off for 53 yards to pay dirt. Shortly later, Jarvis Landry broke off a 50-yard touchdown reception. He ran an out route to the sideline before slashing all the way across the field while veering downfield to dart into the end zone. Lamar Miller was up next to gash the Texans' defense with a 29-yard run. A few plays later, Tannehill hooked up with Landry for a 10-yard touchdown on a crossing route. Tannehill added his fourth touchdown pass of the half with a 54-yard screen pass to Miller. He ran untouched into the end zone. If that wasn't bad enough, Texans tight end C.J. Fiedorowicz bobbled an easy catch, and Reshad Jones caught the deflection with a quick return of 23-yards for a touchdown. Under three minutes before the half, Lamar Miller ripped off an 85-yard touchdown run. Miami took a 41-0 lead into the locker room. Obviously, the second half was all garbage time. The Texans produced a fumble from the Dolphins' Damian Williams, and that set up a 7-yard touchdown pass to Arian Foster. Shortly later, Foster added another touchdown on a short run and Nate Washington caught a 27-yard score. Miami then tacked on a 53-yard field goal, and Washington had another short touchdown catch to conclude the scoring.    Ryan Tannehill dominated Houston. He was 18-of-19 for 282 yards with four touchdowns. It was an easy day at the office for Tannehill. Miami seemed to have the perfect play call throughout the first half.    Lamar Miller was awesome. He ripped off 175 yards on 14 carries with one touchdown rushing. He added three receptions for 61 yards and a touchdown. All of this occurred in the first half. The Texans were incapable of defending Miller.    Jarvis Landry led Miami through the air with five catches for 83 yards and two scores. Rishard Matthews (3-75-1) also was impressive.    Brian Hoyer was 23-of-49 for 273 yards with three touchdowns and one interception. Behind a weak offensive line, he was ineffective until the outcome was decided.    Arian Foster ran for 58 yards on 18 carries with a score. He had 66 yards on five catches with another touchdown. However, late in the fourth quarter, Foster had his left leg give out on him untouched and had to be helped off the field with a cart ride into the locker room. This looks like it could be a serious injury to the left Achilles for Foster.    Surprisingly, Miami's weak secondary did the best job defending DeAndre Hopkins this season. He had only six catches for 50 yards. Nate Washington led Houston's garbage-time production with 127 yards on nine receptions and two scores.    The Dolphins' defense flat-out destroyed the Texans' offensive line. Ndamukong Suh had his best game as a Dolphin. Suh totaled five tackles, two sacks and five quarterback hits.    The lone bright spot for the Texans was Jadeveon Clowney beating Brandon Albert around the corner for his first career sack. On the next play, he added a tackle for a loss. Clowney flashed on other plays as well and led the Texans with eight tackles. J.J. Watt was second with seven tackles and also had two sacks. The rest of Houston's defense played like hot garbage baking in the Florida sun.   ",
      "players": [
        {
          "player_id": "10191",
          "name": "DeAndre Hopkins",
          "position": "WR",
          "height": "6-1",
          "weight": "214",
          "current_team": "Houston Texans",
          "birth_date": "1992-06-06",
          "birth_place": "Central, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "D.W. Daniel, SC",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "27",
          "draft_year": "2013",
          "current_salary": "8,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11684",
          "name": "Reshad Jones",
          "position": "DB",
          "height": "6-2",
          "weight": "215",
          "current_team": "Miami Dolphins",
          "birth_date": "1988-02-25",
          "birth_place": "Atlanta, GA",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Booker T. Washington, GA",
          "draft_team": "Miami Dolphins",
          "draft_round": "5",
          "draft_position": "163",
          "draft_year": "2010",
          "current_salary": "950,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4110",
          "name": "Jadeveon Clowney",
          "position": "DE",
          "height": "6-5",
          "weight": "266",
          "current_team": "Houston Texans",
          "birth_date": "1993-02-14",
          "birth_place": "Rock Hill, SC",
          "death_date": "None",
          "college": "South Carolina",
          "high_school": "South Pointe, SC",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7173",
          "name": "Arian Foster ",
          "position": "RB",
          "height": "6-0",
          "weight": "232",
          "current_team": "None",
          "birth_date": "1986-08-24",
          "birth_place": "San Diego, CA",
          "death_date": "None",
          "college": "Tennessee",
          "high_school": "Mission Bay, CA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21763",
          "name": "Ryan Tannehill",
          "position": "QB",
          "height": "6-4",
          "weight": "220",
          "current_team": "Miami Dolphins",
          "birth_date": "1988-07-27",
          "birth_place": "Big Spring, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Big Spring, TX",
          "draft_team": "Miami Dolphins",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2012",
          "current_salary": "17,975,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10340",
          "name": "Brian Hoyer",
          "position": "QB",
          "height": "6-3",
          "weight": "215",
          "current_team": "New England Patriots",
          "birth_date": "1985-10-13",
          "birth_place": "North Olmsted, OH",
          "death_date": "None",
          "college": "Michigan St.",
          "high_school": "St. Ignatius, OH",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6864",
          "name": "C.J. Fiedorowicz",
          "position": "TE",
          "height": "6-6",
          "weight": "265",
          "current_team": "Houston Texans",
          "birth_date": "1991-10-22",
          "birth_place": "Johnsburg, IL",
          "death_date": "None",
          "college": "Iowa",
          "high_school": "Johnsburg, IL",
          "draft_team": "Houston Texans",
          "draft_round": "3",
          "draft_position": "65",
          "draft_year": "2014",
          "current_salary": "3,097,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23353",
          "name": "Nate Washington",
          "position": "WR",
          "height": "6-1",
          "weight": "185",
          "current_team": "None",
          "birth_date": "1983-08-28",
          "birth_place": "Toledo, OH",
          "death_date": "None",
          "college": "Tiffin",
          "high_school": "Scott, OH",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23423",
          "name": "J.J. Watt",
          "position": "DE",
          "height": "6-6",
          "weight": "290",
          "current_team": "Houston Texans",
          "birth_date": "1989-03-22",
          "birth_place": "Pewaukee, WI",
          "death_date": "None",
          "college": "Central Michigan",
          "high_school": "Pewaukee, WI",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "11",
          "draft_year": "2011",
          "current_salary": "10,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21534",
          "name": "Ndamukong Suh",
          "position": "DT",
          "height": "6-4",
          "weight": "307",
          "current_team": "Miami Dolphins",
          "birth_date": "1987-01-06",
          "birth_place": "Portland, OR",
          "death_date": "None",
          "college": "Nebraska",
          "high_school": "Grant, OR",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2010",
          "current_salary": "9,985,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12827",
          "name": "Jarvis Landry",
          "position": "WR",
          "height": "6-0",
          "weight": "205",
          "current_team": "Miami Dolphins",
          "birth_date": "1992-11-28",
          "birth_place": "Metairie, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Lutcher, LA",
          "draft_team": "Miami Dolphins",
          "draft_round": "2",
          "draft_position": "63",
          "draft_year": "2014",
          "current_salary": "893,852",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15340",
          "name": "Lamar Miller",
          "position": "RB",
          "height": "5-11",
          "weight": "215",
          "current_team": "Houston Texans",
          "birth_date": "1991-04-25",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Killian, FL",
          "draft_team": "Miami Dolphins",
          "draft_round": "4",
          "draft_position": "97",
          "draft_year": "2012",
          "current_salary": "5,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14314",
          "name": "Rishard Matthews",
          "position": "WR",
          "height": "6-0",
          "weight": "212",
          "current_team": "Tennessee Titans",
          "birth_date": "1989-10-12",
          "birth_place": "San Diego, CA",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Saddleback, CA",
          "draft_team": "Miami Dolphins",
          "draft_round": "7",
          "draft_position": "227",
          "draft_year": "2012",
          "current_salary": "5,000,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Vikings",
        "Points": "28"
      },
      "Team 2": {
        "Name": "Lions",
        "Points": "19"
      },
      "comments": " The young Vikings tandem of second-year quarterback Teddy Bridgewater and rookie wide receiver Stefon Diggs continued their hot play to lead a comeback road win in Detroit. Minnesota's front seven dominated the Lions' offensive line, and Matthew Stafford had no chance to sustain drives with the relentless Vikings pass rush. Minnesota remains in the playoff race, while Detroit maintains its status as a top competitor for the No. 1 overall pick in the 2016 NFL Draft.    The Lions started the game well in the first quarter. They got going early with Stafford connecting downfield for 46 yards with Calvin Johnson. To finish the drive, Stafford went to Johnson on a short fade pass on the side of the end zone in front of Xavier Rhodes for the touchdown. Minnesota responded with Bridgewater using Diggs, Mike Wallace, and handoffs to Adrian Peterson to put up a three-point drive. Stafford came back to find Eric Ebron wide open for a gain of 55 yards. Ameer Abdullah had a nice run of 13 to the Vikings 7-yard line, and then Stafford hit Ebron for a touchdown. Bridgewater led another field goal drive for Minnesota, but on his next possession, he fumbled the exchange to Peterson, and Detroit's Stephen Tulloch fell on the loose ball. That led to a Lions field goal and a 17-6 lead. Minnesota answered with a 49-yard pass to fullback Zach Line as he was left completely uncovered along the sideline. On a third-and-goal, Bridgewater found Kyle Rudolph wide open for a short touchdown catch. Bridgewater tacked on a field goal drive with Blair Walsh hitting a 51-yarder in the final seconds before half. The Lions took a 17-15 lead into halftime. Early in the third quarter, Bridgewater laid out a bomb for Diggs, who made a superb diving catch for a 36-yard touchdown. On the Vikings next possession, Peterson broke off a 75-yard run to Detroit's 3-yard line. Caraun Reid came up with a sack on third-and-goal, leaving Minnesota with just a field goal. Bridgewater went on to set up another chip-shot field goal with a 30-yard pass to Adam Thielen. The Vikings suffocated the Lions' defense until garbage time late in the fourth quarter. A 31-yard pass to Theo Riddick, a nice gain to Eric Ebron, and Calvin Johnson caught a deflected pass at the one-yard line. However, the Vikings put together a goal-line stand and took over after Stafford was incomplete on fourth down.    Teddy Bridgewater completed 25-of-35 for 316 yards with two touchdowns. He was very efficient for Minnesota, taking what the defense gave him and picking apart Detroit's weak secondary.    Adrian Peterson ran for 98 yards on 19 carries. Aside from his long run, he didn't find much running holes against Detroit.    Fifth-round pick Stefon Diggs totaled 108 yards and a touchdown on six receptions. He showed his speed once again as the Lions' corners were incapable of keeping Diggs from separating.    Matthew Stafford completed 18-of-26 passes for 256 yards with two touchdowns. It was an underwhelming game, but Stafford had no chance with his pathetic offensive line. He was consistently getting planted into the turf. Chad Greenway, Harrison Smith, Anthony Barr (.5), Erik Kendricks, Tom Johnson and Everson Griffin (1.5) combined for seven sacks. The day's total was the most sacks that Stafford had ever taken in a single game.    Detroit's leading rusher was Ameer Abdullah, who totaled 43 yards on eight carries.    Eric Ebron led the Lions with five catches for 89 yards and a touchdown. Calvin Johnson had 86 yards on a handful of receptions with a score.    On the bright side for Detroit, young defensive tackle Caraun Reid had a superb game with six tackles, one sack and four for a loss. He was overwhelming the interior of the Vikings' offensive line. Ziggy Ansah, Haloti Ngata and Kyle Van Noy also recorded sacks.   ",
      "players": [
        {
          "player_id": "6211",
          "name": "Eric Ebron",
          "position": "TE",
          "height": "6-4",
          "weight": "250",
          "current_team": "Detroit Lions",
          "birth_date": "1993-04-10",
          "birth_place": "Newark, NJ",
          "death_date": "None",
          "college": "North Carolina",
          "high_school": "Ben L. Smith, NC",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "10",
          "draft_year": "2014",
          "current_salary": "1,590,337",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18654",
          "name": "Theo Riddick",
          "position": "RB",
          "height": "5-10",
          "weight": "201",
          "current_team": "Detroit Lions",
          "birth_date": "1991-05-04",
          "birth_place": "Manville, NJ",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Immaculata, NJ",
          "draft_team": "Detroit Lions",
          "draft_round": "6",
          "draft_position": "199",
          "draft_year": "2013",
          "current_salary": "1,075,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23184",
          "name": "Blair Walsh",
          "position": "K",
          "height": "5-9",
          "weight": "186",
          "current_team": "Seattle Seahawks",
          "birth_date": "1990-01-08",
          "birth_place": "Boca Raton, FL",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Cardinal Gibbons, FL",
          "draft_team": "Minnesota Vikings",
          "draft_round": "6",
          "draft_position": "175",
          "draft_year": "2012",
          "current_salary": "800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11189",
          "name": "Calvin Johnson ",
          "position": "WR",
          "height": "6-5",
          "weight": "239",
          "current_team": "None",
          "birth_date": "1985-09-25",
          "birth_place": "Tyrone, GA",
          "death_date": "None",
          "college": "Georgia Tech",
          "high_school": "Sandy Creek, GA",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2007",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17463",
          "name": "Adrian Peterson",
          "position": "RB",
          "height": "6-2",
          "weight": "217",
          "current_team": "Arizona Cardinals",
          "birth_date": "1985-03-21",
          "birth_place": "Palestine, TX",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Palestine, TX",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "7",
          "draft_year": "2007",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8448",
          "name": "Chad Greenway",
          "position": "LB",
          "height": "6-2",
          "weight": "240",
          "current_team": "None",
          "birth_date": "1983-01-12",
          "birth_place": "Mount Vernon, SD",
          "death_date": "None",
          "college": "Iowa",
          "high_school": "Mount Vernon, SD",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "17",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21069",
          "name": "Matthew Stafford",
          "position": "QB",
          "height": "6-2",
          "weight": "230",
          "current_team": "Detroit Lions",
          "birth_date": "1988-02-07",
          "birth_place": "Tampa, FL",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Highland Park, TX",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2009",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1147",
          "name": "Anthony Barr",
          "position": "OLB",
          "height": "6-5",
          "weight": "255",
          "current_team": "Minnesota Vikings",
          "birth_date": "1992-03-18",
          "birth_place": "South Bend, IN",
          "death_date": "None",
          "college": "UCLA",
          "high_school": "Loyola, CA",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "9",
          "draft_year": "2014",
          "current_salary": "2,157,750",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23158",
          "name": "Mike Wallace",
          "position": "WR",
          "height": "6-0",
          "weight": "180",
          "current_team": "Baltimore Ravens",
          "birth_date": "1986-08-01",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Mississippi",
          "high_school": "O. Perry Walker, LA",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "3",
          "draft_position": "84",
          "draft_year": "2009",
          "current_salary": "4,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18421",
          "name": "Caraun Reid",
          "position": "DT",
          "height": "6-2",
          "weight": "302",
          "current_team": "Washington Redskins",
          "birth_date": "1991-11-23",
          "birth_place": "Bronx, NY",
          "death_date": "None",
          "college": "Princeton",
          "high_school": "Mount Saint Michael Academy, NY",
          "draft_team": "Detroit Lions",
          "draft_round": "5",
          "draft_position": "158",
          "draft_year": "2014",
          "current_salary": "487,059",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21992",
          "name": "Adam Thielen",
          "position": "WR",
          "height": "6-3",
          "weight": "200",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-08-22",
          "birth_place": "Detroit Lakes, MN",
          "death_date": "None",
          "college": "Minnesota St.",
          "high_school": "Detroit Lakes, MN",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19223",
          "name": "Kyle Rudolph ",
          "position": "TE",
          "height": "6-5",
          "weight": "265",
          "current_team": "Minnesota Vikings",
          "birth_date": "1989-11-09",
          "birth_place": "Cincinnati, OH",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Elder, OH",
          "draft_team": "Minnesota Vikings",
          "draft_round": "2",
          "draft_position": "43",
          "draft_year": "2011",
          "current_salary": "5,150,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22823",
          "name": "Kyle Van Noy",
          "position": "OLB",
          "height": "6-3",
          "weight": "243",
          "current_team": "New England Patriots",
          "birth_date": "1991-03-26",
          "birth_place": "Reno, NV",
          "death_date": "None",
          "college": "BYU",
          "high_school": "McQueen, NV",
          "draft_team": "Detroit Lions",
          "draft_round": "2",
          "draft_position": "40",
          "draft_year": "2014",
          "current_salary": "990,741",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20629",
          "name": "Harrison Smith",
          "position": "FS",
          "height": "6-2",
          "weight": "212",
          "current_team": "Minnesota Vikings",
          "birth_date": "1989-02-02",
          "birth_place": "Knoxville, TN",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Knoxville Catholic, TN",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "29",
          "draft_year": "2012",
          "current_salary": "5,150,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13388",
          "name": "Zach Line",
          "position": "FB",
          "height": "6-1",
          "weight": "230",
          "current_team": "New Orleans Saints",
          "birth_date": "1990-04-26",
          "birth_place": "Oxford, MI",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Oxford, MI",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10",
          "name": "Ameer Abdullah",
          "position": "RB",
          "height": "5-8",
          "weight": "198",
          "current_team": "Detroit Lions",
          "birth_date": "1993-06-13",
          "birth_place": "Homewood, AL",
          "death_date": "None",
          "college": "Nebraska",
          "high_school": "Homewood, AL",
          "draft_team": "Detroit Lions",
          "draft_round": "2",
          "draft_position": "54",
          "draft_year": "2015",
          "current_salary": "687,830",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5642",
          "name": "Stefon Diggs",
          "position": "WR",
          "height": "6-0",
          "weight": "195",
          "current_team": "Minnesota Vikings",
          "birth_date": "1993-11-29",
          "birth_place": "Gaithersburg, MD",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Our Lady of Good Counsel, MD",
          "draft_team": "Minnesota Vikings",
          "draft_round": "5",
          "draft_position": "146",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22599",
          "name": "Stephen Tulloch",
          "position": "LB",
          "height": "5-11",
          "weight": "230",
          "current_team": "None",
          "birth_date": "1985-01-01",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "North Carolina St.",
          "high_school": "Miami Killian, FL",
          "draft_team": "Tennessee Titans",
          "draft_round": "4",
          "draft_position": "116",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16372",
          "name": "Haloti Ngata",
          "position": "DT",
          "height": "6-4",
          "weight": "335",
          "current_team": "Detroit Lions",
          "birth_date": "1984-01-21",
          "birth_place": "Inglewood, CA",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Highland, UT",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "12",
          "draft_year": "2006",
          "current_salary": "5,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18545",
          "name": "Xavier Rhodes",
          "position": "CB",
          "height": "6-2",
          "weight": "210",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-06-19",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Norland, FL",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "25",
          "draft_year": "2013",
          "current_salary": "8,026,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2377",
          "name": "Teddy Bridgewater",
          "position": "QB",
          "height": "6-2",
          "weight": "214",
          "current_team": "Minnesota Vikings",
          "birth_date": "1992-11-10",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Miami Northwestern, FL",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "32",
          "draft_year": "2014",
          "current_salary": "1,354,023",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11437",
          "name": "Tom Johnson",
          "position": "DT",
          "height": "6-3",
          "weight": "288",
          "current_team": "Minnesota Vikings",
          "birth_date": "1984-08-30",
          "birth_place": "Moss Point, MS",
          "death_date": "None",
          "college": "Southern Miss",
          "high_school": "Moss Point, MS",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,300,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Falcons",
        "Points": "10"
      },
      "Team 2": {
        "Name": "Titans",
        "Points": "7"
      },
      "comments": " It wasn't pretty by any means. But the Atlanta Falcons aren't aiming for artistry. They're shooting for wins, and that's what they got Sunday against the Tennessee Titans. At the day of the day, a win is a win, Atlanta quarterback Matt Ryan said. When you go on the road and get it done that's rewarding. It's rewarding enough that the Falcons are 6-1 and very much in the race for the NFC South championship. So what if the Falcons only won by three points against a Tennessee team that fell to 1-5? The important thing is that the Falcons took care of business and got the victory.    Ryan didn't have his best day. He completed 22-of-38 passes for 251 yards with one touchdown and two interceptions. But Ryan's performance still was good enough to produce a win.    One of the best stories - fantasy or reality - continues to be Atlanta running back Devonta Freeman. He ran for 116 yards on 25 carries. The only downside was that Freeman didn't score a touchdown in this game.    Atlanta's game plan was centered very much around Julio Jones. He was targeted 17 times and finished with nine catches for 92 yards and a touchdown.    Jones remains the primary target in Atlanta's passing game. Roddy White had only three catches for 48 yards and should not be a consideration for your fantasy team at this point.    Atlanta's defense, which is much improved under new coach Dan Quinn, had perhaps its best day of the season. The Titans were playing without starting quarterback Marcus Mariota. But Atlanta held Tennessee's Zach Mettenberger to 187 yards on 22-of-35 attempts. Mettenberger had one touchdown and two interceptions and never really got the Tennessee offense moving.    Tennessee's running game never got on track. Antonio Andrews had 10 carries for 57 yards and Dexter McCluster was given five carries for 20 yards.    In the passing game, Tennessee tight end Delanie Walker had seven catches for 55 yards, and McCluster tallied six catches for 48 yards. Tennessee's only touchdown came on a pass from Mettenberger to Kendall Wright.   ",
      "players": [
        {
          "player_id": "24742",
          "name": "Kendall Wright",
          "position": "WR",
          "height": "5-10",
          "weight": "194",
          "current_team": "Chicago Bears",
          "birth_date": "1989-11-12",
          "birth_place": "Mount Pleasant, TX",
          "death_date": "None",
          "college": "Baylor",
          "high_school": "Pittsburg, TX",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "20",
          "draft_year": "2012",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23085",
          "name": "Delanie Walker",
          "position": "TE",
          "height": "6-1",
          "weight": "241",
          "current_team": "Tennessee Titans",
          "birth_date": "1984-08-12",
          "birth_place": "Pomona, CA",
          "death_date": "None",
          "college": "Central Missouri St.",
          "high_school": "Pomona, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "6",
          "draft_position": "175",
          "draft_year": "2006",
          "current_salary": "4,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19319",
          "name": "Matt Ryan",
          "position": "QB",
          "height": "6-4",
          "weight": "217",
          "current_team": "Atlanta Falcons",
          "birth_date": "1985-05-17",
          "birth_place": "Exton, PA",
          "death_date": "None",
          "college": "Boston Col.",
          "high_school": "William Penn Charter School, PA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2008",
          "current_salary": "15,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11634",
          "name": "Julio Jones",
          "position": "WR",
          "height": "6-4",
          "weight": "220",
          "current_team": "Atlanta Falcons",
          "birth_date": "1989-02-03",
          "birth_place": "Foley, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Foley, AL",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "6",
          "draft_year": "2011",
          "current_salary": "11,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14056",
          "name": "Marcus Mariota",
          "position": "QB",
          "height": "6-4",
          "weight": "215",
          "current_team": "Tennessee Titans",
          "birth_date": "1993-10-30",
          "birth_place": "Honolulu, HI",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Saint Louis, HI",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "509",
          "name": "Antonio Andrews",
          "position": "RB",
          "height": "5-10",
          "weight": "225",
          "current_team": "None",
          "birth_date": "1992-08-17",
          "birth_place": "Enterprise, AL",
          "death_date": "None",
          "college": "West. Kentucky",
          "high_school": "Fort Campbell, KY",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14550",
          "name": "Dexter McCluster",
          "position": "WR",
          "height": "5-9",
          "weight": "165",
          "current_team": "None",
          "birth_date": "1989-08-25",
          "birth_place": "Largo, FL",
          "death_date": "None",
          "college": "Mississippi",
          "high_school": "Largo, FL",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23810",
          "name": "Roddy White",
          "position": "WR",
          "height": "6-1",
          "weight": "201",
          "current_team": "None",
          "birth_date": "1981-11-02",
          "birth_place": "James Island, SC",
          "death_date": "None",
          "college": "Ala-Birmingham",
          "high_school": "James Island, SC",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "27",
          "draft_year": "2005",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15172",
          "name": "Zach Mettenberger",
          "position": "QB",
          "height": "6-5",
          "weight": "224",
          "current_team": "None",
          "birth_date": "1991-07-16",
          "birth_place": "Athens, GA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Oconee County, GA",
          "draft_team": "Tennessee Titans",
          "draft_round": "6",
          "draft_position": "178",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Raiders",
        "Points": "37"
      },
      "Team 2": {
        "Name": "Chargers",
        "Points": "29"
      },
      "comments": " This game got off to an auspicious start as Malcom Smith picked off Philip Rivers on the third play of the game, and returned it to the 1-yard line, where Latavius Murray layed-up the easy goal-line touchdown. It was all down hill from there for the Chargers, well, unless you count garbage time, which you do in fantasy!    Derek Carr was on point in this one, making perfect pass after perfect pass. This was the Carr we saw in Weeks 2 and 3. With the score still within reach, Carr hit Clive Walford with a pretty over-the-shoulder pass for a 23-yard touchdown to make it 17-3 Raiders. It was then on.    Amari Cooper was the next to get in on the fun, as he caught a pass on a crossing route and then went on to make multiple defenders miss on his way to a 51-yard touchdown. San Diego had been holding No. 1 receivers down for just 50 receiving yards a game coming into Sunday, but Cooper ended up with five receptions on six targets for 133 yards and that touchdown. He hadn't topped 49 yards receiving in his last two games, so it was nice to see him take a good pass defense to school this week.    Michael Crabtree was next in line for a touchdown, when he caught a 25-yarder from Carr in the third quarter to put the Raiders up 37-6. The blowout had arrived. That is, until the fourth quarter.    Carr finished the day with 24-of-31 attempts for 289 yards and three touchdowns. That 77.4 percent completion rate was his highest of the season and is especially nice considering the Chargers were allowing a 61 percent completion rate coming into the game. This performance puts him right back up in the conversation of up-and-coming quarterbacks; now, if he can just find some consistency.    The Raiders let off the gas, and Philip Rivers gave it a run, making three touchdown passes in the last quarter. There never really was much of a chance San Diego would be able to come back all the way, but there were a couple times that it felt like it was in the realm of possibility.    After an ugly start, Rivers finished the game having gone 38-of-58 for 336 yards, three touchdowns and two interceptions. This wasn't a game he'll remember fondly, but he has now topped 300 yards in 5-of-7 games, and has multiple touchdown passes in 6-of-7.    Keenan Allen led the way with 13 targets, catching nine for 89 yards. He also had a touchdown called back late on a poorly called offensive pass interference. The Chargers went on to score, but it was blatantly the wrong call, much to the chagrin of fantasy players starting Allen.    Danny Woodhead was the garbage man in this one, catching the last two touchdowns of the game. On the day, he totaled 101 yards, 11 receptions and those two touchdowns. With Melvin Gordon benched for the first half due to his fumbles in Green Bay last week, Woodhead and Brandon Oliver were the main backs, with Woodhead taking over in hurry-up.    The Raiders looked much better post-bye than pre-bye, which leads me to believe the talent is here; they are just having trouble finding consistency. That falls on the coaching staff, so if we get another stretch of not-so-great play, I'll be looking straight at head coach, Jack of the River.    Neither team had much pass rush, which helped these two teams throw for more than 600 combined yards, but the two turnovers by Rivers look like the deciding factor after the Chargers stormed back. As usual, when you win the turnover battle, your odds of winning are greatly improved. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "23066",
          "name": "Clive Walford",
          "position": "TE",
          "height": "6-4",
          "weight": "254",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-10-21",
          "birth_place": "Belle Glade, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Glades Central, FL",
          "draft_team": "Oakland Raiders",
          "draft_round": "3",
          "draft_position": "68",
          "draft_year": "2015",
          "current_salary": "710,646",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4700",
          "name": "Michael Crabtree",
          "position": "WR",
          "height": "6-2",
          "weight": "215",
          "current_team": "Oakland Raiders",
          "birth_date": "1987-09-14",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Texas Tech",
          "high_school": "David W. Carter, TX",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "10",
          "draft_year": "2009",
          "current_salary": "6,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8145",
          "name": "Melvin Gordon",
          "position": "RB",
          "height": "6-1",
          "weight": "207",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1993-04-13",
          "birth_place": "Kenosha, WI",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Mary D. Bradford, WI",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "15",
          "draft_year": "2015",
          "current_salary": "1,404,980",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24616",
          "name": "Danny Woodhead",
          "position": "RB",
          "height": "5-9",
          "weight": "200",
          "current_team": "Baltimore Ravens",
          "birth_date": "1985-01-25",
          "birth_place": "North Platte, NE",
          "death_date": "None",
          "college": "Chadron St.",
          "high_school": "North Platte, NE",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18745",
          "name": "Philip Rivers",
          "position": "QB",
          "height": "6-5",
          "weight": "228",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1981-12-08",
          "birth_place": "Decatur, AL",
          "death_date": "None",
          "college": "North Carolina St.",
          "high_school": "Athens, AL",
          "draft_team": "New York Giants",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2004",
          "current_salary": "11,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "317",
          "name": "Keenan Allen",
          "position": "WR",
          "height": "6-2",
          "weight": "206",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1992-04-27",
          "birth_place": "Greensboro, NC",
          "death_date": "None",
          "college": "California",
          "high_school": "Northern Guilford, NC",
          "draft_team": "San Diego Chargers",
          "draft_round": "3",
          "draft_position": "76",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16093",
          "name": "Latavius Murray",
          "position": "RB",
          "height": "6-3",
          "weight": "225",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-01-18",
          "birth_place": "Titusville, FL",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Onondaga Central, NY",
          "draft_team": "Oakland Raiders",
          "draft_round": "6",
          "draft_position": "181",
          "draft_year": "2013",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3487",
          "name": "Derek Carr",
          "position": "QB",
          "height": "6-2",
          "weight": "214",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-03-28",
          "birth_place": "Bakersfield, CA",
          "death_date": "None",
          "college": "Fresno St.",
          "high_school": "Bakersfield Christian, CA",
          "draft_team": "Oakland Raiders",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2014",
          "current_salary": "5,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4495",
          "name": "Amari Cooper",
          "position": "WR",
          "height": "6-1",
          "weight": "210",
          "current_team": "Oakland Raiders",
          "birth_date": "1994-06-18",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Northwestern, FL",
          "draft_team": "Oakland Raiders",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Giants",
        "Points": "27"
      },
      "Team 2": {
        "Name": "Cowboys",
        "Points": "20"
      },
      "comments": " These were two teams that were desperate for wins, but one team beat itself. Matt Cassel was getting his first start as a Cowboy, but the results weren't better than when Brandon Weeden was the starter. The difference in this game was Dallas committing four turnovers and the Giants playing mistake free football. New York's offense struggled to produce points, but the defense and special teams came through with the clutch plays to get them a much-needed win.    The Cowboys got the scoring started with a drive where they ran the ball down New York's throat, but the drive stalled and Dan Bailey hit a chip-shot field goal. In the second quarter, the Giants' offense got moving as Eli Manning hit Rueben Randle on the run for a 24-yard gain. Orleans Darkwa started rolling over the Dallas defense as he had carries of nine and 10 yards before a 15-yard touchdown to cap the drive. Dallas responded with a field goal drive that was led by a 27-yard pass to Terrance Williams, but a questionable offensive pass interference penalty negated a 31-yard touchdown pass to Darren McFadden. Late in the second quarter, Cassel made a pretty touch pass on a corner post for 35 yards to the Giants' 5-yard line. A few plays later, McFadden plunged into the end zone from a yard out. In the final two minutes, Manning executed a drive to grab a field goal. The big play was a 38-yard slant to Dwayne Harris. Dallas took a 13-10 lead into the locker room. In the third quarter, the Cowboys self-destructed. For one, Dominique Rodgers-Cromartie jumped a route and Terrance Williams fell down. Rodgers-Cromartie picked off the pass and returned it 58 yards for a touchdown. On the next drive, Dallas went into New York territory before Cassel threw a floater deep down the field and Brandon Meriweather ran under it for an interception at the Giants' 1-yard line. Randle made an amazing one-handed reception for a 41-yard gain. Shane Vereen took off on a 39-yard run on the next play to the Cowboys' 11-yard line. Dallas stopped the drive, but Josh Brown hit a 34-yard field goal to give New York a 20-13 lead. Dallas put together another drive that ended with Rodgers-Cromartie picking off Cassel again. The pass was behind his receiver and flew right to Rodgers-Cromartie. After a New York punt, the Cowboys finally finished off a drive. They ran the ball to midfield before Cassel hit Terrance Williams for 21 yards on a corner route along the sideline. On the next play, Devin Street made a beautiful 25-yard touchdown catch as he tip-toed in bounds while reaching to catch the pass over the chalk. It was terrible coverage by Giants safety Landon Collins. With the game tied at 20, former Cowboy Dwayne Harris brought the kickoff back 100 yards for the game-winning touchdown. Dallas went through a time-consuming drive starting at its own 31 before stalling at New York's 30. The Cowboys ate up five minutes of clock for those 60 yards. After forcing a Giants punt, Cole Beasley muffed the catch, and it was recovered by New York to clinch the win for the Giants.    Eli Manning was 13-of-24 for 170 yards with no touchdowns or interceptions. Manning avoided mistakes, and that was the difference between him and Cassel.    Shane Vereen (4-56), Orleans Darkwa (8-48-1), Rashad Jennings (5-19) and Andre Williams (4-13) split up the carries for New York.    Rueben Randle had two receptions for 68 yards. Odell Beckham Jr. had just four catches for 35 yards.    Matt Cassel was 17-of-27 for 227 yards with one touchdown and three interceptions. It could have been worse as Dominique Rodgers-Cromartie dropped an interception early in the game that would have been a pick-six. Robert Ayers dropped another pick.    Darren McFadden ran like he was back at Arkansas with 152 yards on 29 carries and a touchdown. Christine Michael, who was told that he'd get a larger workload, had just six touches for 20 total yards.    Jason Witten had six receptions for 74 yards. Terrance Williams (4-70) and Devin Street (1-25-1) chipped in, but clearly the Cowboys were missing Dez Bryant just as much with Cassel at quarterback.   ",
      "players": [
        {
          "player_id": "18196",
          "name": "Rueben Randle ",
          "position": "WR",
          "height": "6-2",
          "weight": "208",
          "current_team": "None",
          "birth_date": "1991-05-07",
          "birth_place": "Bastrop, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Bastrop, LA",
          "draft_team": "New York Giants",
          "draft_round": "2",
          "draft_position": "63",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "788",
          "name": "Robert Ayers",
          "position": "DE",
          "height": "6-3",
          "weight": "273",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1985-09-06",
          "birth_place": "Jersey City, NJ",
          "death_date": "None",
          "college": "Tennessee",
          "high_school": "Marlboro Co., SC",
          "draft_team": "Denver Broncos",
          "draft_round": "1",
          "draft_position": "18",
          "draft_year": "2009",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1342",
          "name": "Cole Beasley",
          "position": "WR",
          "height": "5-8",
          "weight": "174",
          "current_team": "Dallas Cowboys",
          "birth_date": "1989-04-26",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Little Elm, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5102",
          "name": "Orleans Darkwa",
          "position": "RB",
          "height": "6-0",
          "weight": "210",
          "current_team": "New York Giants",
          "birth_date": "1992-02-28",
          "birth_place": "Nashville, TN",
          "death_date": "None",
          "college": "Tulane",
          "high_school": "Ensworth, TN",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23980",
          "name": "Andre Williams",
          "position": "RB",
          "height": "5-11",
          "weight": "230",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1992-08-28",
          "birth_place": "Poughkeepsie, NY",
          "death_date": "None",
          "college": "Boston Col.",
          "high_school": "Parkland, PA",
          "draft_team": "New York Giants",
          "draft_round": "4",
          "draft_position": "113",
          "draft_year": "2014",
          "current_salary": "527,644",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1383",
          "name": "Odell Beckham Jr.",
          "position": "WR",
          "height": "5-11",
          "weight": "198",
          "current_team": "New York Giants",
          "birth_date": "1992-11-05",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Isidore Newman, LA",
          "draft_team": "New York Giants",
          "draft_round": "1",
          "draft_position": "12",
          "draft_year": "2014",
          "current_salary": "1,839,027",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3655",
          "name": "Matt Cassel",
          "position": "QB",
          "height": "6-5",
          "weight": "230",
          "current_team": "Tennessee Titans",
          "birth_date": "1982-05-17",
          "birth_place": "Northridge, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Chatsworth, CA",
          "draft_team": "New England Patriots",
          "draft_round": "7",
          "draft_position": "230",
          "draft_year": "2005",
          "current_salary": "1,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24257",
          "name": "Terrance Williams",
          "position": "WR",
          "height": "6-2",
          "weight": "208",
          "current_team": "Dallas Cowboys",
          "birth_date": "1989-09-08",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Baylor",
          "high_school": "Warren Travis White, TX",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "74",
          "draft_year": "2013",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9161",
          "name": "Dwayne Harris",
          "position": "WR",
          "height": "5-10",
          "weight": "200",
          "current_team": "New York Giants",
          "birth_date": "1987-09-16",
          "birth_place": "Atlanta, GA",
          "death_date": "None",
          "college": "East Carolina",
          "high_school": "Tucker, GA",
          "draft_team": "Dallas Cowboys",
          "draft_round": "6",
          "draft_position": "176",
          "draft_year": "2011",
          "current_salary": "2,475,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22910",
          "name": "Shane Vereen",
          "position": "RB",
          "height": "5-10",
          "weight": "200",
          "current_team": "New York Giants",
          "birth_date": "1989-03-02",
          "birth_place": "Valencia, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Valencia, CA",
          "draft_team": "New England Patriots",
          "draft_round": "2",
          "draft_position": "56",
          "draft_year": "2011",
          "current_salary": "2,150,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21429",
          "name": "Devin Street",
          "position": "WR",
          "height": "6-3",
          "weight": "198",
          "current_team": "None",
          "birth_date": "1991-03-30",
          "birth_place": "Bethlehem, PA",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Liberty, PA",
          "draft_team": "Dallas Cowboys",
          "draft_round": "5",
          "draft_position": "146",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13982",
          "name": "Eli Manning",
          "position": "QB",
          "height": "6-4",
          "weight": "218",
          "current_team": "New York Giants",
          "birth_date": "1981-01-03",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Mississippi",
          "high_school": "Isidore Newman, LA",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2004",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15133",
          "name": "Brandon Meriweather",
          "position": "DB",
          "height": "5-11",
          "weight": "195",
          "current_team": "None",
          "birth_date": "1984-01-14",
          "birth_place": "Apopka, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Apopka, FL",
          "draft_team": "New England Patriots",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2007",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14725",
          "name": "Darren McFadden",
          "position": "RB",
          "height": "6-2",
          "weight": "210",
          "current_team": "None",
          "birth_date": "1987-08-27",
          "birth_place": "North Little Rock, AR",
          "death_date": "None",
          "college": "Arkansas",
          "high_school": "Pulaski Oak Grove, AR",
          "draft_team": "Oakland Raiders",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2008",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2654",
          "name": "Josh Brown ",
          "position": "K",
          "height": "6-0",
          "weight": "202",
          "current_team": "None",
          "birth_date": "1979-04-29",
          "birth_place": "Foyil, OK",
          "death_date": "None",
          "college": "Nebraska",
          "high_school": "Foyil, OK",
          "draft_team": "Seattle Seahawks",
          "draft_round": "7",
          "draft_position": "222",
          "draft_year": "2003",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18963",
          "name": "Dominique Rodgers-Cromartie ",
          "position": "DB",
          "height": "6-2",
          "weight": "183",
          "current_team": "New York Giants",
          "birth_date": "1986-04-07",
          "birth_place": "Bradentown, FL",
          "death_date": "None",
          "college": "Tennessee St.",
          "high_school": "Lakewood Ranch, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "16",
          "draft_year": "2008",
          "current_salary": "6,980,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11088",
          "name": "Rashad Jennings",
          "position": "RB",
          "height": "6-1",
          "weight": "234",
          "current_team": "None",
          "birth_date": "1985-03-26",
          "birth_place": "Forest, VA",
          "death_date": "None",
          "college": "Liberty",
          "high_school": "Jefferson Forest, VA",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "7",
          "draft_position": "250",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "846",
          "name": "Dan Bailey",
          "position": "K",
          "height": "6-0",
          "weight": "198",
          "current_team": "Dallas Cowboys",
          "birth_date": "1988-01-26",
          "birth_place": "Mustang, OK",
          "death_date": "None",
          "college": "Oklahoma St.",
          "high_school": "Southwest Covenant, OK",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "3,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23527",
          "name": "Brandon Weeden",
          "position": "QB",
          "height": "6-4",
          "weight": "221",
          "current_team": "Tennessee Titans",
          "birth_date": "1983-10-14",
          "birth_place": "Oklahoma City, OK",
          "death_date": "None",
          "college": "Oklahoma St.",
          "high_school": "Edmond Santa Fe, OK",
          "draft_team": "Cleveland Browns",
          "draft_round": "1",
          "draft_position": "22",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2848",
          "name": "Dez Bryant",
          "position": "WR",
          "height": "6-2",
          "weight": "225",
          "current_team": "Dallas Cowboys",
          "birth_date": "1988-11-04",
          "birth_place": "Lufkin, TX",
          "death_date": "None",
          "college": "Oklahoma St.",
          "high_school": "Lufkin, TX",
          "draft_team": "Dallas Cowboys",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2010",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4315",
          "name": "Landon Collins",
          "position": "SS",
          "height": "6-0",
          "weight": "222",
          "current_team": "New York Giants",
          "birth_date": "1994-01-10",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Dutchtown, LA",
          "draft_team": "New York Giants",
          "draft_round": "2",
          "draft_position": "33",
          "draft_year": "2015",
          "current_salary": "991,415",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24544",
          "name": "Jason Witten",
          "position": "TE",
          "height": "6-5",
          "weight": "257",
          "current_team": "Dallas Cowboys",
          "birth_date": "1982-05-06",
          "birth_place": "Elizabethton, TN",
          "death_date": "None",
          "college": "Tennessee",
          "high_school": "Elizabethton, TN",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "69",
          "draft_year": "2003",
          "current_salary": "7,400,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Panthers",
        "Points": "27"
      },
      "Team 2": {
        "Name": "Eagles",
        "Points": "16"
      },
      "comments": " Carolina remained undefeated as the Eagles were incapable of getting a needed road win after their Monday night win over the Giants. With New York prevailing earlier in the day, the 3-4 Eagles fall back to second place in the NFC East. Carolina remains undefeated and looks to be fighting with Green Bay for home-field advantage in the playoffs. The Panthers play an old-school brand of football, but they are a tough team that continues to show they know how to win.    Carolina's first drive got rolling as Jonathan Stewart took off on a 36-yard run with a great block from tight end Greg Olsen. Newton threw a bullet on the next play to Philly Brown at the Eagles' 1-yard line. Mike Tolbert pounded the ball into the end zone from there to give the Panthers a quick lead. Philadelphia promptly set up another score as Sam Bradford threw a pass into traffic, which was intercepted by safety Colin Jones off a deflection. However, the Eagles' defense bailed out Bradford as Nolan Carroll stripped Ted Ginn of the ball and controlled it for an interception at the Eagles' 6-yard line. In the second quarter, Philadelphia put a field goal drive together, with the big play being a 22-yard run by Ryan Mathews. Caleb Sturgis was good on the 52-yard field goal. The Panthers answered as Ted Ginn took an end around for 43 yards to the Philadelphia's 8-yard line. Olsen hit another nice block on that play. A few snaps later, Newton ran into the scrum but stretched the ball over the goal line for a touchdown. Malcolm Jenkins then made a tremendous diving interception to set up Philadelphia in Carolina territory, but the Panthers' defense broke up a few passes in the end zone to force the Eagles into a field goal. Carolina took a 14-6 lead into the half. The Panthers came out of the locker room and moved the ball down the field on the Eagles thanks to passes to Ginn and Olsen. To finish the drive, Newton threw a short touchdown pass to Tolbert. The power back went through about five tackles in the flat to power into the end zone. The Eagles quickly cut the Panthers lead to 21-13 as Mathews took off on a 63-yard touchdown run. He used his speed to break into the open field and pull away from a diving Luke Kuechly. Newton threw his third interception when he had an open receiver, but fired a fastball that was unnecessary. It bounced off the hands of Devin Funchess, and Byron Maxwell made a diving catch. Starting at the Carolina 18-yard line, the Panthers' defense came through by limiting Philadelphia to a field goal as Kuechly broke up a touchdown pass to Josh Huff. Once again, the Eagles drove into Carolina territory, but Sturgis missed a 50-yard field goal. Carolina started moving again with Newton taking off on a draw for 16 yards to set up an easy field goal. The Panthers' defense shut down the Eagles to clinch the win for Carolina.    Cam Newton completed 14-of-24 passes for 197 yards with a touchdown and three interceptions. He ran for 20 yards on four carries and a score. It was an ugly game for Newton, but good enough to keep his team undefeated.    Jonathan Stewart ran for 125 yards on 24 carries. He churned out a lot of tough yards for Carolina. Like last year, Stewart is getting hot off a bye.    Greg Olsen had three receptions for 65 yards. Tedd Ginn (5-59) and Philly Brown (3-38) chipped in for Carolina.    Sam Bradford was 26-of-46 for 205 yards with no touchdowns and an interception. Philadelphia's passing attack never got into a groove and was severely hurt by losing Jason Peters in the first half. Peters was carted off the field with a back injury, and losing him could be a huge blow to the Eagles' offense.    Ryan Mathews led the Eagles with 97 yards on six carries and a touchdown. DeMarco Murray had 65 yards on 18 carries.    Tight end Zach Ertz led Philadelphia's receivers with five catches for 63 yards. Jordan Matthews (3-14), Darren Sproles (5-31) and Miles Austin (4-52) were contained by Carolina's tough defense.    The Panthers' defense got another excellent game out of defensive tackle Kawann Short. For the second-straight week, Short recorded two sacks and caused a lot of disruption in the backfield. Jared Allen also had two sacks, including a clutch one late in the fourth quarter. Luke Kuechly, Thomas Davis and Josh Norman all had excellent games for Carolina. Philadelphia's defense received good games from Malcolm Jenkins, Byron Maxwell and Mychal Kendricks.   ",
      "players": [
        {
          "player_id": "21508",
          "name": "Caleb Sturgis",
          "position": "K",
          "height": "5-10",
          "weight": "188",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1989-09-09",
          "birth_place": "St. Augustine, FL",
          "death_date": "None",
          "college": "Florida",
          "high_school": "St. Augustine, FL",
          "draft_team": "Miami Dolphins",
          "draft_round": "5",
          "draft_position": "166",
          "draft_year": "2013",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12680",
          "name": "Luke Kuechly",
          "position": "ILB",
          "height": "6-3",
          "weight": "242",
          "current_team": "Carolina Panthers",
          "birth_date": "1991-04-20",
          "birth_place": "Cincinnati, OH",
          "death_date": "None",
          "college": "Boston Col.",
          "high_school": "St. Xavier, OH",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "9",
          "draft_year": "2012",
          "current_salary": "7,363,324",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20178",
          "name": "Kawann Short",
          "position": "DT",
          "height": "6-3",
          "weight": "299",
          "current_team": "Carolina Panthers",
          "birth_date": "1989-02-02",
          "birth_place": "East Chicago, IN",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Central, IN",
          "draft_team": "Carolina Panthers",
          "draft_round": "2",
          "draft_position": "44",
          "draft_year": "2013",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11539",
          "name": "Colin Jones",
          "position": "DB",
          "height": "5-11",
          "weight": "200",
          "current_team": "Carolina Panthers",
          "birth_date": "1987-10-27",
          "birth_place": "Bridgeport, TX",
          "death_date": "None",
          "college": "TCU",
          "high_school": "Bridgeport, TX",
          "draft_team": "San Francisco 49ers",
          "draft_round": "6",
          "draft_position": "190",
          "draft_year": "2011",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7916",
          "name": "Ted Ginn",
          "position": "WR",
          "height": "5-11",
          "weight": "178",
          "current_team": "New Orleans Saints",
          "birth_date": "1985-04-12",
          "birth_place": "Cleveland, OH",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Glenville, OH",
          "draft_team": "Miami Dolphins",
          "draft_round": "1",
          "draft_position": "9",
          "draft_year": "2007",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16086",
          "name": "DeMarco Murray",
          "position": "RB",
          "height": "6-0",
          "weight": "214",
          "current_team": "Tennessee Titans",
          "birth_date": "1988-02-12",
          "birth_place": "Las Vegas, NV",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Bishop Gorman, NV",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "71",
          "draft_year": "2011",
          "current_salary": "6,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21034",
          "name": "Darren Sproles",
          "position": "RB",
          "height": "5-6",
          "weight": "181",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1983-06-20",
          "birth_place": "Waterloo, IA",
          "death_date": "None",
          "college": "Kansas St.",
          "high_school": "Olathe North, KS",
          "draft_team": "San Diego Chargers",
          "draft_round": "4",
          "draft_position": "130",
          "draft_year": "2005",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3527",
          "name": "Nolan Carroll",
          "position": "DB",
          "height": "6-1",
          "weight": "202",
          "current_team": "None",
          "birth_date": "1987-01-16",
          "birth_place": "Jacksonville, FL",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Clay, FL",
          "draft_team": "Miami Dolphins",
          "draft_round": "5",
          "draft_position": "145",
          "draft_year": "2010",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21291",
          "name": "Jonathan Stewart",
          "position": "RB",
          "height": "5-11",
          "weight": "235",
          "current_team": "Carolina Panthers",
          "birth_date": "1987-03-21",
          "birth_place": "Fort Lewis, WA",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Timberline, WA",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2008",
          "current_salary": "1,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12107",
          "name": "Mychal Kendricks",
          "position": "ILB",
          "height": "5-11",
          "weight": "237",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1990-09-28",
          "birth_place": "Fresno, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Herbert Hoover, CA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "46",
          "draft_year": "2012",
          "current_salary": "4,850,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5310",
          "name": "Thomas Davis ",
          "position": "LB",
          "height": "6-1",
          "weight": "231",
          "current_team": "Carolina Panthers",
          "birth_date": "1983-03-22",
          "birth_place": "Shellman, GA",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Randolph-Clay, GA",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "14",
          "draft_year": "2005",
          "current_salary": "3,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7461",
          "name": "Devin Funchess",
          "position": "WR",
          "height": "6-5",
          "weight": "230",
          "current_team": "Carolina Panthers",
          "birth_date": "1994-05-21",
          "birth_place": "Farmington Hill, MI",
          "death_date": "None",
          "college": "Michigan",
          "high_school": "Harrison, MI",
          "draft_team": "Carolina Panthers",
          "draft_round": "2",
          "draft_position": "41",
          "draft_year": "2015",
          "current_salary": "836,900",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14354",
          "name": "Byron Maxwell",
          "position": "DB",
          "height": "6-0",
          "weight": "202",
          "current_team": "Seattle Seahawks",
          "birth_date": "1988-02-23",
          "birth_place": "North Charleston, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "Fort Dorchester, SC",
          "draft_team": "Seattle Seahawks",
          "draft_round": "6",
          "draft_position": "173",
          "draft_year": "2011",
          "current_salary": "8,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "751",
          "name": "Miles Austin",
          "position": "WR",
          "height": "6-3",
          "weight": "215",
          "current_team": "None",
          "birth_date": "1984-06-30",
          "birth_place": "Summitt, NJ",
          "death_date": "None",
          "college": "Monmouth",
          "high_school": "Garfield, NJ",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14267",
          "name": "Ryan Mathews",
          "position": "RB",
          "height": "6-0",
          "weight": "220",
          "current_team": "None",
          "birth_date": "1987-10-10",
          "birth_place": "Bakersfield, CA",
          "death_date": "None",
          "college": "Fresno St.",
          "high_school": "West, CA",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "12",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16815",
          "name": "Greg Olsen",
          "position": "TE",
          "height": "6-6",
          "weight": "254",
          "current_team": "Carolina Panthers",
          "birth_date": "1985-03-11",
          "birth_place": "Paterson, NJ",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Wayne Hills, NJ",
          "draft_team": "Chicago Bears",
          "draft_round": "1",
          "draft_position": "31",
          "draft_year": "2007",
          "current_salary": "6,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2201",
          "name": "Sam Bradford ",
          "position": "QB",
          "height": "6-4",
          "weight": "236",
          "current_team": "Minnesota Vikings",
          "birth_date": "1987-11-08",
          "birth_place": "Oklahoma City, OK",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Putnam City North, OK",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2010",
          "current_salary": "14,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22374",
          "name": "Mike Tolbert",
          "position": "RB",
          "height": "5-9",
          "weight": "243",
          "current_team": "Buffalo Bills",
          "birth_date": "1985-11-23",
          "birth_place": "Carrollton, GA",
          "death_date": "None",
          "college": "Coastal Carolina",
          "high_school": "Douglas Co., GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14311",
          "name": "Jordan Matthews",
          "position": "WR",
          "height": "6-3",
          "weight": "212",
          "current_team": "Buffalo Bills",
          "birth_date": "1992-07-16",
          "birth_place": "Madison, AL",
          "death_date": "None",
          "college": "Vanderbilt",
          "high_school": "Madison Academy, AL",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "42",
          "draft_year": "2014",
          "current_salary": "1,094,900",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16512",
          "name": "Josh Norman",
          "position": "CB",
          "height": "6-0",
          "weight": "203",
          "current_team": "Washington Redskins",
          "birth_date": "1987-12-15",
          "birth_place": "Greenwood, SC",
          "death_date": "None",
          "college": "Coastal Carolina",
          "high_school": "Greenwood, SC",
          "draft_team": "Carolina Panthers",
          "draft_round": "5",
          "draft_position": "143",
          "draft_year": "2012",
          "current_salary": "16,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6520",
          "name": "Zach Ertz",
          "position": "TE",
          "height": "6-5",
          "weight": "249",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1990-11-10",
          "birth_place": "Orange, CA",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Monte Vista, CA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2013",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "307",
          "name": "Jared Allen",
          "position": "DE",
          "height": "6-6",
          "weight": "265",
          "current_team": "None",
          "birth_date": "1982-04-03",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Idaho St.",
          "high_school": "Live Oak, CA",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "4",
          "draft_position": "126",
          "draft_year": "2004",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11061",
          "name": "Malcolm Jenkins",
          "position": "DB",
          "height": "6-0",
          "weight": "200",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1987-12-20",
          "birth_place": "East Orange, NJ",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Piscataway, NJ",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "14",
          "draft_year": "2009",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17452",
          "name": "Jason Peters",
          "position": "T",
          "height": "6-4",
          "weight": "328",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1982-01-22",
          "birth_place": "Bowie County, TX",
          "death_date": "None",
          "college": "Arkansas",
          "high_school": "Queen City, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10387",
          "name": "Josh Huff",
          "position": "WR",
          "height": "5-11",
          "weight": "206",
          "current_team": "None",
          "birth_date": "1991-10-14",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Nimitz, TX",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "3",
          "draft_position": "86",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16363",
          "name": "Cam Newton",
          "position": "QB",
          "height": "6-6",
          "weight": "260",
          "current_team": "Carolina Panthers",
          "birth_date": "1989-05-11",
          "birth_place": "College Park, GA",
          "death_date": "None",
          "college": "Auburn",
          "high_school": "Westlake, GA",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2011",
          "current_salary": "13,166,666",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Cardinals",
        "Points": "26"
      },
      "Team 2": {
        "Name": "Ravens",
        "Points": "18"
      },
      "comments": " When the NFL implemented this new extra-point rule, it became clear that it would impact some potential covers. That's exactly what happened in this contest. The Cardinals had this game well in hand, but instead of going up 27-10, a missed kick gave the Ravens some life. The Ravens eventually blocked a punt and converted a two-point score, making this an eight-point result when the spread was nine or 10. My condolences to anyone who bet Arizona; the incompetent Roger Goodell robbed you of your rightful money. The Ravens ultimately were in position to once again score on a last-minute, desperate drive, but heavy pressure forced Joe Flacco into a game-ending interception. The Ravens, now 1-6, are officially finished this season, and they can now begin concentrating on the 2016 NFL Draft. I have them picking Joey Bosa in my , which you can check out by clicking the link.    As for the team with Super Bowl aspirations, the Cardinals once again had a dominant offensive performance. Carson Palmer was great, going 20-of-29 for 275 yards and two touchdowns. He made some mistakes late with clock management, but was terrific overall. He made some unreal throws, including one perfect dime to John Brown for a gain of 35 yards, who secured the ball while being hit by two Baltimore players. In this high-octane scoring attack, Palmer will continue to be a top fantasy quarterback option unless he's taking on an elite defense.    Speaking of Brown, he led the team in receiving, catching four passes for 65 yards, in addition to one of Palmer's touchdowns. The other was hauled in by Michael Floyd (3-59).    Larry Fitzgerald surprisingly didn't do much. despite the promising matchup. He caught just three balls for 39 yards. Jermaine Gresham even out-performed him; the former Cincinnati tight end collected four passes for 62 yards. Gresham actually tied Brown for the team lead in targets with six, and Palmer spoke afterward about his evolution in the offense, citing that Gresham needed was more reps.    Chris Johnson collected 122 rushing yards on just 18 carries, scoring once. However, that stat line is very deceiving. Johnson picked up a few yards on one play and appeared to be tackled down. However, he never hit the ground because he rolled on top of defenders, and he was able to get up, to the surprise of the Baltimore players, and sprint 62 yards into the red zone. However, he handled most of the workload, with Andre Ellington (5-21) only playing late.    Going back to the Ravens, Flacco went 26-of-40 for 252 yards, one touchdown and an interception, which, as mentioned, occurred at the very end of the game. Flacco played pretty well considering the level of his opponent, but didn't get much help from his offensive line; he was hurried often and sacked thrice, including one by Dwight Freeney. The Ravens did at least show more effort this week.    Only two Baltimore players accumulated more than 31 receiving yards. Those would be the usual suspects, Steve Smith and Crockett Gillmore. Smith snatched five passes for 78 yards, while Gillmore tallied just as many receptions for 53 yards.    Arizona's run defense had some issues early on, with Justin Forsett gaining 33 yards and a touchdown on just nine carries in the opening half alone. Buck Allen also chipped in with a 15-yard burst. However, Forsett was limited to just three yards on just as many attempts following the break. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...<\/span>   ",
      "players": [
        {
          "player_id": "7354",
          "name": "Dwight Freeney",
          "position": "DE",
          "height": "6-1",
          "weight": "268",
          "current_team": "Detroit Lions",
          "birth_date": "1980-02-19",
          "birth_place": "Hartford, CT",
          "death_date": "None",
          "college": "Syracuse",
          "high_school": "Bloomfield, CT",
          "draft_team": "Indianapolis Colts",
          "draft_round": "1",
          "draft_position": "11",
          "draft_year": "2002",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17016",
          "name": "Carson Palmer",
          "position": "QB",
          "height": "6-5",
          "weight": "230",
          "current_team": "Arizona Cardinals",
          "birth_date": "1979-12-27",
          "birth_place": "Fresno, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Santa Margarita, CA",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2003",
          "current_salary": "15,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11208",
          "name": "Chris Johnson ",
          "position": "RB",
          "height": "5-11",
          "weight": "195",
          "current_team": "None",
          "birth_date": "1985-09-23",
          "birth_place": "Orlando, FL",
          "death_date": "None",
          "college": "East Carolina",
          "high_school": "Olympia, FL",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2008",
          "current_salary": "847,059",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20783",
          "name": "Steve Smith",
          "position": "WR",
          "height": "5-9",
          "weight": "185",
          "current_team": "None",
          "birth_date": "1979-05-12",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "Utah",
          "high_school": "University, CA",
          "draft_team": "Carolina Panthers",
          "draft_round": "3",
          "draft_position": "74",
          "draft_year": "2001",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6977",
          "name": "Joe Flacco",
          "position": "QB",
          "height": "6-6",
          "weight": "232",
          "current_team": "Baltimore Ravens",
          "birth_date": "1985-01-16",
          "birth_place": "Voorhees, NJ",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Audubon, NJ",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "18",
          "draft_year": "2008",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8489",
          "name": "Jermaine Gresham",
          "position": "TE",
          "height": "6-5",
          "weight": "261",
          "current_team": "Arizona Cardinals",
          "birth_date": "1988-06-16",
          "birth_place": "Ardmore, OK",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Ardmore, OK",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "21",
          "draft_year": "2010",
          "current_salary": "2,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6367",
          "name": "Andre Ellington",
          "position": "RB",
          "height": "5-10",
          "weight": "199",
          "current_team": "Houston Texans",
          "birth_date": "1989-02-03",
          "birth_place": "Moncks Corner, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "Berkeley, SC",
          "draft_team": "Arizona Cardinals",
          "draft_round": "6",
          "draft_position": "187",
          "draft_year": "2013",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7902",
          "name": "Crockett Gillmore",
          "position": "TE",
          "height": "6-6",
          "weight": "260",
          "current_team": "Baltimore Ravens",
          "birth_date": "1991-11-16",
          "birth_place": "Amarillo, TX",
          "death_date": "None",
          "college": "Colorado St.",
          "high_school": "Bushland, TX",
          "draft_team": "Baltimore Ravens",
          "draft_round": "3",
          "draft_position": "99",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6967",
          "name": "Larry Fitzgerald",
          "position": "WR",
          "height": "6-3",
          "weight": "225",
          "current_team": "Arizona Cardinals",
          "birth_date": "1983-08-31",
          "birth_place": "Minneapolis, MN",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Academy of the Holy Angels, MN",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2004",
          "current_salary": "11,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2652",
          "name": "John Brown",
          "position": "WR",
          "height": "5-11",
          "weight": "179",
          "current_team": "Arizona Cardinals",
          "birth_date": "1990-04-03",
          "birth_place": "Homestead, FL",
          "death_date": "None",
          "college": "Pittsburg St.",
          "high_school": "Homestead, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "3",
          "draft_position": "91",
          "draft_year": "2014",
          "current_salary": "1,797,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7063",
          "name": "Michael Floyd ",
          "position": "WR",
          "height": "6-3",
          "weight": "220",
          "current_team": "Minnesota Vikings",
          "birth_date": "1989-11-27",
          "birth_place": "St. Paul, MN",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Cretin-Derham Hall, MN",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2012",
          "current_salary": "887,058",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7155",
          "name": "Justin Forsett",
          "position": "RB",
          "height": "5-8",
          "weight": "190",
          "current_team": "None",
          "birth_date": "1985-10-14",
          "birth_place": "Lakeland, FL",
          "death_date": "None",
          "college": "California",
          "high_school": "Polk, FL",
          "draft_team": "Seattle Seahawks",
          "draft_round": "7",
          "draft_position": "233",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    }
  ]
}
