{
    "year": "2016",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "33"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "This was an absolutely dreadful game to watch, and I hope you weren't subjected to such torture. This contest was comprised of horrible quarterbacking, constant three-and-outs and some of the worst announcing anyone has ever heard. The Cardinals managed to prevail, but it wasn't pretty. In fact, the 49ers pretty much handed them the game. San Francisco was up 7-0 with a couple of minutes remaining before halftime when a Blaine Gabbert pass was tipped at the line of scrimmage and intercepted by Calais Campbell. Drew Stanton hit Larry Fitzgerald for the tying touchdown on the very next play. Then, right after halftime, the San Francisco kick returner fumbled the ball inside his own 20. The Cardinals quickly reached the end zone once again with the help of a running-into-the-kicker penalty, taking a lead that they wouldn't relinquish. If there's anything that could've been learned from this dreadful game from Arizona's perspective, it's that Stanton is one of the worst quarterbacks in the NFL. Battling one of the worst defenses in the NFL, Stanton struggled to move the chains. He was completely inaccurate on most of his throws. Stanton finished 11-of-28 for 124 yards. He did throw two touchdowns, but they were set up on short fields. The one silver lining is that Stanton didn't turn the ball over, but he was close on a couple of occasions. Arizona converted just 5-of-16 third downs because of his incompetence. What I really don't understand is why the Cardinals opted to keep Stanton over Matt Barkley during final cuts. Barkley was unquestionably the superior quarterback in the preseason, and it wasn't even close. Stanton was simply atrocious, and if the Cardinals played a real team this week, they would've lost. I don't understand what the point of the exhibition is if coaches are unwilling to keep obvious, superior talents at the position. All of the rhetoric that players are fighting for jobs is usually complete crap. Coaches know whom they're going to keep, and it usually doesn't matter what the players do. ",
            "2": "Two Arizona offensive play-makers were factors in this contest. David Johnson was a beast, rushing for 157 yards and two touchdowns on 27 carries, as the 49ers, missing NaVorro Bowman, can't stop the run at all. Larry Fitzgerald, meanwhile, also scored twice, catching six balls for 81 yards in the process. He also had a terrific block to spring Johnson into the end zone. The only blemish of Fitzgerald's evening was a dropped pass, though Stanton delivered that pass awkwardly. ",
            "3": "The Cardinals' other receivers did nothing. John Brown caught only one pass for 11 yards, while Michael Floyd failed to log a single reception. Floyd, who dropped three balls last week, let another one fall through his hands in this game. ",
            "4": "Before moving on to the 49ers, it's noteworthy that both of Arizona's starting guards, Evan Mathis and Mike Iupati, left the game with injuries. Fortunately for the Cardinals, they have 10 days to get them, as well as Carson Palmer, back into the lineup. ",
            "5": "San Francisco was the better team in the opening half, outgaining the Cardinals and posting a better yards-per-play average. However, their turnovers crushed them, and the defense eventually ran out of gas, as Arizona ran the ball down their throat on one soul-crushing drive in the fourth quarter. Of course, the defense was on the field a lot because Blaine Gabbert was horrible. Gabbert had one nice drive in this contest, but floundered otherwise. He finished 18-of-31 for 162 yards, one touchdown and two interceptions. He was better than Stanton, but that's not really saing anything. One of the picks wasn't his fault, but he should've thrown another in the fourth quarter. Gabbert did move around well - he scrambled 10 times for 70 rushing yards and a late touchdown - but that didn't make up for his other deficiencies. Gabbert did his usual thing where he threw way short of the first-down marker on numerous occasions, and he sailed balls on the rare occasions in which he hurled some shots downfield. He also took seven sacks - including one for a safety - but some of those occurred because he ran out of bounds for a loss, which counts as a sack. The announcers are clamoring for Colin Kaepernick, but the 49ers' controversial backup is 20 pounds underweight and was benched in favor of Gabbert last year anyway. Kaepernick refuses to put work into the mental part of the game and will ultimately be a worse option. I'd say that's for the best, as it would help the 49ers' draft position - see my 2017 NFL Mock Draft for more - but it doesn't matter at all. The 49ers are so devoid of talent, thanks to Trent Baalke's mismanagement, that it's going to be difficult for them to win more than three games regardless. ",
            "6": "Want an idea of how horrible Gabbert was? Aside from Jeremy Kerley and Carlos Hyde, no 49er caught passes until there were two minutes remaining in the third quarter. I don't know if that says more about Gabbert's incompetence or the lack of talent in San Francisco's receiving corps, but it's a sad state of affairs. As for Kerley and Hyde, the former caught eight passes for 102 yards and a touchdown. Given how much Gabbert loves throwing to him, Kerley should be owned in all formats. Hyde, meanwhile, gained 78 yards and a touchdown on 22 carries. He also caught all six of his targets for 36 receiving yards. ",
            "7": "I'd be remiss if I didn't mention how horrible Phil Simms was tonight. He called Jeremy Kerley Jeremy Colored - kind of racist, eh? - and then said, This game's going to come down to who can make the less mistakes. The less mistakes? You mean fewer mistakes? What kind of English is that? Simms' logic was poor, too. They should run more option! he exclaimed of the 49ers. So, they ran the option, prompting Simms to say, All these teams have seen it so much, they know how to defend it. Contradictory, much? I wasn't the only one to notice Simms' woeful announcing. This was the best tweet I found: "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "The Vikings and Texans came into this game with close records, but the disparity between these teams proved to be much greater. Minnesota demolished Houston, quickly opening up a 24-3 lead prior to the end of the first half. Houston had issues defensively, but the greater problems were on the offensive side of the ball, as Minnesota's dominant defense limited the Texans to just 67 net yards of offense prior to intermission. Brock Osweiler had an extremely rough afternoon, as his passes were all over the place. He sailed balls over his receivers' heads, while other passes skipped into the turf. He had an easy pick-six that was dropped by Harrison Smith, and he also lucked out when a strip-sack was negated when Everson Griffen was whistled for being offside. Minnesota's defense has made every quarterback it has faced this season look absolutely abysmal, and Osweiler was no different. Osweiler was limited to 19-of-42 passing for 184 yards, one touchdown and an interception. It could've been even worse for Osweiler had some Minnesota drops and penalties not negated turnovers. He had no chance versus Minnesota's defense, and sadly, his final stat line is a byproduct of garbage-time stats; midway through the third quarter, Osweiler was 11-of-28 for 93 yards and a pick. ",
            "2": "Sam Bradford, meanwhile, was once again extremely efficient. He misfired on just eight occasions, going 22-of-30 for 271 yards and two touchdowns, torching Houston's poor safeties repeatedly. His longest pass came early, hitting Adam Thielen for a 36-yard touchdown on the opening drive. Bradford, who was responsible for only three incompletions following halftime, made only one mistake, as he was nearly pick-sixed by linebacker John Simon. Still, this was a terrific showing by Bradford, who continues to amaze despite being on the roster for such a short period of time. It's even more remarkable considering that Stefon Diggs was out of the lineup. ",
            "3": "Thielen was Minnesota's big-time producer in the wake of Diggs' absence. He caught seven passes for 127 yards and a touchdown. Cordarrelle Patterson (4-39) hauled in Bradford's other score. Kyle Rudolph (2-15) didn't do as well, dropping a pass. ",
            "4": "Jerick McKinnon handled the majority of the workload in the first half, but didn't find much room. He mustered only 36 yards on 20 carries. Mat Asiata was given more attempts following intermission, and he was more successful. He gashed the Texans for 55 yards and a touchdown on 14 tries. ",
            "5": "Speaking of running backs, McKinnon wasn't the only one who struggled. Lamar Miller tallied only 20 yards on eight carries. He was given one attempt following halftime, which is understandable because the Texans were so far behind. ",
            "6": "Conversely, one player who thrived in garbage time was DeAndre Hopkins. His fantasy owners will be very grateful for that, as Hopkins didn't log a single reception in the opening half. He finished with five grabs for 56 yards and a touchdown, but all of that was meaningless. Will Fuller (1 catch, 4 yards) wasn't nearly successful as Hopkins was at the end of the game. Fuller dropped a deep pass, but this contest was out of hand when that occurred. ",
            "7": "Texans cornerback Johnathan Joseph sustained a concussion in this contest, but was struggling before he left the game. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "It was almost too easy for the Patriots. Following a quick Cleveland three-and-out, Tom Brady took the field and completed his first pass to Julian Edelman. He then connected with Rob Gronkowski for a 19-yard gain, as Gronkowski looked healthy for the first time all year. Following a 13-yard LeGarrette Blount run, Gronkowski snared a 34-yard reception and rumbled down to the Cleveland 2-yard line, breaking five tackles in the process. Two plays later, Blount skipped into the end zone, and just like that, the game was over. If a football fan were asleep for four weeks and woke up without any idea as to what was going on, they would've never suspected that Brady missed any practice time whatsoever. Brady was incredibly sharp, and having Gronkowski at 100 percent didn't hurt. With these two in full gear, the Patriots look like the best team in the AFC. OK, maybe it's a bit presumptive to read that much into a victory against the Browns, but Brady was incredibly sharp. He went 28-of-40 for 406 yards and three touchdowns. Had the Browns been able to keep up on the scoreboard, Brady may have had a shot at 500-plus yards; he was up to 271 yards at halftime, putting him on track for 542 on the afternoon (thank you, Windows calculator). He threw numerous beautiful passes, including a perfect 43-yarder down the field to Chris Hogan to move into the red zone on one occasion. On an ensuing drive, Brady hit Hogan for 63 yards in stride, as the new Patriot receiver beat Joe Haden. ",
            "2": "All three of Brady's touchdowns went to Martellus Bennett, which is remarkable considering that Bennett left the game early on with an injury. He returned and didn't looked like he was hobbled at all, catching six passes for 67 yards. He did this despite Gronkowski being healthy, but Gronkowski still produced; he caught five balls for 109 yards. ",
            "3": "Brady's other big stat-producers were Hogan (4-114) and James White (4-63). Hogan left temporarily to be checked for a concussion, but he returned to action shortly afterward. Julian Edelman, meanwhile, snatched five balls for only 35 yards. ",
            "4": "LeGarrette Blount helped his fantasy owners with a touchdown, but didn't do much otherwise, mustering only 37 yards on 18 attempts. He had three other chances to score, but Cleveland did a good job of stuffing him near the goal line. ",
            "5": "As for the Browns, they never really had a chance, but they might have covered had Cody Kessler not left the game in the first quarter. Kessler, who put together a touchdown drive, was knocked out with a rib injury when he was sacked for a safety. The Patriots lost their momentum in the second half, leaving the Browns with an opportunity to sneak the margin to within single digits. Charlie Whitehurst didn't give Cleveland that opportunity. Whitehurst went 14-of-24 for 182 yards, one touchdown and a pick that bounced off Duke Johnson's hands. Those stats don't look horrible, but he was very inaccurate. Kessler (5-of-8, 62 yards, TD) at least gave Cleveland a chance of being somewhat competitive. Without him, the Browns were very stagnant until the game got well out of hand. Sadly, the Browns may have to start Whitehurst for a few weeks as both Kessler and Josh McCown recover. Whitehurst should not be in the NFL right now. ",
            "6": "The Patriots predictably didn't respect the pass, allowing them to play extremely close to the line of scrimmage and clog all of the running lanes. As a result, Isaiah Crowell was limited to just 22 yards on 13 carries. He also dropped a pass. Duke Johnson, meanwhile, had just three touches, which was curious, though he was responsible for Whitehurst's interception. ",
            "7": "Whitehurst's sole touchdown was thrown to Andrew Hawkins (4-56). Terrelle Pryor, meanwhile, was limited to five grabs for 48 yards, as Bill Belichick did his best to shut him down; Pryor managed just one catch in the first half. Gary Barnidge (5-76) paced the Browns in receiving. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "It took 135 passes, but Carson Wentz finally threw an interception. The turnover lost the game, as the Eagles were trailing by a single point with 1:28 remaining in regulation. As it turns out, Wentz is human after all. This defeat was far from Wentz's fault, however. In fact, the pick, a desperation heave in dire circumstances, should've never occurred. The Eagles were winning by two and had possession when Ryan Mathews lost a Darius Slay-forced fumble, which the Lions recovered right before the ball could trickle out of bounds. The Lions took over in Philadelphia territory and were able to kick what would turn out to be the game-winning field goal from 29 yards out. Wentz nearly had an interception on the opening drive when he tried to fit a ball into tight coverage. However, he bounced back to play well overall. He finished 25-of-33 for 238 yards, two touchdowns and the pick despite having some issues with the noise at Ford Field. He had nothing to do with this defeat, as the Eagles racked up 111 yards in penalties (76 in the opening half). The defense also struggled to get off the field; Nolan Carroll was torched quite a bit, while Mychal Kendricks missed numerous tackles. Despite this, Wentz led the Eagles back from 14-0 and 21-7 deficits and ultimately established the lead, but his running back blew it. ",
            "2": "Speaking of Mathews, he didn't have much success running, plodding for just 42 yards on 11 carries. He was outgained on the ground by Darren Sproles (5-45), but did manage to log five catches for 33 receiving yards and a score. Still, Mathews has been falling out of favor with the Eagles' coaching staff, and his costly turnover won't help him win back any sort of trust from Doug Pederson and company. Kenjon Barner and Wendell Smallwood didn't see much action in this contest, but that may change in the near future. ",
            "3": "Mathews was one of six Eagles to catch at least three passes. The others were Jordan Matthews (4-65), Dorial Green-Beckham (3-43), Zach Ertz (3-37), Darren Sproles (4-23) and Josh Huff (3-5). Huff caught Wentz's other touchdown. ",
            "4": "As for the winning squad, Matthew Stafford did a great job of bouncing back from last week's embarrassing performance. He misfired on just six occasions, going 19-of-25 for 180 yards and three touchdowns. One incompletion was a drop by Andre Roberts in the red zone. Stafford also had a nifty 14-yard scramble in the opening half to help move the chains. His one real blemish on the afternoon was a lost fumble that set the Eagles up in scoring territory. Fortunately for Stafford, his defense was able to limit Philadelphia to just a field goal. ",
            "5": "Two of Stafford's touchdowns were thrown to Theo Riddick, who caught all six of his targets for 33 yards. Stafford had to dump the ball frequently to Riddick to avoid Philadelphia's ferocious pass rush, which grew stronger as the game progressed. Stafford barely had any time in the second half, as his offensive line once again let him down. Riddick, by the way, managed 49 yards on 11 carries. Zach Zenner was given seven attempts, but plodded for just nine yards versus Philadelphia's stout ground defense. ",
            "6": "Stafford was still able to throw a score to Marvin Jones (4-37). Golden Tate (3-39) was on the field after getting benched last week. The Lions tried to involve him by giving him some rushing opportunities. He didn't do much with those three chances, gaining just six yards on the ground. Tate almost seems like a lost cause right now. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The score may say that the Colts won this by six, but they have some major issues because they were outplayed by a wide margin. The Bears generated 126 more net yards of offense and averaged 2.3 more yards per play, which is a substantial amount. The Bears, however, murdered themselves with untimely penalties, missed field goals and a crucial fumble that gave the Colts both the victory and the cover. What Brian Hoyer did to Indianapolis' defense is almost embarrassing for anyone wearing blue and white. Hoyer went 33-of-43 for 397 yards and two touchdowns, and none of it occurred in garbage time, or anything. The stats were completely legitimate. The Colts offered absolutely no resistance, as the only time the Bears were stopped happened to be when they made mistakes. For example, the Bears had to settle for a field goal because a Kyle Long hold negated a first down in the red zone. Later in the opening half, another hold ended up costing Chicago, this time, wiping out a Jordan Howard touchdown. The Bears would've only needed a field goal at the end had Connor Barth not whiffed on a 49-yard try. It was Barth's second chance after the Colts were guilty of running into the kicker. The decision to cut Robbie Gould looks dumber each week. Much later, the Bears, down just three points with about three minutes remaining, committed a fumble when Cameron Meredith lost possession. The Colts scooped up the ball right before it trickled out of bounds, which set up one of Adam Vinatieri's five field goals. Despite all of this, Chicago had a chance to win at the end. Hoyer once again drove the team down the field, but on a fourth down, he somehow didn't seen an open Alshon Jeffery in the end zone. Instead, he hurled an inaccurate ball toward one of his other targets, which fell incomplete. ",
            "2": "As for Andrew Luck, he threw a number of beautiful passes against Chicago's injury-ravaged defense. He lofted a perfect touch pass to Phillip Dorsett on a third-and-12 right outside the red zone, which ultimately led to a touchdown thrown to Dwayne Allen. Luck had other numerous amazing passes that will undoubtedly be shown on the Dilfer's Dimes feature. The Colts, however, were inconsistent offensively because they couldn't pass protect. Luck's numbers may look pretty - 28-of-39, 322 yards, two touchdowns - but several drives stalled because Luck took sacks that he had no chance of getting out of. He was brought down four times in the first two-and-a-half quarters; five occasions overall, as Willie Young logged a trio of sacks. Luck took six sacks the week before by the Jaguars, who put no pressure on quarterbacks, so this is obviously an issue. Ryan Grigson discussed not being able to build a championship defense because of Luck's contract... so what about the offensive line? ",
            "3": "Luck's two touchdowns went to T.Y. Hilton (10-171) and Dwayne Allen (6-50). They were the only Indianapolis players to eclipse the 30-yard mark. This includes Dorsett, who was once again disappointing. He caught two balls for 26 yards, only seeing three targets. He was expected to be a greater factor with Donte Moncrief out with an injury, but that hasn't been the case. ",
            "4": "The Colts didn't run the ball very much, but when they did, they had success doing so. Frank Gore gained 75 yards on 14 carries. He had just four rushes in the opening half, which is puzzling, to say the least. ",
            "5": "Moving back to the Bears, Meredith will be seen as the goat for losing that key fumble, so it's a shame that it spoiled such a terrific afternoon. He caught a whopping nine passes for 130 yards and a touchdown. He served as Hoyer's favorite target, as Jeffery (5-77) once again didn't look 100 percent, though he was certainly improved. Remember, Jeffery should've had a game-winning score, but Hoyer didn't see him. Meanwhile, Eddie Royal and Zach Miller both caught seven passes for 43 and 73 yards, respectively. ",
            "6": "Jordan Howard also had a huge performance for Chicao. He burst for 118 yards on 16 carries, which includes a 57-yard gain. He also caught all three of his targets for 45 receiving yards and a touchdown. As mentioned, it appeared as though he had a second score, but a penalty nullified it. Howard is the real deal, and it's difficult to imagine him relinquishing his job whenever Jeremy Langford returns from injury. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: You'd never think that a game can be decided on whether a defender can hold on to the ball or not, but that's exactly what happened here. If C.J. Mosley doesn't fumble on his pick-six attempt, the Ravens probably win this game. Instead, the Redskins went down the field and were able to prevail. When I re-wathced the 2015 season to prepare for this year, I marveled at how many games were truly 50-50 that were swung by a play like Mosley's fumble. ",
            "2": "",
            "3": "This Beltway Battle meets once every four years, so the Redskins will have bragging rights until 2020. Washington won its third-straight game to overcome the 0-2 start to the season. Baltimore started the game well, but the Redskins' defense was excellent, pitching a shut out in the second half to protect the win for Washington. ",
            "4": "The Ravens got rolling on the opening drive as Terrance West ripped a run of 35 yards to get inside the Redskins' red zone. A pass to Mike Wallace moved the ball to the 7-yard line, and the next play saw Flacco hit Crockett Gilmore (4-28) for a touchdown. The Redskins got on the scoreboard as Jamison Crowder ripped off an 85-yard punt return for a score, but Washington missed the extra point. Baltimore soon added a field-goal drive, with the big playing being a 26-yard pass interference on linebacker Will Compton. The Ravens were set up for more points when Zach Orr caused and recovered a fumble from Matt Jones at Washington's 15-yard line. The Redskins' defense held strong, however, and the Ravens tried a fake field goal, but Justin Tucker's pass fell incomplete. It was a curious decision that ended up hurting Baltimore in the fourth quarter. Just before the half, the Redskins missed a 56-yard field goal, letting the Ravens take a 10-6 lead into the locker room. In the third quarter, the Redskins took advantage of a short field with Cousins making a pretty throw to Pierre Garcon (5-56) for a 21-yard touchdown. With a 13-10 lead, Washington got the ball back deep in its own territory. Cousins was picked off by Ravens linebacker C.J. Mosley, but on the interception return, when he extended the ball for the end zone, he fumbled the ball out of bounds for a touchback. That turned out to be the play of the game as it robbed Baltimore of critical points, even if Mosley was tackled short of the end zone. It ended up being a 17-yard gain for Washington, and the Redskins took advantage with a drive that produced a field goal. After a bunch of punts from each team, the Ravens had one more shot and Flacco ran for a first down on a fourth-and-2 at the 2-minute warning. Flacco continued to move the ball with short passes and then threw a strike to Wallace to get inside the Redskins' 25-yard line. A few plays later, Flacco hit Breshard Perriman, who made a catch over Josh Norman, for what was called a touchdown, but upon review, Perriman only got one foot down and it was overturned to an incompletion. On fourth down, Will Compton broke up a pass intended for Wallace. ",
            "5": "Joe Flacco was 30-of-46 for 210 yards and one touchdown. Baltimore's offensive line had problems protecting Flacco in the second half. Terrance West (11-95) led the Ravens on the ground. ",
            "6": "Mike Wallace (7-63) was Baltimore's leading receiver. Dennis Pitta (7-59) played well, while Steve Smith (3-29) left the game with an ankle injury. Midway through the game, Breshard Perriman (2-11) dropped a perfect bomb for what should have been a 50-yard touchdown and didn't get his second foot down on the end-zone catch in the fourth quarter. ",
            "7": "Kirk Cousins was 29-of-41 for 260 yards with one touchdown and one interception. Garcon led the Redskins receiving. Jordan Reed (8-53) could have had a bigger game, but Cousins missed some throws. ",
            "8": "Matt Jones (14-31 rushing, 2-25 receiving) was contained by the Ravens' defense. ",
            "9": "Washington's front seven won the line of scrimmage in the second half with sacks coming from Ryan Kerrigan, Trent Murphy and Ziggy Hood. Terrell Suggs - three tackles, one sack - had a good game for the Ravens. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Titans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: I wouldn't be too hard on the Dolphins for this loss. They must have been distracted by Hurricane Matthew. I can imagine that it's difficult to concentrate on a football game when you're worried about your family and friends making it through a severe storm. ",
            "2": "This game was supposed to be a low-scoring affair. Neither the Dolphins nor the Titans have had much success on offense to start the season, so it was expected that trend might continue. However, the Tennessee offense played up to its full potential for the first time on Sunday to notch an impressive win. Marcus Mariota put on a stellar performance today for the Titans. After struggling with turnovers to start the season, he played a near-perfect game and helped to get the Titans a big win. In terms of passing, Mariota was very strong, going 20-of-29 for 163 yards and three touchdowns on the day. However, the bigger story of the afternoon was his performance on the ground. Mariota was electric as a rusher. He helped to spark the run game carrying the ball seven times for 60 yards and a touchdown. The touchdown was a thing of beauty, as he faked the ball to DeMarco Murray before taking into the end zone untouched. On several instances, Mariota scrambled to get critical third downs, and that kept the Titans' drives going. Most importantly, Mariota's dual-threat ability allowed him to move around the pocket and make the best play for his team. If he saw a running lane, he took it. If not, he looked for Delanie Walker or another receiver open down the field. It was a solid game overall for the second-year pro, and it looks like Mariota may have put his early-season struggles behind him. ",
            "3": "Though the Titans were efficient in the passing game, their performance in terms of their ground attack was absolutely phenomenal. They totaled a whopping 225 yards on the day, while the Dolphins only recorded 51 yards. Mariota's impact was already mentioned, but the team's top two running backs really had a big impact. DeMarco Murray is continuing to have the best season of his career, and he got another 27 carries during Sunday's game. On those carries, he totaled 121 yards and really led the offense for the team. He ripped off numerous 8-to-9-yard chunks plays, and that allowed the team to move the ball efficiently. When Murray was not carrying the ball, rookie Derrick Henry toted the rock. He received seven carries during the contest and turned them into 54 yards. He had one particularly nice burst where he scampered for 22 yards and moved the Titans toward the red zone. Henry is not a real factor in fantasy yet, but if he get more carries, he could become a high-upside flex play. ",
            "4": "The Titans were happy to get Delanie Walker healthy. Walker led the team in targets, catches and yards, finishing the day with five catches for 66 yards and a touchdown. On the score, Walker caught a bullet pass from Mariota over the middle of the field. Walker dragged a defender the last three yards before lunging in for the score. Andre Johnson (2-13) and Rishard Matthews (4-32) were the other receivers who caught touchdowns for the Titans. Tajae Sharpe (2-17) once again underwhelmed his fantasy owners. ",
            "5": "As good at the Tennessee offense was, the Tennessee defense was even better. The team had a ferocious pass rush for most of the day against the Dolphins. The Titans were constantly pressuring Ryan Tannehill. Derrick Morgan, Jurrell Casey and Brian Orakpo all totaled two sacks on the day, and it looks like the front seven is becoming a strength for the Titans. ",
            "6": "For the Dolphins, this game has to be considered another disappointment. They simply did not show well against the Titans. One of the main culprits of the team's failure was Ryan Tannehill. Tannehill had a poor outing against the Tennessee defense. Though he was under pressure for most of the day, he was unable to get anything going on offense. He was just 12-of-18 for 191 yards. Tannehill did not throw any touchdowns, but he did toss two picks. The first interception was not entirely Tannehill's fault. He threw the ball slightly behind his intended receiver, but the receiver was able to get his hands on it. However, Jason McCourty ripped it out of the player's hands, and that caused the first turnover. The second pick of the day came in desperation time, when Tannehill chucked a ball downfield that Daimion Stafford intercepted. This game was typical Ryan Tannehill. He came up flat in a contest that was important for the team and badly underperformed. It would not be surprising to see the team give up on him in the offseason, and maybe draft a new quarterback in the first round. ",
            "7": "Because Tannehill did not play well, his receivers struggled as well. His two leading receivers were DeVante Parker (2-70) and Damien Williams (2-67). Their numbers are good at a glance, but they were not particularly great. Parker caught one 50-yard pass that was Tannehill's best throw of the day. Other than that, Parker did not do much. Williams did most of his damage on a dump-off that he ran for 58 yards afterward. Aside from that, Williams had a poor performance. Jarvis Landry (3-28) led the team in catches, but was unable to do much against the Titans' defense. ",
            "8": "The Dolphins were marginally better on the ground, but only by default. Jay Ajayi totaled 42 yards on 13 carries and added the team's lone offensive touchdown. The score came on a short run that saw him lunge into the end zone. Ajayi was not great, but he did show that he deserves to carry the load as long as Arian Foster is out. Besides, Ajayi was missing his starting left tackle, Branden Albert and left guard, Laremy Tunsil, during today's game. Perhaps having them back will improve Ajayi's performance. ",
            "9": "The special teams play of the day came via Jakeem Grant. The Miami return man took back one punt, but he made it count. He ran back the punt 74 yards to the house to tie the game at seven. On the return, Grant cut in and out repeatedly down the sideline, avoiding all Tennessee's tacklers. It was a very strong play by the young player, and he definitely deserves a chance to return more kicks in the future. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: I've never minded Todd Bowles as a coach before. I actually thought he was pretty good. That changed after this game. Chet described the punting situation below in the penultimate paragraph, and I agree. Going for it was a no-brainer, especially with Sheldon Richardson going down with an injury. Instead, Bowles elected to punt. The Steelers took over at their own 21-yard line to drive the length of the field. Not only did they score a touchdown, but they managed to eat up six minutes on the game clock. Bowles literally punted the game away. ",
            "2": "The Pittsburgh Steelers dominated the New York Jets this afternoon on the arm of Ben Roethlisberger, as he completed 34-of-47 passes - 72.3 percent - for 380 yards and four touchdown passes in a 31-13 drubbing. The Jets got off to a quick start, moving the ball against the Steelers with ease on their first possession, but the bend, but don't break Pittburgh defense held the Jets to a field goal, which the Steelers quickly retorted by hitting a 73-yard touchdown pass from Roethlisberger to Sammie Coates, which was the first of many plays for Coates. ",
            "3": "Coates caught 6-of-11 targets for 139 yards and a touchdown. This was an up-and-down game for Coates, as he had a couple of bad drops, including a gimme 5-yard touchdown. But the Steelers realize his big-play ability is worth more in their offense than the drops. ",
            "4": "On the other side, the Ryan Fitzpatrick didn't amass huge interception numbers like he has over the last two weeks, but he had little chance to keep up with the Steelers' offense this week. He did a good job of targeting Brandon Marshall, who ended up with the biggest share of New York's 316 total yards, catching 8-of-15 targets for 114 yards and a touchdown. But, Marshall had a couple of bad drops, and in this game, every inch of offense was needed by the Jets. ",
            "5": "After the Steelers scored quickly with the deep touchdown to Coates, the Jets did their best to take away the deep pass, which they did successfully, but that's when Le'Veon Bell came into play. Bell would slip past the line, and with nobody getting to Roethlisberger and no linebacker able to cover Bell; the Steelers had a 10-yard reception anytime they wanted. Bell ended the day having rushed 20 times for just 66 yards, but he caught 9-of-11 targets for 88 yards. Bell truly does make this offense unstoppable at times like this. If he is stopped on the ground, he'll get his through the air or vice-versa or both, which makes things extremely tough for defenses trying to cover Antonio Brown, Sammie Coates and company. ",
            "6": "The Jets' pass defense really was the weak link in this game, as they had no answer for Roethlisberger. And even though the defensive line held Bell to 66 yards, New York only got to Roethlisberger one time, which makes it even tougher on the secondary. Anyway you look at it, the Jets are giving up chunk yardage through the air and don't have the offense to match their opponents. ",
            "7": "The worst coaching decision of the day goes to Todd Bowles, who, with 7:36 left in the game and his team down by two scores on a fourth-and-two at midfield, elected to punt. This against a team that had no trouble moving the ball on his defense for most of the day. Predictably, the Steelers took that possession and went 79 yards in 12 plays, ending the Jets' chances with Sammie Coates' second touchdown of the day. ",
            "8": "The Steelers have now blown out their last two opponents at home after being blown out themselves in Philadelphia three weeks ago, while the Jets have now lost their last three by a total score of 82-33. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "31"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: I can't believe what happened in this game. The Chargers doing their usual stupid stuff - Melvin Gordon fumbled, the punter booted it out of bounds for 19 yards - and then the officials basically gave the Raiders a touchdown after a 5-minute conference in which they completely screwed up every single aspect of the call. They ruled a pass interference when there was barely any contact (and both announcers agreed); they said that Amari Cooper didn't step out of bounds when he did; and they said Cooper didn't catch the pass, when it was clear that he did. Of course, the Raiders challenged the latter aspect and weren't rewarded with the touchdown when they should have been. Yet, the Raiders took over at the 1-yard line, giving them an even score. And this wasn't even the craziest sequence of the game! That would be the botched hold which ruined yet another potential Chargers win. Oh, Chargers... ",
            "2": "For the Raiders to keep pace with the Denver Broncos in the AFC West and in the wild-card race, they needed to come through with a victory over a reeling team like San Diego. Once again, the Chargers hurt themselves with second-half turnovers and botched fundamentals to cost them another shot at a winnable game. ",
            "3": "On the opening drive, Brandon Mebane picked off a screen pass as Derek Carr made a bad mistake, throwing the ball into a crowd of defenders. However, the Chargers gave it right back as Antonio Gates fumbled the ball away after getting stripped by Perry Riley with Reggie Nelson recovering for Oakland. The Raiders responded with Carr using Amari Cooper and Michael Crabtree to move the ball down the field. Oakland was stopped on the goal line to settle for a short field goal. Promptly, Rivers tossed an underthrown pass that was picked off by Sean Smith and returned into San Diego territory, but Sebastian Janikowski missed the field goal. The Chargers got moving and Rivers hit Tyrell Williams for a 29-yard touchdown after he beat David Amerson and Nelson to get open on a post route. The Raiders answered with a field goal drive, but Rivers hit Travis Benjamin on the sideline, and he exploded down field for a 54-yard gain to set up a San Diego field goal. Just before the half, Rivers threw a ball up for grabs and it was picked off by Karl Joseph - the first NFL interception for the rookie. Oakland turned that into a 56-yard field goal from Janikowski to cut the Chargers' lead to 10-9 before the half. To open the third quarter, Rivers found Hunter Henry in busted coverage for a 59-yard gain. Rivers then hit a checkdown to Melvin Gordon, who coasted into the end zone from 18 yards out. Oakland answered with Amari Cooper's first touchdown of the year as he burned Adrian Phillips for a 64-yard touchdown. San Diego responded with a 50-yard pass to Williams and a 24-yard run by Gordon to the one-yard line. Rivers then hit Henry, who was wide open, for the touchdown. After a field goal drive by the Raiders cut the lead to 24-19, fumbles struck San Diego again with Gordon coughing the ball up. Joseph recovered the loose ball to set up the Raiders at the Chargers' 38-yard line. On fourth-and-2, Carr made San Diego pay with a 21-yard touchdown pass to Michael Crabtree and then a two-point conversion to Amari Cooper. That gave the Raiders a 27-24 lead heading into the fourth quarter. Chargers punter Drew Kaser had a 16-yard shanked punt that set up the Raiders at the San Diego 32-yard line, and the Raiders turned that into a short touchdown run from fullback Jamize Olawale. The Chargers responded by moving the ball down the field, and Rivers hit Gates on a short touchdown pass to close the Raiders' lead to a field goal. San Diego got in position to tie the game with a field goal, but Kaser fumbled the snap to botch the field goal attempt and ensure another Chargers loss. ",
            "4": "Philip Rivers completed 20-of-29 passes for 366 yards with four touchdowns with two interceptions. Tyrell Williams (5-117-1), Travis Benjamin (7-117) and Hunter Henry (3-74) all played well for the Chargers. ",
            "5": "Melvin Gordon ran for 69 yards on 16 carries with his 18-yard touchdown reception. He played well with the exception of another critical fumble. ",
            "6": "Derek Carr completed 25-of-40 for 317 yards with two touchdowns and one interception. He continues to show that he is blooming franchise quarterback and a winner. ",
            "7": "Jalen Richard (8-31 rushing, 6-66 receiving) had a solid game with Latavius Murray out with an injury. ",
            "8": "Amari Cooper led the Raiders in receiving with six receptions for 138 yards with a touchdown. Michael Crabtree (3-47-1) contributed some clutch catches as well. ",
            "9": "Chargers rookie defensive end Joey Bosa made his pro debut and was impressive. He had five tackles with two coverage sacks. Raiders defensive tackle Stacy McGee had a phenomenal game with two forced fumbles and 1.5 sacks. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Bills",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "19"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: Laugh at Rex Ryan all you want, but he has provided future 0-2 teams a blueprint for turning the season around. If your defense is struggling, just fire your offensive coordinator, and it'll all work out! ",
            "2": "This game was supposed to be a chance for the Rams to prove that they were a legitimate team. They wanted to win in the Los Angeles Memorial Coliseum to improve to 4-1. Instead, the Bills were able to get the best of the Rams thanks to a complete all-around game. The real story of this game was the defensive performance of the Bills. The team was able to severely limit the Rams toward the end of the game, allowing only one touchdown. Buffalo's stop unit got a lot of pressure on Case Keenum throughout the game, and no player was better than Lorenzo Alexander. Alexander recorded a total of three sacks to bring his season total to seven. Prior to this season, Alexander had nine sacks ... over nine seasons! He is experiencing a re-birth in Rex Ryan's defense and should continue to be a weapon for the team. Elsewhere, Nickell Robey-Coleman came up clutch for the Bills. The nickelback got a key pick-six that gave the Bills a 23-16 lead. Robey-Coleman simply read Keenum's eyes and managed to jump the route. That really swung the momentum in favor of the Bills. Later in the game, Robey-Coleman snagged another pick that sealed the game. It was fourth-and-long deep in the Rams' own territory, and Keenum just lofted the ball up to try and make something happen. ",
            "3": "On offense, the Bills were led today by the superb effort of LeSean McCoy. Their veteran back was far and away the best player of this contest, and it was not close. Against Los Angeles' strong front seven, McCoy was completely dominant. He totaled 150 yards on 18 carries and was a catalyst for his offense. In the first half, he had a 53-yard burst that set up the second touchdown of the game for Mike Gillislee (2 carries, 6 yards, 1 TD). By halftime, McCoy had 111 yards on just nine carries. He was running rings around the defense and looked as fast and elusive as ever. He and DeMarco Murray are currently battling it out to see who the top fantasy running back is. ",
            "4": "In the passing game, the Bills were not quite as strong. Tyrod Taylor was 12-of-23 on the day for just 124 yards. Although he did not do a lot in terms of yardage, he did throw two nice touchdowns. The first went to Justin Hunter (1-4). Hunter set himself up near the back of the end zone, and Taylor scrambled around the pocket until Hunter got open. It was a nice move from the quarterback, as he evaded a couple of pass-rushers to make the perfect off-balance throw. The second touchdown went to Marquise Goodwin (2-13). Taylor delivered a strike to Goodwin that was only where he could get it. Taylor threw it low, and the veteran receiver managed to grab it before it went to the ground. The touchdown made the score 30-19 and helped to put the game out of reach. Overall for Taylor, it was a solid day. He did not do anything great, but he was able to lead the Bills to a victory. As long as the running game is as strong as it is, Taylor's upside as a fantasy quarterback will be limited. ",
            "5": "The only receivers of note for the Bills were Charles Clay and Robert Woods. Clay caught all five of his targets for 73 yards and looked to be Taylor's favorite weapon. As long as Sammy Watkins is out, Clay will be the best receiver on the Bills. As for Woods, he was a major disappointment. He caught only two passes for 26 yards; however, he was guilty of numerous drops. He is simply too inefficient to be relied on in any fantasy format. ",
            "6": "For the Rams, this game was another black mark on the tenure of Jeff Fisher. The team had problems converting red-zone opportunities and had to settle too often. Case Keenum was a part of the problem today as well. Though his 21-of-31 completion rate and 271 passing yards were good on paper, his performance left a lot to be desired. Keenum tossed the two aforementioned picks and was unable to throw a touchdown. In the red zone, he was unable to do anything as the team only got one touchdown and four field goals during the game. Keenum did not help the cause as he struggled to get the ball to his receivers and was unable to deal with the pressure that the Bills were putting on him. After this performance, it is fair to wonder if the Rams will be able to win many games with Keenum as quarterback. He simply is too limited to be more than a stop-gap starter. If the team continues to lose, then the staff should strongly consider giving No. 1-overall pick Jared Goff some playing time just to speed up his development. ",
            "7": "On the ground, Todd Gurley was once again slightly disappointing for the Rams. Running against the Bills, who were once again without Marcell Dareus, Gurley got 23 carries. He only turned those carries into 72 yards. That 3.1 yards-per-carry rate is not what Rams fans want to see from Gurley. Unfortunately, he is just not getting enough help from his offensive line. The blocking needs to improve in order for Gurley to do well. He is frequently getting stacked up at or behind the line of scrimmage, and that was again the case against the Bills. If you are thinking of trying to acquire Gurley in fantasy, definitely try to buy low on him. He will only be as good as the players around him. ",
            "8": "One of the surprises of the game for the Rams was the performance of Tavon Austin. The team made him a big part of the game plan, and he had a solid showing. Through the air, Austin caught seven passes for 59 yards. In the running game, he got three carries and turned them into 26 yards. Keenum seemed to like throwing to Austin, so the receiver should continue to do well. Still, he is probably just a bench player, at best, in fantasy. Some other receivers of note were Kenny Britt (5-75) and Brian Quick (3-51). Britt had a decent game, but he still is extremely inconsistent. He should be a depth receiver at the NFL level; not one seeing a lot of playing time. Quick, meanwhile, looks to still have some of the burst that made him a play-maker in past years. He could end up emerging as the No. 2 receiver before the end of the season. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The Falcons definitely had some believers heading into this game, but many didn't think they had a chance to beat the undefeated Broncos and their Super Bowl defense. Not only did they pull the upset; they did so in dominant fashion. In fact, despite what the final score says, Atlanta was winning in a blowout, up 17 with less than three minutes remaining in regulation. Matt Ryan hit some big plays in this contest, but only one, a 20-yarder, went to Julio Jones. Ryan focused on getting the ball to his running backs for the most part. Tevin Coleman was dynamic, snatching a 49-yard pass to open the game. Coleman ultimately finished with four catches for 132 yards and a touchdown even though it wasn't clear if he'd be able to suit up because of his sickle-cell condition, which makes it treacherous for any player in altitude. Devonta Freeman also picked up some nice chunks. Ryan did try to air the ball out to Jones on two occasions, but missed him for a couple of long completions. These were two of the very few blemishes Ryan had on the afternoon. Another was a dropped interception by Aqib Talib. However, Ryan was fantastic otherwise, going 15-of-28 for 267 yards and a touchdown. Not bad against a Super Bowl defense that rival Cam Newton has lost twice to! ",
            "2": "As mentioned, Freeman was huge in this victory. With Coleman (6 carries, 31 rush yards) unable to shoulder a complete workload, Freeman took 23 carries for 88 yards and a touchdown, which was quite impressive considering the competition. Freeman also caught three balls for 35 receiving yards. ",
            "3": "It was a disappointing afternoon for Jones, who logged just two catches for 29 yards. He had a tough matchup, though his stat line would've been a nice one had Ryan been able to hit him for the two deep bombs which was overshot by just a little bit. ",
            "4": "Aside from Coleman, Freeman and Jones, only one Falcon had multiple receptions. That was Mohamed Sanu (3-43), who didn't perform well. He lost a fumble near midfield, which allowed the Broncos to kick a field goal. He also dropped a pass that would've taken Atlanta to Denver's 1-yard line. ",
            "5": "Many expected the Broncos to boast the best pass rush in this affair, but that wasn't the case at all. Ryan was brought down just twice, while Paxton Lynch took six sacks. Vic Beasley was an absolute monster, registering 3.5 sacks and a forced fumble, as he had his way with right tackle Ty Sambrailo, who, according to the announcers, wasn't healthy. Still, Beasley was dominant, and it made Lynch's first start extremely miserable. Lynch finished 23-of-35 for 223 yards, one touchdown and an interception. He also fumbled once, but managed to recover it. The stat line doesn't look bad, but that's because Lynch generated a bunch of his yards in garbage time. He had accuracy issues, as a number of his early throws were all over the place. He also should've been picked a second time, but Desmond Trufant dropped an interception in the third quarter. Lynch has tons of talent and will definitely improve, but he's not ready to play just yet. Trevor Siemian is likely to get the nod on Thursday. ",
            "6": "With Lynch struggling, the Denver receiving numbers were suppressed. Emmanuel Sanders caught seven balls for 80 yards, while Demaryius Thomas logged five receptions for 49 yards and an extremely late touchdown. It's more telling that Sanders and Thomas combined for just three catches for 45 yards in the opening half. ",
            "7": "The Broncos were down throughout the entire afternoon, so they didn't have much of an opportunity to run the ball. That would explain why C.J. Anderson was limited to just 41 yards on 11 carries. He caught three balls for 21 yards, but dropped a pass. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "It's almost hard to believe that this Dallas team lost to the Giants on kickoff weekend and then had trouble putting away the Redskins the following Sunday. But they're not the same team. The Cowboys have morphed into something better, and now it could be argued that they're one of the best squads in the conference. Dallas' young backfield was amazing, as both Dak Prescott and Ezekiel Elliott continue to mature before our very eyes. Prescott was prolific against a Cincinnati defense with a strong front seven. Despite missing Dez Bryant, Prescott misfired on just six occasions, one of which was a drop by Jason Witten on a third down that would've moved the chains. His only blemish was a lost fumble in the red zone, which was the first turnover of his young career. Prescott was amazingly precise, finishing 18-of-24 for 227 yards and two touchdowns (one passing, one rushing). If he had a blank jersey on, you'd think he were some sort of six-year veteran. He doesn't look like a rookie whatsoever, and he still hasn't thrown an interception. In the wake of Wentz's pick, Prescott now holds the record for most completions by a first-year quarterback without an interception. Elliott, meanwhile, ripped through a Cincinnati ground defense that was supposed to be better because of Vontaze Burfict's return. The Bengals simply had no chance against him, as Elliott galloped for 134 yards and two touchdowns on 15 carries. He also caught three passes for 37 yards. ",
            "2": "Prescott's sole aerial score went to Cole Beasley, who caught all four of his targets for 53 yards. Terrance Williams (5-70) led Dallas in receiving, while Witten (3-43) will be itching to redeem himself for the aforementioned drop. ",
            "3": "Speaking of redemption, I don't think Andy Dalton needs any despite what happened at Dallas. I definitely wouldn't say Dalton played poorly despite his team being shut out until late in the game. Dalton finished 29-of-41 for 269 yards and two touchdowns. While a chunk of his yardage came in garbage time, he didn't play poorly beforehand. He was 10-of-14 for 93 yards in the opening half. The problem was all of the pressure he was seeing. He was sacked four times, but it seemed like the Cowboys were swarming the backfield on almost every play. DeMarcus Lawrence's return had a lot to do with that. Lawrence didn't log a sack, but he pressured Dalton relentlessly and nearly brought him down on numerous occasions. His presence opened things up for Dallas' other pass-rushers. There was a scary moment for Dalton when he was tackled awkwardly. His foot bent backward and he began limping around after that. However, Dalton was able to move the chains effectively in garbage time after this, so it's probably not a big deal. ",
            "4": "Dalton's two garbage-time touchdowns were both thrown to Brandon LaFell, who caught eight passes for 68 yards. Dalton had to resort to throwing to LaFell because A.J. Green was smothered by Morris Claiborne, who broke up a touchdown pass. Green was limited to just four catches for 50 yards, though he had just one catch for nine yards at intermission. Claiborne's play this year has been unreal, as he's finally living up to his first-round billing. ",
            "5": "Jeremy Hill was a non-factor in the game plan. He was given only four carries, three of which came in the opening half. He tallied just 12 yards, and it doesn't appear as though he's completely healthy. Giovani Bernard was used because the Bengals were in constant catch-up mode. Bernard gained 50 rushing yards on nine carries to go along with his six catches for 46 receiving yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "Given that this was a matchup between a pair of quarterbacks who have three combined Super Bowl trophies, many people expected this to be a fast-paced shootout. The total on this game was 50, after all. As it turned out, this was a sluggish affair in which both signal-callers struggled. Aaron Rodgers prevailed, but once again didn't look like himself. He barely completed half of his passes, going 23-of-45 for 259 yards, two touchdowns and a pair of interceptions. One of the picks wasn't his fault, as the ball bounced off James Starks' hands. However, Rodgers was off the mark on a number of throws and had two interceptions that were dropped, one of which was by a safety that appeared as though it could go the other way for six. Rodgers really doesn't have anyone to blame at this point, especially when considering the Giants' already-thin secondary lost Dominique Rodgers-Cromartie and Eli Apple to groin injuries. Both of Rodgers' primary receivers appear to be healthy, while his offensive line kept him clean the entire night. He wasn't sacked a single time, and there were instances in which he stood in the pocket for six or more seconds without anyone even coming close to him. It's mind-boggling that the Giants' high-priced defensive line couldn't generate an sort of heat on Rodgers. ",
            "2": "Randall Cobb had a huge performance. Banged up prior to the bye, he used his week off to heal up, and it showed in this contest. He caught nine of his 11 targets for 108 yards. There was a huge play in which he broke two tackles to reach for the first down, ultimately leading to a Green Bay score. Cobb later caught a third-down pass while falling down, which sealed the victory for the Packers. His one blemish was a drop. ",
            "3": "Rodgers' two touchdowns went to Jordy Nelson (4-38) and Davante Adams (5-85). Nelson could've drawn a couple of pass-interference flags downfield, especially one on the opening drive, but the officials allowed the teams to play. ",
            "4": "Eddie Lacy ran well, gaining 81 yards on just 11 carries. Unfortunately for Lacy, he sustained an ankle injury in the third quarter and never returned. James Starks (12-33) nearly lost the game with a fumble on the final drive, but the Packers were able to recover. Starks also dropped a potential touchdown. ",
            "5": "Moving on to the Giants, Eli Manning's play was deplorable. In fact, as bad as Rodgers was, he looked like, well, vintage Aaron Rodgers compared to Manning. When someone commented about this game on Facebook, I wrote that Manning appeared to be drunk. That, or he was secretly streaming the debate between Giant Douche and Turd Sandwich and wasn't focused on this game as a consequence. Manning began the evening by missing Odell Beckham for a gain of what would've been 25 yards. He then threw behind Beckham on the next drive and Sterling Shepard on the ensuing possession. Another toss behind Shepard came on the following drive - this time on third down. At the end of the opening half, Manning overshot Will Tye for a touchdown and then lost a fumble on a strip-sack. It didn't get any better for Manning after intermission. He opened the third quarter by throwing behind Beckham and then was nearly picked when he didn't see a linebacker dropping into coverage. Later on, Manning had yet another interception dropped by Morgan Burnett, and then he fumbled, but was fortunate to have one of his teammates recover. Manning eventually put together a touchdown drive to get a back-door push, but it wasn't nearly enough to make up for all of his early mistakes. Manning finished 18-of-35 for 199 yards, a touchdown and a lost fumble, and even those ugly stats were helped by garbage time; Manning was 6-of-16 for 87 yards in the opening half. I don't know what's going on with him, and the poor play of the offensive line didn't help, but he looks like he's mentally checked out. The Giants need to begin scouting quarterbacks for a successor in the very near future. Here's a list of our 2017 NFL Draft Quarterback Prospect Rankings. ",
            "6": "Beckham hauled in Manning's garbage-time touchdown. He ended up with five catches for 56 yards. He could've had a much better evening had Manning not endured woeful accuracy issues. The good news is that Beckham appeared to be in good spirits, as he jokingly kissed the kicking net after he scored. ",
            "7": "The Giants had only one other player who caught more than two passes; Bobby Rainey collected six receptions for 52 yards. Shepard (2-14) struggled because of Manning, while Victor Cruz didn't log a single reception. ",
            "8": "New York struggled to run he ball. Orleans Darkwa had the most carries (7-11), while Rainey gained 22 yards on five tries, though most of that came on a 14-yard burst late in the game. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "14"
        },
        "comments": {
            "amount": "10",
            "1": "This game was all about the Buccaneers and Panthers one-upping each other in terms of trying to give this game away. When one team made an error, the other squad made up for it with a more-egregious mistake, and so on. It went back and forth for three hours, and Carolina happened to be the final team that screwed up. The Panthers appeared to have the game in hand when they had the Buccaneers pinned inside their own 20 with less than two minutes remaining. Carolina was confidently taking timeouts, assuming it would retain possession with great field position. Jameis Winston, however, found Mike Evans for a gain of 11 on third-and-7. That's when the trouble commenced for the Panthers. They continued to use their timeouts, for some reason, and then Kony Ealy was flagged for a face mask on one of the final snaps. That gave Roberto Aguayo a 38-yard try instead of a 53-yard attempt. It was far from a guarantee because Aguayo whiffed on two kicks earlier in the evening, but the second-round rookie connected for a change, giving the Buccaneers the victory. Carolina, now 1-4, is in a world of trouble. The Panthers probably will have Cam Newton back next week, but they're going to have to embark on a long winning streak to give themselves a legitimate chance of making the playoffs. They also need to stop screwing up. In this contest, the problems began when Derek Anderson threw an interception on an inaccurate pass to Kelvin Benjamin. Graham Gano then missed a 43-yard field goal. Greg Olsen dropped a touchdown at the beginning of the third quarter, and that was followed by Anderson committing two turnovers; one was a fumble, while the other was an interception in the end zone, though Brent Grimes made a terrific play by making a leaping snag. Kurt Coleman could've made up for this, but he dropped an interception, and the Panthers had field position taken away from them for a stupid personal foul. ",
            "2": "Anderson threw numerous terrific passes against the Buccaneers, but the mistakes overshadowed the positives. Anderson finished 18-of-28 for 278 yards, two interceptions and a fumble. He nearly had a third pick by Grimes, which would've been taken back for six had a receiver not broken up the potential turnover. ",
            "3": "Greg Olsen had a huge night. The stud tight end caught nine balls for 181 yards. I mentioned that he dropped a touchdown, but the ball wasn't very well thrown; I'm sure Olsen would've hauled it in had the attempt ben accurate. ",
            "4": "Only two Panthers caught more than two passes. Besides Olsen, the other was Kelvin Benjamin (5-70). Devin Funchess wasn't even targeted, which is inexplicable. ",
            "5": "Cameron Artis-Payne quietly put together a terrific performance. He gashed the Gerald McCoy-less Buccaneers, tallying 85 yards and two touchdowns on 18 carries. Fozzy Whittaker (5-45) wasn't as much of a factor. ",
            "6": "Let's get to the Buccaneers' mistakes, shall we? It's going to be a long list, and it began when Winston overthrew Evans on the opening drive. They then had issues on third down; they committed two false starts and a delay of game, and they wasted a timeout. Winston then overthrew Vincent Jackson near the goal line, setting up an Aguayo missed 33-yard field goal. Winston fumbled on the ensuing drive, but a teammate somehow recovered when it seemed like a Carolina player pounced on the ball. In the second half, the Buccaneers were guilty of an egregious roughing-the-punter penalty, leading to a Carolina touchdown two plays later. Winston then missed Adam Humphries for a big gain, and following Grimes' interception, they wasted a timeout. Winston got away with an interception of his own on the penultimate drive of the game, prompting Dirk Koetter to settle for a very questionable run on a third-and-9. This forced Aguayo into a 46-yard field goal, which predictably missed. The Buccaneers looked like they were bound to lose, but the Panthers out-did them in the dumb-mistake department. ",
            "7": "Winston finished 18-of-30 for 219 yards and a touchdown. That may appear to be a decent stat line for any box-score observers, but that doesn't tell the whole story. Winston engineered a terrific drive at the very end, but he made a number of mistakes and was fortunate to get away with countless turnovers. He also missed several open receivers. ",
            "8": "Evans was Tampa's only productive receiver. He caught six passes for 89 yards and a touchdown. Jackson (3-36) continued to be a mediocre producer. ",
            "9": "With Doug Martin and Charles Sims out, I didn't expect much from Jacquizz Rodgers, who had been a very pedestrian runner throughout his career. Yet, the Buccaneers tried their hardest to ram it down Carolina's throat with Rodgers, and it was inexplicably successful. Rodgers dashed for 101 yards on 30 carries, and he also caught five passes for 28 receiving yards. He's not worth adding to your fantasy roster because the Buccaneers will be on a bye next week, and Martin is due back after that. ",
            "10": "The Buccaneers may have won to save their season, but they need to work on being more focused. They make way too many mistakes every week, and it has to stop. Koetter doesn't seem to have his team prepared to play, and Tampa will have to consider a coaching switch if this doesn't change. There's no excuse for making so many errors every game, and Koetter didn't look particularly good when he didn't appear to understand the 10-second run-off rules. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}