{
    "year": "2016",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Steve Smith told the media that this would be his final game, so the logical assumption was that the Ravens would put forth a great deal of effort so that the great receiver could have a proper farewell. That was not the case, as Baltimore didn't try hard whatsoever. The lack of character of this team was pretty telling that they didn't really seem to give a damn that their potential Hall of Fame teammate would be walking away forever. That's how they played, anyway. Where to start? Well, the defense was awful. The Bengals had a skeleton-crew offense on the field in this game, missing A.J. Green and Tyler Eifert. This didn't matter, as Cincinnati moved the chains with complete ease. Andy Dalton was able to shred the Jimmy Smith-less Baltimore secondary, going 18-of-28 for 226 yards and a touchdown. Not included in this was a drawn interference flag by Brandon LaFell in the end zone. Dalton was a perfect 6-of-6 for 59 yards and a score in the opening quarter. He constantly connected to Cody Core (4-82) and Brandon LaFell (7-67). Perhaps more embarrassing was Baltimore's inability to stop Rex Burkhead. The lumbering running back started in place of the injured Jeremy Hill, and he easily trampled the disinterested Ravens, gaining 119 yards and two touchdowns on 27 carries. Burkhead also had two catches for 25 yards. ",
            "2": "Meanwhile, Baltimore's offense was also responsible for not giving Smith a great send-off, as the unit did stupid stuff throughout the afternoon. The team managed to move the chains on occasion, but constantly screwed up in the red zone. Joe Flacco fired an interception on a first-and-goal, telegraphing a horrible pass to Shawn Williams. The Ravens later went for it on a fourth-and-1 inside the red zone, but failed to convert. They were down 20-3 and needed two touchdowns and a field goal, so kicking would've made the most sense. This was evident when the Ravens had possession, down 20-10, with 5:40 remaining. Had they opted for the field goal, they would've been down just one score with the ball. John Harbaugh's brain fart was inexplicable. ",
            "3": "As for the man of the hour, Smith had a pretty nondescript game. He caught three passes for 34 yards, and in typical Smith fashion, he got into a scuffle with a Cincinnati defender following a catch and a subsequent late push by Shawn Williams out of bounds. Congratulations to Smith on what has been a terrific career. He has finished seventh all time in receiving yards. ",
            "4": "Flacco did at least play well in between the 20s. He finished 32-of-49 for 267 yards and an interception. However, this wasn't the first time he was guilty of red-zone blunders this year. This has been a constant problem for him, and it's something the Ravens need to address this offseason. Perhaps Flacco will be better in his second year back from hs ACL tear. ",
            "5": "Kenneth Dixon had twice as many carries as Terrance West, which is a good sign that the Ravens recognize who the better talent at running back happens to be. Dixon gained 44 yards and a touchdown on 10 carries. West (5-18) was stuffed on a third-and-1. Baltimore's decision to use West in that situation was perplexing, given that Dixon had move the sticks on a fourth-and-1 earlier on the same possession. ",
            "6": "Dennis Pitta led the Ravens with 11 catches for 91 yards. Breshad Perriman (4-62) was next, thanks to a 39-yard burst that featured some horrible tackling efforts by the Bengals. It appeared as though Perriman scored, but replay review ruled it down at the 1-yard line, allowing Dixon to vulture the score. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Congratulations to Sam Bradford for setting the most fraudulent NFL record of all time! With no playoff implications in this game, all eyes were on Bradford, who was looking to clinch the league's single-season completion percentage record, beating Drew Brees' 71.2 from 2011. Bradford, who went 25-of-33 for 250 yards, three touchdowns and an interception, finished with a 71.6-percent completion rate this year. I'm calling the record fraudulent because that's exactly what it is. Brees' 2011 campaign was one of the best quarterbacking seasons in NFL history. Brees tallied 5,476 yards and maintained a sterling 8.3 YPA. Bradford, on the other hand, achieved the high completion percentage because all he did was dink and dunk throughout the entire year. By comparison, Bradford failed to reach 4,000 yards and possessed a YPA of around seven. It's a shame for Brees because he actually deserved the record. Bradford does not. Bradford did play well in this game, though it needs to be noted that the Bears were missing several edge rushers. Bradford was seldom pressured, and he was able to shred Chicago's secondary as a result. His one blemish was the pick, which he forced into tight coverage. ",
            "2": "With Bradford performing well, the Bears didn't have a chance, especially with Matt Barkley self-destructing. Barkley, who threw eight interceptions in the past two games heading into this contest, continued to be a turnover machine, adding two to his dubious total. Barkley's first pick occurred when he forced a poor pass into coverage when he had an underneath receiver open in the red zone. He did the same thing after halftime, once again deep in Minnesota territory. Barkley capped off his afternoon with strip-sack that was returned for a touchdown. Barkley misfired on only four occasions, going 10-of-14 for 125 yards. That's not bad, but the three give-aways obviously need to be taken into account. Barkley played well several weeks ago, but he has transformed into a turnover machine. He might still have a role as a No. 2 quarterback in this league, but he really needs to work on being more careful with the football. ",
            "3": "The one piece of good news for the Bears is that Jordan Howard set the team record for rushing yards by a rookie. Howard was great, gaining 135 yards on 23 carries. He's definitely the starter heading into next year over Jeremy Langford (10-26), who lost a fumble, which the Vikings turned into a touchdown. ",
            "4": "Alshon Jeffery didn't do anything outside of catching one pass for 10 yards. Jeffery was smothered by Xavier Rhodes, who actually covered the No. 1 receiver this week. The team's leading receiver was Cameron Meredith (4-61), who actually threw a touchdown pass to Barkley on a trick play. Meredith was a quarterback at Illinois State. ",
            "5": "Moving back to the Vikings, Kyle Rudolph had a big game with Stefon Diggs out, catching 11 balls for 117 yards and a touchdown. Last week's hero, Adam Thielen, snatched just one ball for seven yards. ",
            "6": "Jerick McKinnon had a solid stat line, thanks to a 36-yard burst. He finished with 89 yards and a touchdown on 16 attempts. ",
            "7": "Last thing: Some loser protester wearing a Vikings Brett Favre jersey was causing a distraction the entire game, hanging from the rafters and posting signs that didn't make any sense. Whatever he was protesting was probably stupid, and he was just wasting time, failing to make any sort of difference like most protesters in the current era. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "This game didn't mean anything to either team. The Cowboys sat Ezekiel Elliott entirely and used Dak Prescott for only a quarter. Thus, all eyes were on Tony Romo, who played for the first time since suffering an injury on Thanksgiving last year. Romo was on the field for just one drive, but that's all the Cowboys needed to see. Romo looked like he was rusty when his first pass was nearly picked by Leodis McKelvin. However, he bounced back with a strike to Terrance Williams to move the chains on a third-and-long attempt. Romo then helped Dez Bryant draw an interference flag in the end zone, as Nolan Carroll was guilty of some of the worst coverage you'll ever see from a professional cornerback. Romo capitalized by lofting a perfect touchdown to Williams. Romo's final numbers were 3-of-4 for 29 yards and the touchdown. It was a small sample size, but the Cowboys have to be confident that Romo can lead the team deep into the playoffs in the event of a Prescott injury. Prescott, by the way, went 4-of-8 for 37 yards. He was banged up pretty well, and I imagine the Cowboys regret using him at all in this game against an angry Eagle team. ",
            "2": "The Cowboys used Mark Sanchez the rest of the way, so I'll focus on the Eagles. Carson Wentz had a nice finale to his roller-coaster rookie year, going 27-of-43 for 245 yards and two touchdowns. Granted, Wentz was going up against a defense missing some starters, including Sean Lee, but despite some dangerous passes, Wentz flashed enough for Philadelphia fans to feel excited for next year. Wentz showed some great pocket awareness at times. On one instance, he was able to duck out of a sack and find Trey Burton for no gain. The end result isn't impressive, but Wentz avoided a big loss in the red zone, gave his teammate a chance to score, and set up a manageable third-down situation on the following play. Wentz later had a nifty scramble to move the chains in the red zone, setting up a touchdown to Zach Ertz. ",
            "3": "Speaking of Ertz, the talented tight end had a big game, snatching 13 of his 16 targets for a whopping 139 yards and two touchdowns. He handed one of the touchdown footballs to some baseball player named Mike Trout, who apparently gave every single Eagle a pair of shoes this week. I don't know why any of this matters, but the baseball-obsessed FOX broadcast made a big deal about it. ",
            "4": "Elsewhere in the receiving corps, the other tight end, Burton, was next with five catches for 39 yards. Jordan Matthews was out, so the wide receiver who posted the best stats was Paul Turner (2-30). Turner had a great preseason and might have a bright future. ",
            "5": "Philadelphia fans definitely had a great time booing Sanchez, who was predictably horrible, save for one drive. Sanchez finished 9-of-17 for 85 yards and two interceptions. The first pick was a great play by Jordan Hicks to break up a screen, tipping a pass to himself. The second was all on Sanchez, as he telegraphed a pass to Hicks. Sanchez may have cost himself a roster spot in the entire league next year by this abysmal performance. ",
            "6": "Darren McFadden started for the Cowboys, but didn't get much work. He gained 28 yards on seven carries. Neither Bryant (0 catches) nor Jason Witten (1-10) played very much either. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "I wrote that I wasn't sure if the Dolphins would go all out in this game, as they weren't even assured the No. 5 seed had they won, given that a Kansas City victory over San Diego would nullify this win. Sure enough, Miami definitely put forth full effort in this contest, but it didn't matter because the Patriots were just so much better. New England's plan, apparently, was to control the clock and to limit Matt Moore's chances. The opening drive for the Patriots lasted nearly eight minutes, as Tom Brady was a perfect 6-of-6 for 41 yards and a touchdown to start the game. The Dolphins had to punt away instantly, thanks to a Ja'Wuan James false start, and this led to another New England touchdown. Before the Dolphins knew what hit them, the Patriots were up 20-0. Miami, to its credit, attempted a comeback and drew to within 20-14. However, the Patriots responded with a 77-yard touchdown to Julian Edelman on third down. That put the game away for good, as the Dolphins didn't score after that, thanks in part to a Damien Williams fumble in the red zone that set up another quick New England score following a long return on the recovery. ",
            "2": "Brady was nearly flawless, going 25-of-33 for 276 yards and three touchdowns. This result allowed him to set an NFL record for the best single-season touchdown-to-interception ratio in NFL history. He finished the year with 28 scores and just two picks. The previous record-holder was Nick Foles, who somehow managed a 27:2 ratio back in 2013. That required a lot of luck and dropped interceptions. Brady's new record, in contrast to Bradford's, is totally legitimate. ",
            "3": "Brady's three touchdowns went to Edelman (8-151), Michael Floyd (3-36) and Martellus Bennett (3-33). Floyd is noteworthy, as his score was a great one; he fought hard to reach the end zone, taking six Dolphins along for a ride. Floyd also had a crushing block on Edelman's long touchdown catch. With Rob Gronkowski out, a new weapon like Floyd is definitely welcome. Edelman, by the way, was guilty of a head-butting personal foul in the opening half. That was probably the only real blunder for New England's offense the entire afternoon. ",
            "4": "The two Patriot running backs split carries evenly in the first half. Dion Lewis had one more attempt prior to halftime, but LeGarrette Blount finished with more tries, as Bill Belichick used the latter as an end-game hammer to run out the clock. Blount managed 51 yards and a touchdown on 14 carries, while Lewis gained 48 yards on 11 attempts, all but two of which came in the opening half. ",
            "5": "As for the Dolphins, Matt Moore didn't have a bad game, going 24-of-34 for 205 yards, two touchdowns and an interception. The pick really hurt, as it occurred when he hurled an underthrown pass while scrambling left. With the Patriots limiting Miami's possessions, every drive was going to be crucial, so the Dolphins couldn't afford that mistake. The same goes for the aforementioned Damien Williams fumble. ",
            "6": "Moore's touchdowns went to Jarvis Landry (9-76) and Kenny Stills (4-41). DeVante Parker caught five of his six targets for 45 yards. ",
            "7": "With Miami constantly trailing, Jay Ajayi's attempts were limited. It's a shame for Ajayi, as he was running pretty well. He gained 59 yards on 16 carries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Buccaneers needed a billion things to happen for them to make the playoffs, including a tie by the Redskins. They obviously didn't have much of a chance, but they managed to fight hard for a victory. The win gets them to 9-7, so having a positive 2016 campaign could serve as a confidence-builder heading into 2017. That said, Jameis Winston didn't have the greatest performance. He began the game well, scrambling around on a third-and-10 to find Adam Humphries, which set up a field goal. However, Winston then was guilty of two turnovers; one was an interception tipped off Humphries' hands, while the second was a strip-sack in Carolina territory, as he held on to the ball too long. Winston was also very fortunate to get away with a pick at the end of the game when he foolishly threw the ball up for grabs into the end zone while getting hit. It was a tie game, and the Buccaneers were in kicking range, so it's not like Winston had to force anything. The ball fell incomplete, however, and Winston managed to throw a touchdown shortly after. The score turned out to the the game-winner, as the Panthers failed on a two-point try on the next drive with only a few seconds remaining in regulation. Winston ended up 20-of-35 for 202 yards, one touchdown, the pick and his fumble. He didn't look very good, perhaps because he was missing his security blanket, Cameron Brate. Humphries took over in that role, snatching 10 balls for 94 yards, but as mentioned, he was responsible for Winston's interception. ",
            "2": "Aside from Humphries, only two Buccaneers caught multiple passes: Mike Evans (5-65, TD) and Russell Shepard (2-29). ",
            "3": "With Doug Martin in rehab, and Charles Sims out with an injury, Jacquizz Rodgers handled most of the workload. He gained 75 yards on 17 carries, most of which came on a 26-yard burst. I imagine the Buccaneers will be looking for a new starting running back. Check out our 2017 NFL Draft Running Back Prospect Rankings for more. ",
            "4": "As for the Panthers, I'm sure they're relieved that their disappointing season has finally come to an end. They deserve credit for fighting hard for a potential seventh victory, but they came up a two-point conversion short of prevailing in Tampa. Cam Newton struggled once again, though he did complete half of his passes this time. Newton's problem in this game were the turnovers he committed. He was responsible for three interceptions, though the first wasn't too egregious, as it was basically a punt that Philly Brown nearly came down with. The second was much worse, however, as Newton stared down Ted Ginn like a leering drunk, allowing the Buccaneers to snatch a pick-six. His next interception was targeted for Greg Olsen, but Keith Tandy came up with the turnover. Newton finished 18-of-32 for 237 yards, one touchdown and three interceptions. It could've been far worse for him, however, as he nearly had a couple of other picks. One potential interception was actually overturned by replay review. It's clear that Newton isn't healthy at all, as he's been bothered by a shoulder injury for quite some time now. ",
            "5": "Kelvin Benjamin abused Tampa's secondary, catching six passes for 93 yards and a touchdown at the end of regulation. He had a 47-yard reception to get the Panthers into Tampa territory on the final drive of the game. Ginn (4-69) was next on the stat sheet, while Olsen (3-22) was a major disappointment. Olsen is not 100 percent, so I'm sure he's looking forward to having some time off to heal. ",
            "6": "Jonathan Stewart struggled to find much running room for the most part; he was limited to 65 yards and a touchdown on 20 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Two long-time great players said their goodbyes this week. Steve Smith was the one everyone was talking about, but Robert Mathis also announced that he'll be hanging up the cleats. Unlike the Ravens, the Colts managed to come through for their teammate, as Andrew Luck threw a touchdown at the end of regulation to give Indianapolis its eighth victory of the year. Luck, however, did not play well in the early stages of the game. He seemed to panic when he was down 10-0, forcing a pass off his back foot near the red zone. He had accuracy issues throughout the opening half, going 7-of-17 for 88 yards and the pick by intermission. However, he caught fire in the second half. He was 17-of-23 for 234 yards and two touchdowns after the break, leading a great comeback for the Colts that ultimately concluded with a victory in the final seconds. Luck's final numbers were 25-of-39 for 301 yards and a touchdown. He didn't have Donte Moncrief at his disposal, so he targeted T.Y. Hilton quite a bit. Hilton saw 12 passes go his way, and he came up with six catches for 95 yards. Dwayne Allen (3-34) and Jack Doyle (2-10) snatched Luck's touchdowns. ",
            "2": "Congratulations are in order for Frank Gore, who became the first running back, 33 years or older, to rush for 1,000 yards in a season since John Riggins did so in 1984. Gore tallied 62 yards on 16 carries. ",
            "3": "Condolences are in order for Adam Vinatieri, who missed out on a $500,000 bonus because he whiffed on a field goal in this game. ",
            "4": "I thought the Jaguars would be flat after Blake Bortles and Allen Robinson actually tried hard for the first time all year last week. I was wrong, as they somehow summoned the energy once again. Bortles finished 25-of-39 for 301 yards and a touchdown. However, it wasn't all rosy for the first-round bust, as he was responsible for two separate strip-sacks, one of which Mathis was able to force. Mathis' actually really helped win the game, as the Jaguars were in the red zone to perhaps put the game away in the fourth quarter. The Colts collected the turnover, however, and they were able to march down the field and win this game. ",
            "5": "A major reason why Bortles was able to perform so well happened to be the injuries the Colts had in their secondary. Their Nos. 2 and 3 cornerbacks in this game were newly signed Charles James and the undrafted Chris Milton. As a result, two Jaguar receivers performed on a high level in addition to Robinson (5-82). They were Marqise Lee (6-86) and Bryan Walters (8-84). ",
            "6": "With Chris Ivory and T.J. Yeldon out, someone named Corey Grant led the team with 122 yards and a touchdown on 18 carries. Yeah, this game was pretty worthless outside of the Mathis implications, so let's just move on. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Titans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: I'd like to propose a new NFL rule: If a team loses to Matt Cassel, it automatically forfeits a playoff spot, even if it sits some of its starters. Who outside Houston wouldn't agree with this? ",
            "2": "This was a meaningless game for both teams. The Texans had key players like Jadeveon Clowney, Johnathan Joseph and Lamar Miller inactive, plus pulled their other defensive starters before long. With Marcus Mariota out for the Titans, this game resembled a preseason contest. However, the Texans needed to get some reps for inexperienced starter Tom Savage. That plan didn't work out, as Savage suffered a concussion on a quarterback sneak in the second quarter and forced Brock Osweiler into the game. With the injury to Savage, the Texans now have to figure out who they are going to start in the opening round of the playoffs next Saturday. ",
            "3": "On Houston's first possession of the game, Savage was drilled by Sean Spence for a strip-sack. The ball rolled into the end zone before DaQuan Jones recovered the fumble for a Titans touchdown. Midway through the first half, Savage converted a fourth-and-1 on a quarterback sneak. The league's neurological monitors removed Savage from the game after that play, forcing him into the concussion protocol. Savage didn't act injured, but it brought Osweiler into the game for Houston. The Titans had a drive going into Houston territory before A.J. Bouye deflected a pass in the air and Quintin Demps picked it off before returning it to the Texans' 40-yard line. Osweiler moved the chains a few times before Nick Novak missed a 45-yard field goal. The Titans got moving late in the half with a 25-yard pass to Rishard Matthews after Corey Moore fell down in coverage. A pass interference set up a first-and-goal, and Matt Cassel found Matthews open for a short touchdown. Savage came back into the game to take a knee to kill the clock before the half. The Titans took a 14-0 lead into the locker room. Curiously at halftime, Savage was ruled out with a concussion after being re-evaluated. Osweiler was able to engineer a drive in the third quarter with a 27-yard pass to DeAndre Hopkins and a connection to Will Fuller (3-24) for 14 yards. On fourth-and-goal, Osweiler found C.J. Fiedorowicz (2-12-1) for a short touchdown. The Texans then failed with their onside kick attempt, giving Tennessee good field position. Some good runs by Derrick Henry and a reception to Delanie Walker set up a first-and-goal that Henry turned into a touchdown. The Texans responded with a 51-yard pass to Hopkins, but ultimately had to settle for a field goal. Cassel soon loaded up a 50-yard completion to Matthews after he beat Robert Nelson once again, and that set up a field goal for Tennessee to take a 24-10 lead. Nelson and Texans backup Denzel Rice were being beaten like a drum. Osweiler hit Wendall Williams for a 26-yard reception, and on a fourth-and-goal, Osweiler ran the ball into the end zone to cut the lead to 24-17 with just over three minutes remaining. Derrick Henry ran the clock down, and Osweiler was unable to engineer a touchdown drive in the final minute. ",
            "4": "Savage was 5-for-8 for 25 yards before leaving the game. Osweiler was 21-of-40 for 253 yards with a touchdown passing and another one rushing. ",
            "5": "DeAndre Hopkins made seven receptions for 123 yards. The Texans pulled him early to protect him for their playoff game. ",
            "6": "Cassel was 16-of-26 for 150 yards with a touchdown and an interception. ",
            "7": "Henry led Tennessee in rushing with 65 yards on 15 carries. DeMarco Murray (11-21) was held in check. ",
            "8": "Rishard Matthews totaled 114 yards on nine receptions with a touchdown against Houston's backup secondary. ",
            "9": "The Texans didn't have all of their backup offensive linemen playing, but did rotate left tackle Duane Brown out of the game for a lot of the contest. Even when the starters were in, Houston struggled as Jurrell Casey had two sacks, while Derrick Morgan and Brian Orakpo generated a lot of heat off the edge. ",
            "10": "Texans backup defensive linemen Joel Heath (2 sacks), Christian Covington (1 sack) and Ufomba Kamalu (1 sack) gave the Titans' offensive line some problems. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Jets",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: I hope the Bills fans got a good look at this game, and they realize what life will be like once the Bills finish running Tyrod Taylor out of town. Taylor is, by no means, a great quarterback, but he's a solid starter with upside, and the Bills don't have any sort of viable options this offseason. ",
            "2": "The Bills should consider firing Doug Whaley after this week. The incompetent general manager insisted that his team take an extensive look at first round by E.J. Manuel in this contest, and it cost the Bills the victory. With Manuel at the helm, the Bills were inept on offense. Anyone who has seen Manuel play could have told you that he would have this type of performance. Still, Whaley insisted on playing Manuel, and the Jets were able to dominate the Bills as a result. Manuel was absolutely atrocious for the Bills. The team had announced that he would make the start in place of Tyrod Taylor, but it definitely appears to have been a massive mistake. Manuel looked completely incompetent, and he does not belong in the NFL. Manuel showed terrible pocket presence and awareness, constantly taking hits and sacks instead of throwing the ball away. In addition to that, he struggled mightily with accuracy, and never really put any of his passes on his receivers. By the end of the game, Manuel had gone 9-of-20 for a measly 86 yards. He was responsible for one fumble, and on another, he had a botched handoff with Jonathan Williams. Manuel was so bad that the coaching staff elected to play Cardale Jones late in the second half. Jones was better, if only by default, going 6-of-11 for 94 yards with one pick. Jones had a really nice pass where he hit Justin Hunter for a huge 64-yard gain. For the most part, however, Jones put too much air under his passes and too often stared down his receivers. Still, he offers more upside than Manuel at this point. The Bills will likely part ways with Manuel in the offseason, and I would be surprised to see him on a 53-man roster come next fall. ",
            "3": "With the issues between the quarterbacks, it is no surprise that the receivers had a poor day for the Bills. Robert Woods (4-43) and Sammy Watkins (4-31) both had mediocre days and tied for the team lead in catches. Both are better when Taylor plays quarterback. Tight end Charles Clay (3-20) was also a disappointment, as he saw seven targets but barely managed to do anything with them. ",
            "4": "The typically strong Bills' running game was also a weakness today. LeSean McCoy unfortunately left the game with an ankle injury after just posting 10 yards on five carries. He had a terrific season, but the Bills did not want to risk his health with a banged-up ankle. Mike Gillislee put together a mediocre performance, finishing with 15 carries for 40 yards. He also got the only touchdown of the day for the Bills, but it came in garbage time. He struggled to find space against New York's defense, which had sold out to stop the run with Manuel starting. ",
            "5": "There was one play that was a microcosm of Buffalo's season. On a kickoff with the team down by 20, the Bills let the ball fall on the 10-yard line. It rolled into the end zone where no player picked it up. Jets special teamer Doug Middleton proceeded to jump on the ball in the end zone to get a touchdown. It was a bad look for the Bills, and that could be used against Anthony Lynn as he vies for the head coaching position. ",
            "6": "For the Jets, and head coach Todd Bowles, this was an important win. They were playing a much weaker Bills squad and were able to notch the victory. In what was likely Ryan Fitzpatrick's last game with the Jets, he put together a solid performance that many will look at when scouting backup quarterbacks this offseason. Fitzpatrick went 20-of-30 for 210 yards and two touchdowns. For the most part, he looked sharp and threw accurate passes. This is the type of performance that should be expected of him. If Fitzpatrick can limit his turnovers, he is a serviceable starter. It will be interesting to see where he lands in the offseason. Fitzpatrick spent a majority of the day targeting Quincy Enunwa (5-81) and Robby Anderson (4-43). Enunwa served as the No. 1 option for the Jets with Brandon Marshall out. He had a nice deep catch at one point and was almost able to outrun some of Buffalo's defenders for a touchdown. He should be the No. 3 option for the Jets next year, provided that Marshall and Eric Decker both return healthy. As for Anderson, he had a mixed outing. He has game-breaking speed, but he was guilty of a terrible drop. Anderson should be a depth guy for the team next year, as his straight-line speed makes him a great situational weapon. ",
            "7": "With Matt Forte out, Bilal Powell got a chance to work as the lead back. Boy, did he impress. Powell saw 22 carries and got 122 yards on those carries. He ripped off countless 10-yard gains and was really able to gash the Buffalo defense. Though he struggled in short-yardage situations, he still proved that he can be a workhorse back. Next year, the team should use him as their top option and bring in a power back to back him up. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: What the hell were the Browns thinking? How could they possibly come close to kissing their first-overall pick goodbye? They're so lucky Isaiah Crowell fumbled. It's like the football gods intervened and were like, You idiots, why are you trying to win this meaningless game!? ",
            "2": "There wasn't much intrigue as the Cleveland Browns came into Heinz Field to take on their old rivals, the Pittsburgh Steelers, but there was a competitive football game that went into overtime thanks to the Steelers resting their best players. This game felt like a preseason affair, but there were real-life consequences for the Browns, as a win could have lost them the No. 1 pick in the 2017 NFL Draft. Thankfully for them, they squandered plenty of opportunities to win, while the Steelers did just enough to squeak out the victory on the arm of Landry Jones. ",
            "3": "The Browns got off to a fast start and a 14-0 lead behind two Robert Griffin III touchdown passes, one to Seth DeValve and the other to Gary Barnidge. Griffin showed some of his better traits early, making short, high-percentage passes and causing confusion with his legs, which gave running back Isaiah Crowell more running lanes. Griffin did throw a pick inside the red zone to kill a drive and then had a snap go over his head on the very next possession, which led to the Steelers' first score, an 11-yard touchdown pass from Jones to DeAngelo Williams with just 31 seconds left in the first half. That brought the Steelers within a touchdown, down 14-7 at halftime. ",
            "4": "Jones had a good statistical day, completing 24-of-37 targets for 277 yards, three touchdowns and one interception, but the Browns' mistakes are what gave the Steelers a chance to win. In the third quarter, Browns cornerback Briean Boddy-Calhoun picked off Jones and wended his way all the way back for a touchdown, or what appeared to be a touchdown, until review showed he fumbled into the end zone and out of bounds before crossing the goal line, causing a touchback. The Steelers then went 80 yards down the field and scored on a one-yard touchdown run by DeAngelo Williams. The Browns went from what should have been a two-touchdown lead to a tie game. The Browns then had a chance to win the game with a minute in regulation, when Isaiah Crowell fumbled the ball away, sending the game into overtime. At this point, you wouldn't think the Browns could mess up anymore than that, but overtime brought some more miscues. Griffin moved his team down the field in the extra session, which was topped by a 43-yard completion to Terrelle Pryor. Then, with a first-and-goal from the two-yard line, Cleveland proceeded to lose 13 yards on a wide receiver screen and ended up kicking a 34-yard field goal, which Landry Jones then answered with his own drive, but his finished with a 26-yard touchdown pass to Cobi Hamilton for the win. ",
            "5": "I would say the Browns lost on purpose so they could get the No. 1 pick, but they sure did a good job of pretending to mess up royally if they did. They ended this season with just the one win last week against the Chargers, but Hue Jackson will get another season to get this team on track. ",
            "6": "One player whose future continues to look bright is Terrelle Pryor, who caught 7-of-11 targets for 94 yards. He topped 1,000 receiving yards in his first full season as a receiver. This, of course, was with some bad quarterbacks at the helm. ",
            "7": "The Steelers will move into the playoffs well rested to face the Miami Dolphins at Heinz Field. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: I'm glad I made two units betting against the Rams in Week 17, but I strongly regret wagering on Jared Goof so frequently earlier in the season. That was just dumb. ",
            "2": "There were a few takeaways from this game. On a positive note, Cardinals wide receiver Larry Fitzgerald ended the season as the NFL's leader in receptions. On the negative side, Rams rookie quarterback Jared Goff was awful once again; the No. 1 overall pick in the 2016 NFL Draft does not look like a competent NFL starter. Weeks ago, the Rams were assured of their 13th-straight not-winning season and finished with a seven-game losing streak to end the year. Los Angeles didn't win a game after Goff was made the starter. One major potential ramification for the 2017 NFL season that came from this game, however, could be the injury to Cardinals running back David Johnson. He went down with a leg injury that looked scary during the first quarter and was carted into the locker room. If the situation is serious - though it appears Johnson may have dodged a bullet - it could have a real impact on Arizona next fall considering the timing of the injury. ",
            "3": "As for the game, Arizona dominated from start to finish. The Cardinals started the game featuring David Johnson (5-6 rushing, 3-38 receiving) and Fitzgerald to produce a field goal drive. In the second quarter, there was a funny exchange, as Carson Palmer threw a bad pass that the Rams' Maurice Alexander picked off. The Rams then tried a trick play on the next snap, having Pharoh Cooper throwing a pass back across the field to a wide-open Todd Gurley. The ball hung in the air like a punt, however, and Cardinals rookie Harlan Miller tracked it down for an interception with a return well into Rams territory. That led to a second field goal for Arizona. Shortly later, Palmer led a drive that ended with him hitting Jeremy Ross (4-37) for a touchdown. The Rams got moving when Goff hit Todd Gurley on a check-down, and Gurley bolted down the field for 29 yards. Los Angeles produced two field goal drives in the second quarter and the Cardinals got a field goal on the final play of the half to make it 16-6. Early in the third quarter, Goff took a third-down sack and a punt return from Patrick Peterson set up Arizona in great field position. The Cardinals' next play saw Palmer find Darren Fells (1-37-1) in busted coverage for a 37-yard touchdown. Shortly later, Arizona's J.J. Nelson (4-75) made a juggling catch while falling on his back for 32 yards just in front of the end zone. Kerwynn Williams (12-60-1) then powered into the end zone from a yard out to give Arizona a 30-6 lead. In the fourth quarter, Fitzgerald caught a touchdown and became the NFL's reception leader, at age 33, for the 2016 season. Goff was benched for Sean Mannion in the fourth quarter. Quickly, Justin Bethel intercepted Mannion and returned it 68 yards for a touchdown. ",
            "4": "Palmer was 20-of-38 for 255 yards with three touchdowns and one interception. Fitzgerald collected five receptions for 43 yards and a score. ",
            "5": "Goff was 13-of-20 for 120 yards. He did have a couple of nice passes dropped, with Brian Quick (2-16) causing the most glaring failure. Still, the big problem for Goff was terrible pocket presence. He constantly held onto the ball for far too long in the pocket and did not display the feel or internal clock to get the pass out before taking a negative play. Goff was primarily responsible for the Rams taking seven sacks. He also threw a terrible interception to D.J. Swearinger, although a questionable roughing-the-passer penalty bailed him out. Markus Golden (2.5), Chandler Jones (1.5), Calais Campbell (1.5), Rodney Gunter and Swearinger all recorded sacks for Arizona. Goff is going to be a huge project for Los Angeles' new coaching staff, but with how bad he looked as a rookie, it wouldn't be at all surprising if he ends up being a bust. ",
            "6": "Gurley ran for 40 yards on 14 carries plus made four receptions for 37 yards. Playing in what he previous described as a middle-school offense, Gurley was the Rams' leading receiver against Arizona. Tavon Austin (2-18) had a touchdown run called back, plus he fumbled the ball away in the second half. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "27"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: Mike McCoy was fired. You can check out all my NFL Coach Firing Grades here. ",
            "2": "The Chiefs came into this contest with one mission: win and get to the No. 2 seed in the AFC. They were able to do just that. The team put forth a terrific performance as a team to go into the postseason with a bye week and some momentum. Alex Smith put together one of the best performances of his season on Sunday afternoon. The veteran quarterback was his usual, accurate self, but he added a lot to the game by virtue of his mobility. Smith scrambled for 21 yards on six carries during the matchup with the Chargers. He also added a touchdown with his legs. On the score, he ran a read-option play that he was able to execute perfectly. He read the opponent and got outside leverage before getting to the pylon. On the other scrambles, Smith showed tremendous speed and was able to make quick decisions. That really helped to get his passing game going. In that department, Smith went 21-of-28 for 264 yards, two touchdowns and one interception. He was able to demonstrate excellent accuracy and delivered a lot of on-target passes to his receivers. If Smith can play like this in the postseason, he will give the Chiefs a chance to win their divisional round matchup. ",
            "3": "Smith's strategy of spreading the ball around worked very well for the Chiefs on Sunday. Four different receivers saw at least five targets, and the leader of the group was Tyreek Hill. Hill caught five passes for 46 yards, and was able to do some damage on screen plays. He should continue to be a weapon for the Chiefs, and he could be their No. 1 option next year. Elsewhere, Chris Conley (4-55) and Jeremy Maclin (4-53) put together solid performances. Maclin had a couple of nice catches, and he seems to be coming on after struggling with injuries earlier in the season. ",
            "4": "One of the other top receivers was actually running back Charcandrick West. He totaled 58 yards on five catches and also had a couple of receiving touchdowns. West caught both on plays where he flared out of the backfield to the front pylon. It was an impressive performance from the young running back, who also led the team in rushing with 58 yards on 16 carries. He did a good job of filling in for the injured Spencer Ware. ",
            "5": "One of the biggest plays of the game for the Chiefs came on a punt return. Hill fielded the ball at his own 5-yard line. Hill decided to bring the ball out, and he got some strong blocks as the play developed. He made it down the sideline and scampered to the end zone for the 95-yard score. That gave the Chiefs a 34-17 lead, and really helped to cement their lead. ",
            "6": "For the Chargers, this loss was not all too surprising. The team came limping into the final game, dealing with countless injuries. Because of this, their team struggled to keep pace with the Chiefs. Philip Rivers had a mixed performance in his final game of the 2016 season. He went 22-of-38 for 269 yards, two touchdowns and two picks. However, the stats are a little misleading. One of Rivers' touchdown drives came with the Chiefs already up 17 points, so it was essentially garbage-time numbers. Still, Rivers did make some nice throws on the day. With an upgraded offensive line, he could be a top-10 quarterback once again. The major issue with Rivers was his decision-making on his picks. He threw into double coverage far too often, and while the ball placement was decent, he needed to be better about throwing to open receivers. Frankly, he should have thrown the ball out of bounds in the end zone on the Daniel Sorensen interception. The Marcus Peters pick was a less-egregious error, as the skilled corner just jumped the route. ",
            "7": "Rivers' decent day allowed his top receiving targets to perform relatively well. Per usual, Rivers heavily targeted his tight ends. Antonio Gates (5-55, 1 TD) and Hunter Henry (4-43, 1 TD) created mismatches with the Kansas City linebackers and were able to provide great intermediate options for the team. Gates will likely return to the team next year, so he and Rivers should have a chance to repeat their success in 2017. Tyrell Williams (6-70) and Dontrelle Inman (4-51) were the top traditional receivers on the day. Both were solid and should be integral parts of the San Diego offense next year. Ronnie Hillman (3-50) was great at catching passes out of the backfield. ",
            "8": "The rushing attack for the Chargers actually featured a surprising leader. Andre Williams, signed off of the practice squad earlier this season, got a lion's share of the carries. With injuries to Melvin Gordon and Kenneth Farrow, Williams saw 18 carries and managed to turn them into 87 yards. He ran with some great physicality and looked to be in better shape than he was with the Giants. Perhaps he will be a backup for the Chargers in 2017. Hillman, meanwhile, also saw some carries, and showed some change-of-pace ability. He finished the day with 41 yards on seven carries. ",
            "9": "The Chargers got some great play out of some of their defensive stars. Joey Bosa notched yet another sack on a play where he just blew through the defensive line. He will be a stud in the future for the Chargers. Safety Jahleel Addae had a good game as well. He had a huge pick-six return that saw him run all over the field and find a convoy of blockers to get to the end zone. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "25"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "23"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: My great fear about the Seahawks occurred in this game, as they pulled their starters because the Falcons were well ahead. I feared this because my NFL Pick of the Month was on the Saints. Fortunately, Drew Brees came through at the very end! ",
            "2": "Seattle came into this game looking to move up to the No. 2 seed and get a playoff bye, but the Falcons took it to the Saints and ruined any hopes of that scenario coming true. But the 49ers made this a game, as they have been wont of late. The 49ers started fast with two short touchdown runs from Shaun Draughn. Colin Kaepernick led his team down the field, completing his first eight passes for 115 yards. This has been a theme for Kaepernick this season. He'd start quickly and then get bogged down completely for two quarters before making a last-ditch effort to come back. Last week, that worked for the 49ers' second win of the season against the Rams, which happened to be the 49ers' second win against any team. ",
            "3": "Russell Wilson wasn't sharp to start this game, but did get into a rhythm as the game went on; however, with the Falcons out to a big lead on the Saints, Pete Carroll pulled Wilson and put in Trevone Boykin for the fourth quarter. Wilson still put up good numbers for just three quarters of play, completing 19-of-32 passes for 258 yards and a touchdown. ",
            "4": "Kaepernick completed 17-of-22 passes for 215 yards and a touchdown, with eight completions and 115 yards coming on his first eight passes. After that outburst, he went 9-of-14 for 100 yards and a touchdown in three quarters of play. Remember that this team didn't have Carlos Hyde or Torrey Smith, and even if both had been in, the talent deficiency across the board in San Francisco is abysmal. Maybe that's why general manager Trent Baalke was fired before the game? It is. With Seattle resting its starters in the fourth quarter and the 49ers complete lack of talent, this game was boring, but once again, Kaepernick made it close, throwing a 9-yard touchdown to Garrett Celek to bring the 49ers within two-points with just over five minutes left in the game. They, of course, fell short, but Kaepernick, despite his many faults as a passer, does make things happen. Maybe he's just a faster Tim Tebow, but I believe he does have a future in the right spot. Where that will be is clear as clay, especially with huge changes in store among the San Francisco brass. ",
            "5": "Thomas Rawls rushed eight times for 14 yards and one gimme touchdown, while Alex Collins rushed seven times for 55 yards in relief of Rawls. I do think we'll see more of Collins in the playoffs, as Rawls just hasn't looked like the same runner after his injuries. ",
            "6": "This Seattle team is very talented, but also flawed. The Seahawks' offensive line is not putting it together, and their running game is a shadow of it once was. This season, the 49ers hadn't held a team under 51 rushing yards through three quarters all season, but they restricted the Seahawks to just 20 in this game, and three quarters were how long the starters played. ",
            "7": "The 49ers will get the No. 2 pick in the 2017 NFL Draft, and hopefully they get a good general manager set up quickly for that pick, because they need it to hit. ",
            "8": "Seattle will go into the playoffs as the No. 3 seed, which does give the team a home game against the Lions. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Giants",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The prevailing opinion on the Sunday morning shows was that this was going to be a big game for Kirk Cousins in determining how large of a contract he would receive this offseason. A big performance in a victory would allow the Redskins to reach the playoffs, but if Cousins struggled, Washington would be stuck, and would probably have to resort to franchising its quarterback once again. Cousins didn't lead his team to victory, eliminating Washington in the process. However, Cousins didn't perform poorly. It's more like he didn't have much of a chance. Washington's offensive line was atrocious in this game. The Redskins couldn't block the Giants whatsoever, and Cousins was constantly hounded throughout the afternoon. Cousins took four sacks in the first two-and-a-half quarters, as Washington couldn't get anything going offensively. It's not like Cousins held the ball too long in the pocket or anything; he simply didn't have any time to throw. He was being brought down before he could make any sort of progressions, which would explain why the Redskins mustered just 83 net yards of offense in the opening half. Something clicked in the fourth quarter, however, as the Redskins engineered a couple of scoring drives. They managed to come back from down 10-0 to tie the game. However, following a New York field goal, set up by a deep Eli Manning pass, the Redskins needed another score to either win or force overtime. They moved into New York territory, but Cousins was pressured once again. He moved to his left, which forced a weak throw to Pierre Garcon. Dominique Rodgers-Cromartie snatched the interception to seal the victory for the Giants. Cousins finished 22-of-35 for 287 yards, one touchdown and two interceptions. Cousins is getting a ton of flak on Twitter, with a hilarious Jordan meme where Michael Jordan's face replaced Cousins during the iconic You like that? moment. However, while Cousins is partly to blame for the pick, the Redskins' offensive line is mostly at fault. The pressure they allowed prompted the losing pick. The other interception occurred because his receiver fell down. Rodgers-Cromartie also snatched that one. ",
            "2": "The only two successful targets for Cousins happened to be Garcon (4-96) and Jordan Reed (5-40, TD). Garcon made a great play to elude numerous tacklers on a third-and-17 in the red zone to set up the touchdown. DeSean Jackson didn't do much, catching two balls for 34 yards. The scuttlebutt is that Jackson will sign with the Eagles this offseason. ",
            "3": "Robert Kelley didn't have any sort of success, mustering only 33 yards on 12 carries. He was stuffed by Kelvin Sheppard on a third-and-1 in the opening quarter. ",
            "4": "As for the Giants, their offense once again did just enough to prevail. Eli Manning went an underwhelming 17-of-27 for 180 yards, but his 44-yard connection with Tavarres King set up the decisive field goal. Manning, like Cousins, saw tons of pressure from the Redskins' front. It's noteworthy that Washington lost Ryan Kerrigan at the beginning of the third quarter to a finger injury. ",
            "5": "Will Tye was New York's leader in receiving yards (4-47); not Odell Beckham. The natural blonde caught five passes for 44 yards, as Josh Norman did his best to limit him. Beckham did get the best of Norman on some occasions, however, including once when Beckham annoyed Norman enough for Norman to hit him late out of bounds. Norman later head-butted Beckham. ",
            "6": "Paul Perkins and Rashad Jennings split the workload almost evenly, with the former having the edge in carries, 21-18. However, Perkins outgained Jennings by a wide margin, 102-52. Jennings scored a touchdown, but the Giants need to consider making Perkins their primary ball-carrier going forward. ",
            "7": "One last thing: This game really ended at 13-10, but the Redskins' attempt at a Stanford Band-type play ended with the Giants scooping and scoring to make this result 19-10. Everyone left the field, but the officials called everyone back to attempt an extra point for some reason. I have no idea why this stupid rule exists. The Giants scoffed at it, opting to kneel down instead of kicking the extra point. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "It would be an understatement to say that the Raiders are in serious trouble. They were battling the Broncos, who hadn't been very competitive against the Patriots and Chiefs, teams that the Raiders will need to beat in the second round of the playoffs, if they even get there. Yet, Oakland was dominated and blown out in Denver, dropping to the No. 5 seed. This game was never close. Derek Carr's injury was expected to keep the Raiders out of the Super Bowl, but I didn't think it would prevent them from being competitive against capsizing, mediocre teams. Matt McGloin was absolutely atrocious. He went 6-of-11 for only 21 yards, as he missed Amari Cooper for a deep touchdown. McGloin was then roughed up on a couple of roughing-the-passer penalties, the second of which forced him out of this contest with a shoulder injury. Connor Cook took over and was better, though he would've been by default anyway. Cook actually led a touchdown drive when he found Cooper in the end zone. The rookie finished 14-of-21 for 150 yards, one touchdown and an interception on a poorly thrown floated pass. Cook was also responsible for a lost fumble on a strip-sack, which ruined a promising drive. Cook has no experience, but he's probably the better option. He was better in the preseason than McGloin, and he actually has NFL-level talent. In fact, the Cowboys were going to select him instead of Dak Prescott before Oakland moved up for him. That said, it doesn't appear as though the Raiders have much of a chance with either signal-caller. ",
            "2": "In addition to the bad quarterbacking, the Raiders have two other major concerns. The first is the knee injury Donald Penn suffered in the fourth quarter. Penn was clutching his knee and had to leave the game. Penn is one of the top left tackles in the NFL, and his absence would be enormous versus the Houston edge rushers. Meanwhile, Michael Crabtree isn't 100 percent, and this isn't because Aqib Talib yanked off Crabtree's counterfeit gold chain during the game and then bragged about doing so to his teammates. Crabtree was hobbling around on a bum ankle all afternoon, as it was clear that he wasn't 100 percent. Crabtree caught five passes for 47 yards, while Cooper (4-39) snatched Oakland's only touchdown. ",
            "3": "The Raiders were expected to run all over the Broncos, who have been weak to ground attacks all year. However, the Raider running backs mustered just 57 total rushing yards on 15 carries. DeAndre Washington led the way with 43 yards on seven attempts, but about half his yardage came on one 20-yard burst. Take that away, and Oakland was restricted to only 37 yards on the ground on 14 attempts. With Carr out of the lineup, Denver was able to play closer to the line of scrimmage. Other opponents will treat the Raiders similarly. ",
            "4": "The Broncos, meanwhile, were playing hard for Gary Kubiak, who told his players that he would be retiring after this game. They sent him off in style, and even the offense played well for the first time in quite a while. Then again, the Oakland defense definitely had a part in that, missing numerous tackles throughout the afternoon. News reports indicated that Trevor Siemian and Paxton Lynch would rotate series in this game, but the rookie didn't see the field. Siemian played every snap, going 17-of-27 for 206 yards, two touchdowns and an interception. The pick was sloppy, as it was launched into triple coverage, but that was Siemian's only mistake in the finale. He wasn't great, but he did a good job of managing the game, especially after losing Emmanuel Sanders early to a foot injury. ",
            "5": "The Broncos were able to move the chains extremely well on the ground. Justin Forsett gained 90 yards on 22 carries, but most of that came on a 64-yard burst in the opening quarter. Devontae Booker was more effective otherwise, as his 14 attempts went for 57 yards and a touchdown. He also caught two passes for 52 receiving yards and a touchdown. ",
            "6": "Aside from Booker, Denver's leading receiver was Demaryius Thomas, who had four grabs for 47 yards. With Sanders sidelined, former second-rounder Cody Latimer saw some action, but was largely ineffective. He logged three receptions for 28 yards. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "32"
        },
        "comments": {
            "amount": "6",
            "1": "The final score may say 38-32 - and I surely owe my soul to someone because of the close margin - but this game was decided by the second quarter. The Falcons absolutely dominated this game, and they ultimately led 38-13 before they took their foot off the gas. The win helped seal up the No. 2 seed. Atlanta's offense was absolutely absurd in the first half. There are so many stats and facts I can cite, but perhaps this is the most impactful one: The Falcons had only one play in the first quarter, a drop, that didn't result in a touchdown or a first down. They were averaging 24.6 yards per play. This means if that number held up, the Falcons would've scored a touchdown every three plays, assuming a starting position at their own 25-yard line! The Falcons didn't punt until the middle of the third quarter when, as mentioned, they took the foot off the gas. Matt Ryan was ridiculous nonetheless, going 27-of-36 for 331 yards and four touchdowns. He was so locked in that it was shocking whenever he threw an incompletion. The stats could've even been better had the Saints kept up on the scoreboard prior to their late surge in the final quarter. Also, Ryan helped Julio Jones draw a deep pass interference, so that won't show up on the box score either. ",
            "2": "Speaking of Jones, he caught seven passes for 96 yards and a touchdown in addition to drawing that interference flag. Ryan's other touchdowns went to Justin Hardy (4-43), Mohamed Sanu (4-32) and Levine Toilolo. ",
            "3": "Devonta Freeman also had a monstrous performance. He burst for a 75-yard touchdown on the team's second drive, ultimately finishing with 96 yards and a touchdown on 12 attempts. Freeman also snatched all five of his targets for 81 receiving yards. Tevin Coleman (8-44) also had a long gain on the ground of 25 yards. ",
            "4": "The silver lining for the Saints, aside from covering the spread, is that Drew Brees has thrown for 5,000-plus yards for the fifth time in his career. Brees posted a great stat line, though the offense scored just six points outside of an early drive until the fourth quarter. Brees made a great pass when he dropped the ball in perfectly to Coby Fleener on a fourth-and-1 on the second possession. However, the drive couldn't end in a touchdown because Fleener failed to hold on to the ball while falling out of bounds. The play was initially ruled a score, but replay review reversed the call. Brees was on fire in garbage time, allowing to finish with the following stat line: 29-of-50, 350 yards, two touchdowns and an interception, which was his only blemish in the final quarter. Brees forced a pass into the end zone. It was only first-and-goal, so Brees didn't have to be so careless. The pick would end up costing the Saints the game. ",
            "5": "Michael Thomas led the Saints with 10 catches for 156 yards and a touchdown, putting a bow on his terrific rookie year. If it werent' for Ezekiel Elliott and Dak Prescott, people would be talking about Thomas as a potential Offensive Rookie of the Year candidate. Elsewhere in the Saints' receiving corps, there was a scary moment when Brandin Cooks' head hit the ground, and he was motionless for a while. Cooks (3-19) was obviously ruled out after that, so Willie Snead (3-82) was next on the team in receiving yards. ",
            "6": "Mark Ingram had a big game, gaining 103 yards and a touchdown on only 20 carries. He also caught six passes for 29 receiving yards. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "Aaron Rodgers told the media that his team was going to run the table, and that's exactly what Green Bay did. The Packers have prevailed in the final six games, overcoming a 4-6 record to win the NFC North. Rodgers has been unbelievable down the stretch, finishing his run with 18 touchdowns and zero interceptions. He was fantastic in this contest as well, going 27-of-39 for an even 300 yards and four touchdowns. He made so many great plays. Once, he was able to dodge Ezekiel Ansah's sack somehow and connect with a teammate for a first down. Later, Rodgers maneuvered the pocket for exactly 8.7 seconds and found Geronimo Allison for a touchdown. Rodgers also picked up a key first down with his legs late in the game. Rodgers' injuries are clearly a thing of the past, as he scrambled 10 times for 42 rushing yards. ",
            "2": "Allison actually came out of nowhere to lead the team in receiving with four catches for 91 yards and the touchdown. He came up big with Randall Cobb inactive. Meanwhile, Jordy Nelson (6-66) was limited by Darius Slay's great coverage, while Davante Adams (6-31) caught two scores, while Aaron Ripkowski (2-25) snatched Rodgers' fourth touchdown. ",
            "3": "Speaking of Ripkowski, he made some tough runs throughout the evening, rumbling for 61 yards on nine carries against Detroit's weak run defense. Ty Montgomery also had some significant gains, picking up 44 yards on eight carries. Montgomery had a great juke of linebacker Tahir Whitehead on a late scoring drive. ",
            "4": "The Packers had two injuries of note. Quinten Rollins was down for a while and had to be carted off the field and driven to the hospital. The good news is that he had movement in his extremities. The bad news is that Rollins may not be able to play anytime soon, depleting an already-thin secondary. ",
            "5": "Detroit, meanwhile, once again didn't trail heading into halftime, as was the case Monday night at Dallas. The Lions actually held a lead in this contest, with Matthew Stafford catching fire in the second quarter. Things fell apart after the break, however, as the Lions were able to put more pressure on Stafford, rattling him in the process. Stafford, as a result, missed on many throws he usually completes. Stafford finished 26-of-41 for 347 yards, two touchdowns and an interception. His stat line is misleading, however. One of his scores was a meaningless Hail Mary with half a minute left in regulation to Anquan Boldin (4-57). Stafford also should've thrown a second interception, a potential pick-six, but Clay Matthews dropped the ball. Stafford made another mistake in the early going, completely missing Golden Tate downfield for a long touchdown. He simply overshot him. ",
            "6": "Tate (6-77) caught Stafford's other touchdown, and he also happened to lead the Lions in receiving, despite the miscue. He did, however, commit an obvious offensive pass interference, which prompted a missed field goal from Matt Prater, whiffing from 39 yards out. Had Prater connected, the Lions could have maybe pushed. Marvin Jones (5-76) and Eric Ebron (6-61) were next on the receiving chart. ",
            "7": "The Lions made the mistake of going away from Zach Zenner on Monday night. I don't understand what their problem is because they made the same exact error in this contest. Zenner had 16 carries for 63 yards and a touchdown by halftime, but received just four attempts following the break. He was such a big part of the offense early on, so it made no sense for them to shy away from him later in the game. Zenner (16-69, TD) was a big part of the passing attack, at least, catching four balls for 41 receiving yards. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "16"
}