{
    "year": "2016",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "I did not think the Panthers were prepared to play in the Super Bowl. They came into the contest highly acclaimed after their blowout victory over the Cardinals in the NFC Championship. The Broncos, meanwhile, possessed a decaying quarterback who happened to be statistically worse than Mark Sanchez. The Panthers knew they were going to win, so it seemed like they took that game for granted. The rematch was much different. The Panthers came in more focused, ready with a better game plan against the deadly Denver pass-rushing duo of Von Miller and DeMarcus Ware. They changed Cam Newton's drop-back in the pocket and gave right tackle Mike Remmers some help to combat Miller. The result was a more competitive battle in which the Panthers led by double digits at halftime. And yet, they still lost. The difference, once again, was Denver's defense. The Broncos' stop unit didn't fare all that well in the first half, but Wade Phillips made some tremendous adjustments at intermission. Following halftime, the Panthers gained just 123 net yards (210 beforehand), and Newton went just 7-of-16 for 83 yards and an interception in the final two quarters. He took some crushing hits. On one instance, he was down for a while on the sideline and appeared to be injured. On another, it seemed like he sustained a concussion, and Derek Anderson even began warming up. Newton stayed on the field, however, and even had the Panthers in a position to kick the game-winning field goal, but Graham Gano went wide left from 50 yards. ",
            "2": "The big story to come out of this game will be Trevor Siemian, who was not intimidated whatsoever to be going up against Luke Kuechly and Carolina's Super Bowl defense despite never attempting a pass in the regular season before. Siemian was very competent, making smart decisions (for the most part) and tossing precise passes, all while mixing in timely runs. He kind of looked like Alex Smith, if I had to make a comparison. Granted, he was battling a secondary that really looks like it's missing Josh Norman, but Siemian still had to deal with Kuechly, Thomas Davis, Kawann Short and the rest of Carolina's prolific front seven. Siemian finished 18-of-26 for 178 yards, one touchdown and two interceptions, and he also jogged for 20 rushing yards on five carries. Both picks occurred inside the Carolina 30-yard line - two of Denver's three give-aways took place there - as one was tipped at the line of scrimmage, while the other one transpired as Siemian was under pressure and threw off his back foot. I won't blame Siemian for the first pick, but the second one was inexcusable. That was three easy points off the board, which would've made a huge difference had Gano nailed that field goal. Siemian also got lucky on one occasion, when he had an open Virgil Green in the end zone, but underthrew him with a pass that was nearly picked off. It's too bad that Siemian is just a bridge to Paxton Lynch, because I think there's something there. Siemian is a smart, gritty quarterback who, at the very least, proved that he can be a viable backup quarterback in this league. ",
            "3": "C.J. Anderson looked like Denver's best offensive player at times. He ran extremely well with great power and burst, gaining 92 yards and a touchdown on 20 carries. He also caught four passes for 47 receiving yards and a second score. Anderson has gotten off to slow starts the past two years, thanks in part to conditioning, but he appears to be in terrific shape right now. ",
            "4": "Siemian connected with Emmanuel Sanders and Demaryius Thomas a total of nine times, as both wideouts posted meager numbers, 5-49 and 4-48, respectively. Thomas dropped a pass inside the 5-yard line that was nearly picked on a deflection. ",
            "5": "Going back to the Panthers, Newton's overall numbers were 18-of-33 for 194 yards, one touchdown and an interception that was the result of Chris Harris catching a tip pass on a diving attempt. That, combined with a personal foul penalty, allowed the Broncos to score the go-ahead touchdown. Newton also ran 11 times for 54 yards and an additional score. Newton played extremely well in the first half, but as mentioned, the Broncos made some excellent adjustments at halftime and roughed him up in the final 30 minutes. Given how horribly Carolina's 2-minute offense was at the end of the game - the team took its time and wasted a timeout - it wouldn't shock me at all if Newton were truly concussed at the very end. Fortunately for him, he gets 10 days to bounce back before battling the horrible 49ers. Oh, and speaking of Newton, he revealed his new celebration dance. He's no longer dabbing, which was sooo 2015. He's now doing the floss: "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "34"
        },
        "comments": {
            "amount": "7",
            "1": "The Raiders came into this season with enormously high expectations - not anything like they've had in more than a decade. I was worried that as a young team, they could choke under such great pressure. It appeared as though they would, as they were down 24-10 at one point, but they rallied back and scored a touchdown that would seemingly tie the game. Jack Del Rio made a bold decision, however, and opted to go for the two-point conversion. Derek Carr connected with Michael Crabtree for the game-winning score, prompting the announcers to dub Del Rio Black Jack. Though Oakland prevailed, there were some concerning things about its offense. That might seem like a strange thing to say, given that Derek Carr went 24-of-38 for 319 yards and a touchdown, but keep in mind that the Saints quite possibly might have the worst defense in the NFL and sustained an injury to its top cornerback, Delvin Breaux, in this contest. Things won't be as easy against better opponents, and Carr and the rest of the offense need to clean up some of their mistakes. For instance, there were some drops, including one from Seth Roberts inside the New Orleans 5-yard line. Carr, meanwhile, had some poor throws. One was off his back foot on a third down despite having a clean pocket. He also led Clive Walford out of bounds in the red zone and then floated a high pass out of play on a fourth down that seemingly ended the game, but he was bailed out by a horrible pass interference call; the pass should've been deemed uncatchable. Again, I don't want to sound overly negative because the Raiders made a great comeback and ultimately prevailed, but they were fortunate because of both the officiating and the opposition. If they want to make a playoff run - and they certainly have the talent to do so - they need to clean up their mistakes because they'll be penalized versus tougher foes. Something that would also help would be getting their right tackle situation shored up. It was fine heading into the game, but Menelik Watson and his backup both got hurt. To compensate for this, the Raiders moved Donald Penn to right tackle, sliding guard Kelechi Osemele to the blind side. Meanwhile, on defense, cornerback Sean Smith wishes he sustained an injury, so that he could at least have an excuse for being torched so brutally. Smith was ultimately benched. ",
            "2": "Roberts scored Carr's lone touchdown, which happened to put Crabtree in position to secure the two-pointer. Crabtree caught seven passes for 87 yards. His two blemishes were a dropped pass and a horrible call on an unsportsmanlike penalty for celebrating too much after giving the Raiders the decisive score. Crabtree did throw the ball up into the air, but the officials need to calm the hell down. Players can't be mindless automatons, so they're going to celebrate after a game-winning play. As for Amari Cooper, he logged six catches for 137 yards. He appeared to drop a pass in the early going, though it was ruled a fumble out of bounds. Cooper did most of his damage with two catches for 69 yards on a single drive, ultimately leading to a Latavius Murray touchdown. ",
            "3": "Speaking of Murray, he gained 59 yards and that touchdown on 14 carries. However, the CBS announcers remarked that the Raiders' offense just looked faster when DeAndre Washington (5-14) and Jalen Richard (3-84, TD) were on the field. Richard scored on a 75-yard burst in which the Saints displayed some of the worst tackling you'll ever see. ",
            "4": "The Raiders also have to be worried about their defense. Sure, they were going up against Drew Brees, but they didn't pressure him very much despite New Orleans possessing a poor offensive line. Brees tore up Sean Smith and the rest of Oakland's secondary as a result, going 28-of-42 for 423 yards and four touchdowns. He looked like vintage Brees, as he nearly put the Saints in position for the game-winning field goal. Unfortunately for the Saints, Brees ran out of time, and New Orleans had to attempt a 61-yard field goal, which drifted wide left. ",
            "5": "It was no surprise who Brees' two primary receivers were. Brandin Cooks found the end zone twice, catching six passes for 143 yards. One of the touchdowns was a 98-yarder. However, Willie Snead actually led the team in receiving, snatching all nine of his targets for 172 yards and a touchdown. He made some ridiculous catches in this game, and it's fair to wonder if he's one of the most underrated players in the NFL. People attribute Snead's production to Brees, but some of his receptions in this contest were pretty amazing. ",
            "6": "The Saints didn't try to establish the run all that much, as Mark Ingram was given 12 carries, which he turned into 58 yards. He also caught two balls for 29 receiving yards. ",
            "7": "Rookie Michael Thomas made an impact in this game, logging six receptions for 58 yards. He was also Johnny on the spot, picking up a fumble in the fourth quarter and running it inside the Oakland 5-yard line. He has some fantasy potential, but doesn't appear as though he'll be leaping Snead anytime soon. He could be a high-end WR3 if either Cooks or Snead gets hurt. Oh, and by the way, Coby Fleener had one catch for six yards. He's droppable. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "All eyes were on Carson Wentz in this matchup, a quarterback the Browns could've selected with the No. 2 overall pick in the 2016 NFL Draft. Though Cleveland obtained numerous picks in the trade, they came out of this game looking pretty foolish that they didn't just take Wentz. Wentz had a terrific debut, albeit with a caveat. He went 22-of-37 for 278 yards and two touchdowns, and he could've posted an even better stat line had he not endured four drops. Wentz's ball placement downfield was very impressive, as most of his longer throws were right on the money. He even showed some great pocket presence, drawing a player offside on his opening drive with his cadence. The caveat, however, is that he was battling the Browns, who are absolutely dreadful. They have one of the worst defenses in the NFL, and they have zero pass rush to speak of. Wentz, consequently, had all day to throw. He was guilty of holding the ball too long in the pocket on occasion, so I'm interested to see if this will become a problem against teams that are better at generating pressure on the quarterback. It was a problem once in this game, as a sack he took resulted in a missed, longer field goal. ",
            "2": "Wentz's two touchdowns went to his primary receivers. Jordan Matthews got off to a rough start with a drop on the opening possession, but went on to haul in seven of his 14 targets for 114 yards and a score. Matthews made up for his error almost immediately, making a great catch on the same drive. Agholor, meanwhile, snatched four balls for 57 yards and his touchdown. I still wouldn't trust Agholor, who will need to prove himself against legitimate NFL teams. ",
            "3": "If Wentz goes on to become a Hall of Famer or something, the answer to the trivia question as to who caught his first pass will be Zach Ertz. The skilled tight end made a great one-handed grab on the play, and he ended up finishing with six catches for 58 yards. ",
            "4": "Ryan Mathews carried most of the workload, but he gained just 77 yards on 22 carries. He did score a garbage-time touchdown, however, helping his fantasy owners. ",
            "5": "Two other Eagles of note: Dorial Green-Beckham made a brief appearance, catching two passes for 14 yards. Darren Sproles, meanwhile, didn't do much besides screw up, dropping two passes and losing a fumble in the process. ",
            "6": "As for the sorry Browns, their quarterback failed to complete half of his passes, as Robert Griffin went 12-of-26 for 190 yards and a touchdown. The thing is, Griffin wasn't even battling a defense that gave him much of an issue in terms of a pass rush. I actually thought the Eagles would get to him frequently, but that wasn't the case. Griffin did scramble for 37 rushing yards, but he was largely ineffective. Making matters worse, he sprained his left shoulder when he crashed into Jalen Mills instead of opting to slide. His availability for next week is unknown at this moment, but Josh McCown is probably the better option anyway. It didn't help Griffin that his so-called top weapon dropped two passes. That would be Gary Barnidge, whose performance in this contest made 2015 look like a mirage. Barnidge didn't log a single reception. ",
            "7": "Only two Cleveland players caught more than two passes, and none had greater than three. The leaders in that department were Duke Johnson (3-28) and Terrelle Pryor (3-68), who will need better performances if he's going to reach Charles Woodson's predicted 1,800-yard season. Corey Coleman, meanwhile, made a 58-yard reception, which was just one of two catches. He finished with two grabs for 69 yards, and he dropped a pass. ",
            "8": "Down throughout the game, the Browns didn't have much of a chance to establish the run. Isaiah Crowell still managed to score though, finishing with 62 yards on 12 carries. ",
            "9": "Though Cleveland's offensive line held up for the most part, there was still an issue with Cameron Erving, whose errant snap resulted in a safety. The Browns are going to miss Alex Mack, but Ervin's presence will at least ensure a top selection in the draft (check out my 2017 NFL Mock Draft here.) It'll also help if Joe Haden is hurt; he re-injured the same ankle he had surgically repaired this offseason. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Vikings may have won this game, but they seriously need to think about starting Sam Bradford. Shaun Hill was very ineffective in this contest, as he would've had major problems dealing with a real defense. Hill finished 18-of-33 for 236 yards, as he only did enough to keep the Vikings from losing this game. Some may look at Minnesota's point total of 25, but the defense had 13 on two return touchdowns (one missed extra point). All Hill could do was dink and dunk, which is highly discouraging, considering that the Titans have one of the worst secondaries in the NFL. The opportunities were definitely there for Hill. On one occasion, he had Stefon Diggs open for a touchdown, but completely missed him. It's hard to trust Bradford because of his durability concerns, but he's the better option when healthy, and it's not even close. ",
            "2": "Bradford providing some sort of threat downfield would open things up for Adrian Peterson, who was bottled up for 31 yards on 19 carries. Peterson had absolutely no running room, as the Titans stacked the line of scrimmage, daring Hill to throw. Hill did throw, 33 times, but couldn't sustain drives. Bradford needs to play. ",
            "3": "Despite Hill's ineptitude, Stefon Diggs had a big game. He caught seven passes for 103 yards, as the FOX announcers marveled at his incredible hands. Diggs was just one of three Vikings to catch multiple passes. The others were Kyle Rudolph (4-65) and Adam Thielen (4-54). Laquon Treadwell wasn't targeted at all, and I don't recall even seeing him on the field. Considering how bad Charles Johnson was, however, Treadwell could be a bigger part of the offense sometime soon. ",
            "4": "Before moving on to the other side of the ball, something needs to be done about Blair Walsh, who missed a chip-shot field goal and an extra point. He did manage to drill a 50-yarder, but the close misses are inexcusable. ",
            "5": "As mentioned, the story of this game was Minnesota's defense. The Vikings had some issues with Marcus Mariota in the first half, but made the appropriate adjustments at intermission and limited him to 12-of-20, 125 yards, one touchdown, an interception and a fumble after the break. Mariota looked great early on, as he appeared to be on his way to a big afternoon after going 13-of-21 for 146 yards and a touchdown in the opening half. He even nearly threw a second score, but Andre Johnson dropped the ball in the end zone. He and Tajae Sharpe were really clicking, but the Vikings finally got to Mariota later in the game. Mariota was guilty of holding on to the ball on some occasions, and then he fired a pick-six when Everson Griffen was in his face. This prompted Mariota to throw off his back foot, and Eric Kendricks ran back 77 yards for a touchdown. Later, a miscommunication between Mariota and his running back led to a fumble, which was returned for six as well. Mariota ended up finishing 25-of-41 for 271 yards, two touchdowns and an interception - not bad, considering he was battling one of the top defenses in the NFL. Both of his scores were thrown to DeMarco Murray, who caught five balls for 35 receiving yards. He also rushed for 42 yards on 13 carries. More importantly, he had way more touches than Derrick Henry, who mustered only three yards on five attempts. Henry did have a 29-yard reception, but he didn't do much otherwise. ",
            "6": "It's clear that Sharpe is Tennessee's No. 1 receiver. Sharpe caught seven of his 11 targets for 76 yards. He'll be in for even better days against worse defenses. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "I suppose it's a good thing the Chargers don't have many fans because it's not a good day to be one. San Diego, in one single afternoon, lost a big lead, lost a game, and lost one of its best players. The Chargers maintained a 24-3 advantage in this divisional rivalry, but saw Keenan Allen suffer a knee injury on a non-contact play. This was obviously a dubious sign, and it got worse when the cart came out. A tearful Allen was driven into the locker room, and it was later reported that the Chargers believe that their stud offensive weapon has sustained a torn ACL. If true, this is a horrible blow for both Allen and the Chargers. Allen missed the second half of last year with a lacerated kidney, and he worked so hard to get back into shape. He was terrific, catching six passes for 63 yards in a single half of action. That's likely all he'll do this season, however, and it's quite apparent that the Chargers will have trouble moving the ball without him. They accumulated just 179 net yards in the second half, and didn't seem to have a prayer of achieving a first down in the fourth quarter when the Chiefs were mounting their ferocious comeback. The Chiefs were terrific in the second half, generating 308 net yards of offense (105 in the first half). Prior to intermission, the first-team unit looked lost. One drive even featured two sacks and one false start - Corey Liuget had an amazing game - prompting the crowd to boo heavily. They were also guilty of two turnovers in the opening half, though one was nullified by a defensive hold. They couldn't keep Philip Rivers off the field, as their pass rush was absent without Justin Houston. Alex Smith, however, made some incredible throws during the comeback and overtime after misfiring often early, converting some key third and fourth downs. Smith finished 34-of-48 for 363 yards, two touchdowns and an interception. ",
            "2": "While Smith will get all the acclaim, Kansas City's best offensive player was Spencer Ware. Yes, Spencer Ware! Replacing the injured Jamaal Charles, Ware was amazing. He rushed for 70 yards and a touchdown on only 11 carries, but what he did in the passing game provided much more of an impact. He caught seven passes for a whopping 129 receiving yards. Ware was like a bull, seemingly impossible to bring down. He's going to be a big producer this year, perhaps even when Charles is healthy enough to play. ",
            "3": "As for Smith's downfield options, Travis Kelce logged six catches for 74 yards, including a big fourth-down conversion in the final quarter. Jeremy Maclin, meanwhile, hauled in five balls for 63 yards and a score. Maclin took a crushing helmet-to-helmet hit at the end of regulation and had trouble getting up afterward, but was able to re-take the field after being cleared for a concussion. ",
            "4": "Going back to the Chargers, Rivers' stat lines were significantly different pre- and post-Allen. Rivers, in the first half, was 16-of-20 for 151 yards and a touchdown. He was unstoppable, as he had all the time in the world. Without Allen, however, he was 9-of-16 for 82 yards. Considering this dichotomy, it's fair to say that San Diego would've held on for the victory had Allen remained on the field. ",
            "5": "With Allen presumably done for the season, Rivers will target Travis Benjamin and Danny Woodhead more frequently. Benjamin caught seven passes, but for only 32 yards. Woodhead, meanwhile, logged five catches for 31 yards and a touchdown. He also rushed for 89 yards on 16 carries. ",
            "6": "While Woodhead ran well, it's fair to criticize Mike McCoy for only feeding the ball to Melvin Gordon six times in the second half with a big lead. It's not like Gordon struggled earlier; he had 57 yards and two touchdowns on 14 carries. Gordon looked great and should've been more involved on offense, especially with Allen out. This, by the way, wasn't the only time McCoy screwed up, as his offense had to burn a whopping four timeouts in this contest because they couldn't line up properly. That's absolutely ridiculous. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "If you're surprised that the Buccaneers pulled the upset and utterly shocked that they led the Falcons by 18 at one point, don't be. This Tampa team is for real. I spent time writing on my NFL Picks page, discussing how underrated they are. The Buccaneers outgained their opponents in terms of yards per play in 13 of 16 games last year, but had some horrible luck. If this game is any indication, their fortunes appear to be changing. Jameis Winston put together an incredible performance. Sure, he shredded one of the worst defenses in the NFL, but he was nearly flawless after a slow start. Winston made an early interception that appeared to be no one in particular - I'm still trying to figure out what happened - but the Falcons had no answer for him after that. Winston misfired on just three occasions following intermission. Winston finished 23-of-33 for 281 yards, four touchdowns and the aforementioned interception. That doesn't even include a 25-yard pass interference that Austin Seferian-Jenkins drew in the early going, so Winston's stat line could've looked even better. ",
            "2": "Winston spread the ball around, as five players caught three passes or more. No player had more than 34 receiving yards, save for Mike Evans, who made five grabs for 99 yards and a touchdown in which he got behind both Robert Alford and the safety for the 45-yard grab. Winston's other scores went to Charles Sims (3-32), Brandon Myers (1-4) and Seferian-Jenkins (1-30). Of those, Sims' touchdown is most noteworthy, as his score was a heroic effort right before halftime in which he broke numerous tackles. ",
            "3": "Sims saw only four carries, however, as Doug Martin handled the majority of the workload. Martin gained 62 yards on 18 carries and also caught all five of his targets for 34 receiving yards. ",
            "4": "As for the Falcons, it was the same, old story. They moved the chains well in between the 20s, but failed in the red zone - a problem that has been consistent for them ever since Tony Gonzalez retired. They drafted Austin Hooper in the third round this past April to perhaps solve the problem, but Hooper ironically committed a false start at the Tampa Bay 1-yard line in the first half. He made just one catch for 14 yards. ",
            "5": "Matt Ryan went 27-of-39 for 334 yards and two touchdowns. That's an impressive stat line, but Ryan definitely wasn't as good as those numbers indicate. As mentioned, he struggled in the red zone, and a bulk of his yardage came in garbage time. The Buccaneers were leading 31-13 at one point and were more than willing to give Ryan as many undernearth throws as he desired. ",
            "6": "Ryan's longest completion was to Mohamed Sanu, who hauled in a 59-yarder. However, this reception came in a busted coverage, as there was no one around Sanu. The former Bengal caught five balls for 80 yards and a touchdown, but his stat line would've been 4-21 had Tampa's defense not had a brain fart. Sanu also dropped a pass, so I wasn't overly impressed. I wouldn't rush to add him in fantasy if he's available, especially in the wake of reports that he was limping around afterward. ",
            "7": "As for the big name, Julio Jones caught four passes for 66 yards and a touchdown. Most of his production came after intermission, however, as he managed just one reception prior to the break. ",
            "8": "Remember how I said the Buccaneers were willing to give everything underneath to Ryan? Well, that would explain why Tevin Coleman led the team in receiving yardage, as he caught five balls for 95 yards. This included a terrific, one-handed grab made behind him. He also rushed for 22 yards on eight attempts, beating Devontae Freeman, who mustered only 20 yards on 11 tries. Freeman struggled at the end of last year, and it appears as though he's picking up where he left off. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Packers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Jaguars lost another game, but I'll say this: They don't look like the same pushover. I consider the Packers to be the best team in the NFL, and the fact that Jacksonville was able to fight tooth and nail with them says a lot. The Packers, however, are the team going places, and Aaron Rodgers, following a slow start, moved the offense very well in extremely hot and humid conditions. Rodgers went 20-of-34 for 199 yards and two touchdowns. Those aren't the best stats, but Prince Amukamara, one of the new Jaguars, made some tremendous pass break-ups. Jared Cook also drew a 30-yard pass interference. Plus, it's not like Rodgers disappointed his fantasy owners, given that he ran in a third touchdown. Rodgers absolutely sucked the life out of the Jaguars in the second half. He orchestrated a drive that lasted more than nine minutes. It culminated in a field goal, but don't blame Rodgers for that, as the Packers oddly opted to run the ball three times in a goal-to-go situation. I think it's foolish not to have Rodgers throw the ball at least once, given that he's arguably the best quarterback in the NFL. ",
            "2": "Rodgers' two touchdowns were thrown to Jordy Nelson (6-32) and Davante Adams (3-50). The plan was for Nelson to see limited snaps in this game, but he ended up leading the team with nine targets. Adams, meanwhile, made a terrific grab in the end zone, drawing pass interference in the process on a pass in which Rodgers was drilled upon release. As for Randall Cobb, the good news was that he caught six passes. The bad news is that he managed just 57 yards. The worst news is that Cobb appeared to sustain a foot injury in the second half. He remained on the field, but was gimpy for the rest of the afternoon. ",
            "3": "Eddie Lacy didn't have an impressive showing in his 2016 debut. He gobbled up 61 yards on 14 carries, but most of it came on a spicy 28-yard burst in which new Jaguar Tashaun Gipson took a horrible angle, leaving Jaguar fans starved for better safety play. Otherwise, Lacy mustered only 33 yards on 13 attempts ... and yet the Packers fed him in the red zone, only to see him stuffed? I would've gone in a different direction, but maybe I just have a bad taste of play-calling. ",
            "4": "OK, enough with the food references. Let's discuss the Jaguars, who nearly won this game, and perhaps would've prevailed had they not burned all three of their timeouts in the first 22 minutes of the second half. They almost got there though, albeit with the help of some horrible officiating, as one seemingly corrupt ref threw a flag way late on a play that should've ended the game. Fortunately for the Packers, it didn't end up mattering, but it was still a strange call. Attacking Quinten Rollins mercilessly, Blake Bortles went 24-of-39 for 320 yards, one touchdown and an interception, which was thrown early and was tipped into the air a bunch of times. Bortles should've had a better stat line, but Allen Robinson mysteriously wasn't getting any calls. Robinson was seemingly interfered with on numerous occasions, yet no flags were thrown. Also, it's worth noting that Bortles' pass protection wasn't very good, as Clay Matthews terrorized him all afternoon. ",
            "5": "Despite getting absolutely no help from the officials, Robinson still led the Jaguars in receiving yardage, catching six passes for 72. He'll have much better performances going forward unless there's a league-wide conspiracy against him. The same can be said for Allen Hurns (4-75), who didn't get the benefit of garbage-time yardage. Julius Thomas, meanwhile, made five grabs for 64 yards and a touchdown. ",
            "6": "Chris Ivory didn't play, allowing T.J. Yeldon to handle the majority of the workload. Yeldon managed only 39 yards on 21 carries versus a stout Green Bay front, though he did score a touchdown in the process. Yeldon was more effective as a receiver out of the backfield, catching four balls for 30 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Texans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "11",
            "1": "EDITOR'S NOTE: I was praying for the Bears to get a back-door cover, but their offense was hot garbage in the second half. Of course, it didn't help that John Fox had an insanely dumb challenge on a Will Fuller catch, wasting a timeout. Not that it mattered, but the horrible decision-making was so offensive that I'm going to attribute this loss to that. ",
            "2": "The Texans transformed their offense this offseason by signing Brock Osweiler at quarterback and Lamar Miller at running back, and drafting Will Fuller in the first round. Those three players came up huge for Houston's offense to lead the team to the victory. Bears quarterback Jay Cutler played really well in the first half, but the Texans' defense dominated the final two quarters and battered Cutler with a serious pass rush to shut out Chicago after intermission. ",
            "3": "Osweiler had a good first drive going to open the game, but in Chicago territory, Tracy Porter out-fought DeAndre Hopkins for a 50-50 pass and came away with an interception. Jay Cutler took advantage and started moving the ball down the field, including an excellent catch by Alshon Jeffery. To end the drive, Jeremy Langford plunged into the end zone from a yard out and gave the Bears a quick 7-0 lead. Chicago's defense quickly got off the field and Eddie Royal had a 31-yard punt return to the Texans' 40-yard line, but the Texans stopped the Bears on fourth-and-1 to get the ball back. Houston was able to get a field goal drive thanks to Miller's running. The Texans took the lead with a 23-yard touchdown to Hopkins as, once again, he made a phenomenal contested catch. At the end of the second quarter, Will Fuller dropped what would have been an 83-yard touchdown, and the Bears responded by hitting Jeffery for a 54-yard gain. With only a play before having to settle a field goal, Cutler threw a perfect strike to Royal for a 19-yard touchdown after he worked over Kareem Jackson. That gave the Bears a 14-10 halftime lead. At the start of the third quarter, Kevin White ran the wrong route, and that let Andre Hal pick off a pass to set up the Texans in Chicago territory. Houston had to settle for a field goal. Late in the third quarter, Fuller caught a 27-yard pass to get into Bears territory. He finished the drive by making a shoestring catch on a wide receiver screen before using his speed to dart down the field for an 18-yard touchdown. Shortly later on a third down, Fuller made a superb leaping grab of about 30 yards and set up a short field goal for Nick Novak. Houston's defense then slammed the door for the win. ",
            "4": "Brock Osweiler completed 22-of-35 for 231 yards with two touchdowns and an interception. He threw the ball better than the numbers illustrate, and he easily could have had a couple more touchdown passes. ",
            "5": "Lamar Miller ran for 106 yards on 28 carries with four receptions for 11 yards. ",
            "6": "DeAndre Hopkins had five catches for 54 yards with a score. Will Fuller (5-107-1) had a great debut aside from his drop. Chicago's corners couldn't run with Fuller, especially in the second half. Osweiler targeted Fuller heavily, at times more than Hopkins, and if you need a wideout for your fantasy team, Fuller could be an adept pickup. ",
            "7": "Jay Cutler was 16-of-29 for 216 yards with one touchdown and one interception. He played better than the numbers illustrate as well. The Bears' offensive tackles got whipped in the second half. ",
            "8": "Jeremy Langford ran for 57 yards on 17 carries, but bailed out his fantasy owners with a score. ",
            "9": "Alshon Jeffery had four catches for 105 yards. Eddie Royal (4-57-1) chipped well in the first half, and Kevin White (3-34) flashed at times. ",
            "10": "Chicago's front seven played well overall, but the secondary struggled. Leonard Floyd notched a sack in his first NFL game. Akiem Hicks had a forced fumble. Jerrell Freeman (17 tackles) and Danny Trevathan (11 tackles, 1 sack) both played well in their debuts for Chicago. ",
            "11": "Defensively for Houston, Whitney Mercilus had two sacks and a forced fumble. J.J. Watt was not his normal self, but he had a near sack late in the fourth quarter. Jadeveon Clowney was active and played well. Brian Cushing left the game at the beginning of the first quarter with a torn MCL. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "22"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: I was shocked this spread dropped to pick, but I'm happy I jumped on Cincinnati for a unit. It was a true toss-up though. The Jets played well, but their season is officially over, given that Trent Dilfer called this a must win. ",
            "2": "The largest lead in this game came in the first quarter when Ryan Fitzpatrick hit Quincy Enunwa for a 3-yard touchdown to put the Jets up 7-0. That lead was the greatest by either team as it was a see-saw battle the rest of the game, with the Jets' defense getting to Andy Dalton all day. Sprinkled in between the tough Jets defense were some big splash plays from the Bengals. The biggest, and eventually most lopsided, matchup in this game was A.J. Green versus Darrelle Revis. The first big blow came in the second quarter when Andy Dalton hit Green on a deep post that he had beaten Revis on badly. He covered 54 yards on that touchdown to put the Bengals up 10-7. ",
            "3": "The Jets moved the ball with Matt Forte as the primary back, and he was extremely consistent, gaining 96 yards on 22 carries, while adding 59 more yards on five catches. On those 27 touches, he put together eight first downs. It is a large workload for the 30-year-old back, but he out-touched Bilal Powell by 21 and appears to be the true lead back. After Green's big touchdown, Fitzpatrick hit back with a 15-yard strike to Eric Decker to make it 13-10 mid-second quarter. And then, the two teams traded field goals to give the Jets a 16-13 halftime lead. ",
            "4": "Throughout the game, Dalton was getting harassed by the Jets' front seven, as they got to him a total of seven times on the day. That gave Dalton the most sacks he's ever taken in his career. And amazingly, this came without New York's suspended defensive end Sheldon Richardson. But, the pressure didn't keep Dalton from continuing to connect with A.J. Green. ",
            "5": "Ryan Fitzpatrick, on the other hand, couldn't connect on any big passes and finished with a pitiful 5.4 yards per attempt compared to Dalton's 12.2 YPA. When a quarterback is connecting on such short passes, he needs to have a high completion rate, but Fitzpatrick finished the day with just a 54.3 completion percentage compared to Dalton's 76.7. ",
            "6": "The Bengals couldn't do much on the ground against the Jets, but Jeremy Hill got into the end zone on a 12-yard touchdown run where he blew up the defense. The talk of Hill looking more explosive this season sure appeared to be true on that touchdown run, which put the Bengals up 20-16 in the third quarter. After Hill's touchdown, the Jets moved into the Bengals' territory, but settled for two field goals in the fourth quarter. Coach Todd Bowles probably got too conservative with those field goals though. But in the end, it came down to a last-minute drive that ended with a Ryan Fitzpatrick interception, which was very much on him. In the end, the Bengals just had the better offense and were able to weather the sacks and strong run defense the Jets brought. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "7"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: It's hard to follow every game on Sunday - I rewatch them later - so I need help covering some of these. Jacob Camenker will be joining us to help out with the NFL game recaps. Jacob is a long-time site reader who has been published at Rant Sports and FanSided. I hope you enjoy his analysis! ",
            "2": "This game ended up being a big-time defensive battle. Despite both teams being slightly weaker on the defensive side than they have been in prior years, both stop units were playing at a high level. The Ravens succeeded in pulling away at the end of the game, and that was largely thanks to the efforts of Joe Flacco. Flacco was making his first start since tearing his ACL midway through the 2015 season, and he looked very solid considering the circumstances. Flacco went 23-of-34 during the contest, totaling 258 passing yards and one touchdown. He was every bit as good as those numbers indicate. He had a couple of beautiful throws, including a nice pass on the run to Kamar Aiken and a perfectly placed 27-yarder to Dennis Pitta on Baltimore's last scoring drive of the game. In addition to those passes, Flacco threw a 66-yards touchdown strike to Mike Wallace that gave the Ravens a 10-0 lead at the time. Wallace beat backup safety Duke Williams on the play, and Williams had no business being matched up on him. Wallace's final stat line may look good (3 catches, 91 yards, 1 TD) but most of that came on the score. He may be targeted a lot by Flacco, but do not expect him to put up huge numbers every week. ",
            "3": "A duo of injured players returned for the Ravens this week as well. Veteran receiver Steve Smith Sr. was coming off of an Achilles injury that prematurely ended his 2015 campaign, while tight end Dennis Pitta was starting for the first time since 2014. Smith was targeted nine times, but he only caught five of them for 19 yards. He was well covered by the elite Buffalo corners, so he will likely have bigger games in the future. Pitta looked surprisingly good, and it appears as though he is finally healthy. He caught three passes for 39 yards, including a 27-yard grab that moved the Ravens into field goal range late in the fourth quarter. Pitta could be a factor for the Ravens, and he has a lot of upside in most fantasy format. He will be at least an intriguing TE2 in most weeks. ",
            "4": "Baltimore's running backs were pretty good in this matchup. Justin Forsett had 10 carries for 41 yards and looked good when he was on the field. It makes me wonder why the Ravens cut him just a week ago. Terrance West got 12 carries and turned them into 32 yards. He had some nice bursts, and it looks like this rotation will continue to be a back-by-committee arrangement. ",
            "5": "For the Bills, their offense struggled greatly. The team only totaled 160 yards during the game, and after the first quarter, they only had a total of two yards. Though offensive coordinator Greg Roman's play calling left a lot to be desired, many of Buffalo's problems can be blamed on the performance of the offensive line. The line was simply brutal today. The left side lost tackle Cordy Glenn to an ankle injury in this contest, and the Bills had trouble replacing him. The right side, which was missing Seantrel Henderson, was beaten pretty badly on multiple occasions. Jordan Mills and John Miller could not stop Baltimore's interior rushers. Terrell Suggs and Timmy Jernigan wreaked havoc in the pocket and got many hits on Tyrod Taylor. If Taylor was less mobile, he could have been sacked five or more times. Speaking of Taylor, his debut was uninspiring at the best. He went 15-of-22 but only threw for 111 yards during the game. Though some of that was not his fault, he was not as accurate as he could have been on some of his throws. With better protection, he may have done more, but he will need to improve regardless. ",
            "6": "The real threat on offense for the Bills was LeSean McCoy. McCoy had trouble finding running lanes early, but he finished the game with a decent stat line. He ran for 58 yards on 16 carries and scored the lone touchdown for the Bills during the game. On the touchdown drive, McCoy was the catalyst. He had a few runs where he used athleticism to get to the outside and ripped off some chunks of yardage. He would have been better during the game had the offensive line not given up so much penetration to the Ravens. ",
            "7": "None of Buffalo's receivers stood out during this affair. Sammy Watkins (4-40) and Charles Clay (2-40) tied for the team lead in receiving yards, but neither played particularly well. If Taylor had more time to throw, then they may have been able to do more. ",
            "8": "On the defensive side for the Bills, Jerry Hughes had a great day. He was able to put constant pressure on Flacco and totaled two sacks on the day. Hughes looks to be poised for a monster season as the team's primary pass-rusher. ",
            "9": "A couple of notes on veterans: Reggie Bush looks done. He had three rushes for minus-4 yards and ran backward five or six yards on one of his carries. He should be cut. Mike Gillislee deserves more carries. Devin Hester also looked washed up for the Ravens. He ran backward eight yards on a punt return before being tackled at one point. He should retire. ",
            "10": "It looks like the Bills have not fixed their penalty issues from last season. The team was called for eight infractions that cost them 89 yards. One came late in the game on a field goal attempt by Justin Tucker that gave the Ravens a first down. That allowed them to run more time off of the clock. Rex Ryan needs to instill some discipline in his team, or he may be looking for a job in the near future. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Lions",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "35"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: I wrote this prior to the game ending: The Colts may have won, but I get the feeling that the Lions were the better team in this game. Andrew Luck was the best player though, and he definitely deserves major credit for leading his team back from down 21-3 and 28-18. Shame on me for doubting Matthew Stafford and his fierce finger-pointing! ",
            "2": "This game had shootout written all over it, and a missed extra point almost doomed the Lions, but Detroit had the ball last. With big-armed Matthew Stafford and a plethora of weapons, the papier mache Colts defense didn't stand a chance. Matt Prater redeemed himself, and Detroit escaped Indianapolis with a nice road victory to start the season. Indianapolis' offensive line showed some signs of improvement over last year, but the defense remains a huge liability. Andrew Luck is going to have to win shootouts on a weekly basis this season. ",
            "3": "The Lions got on the board first as Stafford led a nice drive with completions to Golden Tate (7-41) and Anquan Boldin (3-35), and there was also a great run by Ameer Abdullah. To end the drive, Theo Riddick knifed through the Colts' defense for a 21-yard touchdown as rookie left tackle Taylor Decker made an excellent block at the second level to spring Riddick downfield. After trading punts, Stafford got moving again with a 27-yard gain to Marvin Jones (4-85), a third-down conversion to Boldin, and a gain of 13 yards to Eric Ebron (5-46-1). That set up Dwayne Washington to plunge into the end zone from a yard out. Luck responded with a drive that saw him complete passes to Donte Moncrief (6-64-1) and T.Y. Hilton (6-79) to set up a 50-yard field goal from Adam Vinatieri. Stafford answered with a 32-yard pass to Jones and finished another drive with a strike to Ebron for a short touchdown reception. Ebron made a superb catch while getting hit by two defenders. Luck quickly moved the ball with a 32-yard completion to Moncrief, 14 yards to Josh Ferguson, 16 yards to Dwayne Allen, eight to Hilton, and a short touchdown strike to Moncrief. The Lions took a 21-10 lead into the half. In the third quarter, Luck got rolling with a 51-yard pass to Philip Dorsett (4-94), who beat Darius Slay for the reception. Allen (4-53-1) got open in busted coverage for a 19-yard score. Luck went back to Allen for a two-point conversion and midway through the third quarter, the Lions' lead was cut to 21-18. Stafford answered ripping the ball down the field and finished it with a short touchdown toss to Abdullah, who was left uncovered in the flat. Luck came back to produce another field-goal drive. The Lions punted the ball away, and Luck went right back to work with a 32-yard pass to Hilton to get into Detroit territory. The Lions' lead evaporated when Luck hit tight end Jack Doyle (3-35-2) for a 16-yard touchdown, and just like that, the game was tied at 28. Midway through the fourth quarter, the Lions were led into the red zone on nice gains by Riddick, Abdullah, Boldin and Ebron. A screen to Riddick hit pay dirt from 13 yards out, as Larry Warford hit the key block to spring Riddick. However, Matt Prater missed the extra point. After a few moderate gains, Luck hit Dorsett for a 33-yard gain after he beat Quandre Diggs downfield. That put the Colts in the red zone with two minutes left on the clock. With just under 40 seconds remaining, Luck connected with Doyle for a 6-yard touchdown. Vinatieri made the extra point to give the Colts a one-point lead. Stafford got the ball at the Lions' 25-yard line with 37 seconds remaining and all three timeouts. Riddick rumbled for 20 yards on the first completion. Stafford then hit Ebron for close to 10 yards and then Jones for 22 yards. That set up Prater to redeem himself with a 43-yard field goal attempt that he drilled to give the Lions the victory. A safety was tacked on during the Colts' lateral on the kickoff return as time expired. ",
            "4": "Matthew Stafford was superb, going 31-of-39 for 340 yards with three touchdowns. Indianapolis' secondary was completely helpless to stop Detroit. The Colts' defense had one sack on a play where Erik Walden beat Laken Tomlinson. Other than that, Stafford threw from a clean pocket all too often. The linebackers were incapable of defending against Detroit's running back duo and the secondary was torched. Indianapolis' defense was horrible in the season opener. ",
            "5": "Ameer Abdullah had 63 yards on 12 carries with five receptions for 57 yards and a touchdown. Theo Riddick saw seven carries for 45 yards with one touchdown rushing and five receptions for 63 yards with one touchdown receiving. This duo carved up the Colts' defense. ",
            "6": "Andrew Luck was excellent, completing 31-of-47 passes for 385 yards with four touchdowns. The Colts' much-maligned offensive line had a rough start to the game, but played well down the stretch and was very good in the second half. ",
            "7": "Frank Gore led the Colts on the ground with 59 yards on 14 carries. ",
            "8": "Detroit's defense started the game well before wilting. Kerry Hyder recorded two sacks, but the rest of the Lions' front didn't get enough pressure on Luck while the secondary allowed too many wide-open receivers. It seemed like Detroit just forgot to cover the tight ends at times. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "If this isn't the definition of a Pyrrhic victory, I don't know what is. The Seahawks may have won, but their season could be in shambles depending on how severe Russell Wilson's ankle injury is. Wilson sustained the injury in the third quarter when Ndamukong Suh inadvertently stepped on his foot. On the next play, Wilson waved the white flag, throwing the ball into the dirt. It appeared as though he might leave the game, as Trevone Boykin began warming up, but to Wilson's credit, he did not miss a single snap. He showed great toughness by remaining on the field, but wasn't nearly as effective because he lost his mobility. Wilson's elusiveness is so important to his game, especially considering the state of his offensive line. If he can't move around like he normally does, Seattle's offense is going to be severely limited. Wilson finished 27-of-43 for 258 yards, one touchdown and early interception where he threw the ball up for grabs while under pressure, giving the Dolphins a free field goal. However, he rushed for only 16 yards, and the Seahawks had trouble maintaining drives as a consequence. Wilson did manage to step up when it counted most though, leading his team to a game-winning touchdown at the end of regulation. That said, the touchdown never should've counted because the officials missed a blatant offensive pass interference in the end zone. ",
            "2": "Wilson's game-winning touchdown went to Doug Baldwin, who picked up where he left off last season; he caught nine of his 11 targets for 92 yards. Tyler Lockett was less of a factor, snatching three balls for 17 yards. He dropped a third-down conversion. ",
            "3": "Christine Michael got the start, but he and Thomas Rawls split touches almost evenly. Michael had 66 yards on 15 carries, as some of his tough runs featured broken tackles. Rawls had just 32 yards on 12 tries, but he also caught three balls for 17 receiving yards. Rawls will get more work as the season progresses, but I don't see Michael going away anytime soon. ",
            "4": "Jimmy Graham played, but didn't do anything. He took the field sparingly and saw just one target, catching it for 11 yards. Graham is going to have trouble doing much this year because no one comes back from a torn patellar tendon. I don't think he's worth owning in 12-team leagues. ",
            "5": "Moving on to the Dolphins, they definitely could've prevailed in this game. They held a 10-6 lead late in the fourth quarter, and this was despite a horrifying drop by Kenny Stills in the opening half. Stills somehow got 10 yards ahead of Earl Thomas and had a perfect, 71-yard pass from Ryan Tannehill hit him right in the hands. He inexplicably dropped it. With Wilson sustaining an injury later in the game, that touchdown could've allowed the Dolphins to take complete control of the contest. They have to be kicking themselves for Stills' incompetence. ",
            "6": "Ryan Tannehill went 16-of-29 for 186 yards, and he also rushed for 17 yards and a touchdown. He definitely did not play poorly, and had Stills hauled in the 71-yard touchdown, his passing stat line would've been 17-of-29 for 257 yards and a score. That looks much better, doesn't it? Despite the loss, the Dolphins have to feel very encouraged. Tannehill did a solid job of moving the chains against one of the best defenses in the NFL, all while playing on the road in one of the most hostile environments in the NFL. He took a couple of bad sacks because he held on to the ball too long, but it was a very positive showing overall in Adam Gase's new offense. ",
            "7": "Remarkably, only two Dolphins accumulated more than two catches: Jarvis Landry (7-59) and Arian Foster (3-62). Stills, meanwhile, caught only one of his five targets for 16 yards. The Dolphins will be looking forward to having DeVante Parker in the lineup so Tannehill doesn't have to target Stills so heavily; Stills tied Foster for second on the team with five targets, trailing Landry's 10. ",
            "8": "As for Foster, he did well as a receiver out of the backfield, but did nothing on the ground, as Seattle's stout front limited him to 38 yards on 13 carries. He was stuffed on an opening-quarter fourth-and-1 in which Kam Chancellor made the tackle, thanks in part to Landry actually pushing him into Foster. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Giants",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "The Cowboys may have lost the season opener, but they have to be feeling good about their future. Dak Prescott, making his NFL debut alongside fellow rookie Ezekiel Elliott, was very impressive. Prescott opened the game by going 6-of-7 for 49 yards on the initial drive. He moved the chains well at times and even appeared to have a touchdown to Dez Bryant, but the catch was ruled incomplete upon review because Bryant let the ball hit the ground. Prescott was only 11-of-26 in the second half, but was the victim of countless drops, as the Dallas players lost the ball in the sunlight in Jerry Jones' poorly designed stadium. Cole Beasley even mimicked Bryant, dropping a touchdown. Prescott finished 25-of-45 for 227 yards. He also rushed twice for 12 yards. Prescott's stat line would've been much better if it weren't for all of the drops, and it needs to be noted that he was battling one of the top defenses in the NFL. Despite this, Prescott nearly led the Cowboys on a game-winning drive, but Terrance Williams stupidly did not get out of bounds as the clock was ticking down. Prescott attempted to spike the ball, but ran out of time. ",
            "2": "As for his rookie teammate, Elliott didn't have as much success, mustering only 51 yards on 20 carries, though he did score once. What needs to be factored in is that Elliott was going against what could be the top run defense in the NFL. No one is going to rush the ball successfully against Snacks Harrison and Johnathan Hankins. ",
            "3": "Prescott's top target was Jason Witten, who saw 14 balls go his way. Witten snatched nine of them for 66 yards, and he would've secured a 10th if he didn't lose the ball in the sunlight. It needs to be emphasized how much of a problem this was, as the light was blinding for the Cowboys in the direction they were moving in during the fourth quarter. The Cowboys need to reconsider ever having a 4 p.m. home start time again in September and October. That, or Jerry Jones needs to throw another billion dollars into his precious monstrosity. ",
            "4": "Beasley was next on the receiving chart, catching eight passes for 65 yards. As mentioned he dropped a touchdown, much like Bryant, who hauled in only one ball for eight yards. Both had drops in the sunlight. It was embarrassing, and it epitomized Jones' ownership in the post-Jimmy Johnson era. Jones likes to think big, but doesn't take care of all the smaller, important details. ",
            "5": "OK, that was the last time I'll rip Jones, so let's just begin discussing the Giants. New York's offensive line was seen as a big problem area heading into the year, but I don't think we learned anything. The Cowboys had zero pass rush in this game, though that was to be expected because all of their key players were missing. One of the FOX announcers said it best when he noted that there were drug suspensions all over their defense. With no defenders in his face, Eli Manning went 19-of-28 for 207 yards, three touchdowns and an interception on a weird pass right to Brandon Carr. It was a nice start to his year after playing woefully in the preseason, but again, he was battling a skeleton-crew front seven, so this wasn't much of a test. ",
            "6": "Odell Beckham Jr. led the Giants in targets, which was not a surprise; he caught four of the eight balls thrown his way for 73 yards. However, he failed to find the end zone like Sterling Shepard (3-43) and Victor Cruz (4-34), who showed off his nifty salsa moves. It's tough to envision Cruz being a consistent contributor because of his durability, but anything the Giants get out of him has to be considered a bonus. ",
            "7": "The Giants were able to move the chains effectively in the second half by pounding it right at the Cowboys, who are currently extremely weak in the interior. As a result, Rashad Jennings (18-75) and Shane Vereen (6-38) both ran very well. Vereen dropped a pass, but still caught three balls for 23 receiving yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Patriots' goal heading into this year, according to many people outside of the organization, was to somehow go 2-2 in the first four games, weathering the storm until Tom Brady returned in Week 5. This would perhaps give them a decent chance at the playoffs with a strong, late push. Things looked bleak earlier in the week when Rob Gronkowski and Nate Solder were both ruled out. The Patriots were actually underdogs of 9.5 points as a result. How could they possibly defeat the mighty Cardinals, who were much more healthier? Well, after one week in which the sky was supposed to be falling, the Patriots were the only team in the AFC East to win a game. They walked right into Arizona and prevailed, thanks to a missed 47-yard field goal at the end of regulation that was the result of a bad snap. Still, Jimmy Garoppolo deserves a ton of credit. Things looked shaky to start, as he overthrew Chris Hogan on his first attempt. However, he was able cap off that drive with a perfect touch score to Hogan. Garoppolo then bookended his strong first drive with what turned out to be the decisive possession, which was highlighted by a third-and-15 conversion to Danny Amendola. Garoppolo finished 24-of-33 for 264 yards and a touchdown. He looked like Brady, firing passes quickly to his speedy slot-type receivers. Some of his out throws took a little too long to get there for my liking, which is something that future opponents might be able to take advantage of. Keep in mind that Garoppolo was battling a defense with the worst starting cornerback in the NFL in third-round rookie Brandon Williams. Arizona's defense, despite Chandler Jones' terrific debut, is not as formidable as the public believes. ",
            "2": "Garoppolo, like Brady, spread the ball around. A whopping six players saw at least four targets, with Julian Edelman (7-66) and James White (5-40) leading the way with seven balls thrown their way. Hogan also had a solid showing with three catches for 60 yards and the aforementioned score. ",
            "3": "One Patriot who proved to be a big disappointment was Martellus Bennett. Expected to be a big-time target with Gronkowski out, Bennett secured only three passes for 14 yards. The Cardinals cover tight ends well, but still, Bennett's fantasy owners have to be greatly disappointed. ",
            "4": "While White handled all the receiving duties, LeGarrette Blount punched through Arizona's front for 70 yards and a touchdown on 22 carries. Blount hurt his team by losing a fumble in the second half, but made up for it by converting a third-and-11 on the final offensive drive, thanks to a broken tackle from Patrick Peterson. ",
            "5": "One of the primary reasons I liked the Patriots in this game was Carson Palmer's uncertainty. Palmer looked horrible in the preseason, as his passes lacked zip, and he was woefully inaccurate. Palmer made some solid throws in this contest and finished 24-of-37 for 271 yards and two touchdowns. However, he was lucky to get away with numerous interceptions. I counted a whopping four passes that could've legitimately been picked off. Another issue is that Arizona's offensive line won't hold up against solid pass rushes if Evan Mathis is out. Mathis was carted off the field in the second quarter and never returned. His backup, Earl Watford, was guilty of a holding penalty that helped result in Arizona's loss, though the bad snap on the field goal was the primary culprit. ",
            "6": "Despite Palmer's decline, Larry Fitzgerald put together a monstrous performance. He accumulated eight receptions for 81 yards and two touchdowns, one of which was an amazing, diving grab. Fitzgerald has hinted that he'll retire after this season, which is a shame because it appears as though he can play very well for a long time. Elsewhere in the Arizona receiving corps, Michael Floyd hauled in three balls for 61 yards. He should've caught a fourth pass, but Palmer underthrew him. John Brown, meanwhile, caught only one pass for eight yards on four targets. With Palmer taking a step backward, Brown's production will drop. ",
            "7": "David Johnson had a terrific play in this game, a 46-yarder than featured a blinding spin move and electrifying speed. He finished with 89 yards and a touchdown on 16 carries, and he also chipped in with four catches for 43 receiving yards. He's going to have a huge year. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "When one team makes mistakes, and the other constantly takes advantage of those errors, the latter is almost always going to prevail, usually in a blowout. That's exactly what happened here, as the Steelers demolished Washington. Everything seemed to go against the Redskins throughout the evening. They moved the ball well during the entire game, but something bad always seemed to happen in Pittsburgh territory. Kirk Cousins made a horrible throw to Jamison Crowder inside the Pittsburgh 5-yard line. Matt Jones' long run was wiped out by a hold. The Redskins committed numerous false starts. Cousins fired a horrible interception when he forced a pass into coverage. I can go on and on. It was brutal for the offense, and the defense was guilty of numerous errors as well, particularly by Bashaud Breeland, who put together one of the worst performances you'll ever see from a defensive back. He was constantly torched in coverage, took bad angles and missed an open-field tackle on one of DeAngelo Williams' touchdown runs. The Redskins' coaching staff needs to be blamed as well for exposing Breeland, as they weren't smart enough to devise a scheme to allow Josh Norman to shadow Antonio Brown. The Steelers, consequently, lined up Brown away from Norman, and it wasn't even fair, as Brown treated Breeland as if he were some Pee Wee football player. That's how much of a mismatch it was. If the Redskins want to be considered a serious playoff contender, their coaching staff needs to come up with a real defensive scheme and not allow for the opponent to take advantage of them so easily. ",
            "2": "Brown ended up with eight catches for 126 yards and two touchdowns. One of the scores came on a fourth-and-1 where the ballsy Steelers allowed Ben Roethlisberger to loft a 26-yard pass to him rather than be conservative with a run or a short throw. That was part of the difference in this game. While the Redskins moved the chains effectively, but sputtered in Pittsburgh territory, the Steelers never screwed up after an early gaffe, converting two crucial fourth-and-1 tries. ",
            "3": "Roethlisberger was nearly flawless, going 27-of-37 for 300 yards, three touchdowns and an interception. The pick came early, as he had a miscommunication with new slot receiver Eli Rogers. The Redskins only got a field goal out of the turnover, as the Redskins missed one of many opportunities because of a bad Cousins pass. Roethlisberger also fumbled on the next drive, but was extremely fortunate that Ryan Kerrigan, who scooped up the loose football, fumbled it away himself. Roethisberger, however, grew stronger as the game progressed, as two of his 10 incompletions were drops by DeAngelo Williams. Roethlisberger's third score ended up going to Rogers, though the pass wasn't intended for him. The throw was heading in Sammie Coates' direction, but the pass was nearly picked. The ball deflected right into Rogers' hands. It was that sort of night for the Redskins. Rogers, by the way, six catches for 59 yards and the touchdown. He was very impressive in his debut, and I think he's worth an add in fantasy. ",
            "4": "I wondered if DeAngelo Williams would still play well, given that he's now 33. That question was quickly answered, as Williams was extremely dominant. The Redskins had absolutely no answer for him. The Steelers blew open big holes for Williams, who took advantage of it. With the running space, Williams' ability and Breeland's poor angles, the veteran back accumulated 143 yards and two touchdowns. He dropped two passes, but was great overall. ",
            "5": "A couple of other Steelers: Coates caught two passes for 56 yards, but didn't have a good game. He allowed a pass to get deflected in the end zone and dropped another pass. Jesse James logged five receptions for 31 yards, replacing Heath Miller. ",
            "6": "Going back to the Redskins, Cousins had 16 games to prove that he's worth a massive contract that the upper-echelon quarterbacks have received. Cousins did not look like he was nearly worth the money. He made several horrible throws in the first half and then forced an interception in the third quarter when the game was still close. Some of his completions were solid, but he had a poor night overall, appearing to play like the quarterback who struggled prior to 2015. Cousins went 30-of-43 for 329 hollow yards and two interceptions. ",
            "7": "Three Redskins accumulated double-digit targets: Jordan Reed (7-64), DeSean Jackson (6-102) and Jamison Crowder (6-58). Reed got banged up in the second quarter and limped off the field, but returned later. Jackson, meanwhile, looked great. He's in terrific shape and could enjoy his best season as a result. ",
            "8": "It wasn't a good start to Matt Jones' season, though it's not his fault that the Redskins could only give him seven carries. Jones tallied 24 yards in the process. He had a long gain wiped out by a hold. Making matters worse, Chris Thompson vultured a touchdown late in the fourth quarter. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "49ers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "First-overall pick Jared Goff was the No. 3 quarterback in this game, but he might be No. 1 by this upcoming Sunday in the home opener. The Rams almost don't have a choice in terms of this sort of move, given how atrocious Case Keenum was at San Francisco. Keenum put together one of the worst quarterbacking performances I've ever seen from a player named the starter at the beginning of the season. Keenum failed to complete half of his passes, going 17-of-35 for 130 yards and two interceptions. He was nearly picked off several other times, and when he wasn't throwing near the 49ers, he was tossing short passes and sailing balls out of bounds. If it weren't for Keenum completing 3-yard attempts to his teammates on third-and-9s, I would've thought Keenum was colorblind and genuinely believed that the players in red were on his squad. Keenum, quite simply, gave the Rams no chance. I can't even count how many dinks and dunks he had on third-and-medium or third-and-long situations. He barely tried to go beyond the first-down marker, and when he did, his passes were intercepted. ",
            "2": "Keenum didn't get any help from his teammates, as he's paired with receivers who are incapable of getting open. Tavon Austin, who inexplicably received a huge contract recently, couldn't do anything but catch slip screens. He caught four balls for only 13 yards, and he dropped two passes. Kenny Britt led the way with four receptions for 67 yards. Besides Britt, no Ram accumulated more than 23 receiving yards. ",
            "3": "The 49ers placed eight and nine men in the box in an attempt to stop Todd Gurley, given that they didn't respect anything Keenum could do downfield. The result was Gurley rushing for just 47 yards on 17 carries. He had absolutely zero room to do anything. ",
            "4": "Los Angeles' defense wasn't nearly as bad, but the unit still struggled at times. In fact, Aaron Donald got so frustrated that he was ejected in the fourth quarter after he shoved a player in the head and made contact with an official. Donald is officially the first player to get ejected for committing two personal foul penalties, so congratulations are in order, I suppose. The Rams couldn't stop Carlos Hyde even when Donald was on the field, as they appeared to be sleepwalking through this game, much like the Vikings did last year. Hyde gained 88 yards and two touchdowns on 23 carries. This was likely his best performance of the season, so I'd try to unload him in fantasy as soon as possible. ",
            "5": "As for Blaine Gabbert, he also had an underwhelming showing, though he was light years better than Keenum. Gabbert made a couple of solid throws, going 22-of-35 for 170 yards and a touchdown. He also managed to pick up 43 rushing yards on nine scrambles. However, as the passing yardage number indicates, Gabbert dinked and dunked more often than not. He repeatedly threw short of the line to gain on third down, though not nearly as blatantly as Keenum. Gabbert also had some bad misses, overthrowing an open Jeremy Kerley for a touchdown in the opening quarter. Gabbert nearly threw some interceptions as well, including a dropped pick-six by Alec Ogletree. A better defense will be able to take advantage of Gabbert's incompetence. I wouldn't expect Gabbert to last the entire season. Communist Kaepernick took the field late in the game to a mixture of some boos and some cheers. Red Kaep once again kneeled during the national anthem alongside his comrade, Eric Reid. ",
            "6": "Jeremy Kerley, who has been on the 49ers' roster for only a week, caught seven balls for 61 yards. It's a shame, as this was supposed to be Bruce Ellington's role. Ellington, whom I liked as a sleeper, was lost for the season. Elsewhere, Torrey Smith snatched two receptions for 13 yards. He's a waste, as he also dropped a pass. Vance McDonald (2-14) secured Gabbert's sole touchdown. ",
            "7": "Chris Berman had an interesting night as the game's play-by-play guy, to say the least. I'll have more in my NFL Power Rankings, which will be updated shortly. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "16"
}