{
    "year": "2016",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "28"
        },
        "comments": {
            "amount": "9",
            "1": "This score might make it seem like the Falcons absolutely dominated this game, but that's definitely not true. Tampa got out to a quick lead and even led 14-13 late in the second quarter when the team sustained a horrible injury. Center Joe Hawley, who had been playing on a high level this season, hurt his knee and was quickly ruled out. The Buccaneers couldn't do anything offensively after that until late in garbage time when Atlanta played a lackadaisical prevent defense. Fatigue also played a factor in Tampa's demise. Both teams came in on short rest, of course, but the Buccaneers played a grueling overtime battle, and the defense was on the field for an extended period of time against the Raiders. They committed tons of penalties in the early going and then looked completely gassed in the second half. The Falcons were able to take full advantage. That's not to take anything away from Atlanta's offense, however. Matt Ryan was terrific, misfiring on just nine occasions. He finished 25-of-34 for 344 yards and four touchdowns. One of his incompletions was a Mohamed Sanu drop. Ryan was nearly flawless in the second half; his numbers following intermission were 14-of-16 for 173 yards and three scores. Tampa's horrific secondary, which was abused by Derek Carr this past Sunday, had no chance against Ryan, especially considering how tired they were. ",
            "2": "Julio Jones caught only three passes in the first half, but he was unstoppable after intermission, finishing with eight grabs for 111 yards and a spectacular, leaping touchdown in which he was able to impressively tap his feet inbounds. Jones constantly beat the Buccaneers with in-cuts, as they just couldn't figure out how to stop it. ",
            "3": "Ryan's other three touchdowns went to Austin Hooper (3-46), Levine Toilolo and Patrick DiMarco. Sanu made up for the early drop, finishing with five receptions for 74 yards. He also drew a pass-interference call in the end zone. ",
            "4": "With Tevin Coleman out, Devonta Freeman handled most of the workload. He gained 77 yards on 17 carries, and he also caught two balls for 28 receiving yards. It wasn't the dominant performance his fantasy owners were hoping for, but the Buccaneers sell out against the run. ",
            "5": "As for Tampa Bay, Hawley wasn't the only major injury the team sustained. Jameis Winston, for some strange reason, rolled out on a two-point conversion, down 40-20 in the fourth quarter. He was absolutely crushed, twisting around awkwardly. He looked like he was in severe pain, and he was knocked out for the evening. The good news is that Winston has 10 days to recover, but I don't understand why he would be doing that in such a circumstance. Winston had a decent game for the most part, going 23-of-37 for 261 yards and three touchdowns. He was very strong in the early going, but slowed down once Hawley left the field, and understandably so, given how important the center position is. ",
            "6": "Mike Evans had a huge performance. It didn't begin well, as he dropped a pass, but he capped off the opening drive with a score. He was also guilty of two blatant offensive pass interference calls, but in between, he made a ridiculous, one-handed catch near the sideline as he was getting crushed by a defender. It was a reception that would've made Odell Beckham Jr. jealous. Evans hauled in 11 of his 17 targets for 150 yards and two touchdowns. It really helped that the Falcons lost Desmond Trufant to some sort of strange, non-contact injury in the second quarter. ",
            "7": "Winston also threw touchdowns to Adam Humphries (5-46) and Cameron Brate (5-43). He was missing his new No. 2 receiver, Russell Shepard, who replaced Vincent Jackson a couple of weeks earlier. ",
            "8": "Speaking of Tampa injuries, the top three running backs were injured, so Peyton Barner (11-31) and Antone Smith (5-25) shared the workload. Neither was particularly effective. Smith got hurt in the fourth quarter. It's unbelievable how many injuries to running backs this team has sustained. ",
            "9": "I have to comment on how much of a relief it was to not have to listen to Phil Simms on a Thursday night. It did mean enduring the insufferable Bob Costas in the pre-game, but Simms is somehow worse. Hearing Al Michaels and Cris Collinsworth was relieving, though I had to laugh whenever Michaels tried to pronounce Cecil Shorts. His best try was Sheshil Shortsh. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "I'm not sure if the Vikings thought they'd get a huge boost from the Norv Turner resignation, but I imagine they have to be disappointed by the results. They struggled to move the chains for most of the afternoon despite that Detroit, already owning one of the league's worst defenses, was missing its top cornerback, Darius Slay. Minnesota managed to move the chains effectively at the end of the game to avoid a loss in regulation, but it was too little, too late. The offense's incompetence can be assigned to numerous players. Sam Bradford, despite just misfiring nine times, made some pretty glaring mistakes. His first drive ended quickly, as he just missed his target. He later threw short of the line to gain on a third down in the red zone. He had time then to make a better decision, but toward the end of the first half, he took a sack to move his team out of field-goal range. Following intermission, Bradford missed Cordarrelle Patterson for a potential big play. Bradford finished 31-of-40 for 273 yards and a touchdown, as he threw quicker passes under new coordinator Pat Shurmur. However, this is just proof that stats can be very misleading. Bradford wasn't horrible, but he has clearly regressed since his hot start, and he needs to clean up the mistakes. ",
            "2": "Despite the small amount of incompletions, Bradford endured some drops. Stefon Diggs had a ball slip through his hands, though he later made up for it by converting a fourth-and-4 on the final drive of regulation. He had a great game overall, catching 13 balls for 80 yards. Patterson, meanwhile, was flagged for lining up incorrectly and dropped a potential game-winning touchdown near the end of regulation, though the Vikings bailed him out by scoring later on the drive. Patterson (6-45) and Adam Thielen (4-68) were right behind Diggs on the stat sheet. ",
            "3": "The Vikings didn't run the ball very well outside of a 14-yard Ronnie Hillman burst. Hillman and Jerick McKinnon actually saw the same amount of carries, though the former outgained the latter, 30-8. Matt Asiata (9-27) was stuffed on a fourth-and-1 run in the fourth quarter. ",
            "4": "Though he's not an official member of the offense, Blair Walsh deserves a major chunk of the blame. He whiffed on an extra point and a 46-yard field goal. Compare him to Matt Prater, who drilled a 58-yard kick at the end of regulation to send the game to overtime. ",
            "5": "Prater took the team to overtime, and Matthew Stafford got the Lions the victory. With the help of a pass-interference penalty, Stafford was able to engineer a game-winning drive, throwing a 28-yard pass to Golden Tate, who broke free of two tackles and tip-toed the sideline, plunging into the end zone. This prevented the Vikings from having a single possession in the extra session. Stafford had a solid game overall considering the defense he was battling, although Minnesota did lose Captain Munnerlyn to injury. He finished 23-of-36 for 219 yards, two touchdowns and an interception in which he panicked under pressure, caused by a blown protection by Theo Riddick. Stafford, however, was not penalized for the turnover because the Vikings didn't score off the give-away. ",
            "6": "Stafford endured some drops in the opening half. Anquan Boldin dropped a pass on third down, while Marvin Jones let the ball fall through his hands shortly later. Neither player did much, save for Boldin catching a touchdown. Jones logged just one reception for five yards. Tate, meanwhile, who won the game, secured 11 receptions for 79 yards. He finished behind only Eric Ebron (7-92) on the receiving list. ",
            "7": "Riddick and Dwayne Washington shared the workload. Riddick gained 70 yards on 14 carries, most of which came on a 42-yard burst on a draw. It was yet another instance in which the Vikings surrendered a long gain on a run. Washington, meanwhile, ran very hard, though the stats don't show it. Washington mustered 26 yards on 10 carries. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Dolphins, at 1-4, were considered by many to be the worst team in the NFL. Ever since they've gotten all of their offensive linemen back into the lineup, however, they've been on a tear. They've achieved three consecutive victories and have now rebounded to 4-4. The healthy trio of Branden Albert, Mike Pouncey and Laremy Tunsil have paved the way for Jay Ajayi, who has gotten all of the acclaim. Ajayi didn't quite generate 200 rushing yards for the third consecutive game, but he did break the century mark, which was considered a daunting task considering that New York has a stout run defense. Ajayi actually didn't do much early - he gained 26 yards in the opening half - but Miami's offensive line wore down the Jets' defensive front late in the afternoon. The New York linemen looked completely gassed even though Muhammad Wilkerson and Sheldon Richardson had the entire first quarter off as a result of a strange coaching decision by Todd Bowles. Ajayi finished with 111 yards and a touchdown on 24 carries. He picked up consecutive 12-yard bursts in the fourth quarter, as the Jets, as previously mentioned, were wearing down. ",
            "2": "As for Ryan Tannehill, well, there's good news and bad news. The good news is that Tannehill wasn't guilty of a turnover. He also did a good job of moving the chains at times, especially in the first half, when he was 11-of-13 for 98 yards and a touchdown. The bad news is that Tannehill nearly had a meltdown following intermission. His stat line in the second half was hideous: 6-of-15, 51 yards. He also was nearly responsible for a potential pick-six that was dropped in the red zone. Tannehill refused to challenge Darrelle Revis deep, and he was extremely fortunate that he was bailed out by a Kenyan Drake kickoff return, which was the result of the Jets foolishly being offside on a kickoff. Had Drake not scored, Tannehill would've been asked to drive down the field with a 23-20 deficit, and based on how he was perfoming in the second half, I don't think he could've done that. ",
            "3": "Tannehill's sole touchdown went to some tight end named Dominique Jones, who sadly happened to be the team's leader in receiving yardage (3-42). Jarvis Landry was next with three grabs for 33 yards, and he just missed out on a score as he was tackled at the 1-yard line. DeVante Parker (2-8) barely did anything. ",
            "4": "The Jets, meanwhile, seemed like they would win this game. With Tannehill sputtering, they took advantage of a dropped punt, and Ryan Fitzpatrick fired a touchdown to take the lead. As mentioned, however, a penalty allowed Miami to score on a decisive kickoff return. It wasn't the first time that the Jets were guilty of a costly penalty, as it was actually a problem all afternoon. For example, Buster Skrine and Calvin Pryor were flagged for consecutive personal fouls on a first-half drive, which ultimately led to Ajayi's touchdown. Sheldon Richardson was called for unnecessary roughness on Miami's next drive. Fitzpatrick, meanwhile, was responsible for his own blunders. He missed Brandon Marshall for a touchdown on a slant on the first possession. He was later strip-sacked deep in his own territory, but was lucky that a teammate was in the area to recover the potential turnover. Fitzpatrick at least didn't throw an interception in the opening half, but was guilty of two following intermission. The first occurred when he didn't see Jordan Phillips dropping into coverage. The second was more egregious. Fitzpatrick lofted a pass into the end zone despite there being nothing but multiple Dolphins in the area. It was so utterly careless that if you didn't know any better, you'd think Fitzpatrick had an IQ of zero. He made up for it with the aforementioned touchdown, but his mistakes were definitely one of the reasons the Jets lost yet again. Fitzpatrick finished 17-of-28 for 193 yards, one score and the two picks. He missed one drive with an apparent concussion, but was cleared rather quickly. Bryce Petty threw two passes in his absence, completing both short tosses to his running backs for 19 yards. ",
            "5": "Fitzpatrick's leading receiver wasn't Brandon Marshall; Jalin Marshall caught three passes for 59 yards and what appeared to be a game-winning touchdown. Brandon Marshall, meanwhile, snatched six balls for 45 yards, which included an amazing, one-handed grab for 13 yards. The veteran Marshall, as mentioned, should've scored, but Fitzpatrick missed him. Marshall had an ugly afternoon, yelling at Fitzpatrick on the sideline, and he was heard shouting, Get me the f***ing ball! It's easy to see why Marshall has never been on a team that has reached the playoffs. ",
            "6": "Matt Forte was the clear MVP for the Jets' offense. Forte gained 92 yards and a touchdown on just 12 carries. Considering that the Jets never trailed by more than seven points, questions need to be asked about why Forte didn't get more touches. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Giants",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Carson Wentz had everyone ranting and raving about his poise despite being a rookie, as he avoided throwing an interception in nearly his first four full career games. Wentz did a great job of avoiding mistakes earlier this season, but has gotten worse in that regard as of late. That proved to be the case at the beginning of this contest, as Wentz put his team in an early hole with two interceptions. Both throws were ridiculously high; the first occurred while Wentz was rolling right, while the second came on a pass that was nowhere near his target. Both turnovers immediately led to touchdowns for the Giants. Odell Beckham Jr. caught the first, thanks to a poor angle by Rodney McLeod, while the second happened as Eli Manning found a wide-open Roger Lewis, thanks to a blown coverage by Jaylen Watkins, who was later flagged for an unnecessary roughness penalty. Wentz settled down afterward, though he struggled in the red zone and had some issues with his accuracy. However, Doug Pederson picked up the slack in terms of crushing his own team with mistakes. Pederson went for it twice on fourth-and-short in the opening half. I didn't think the decisions were bad, but the play calls were abysmal. The first had Wentz rolling left, which the Giants read easily, smothering him for a loss. The second was one of the slowest-developing runs the NFL has ever seen, and Darren Sproles was predictably stuffed. That wasn't all for Pederson, as he constantly called ineffective read plays for Wentz, which didn't do anything. Pederson also had a horrible challenge on one play in the third quarter, burning a timeout. It was one of two timeouts Pederson wasted in the second half, costing the Eagles one more possession. Despite all of this, as well as a blocked field goal, the Eagles still had a chance to win at the very end. They had two possessions deep in Giants territory, but high passes, drops and quarterback pressures ultimately allowed the Giants to win. ",
            "2": "Wentz finished 27-of-47 for 364 yards and the two picks. Wentz managed to play well in between the 20s after the two early turnovers, but he constantly sailed passes over his receivers' heads in the red zone. He also made some dumb mental mistakes. For instance, he took a 5-yard sack by running out of bounds and not throwing the ball away. He also threw short of the third-down marker on third down on a couple of occasions. He was lucky to have just two interceptions, as he was nearly picked off a couple more times. He also underthrew Jordan Matthews and someone named Bryce Treggs for two potential touchdowns. ",
            "3": "If there's a silver lining for the Eagles, it's that Wentz finally developed a connection with Zach Ertz. The talented tight end had done nothing all year, but he caught all eight of his targets for 97 yards, eating the Giants' linebacking corps alive. Ertz missed some action with a minor injury, but he wasn't out long. Matthews (6-88) was next on the receiving chart. Nelson Agholor, meanwhile, dropped some passes and fumbled the ball, but was fortunate enough to recover it. ",
            "4": "Sproles once again carried the load for the Eagles. He gained 57 yards on 13 carries, but was stuffed on that aforementioned fourth-and-1 play. He also nearly scored on a punt return, but barely stepped out of bounds. Ryan Mathews found the end zone, but was given just five carries, which he turned into 15 yards. Kenjon Barner also had a touchdown on his only attempt. ",
            "5": "Following the two early touchdown following Wentz's interceptions, the Giants barely did anything on offense. It didn't help that stud guard Justin Pugh sustained an injury in the first quarter. Still, the Giants had just two positive drives that didn't come off Philadelphia turnovers on the afternoon. Eli Manning finished 22-of-36 for 257 yards, four touchdowns and two interceptions. He was nearly picked a third time by McLeod, but the ball barely hit the ground. Manning struggled following halftime, going 7-of-14 for 82 yards and two picks. Neither interception was really his fault, however, as the first one occurred when Nolan Carroll ripped the ball out of Beckham's hands. The other was tipped by Connor Barwin and snatched in the air by Jordan Hicks, who made a very athletic play. Still, this set up the Eagles for a short drive to potentially take the lead, but Wentz couldn't get the job done. ",
            "6": "Beckham caught two of Manning's touchdowns, but had just four grabs for 46 yards. Beckham missed a drive when he took a helmet to the arm, but ended up being fine. Sterling Shepard (3-50) led the Giantsin receiving and hauled in the other touchdown, while Victor Cruz, who caught just one pass for 46 yards, sprained his ankle in the second quarter. ",
            "7": "The Giants struggled to run the ball, which wasn't surprising at all with Pugh out of the lineup. Both Paul Perkins and Rashad Jennings had 11 carries, gaining 32 and 26 yards, respectively. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "For a second, it seemed like the Browns would be able to compete with the Cowboys and perhaps pull the upset. They opened the game with some exotic formations, which tripped Dallas up pretty well. A fight even broke out on the first drive, as Cameron Erving ripped the helmet off of David Irving, and both players were ejected. The Browns established a 3-0 lead, and they were later deep in Dallas territory, down 7-3, but then reality set in. The Browns missed a field goal, and then the Cowboys scored on almost every possession for the rest of the game. Before the Browns knew it, their potential 7-6 deficit turned into a 21-3 halftime score, and there was no way they were coming back from that against a red-hot opponent. How great was Dallas' offense? The Cowboys punted once until the very end of the game, and that punt came on a drive in which they were pinned at their own 1-yard line. Their dominant defensive line pushed around Cleveland's beleaguered front, and Dallas basically did whatever it wanted to. The Cowboys racked up 423 net yards, averaging six yards per play. They achieved 29 first downs, and yet those numbers don't even describe how one-sided this affair was. ",
            "2": "Dak Prescott was nearly flawless, as he misfired on just six occasions. He finished 21-of-27 for 247 yards and three touchdowns. He was great, but Cleveland's secondary and linebacking corps have to shoulder much of the blame. For instance, on a Prescott touchdown to Jason Witten, newcomer Jamie Collins blew a coverage, as it didn't appear as though he knew what to do just yet. Later, rookie corner Xavien Howard whiffed on a tackle after Witten caught a short reception, allowing the future Hall of Famer to rumble for 27 yards. Numerous offside penalties allowed the Cowboys to keep drives alive as well. Speaking of Witten, he had a huge performance. He caught eight passes for 134 yards and a touchdown - a disappointing stat line, considering that the Browns traded for Collins to join the talented Christian Kirksey. Prescott's other scores went to Cole Beasley (6-56), who was wide open on his score, and Gavin Escobar. Dez Bryant, meanwhile, did nothing positive outside of catch a 19-yard pass. He dropped two balls, one of which would've been a touchdown. ",
            "3": "The Browns had trouble tackling Ezekiel Elliott. The star rookie didn't gain 100 yards, but only because he carried the ball just 18 times, surrendering work to Alfred Morris (17-56) late in this contest because it was such a blowout. Elliott tallied 92 yards and also scored twice. ",
            "4": "Before moving on to Cleveland's offense, it's worth noting that the Cowboys lost guard Ronald Leary late in the game to a concussion. ",
            "5": "Cleveland welcomed back both Cody Kessler and Corey Coleman, but it didn't make much of a difference, even with Morris Claiborne and Barry Church out for Dallas. The Erving ejection did matter though, as the Browns scored just once in his absence. Dallas was able to rack up four sacks. When Cody Kessler had time in the pocket, he did an OK job. Kessler went 19-of-27 for 203 yards and a touchdown. He nearly threw a pick on an overthrow. These stats were actually not a byproduct of garbage time; Kessler was just 5-of-7 for 36 yards following intermission. He didn't get much of a chance to do anything because the Cowboys were able to grind the game out and control the clock. Dallas won the time-of-possession battle by a whopping 19 minutes, and Cleveland ran just 14 offensive plays in the second half! ",
            "6": "As for Coleman, he wasn't much of a factor, catching three balls for 41 yards. Terrelle Pryor (5-47) hauled in Kessler's sole touchdown. ",
            "7": "The Browns, trailing for most of the contest, didn't get to establish the rush. Duke Johnson gained 30 yards on five attempts, while Isaiah Crowell didn't do much on the ground, mustering only four yards on six attempts, though he did lead the team in receiving, catching four passes for 63 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "14"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Nice job by the Jaguars firing their only good coach, as they managed only seven points until garbage time with their new coordinator. Oh, and nice job by Travis Kelce to get ejected. I'm serious about that. Kelce got das boot when he threw a towel at a ref. Given how awful the officiating has been this year, I think other players should utilize Kelce's strategy. ",
            "2": "Kansas City won its fourth straight game to keep pace in the AFC West, the best division in the NFL. The Chiefs were playing without starting quarterback Alex Smith or running backs Jamaal Charles and Spencer Ware, plus wide receiver Jeremy Maclin quickly went out of the game with a groin injury. Backup quarterback Nick Foles wasn't impressive, but he didn't need to be as Kansas City's defense carried the team to victory. After being beaten by the Titans in Week 8, the Jaguars made offensive coordinator Greg Olson the fall guy and the sacrificial lamb for the incompetence of head coach Gus Bradley and general manager David Caldwell. Olson saved Bradley and Caldwell's jobs a year ago. Despite the change, however, Jacksonville's offense produced a whopping 14 points after 10 days to prepare for Kansas City. The attempt to save face was proven to be pathetic by the Chiefs, as the Jaguars turned the ball over four times - and two easy interceptions were dropped by the Chiefs. Clearly, the wrong people were fired, as Bradley and Caldwell have proven all they produce is losing for Jacksonville. ",
            "3": "Early in the first quarter, the Jaguars had a hilarious blooper play as Prince Amukamara ran under a terrible pass from Foles that looked like a punt down the middle of the field to get an interception, but Amukamara's teammate, Tashaun Gipson, ran into him to break up the catch. Late in the first quarter, Jaguars punt returner Bryan Walters fumbled the ball away to set up the Chiefs inside Jacksonville's 25-yard line, which set up Foles to hit Albert Wilson for a 23-yard touchdown pass a couple of plays later. Early in the second quarter, Bortles threw a terrible interception right into the hands of Ramik Wilson, and then Bortles was called for a personal foul going for the knees of a defender. That set up Kansas City at the Jaguars' 14-yard line, but the Chiefs were held to a field goal. Late in the first half, Jacksonville moved the ball with passes to Marcedes Lewis for 17 yards and Allen Robinson for 20 yards to get into Kansas City territory. A 25-yard pass to Marqise Lee then moved the Jaguars to inside the 10-yard line. Bortles lucked out with an easy interception dropped by Ron Parker in the end zone, and on the next play, Bortles threw a one-yard strike to Robinson, who had managed to separate from Parker. The Chiefs took a 10-7 lead into the half. Early in the third quarter, T.J.Yeldon fumbled the ball away to Kansas City and Cairo Santos drilled a 51-yard field goal. Bortles continued to struggle as Stephen Nelson dropped an interception, and Bortles also missed Robinson running wide open for a would-have-been 60-yard touchdown. A 37-yard punt return from Chiefs receiver Tyreek Hill and a penalty on the Jaguars started the Chiefs' offense at the 30-yard line, but Foles' struggles once again led to Kansas City settling for a field goal. Jacksonville put of a bit together in response, but Jason Myers missed on a 54-yard field goal attempt. The Chiefs got moving on a third-down completion to Travis Kelce to move deep into Jaguars territory. But a few plays later after getting interfered with in the end zone, Kelce lost his cool at the officials, who hadn't thrown any flags, and his temper tantrum landed him two unsportsmanlike conduct penalties and ejection. The 30-yard loss killed the drive, but Santos hit a field goal to produce a 19-7 lead. The Jaguars got close to the end zone with a long pass to Marqise Lee (4-84) for 51 yards. However, two plays later, Chris Ivory fumbled the ball into the end zone, and it was recovered by Marcus Peters. The Jaguars got the ball back and were able to get points with a 14-yard scoring pass to Yeldon. Soon afterward, Sen'Derrick Marks got a third-down sack to get the ball back for Jacksonville with three minutes remaining. Bortles took off on a 27-yard run to get into Kansas City territory, but Dontari Poe blew up a Yeldon run on third down and Stephen Nelson broke up a fourth-down pass intended for Bryan Walters to clinch the win for Kansas City. ",
            "4": "The change in coordinators didn't make a difference for Bortles, as he was 10-of-19 for 90 yards at halftime. He finished completing 22-of-41 passes for 252 yards with two scores and an interception, but he was inaccurate and careless with the football. He didn't look any better this week. In fact, you could say Bortles was less effective in the second half than he typically is. ",
            "5": "Ivory (18-107) led the Jaguars in rushing, but had a critical fumble and picked up almost half of his yards on one carry. T.J. Yeldon (7-33 rushing, 5-32-1 receiving) chipped in but also had a turnover. ",
            "6": "Allen Robinson notched seven receptions for 76 yards and a touchdown, but it could have been much bigger if Bortles had been more accurate. Allen Hurns didn't record a catch, while Julius Thomas (2-21) continues to show that he was a waste of a big contract by Jacksonville. Hurns left the game with a concussion. ",
            "7": "Foles was 20-of-33 for 187 yards with a touchdown. He wasn't impressive, but he avoided turnovers despite the lack of weapons. One can't expect a lot more than that from a backup quarterback. ",
            "8": "Charcandrick West (13-39) led Kansas City in rushing with Ware and Charles out. ",
            "9": "Kelce was the Kansas City's leading receiver with five catches for 58 yards, but his getting kicked out of the game hurt his team, and he has to know better than that. ",
            "10": "Defensively, Dee Ford continued his breakout season with two sacks. Cornerback Stephen Nelson had a good game for Kansas City despite a dropped interception. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The Steelers are now 2-6 when Ben Roethlisberger returns in his first game from injury. I know Roethlisberger has these heroic efforts, but maybe he should extend his personal injury timetable by one week going forward. ",
            "2": "This game, as most Ravens-Steelers games are, was in no way pretty. Both teams had trouble offensively, but Pittsburgh was by far the more troubled of the two. Through 50 minutes of football, the Steelers had two first downs with 69 total yards. You really can't get any worse than that. The Ravens' defense confused and harassed Roethlisberger, but the Steelers also didn't have much faith in him coming off knee surgery just three weeks ago. They would often run on third-and-not-short for no first down, and the Ravens weren't afraid of Roethlisberger, who looked off-target for the majority of the game. ",
            "3": "Baltimore's offense in the first half came mostly on one play, a slant to Mike Wallace, which he took 95 yards for a touchdown. It was the longest touchdown of Joe Flacco's career, and with a field goal as time ran down on the first half, the Ravens led 10-0. Wallace came into the league with the Steelers, so there must have been a little revenge factor for him this week. He ended up with 124 yards on four receptions to go along with his fourth touchdown of the year. On the day, the Ravens totaled just 179 yards on 14 drives, if you take Wallace's huge gainer out of the equation. Baltimore also couldn't run the ball, with Terrance West rushing 15 times for 21 yards and Kenneth Dixon seeing nine attempts for 13 yards. That is a good sign for the Steelers, who were being gashed by opposes runners lately. ",
            "4": "The Ravens' defense and special teams won this game for their team. They shut down Le'Veon Bell to just 32 yards on 12 carries, and of course, the utter devastation of the Steelers' offense through three quarters. ",
            "5": "Penalties also made this game tough to watch. Pittsburgh had more penalty yards than offensive yards through the first half! On the day, the two teams accumulated 21 penalties for 193 yards, which is slightly less than the Raiders last week, but still too much for most football games. ",
            "6": "At any rate, another field goal and then a blocked punt for a touchdown put the Ravens in control 21-0 with just 13 minutes left in the game. That's when Pittsburgh's offense finally woke up. That awakening was, of course, helped by a defense with a 21-point lead, but there's no doubt that Roethlisberger was more accurate after getting three quarters of practice. He finally started connecting with Antonio Brown, finding him on a 23-yard touchdown to cut the deficit to 21-7. Brown, after barely seeing the ball through most of the game, ended up with seven receptions for 85 yards and a touchdown. The fact that Roethlisberger didn't hurt himself anymore and looked strong to finish the game is actually a decent outcome from this ugly game. Roethlisberger again moved his team down the field with time waning and ended up rushing for a touchdown to make the game 21-14 with 48 seconds left on the clock. Of course, an onside kick was in order, but instead we saw the worst possible whiff on a kick by Chris Boswell, who will have a time living that play down. ",
            "7": "Steve Smith returned after missing two games with an ankle injury. He ended up with four receptions for 47 yards, but the good news is that he made it through the game healthy and should continue to be a top target for Flacco. Oh, and the Ravens get to play the Browns this Thursday night. ",
            "8": "The Steelers have now lost three in a row, and the Ravens have taken over the lead in the NFC North based on their head-to-head record since both teams are now 4-4. Pittsburgh takes on a hot Dallas Cowboys team next. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Saints",
            "Points": "41"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> I had this game on in the background, and I must have heard, Colin Kaepernick is back to his former self! about a dozen times by the announcers. And whenever they showed the replay of what happened, Kaepernick was throwing to a wide-open player with no pressure in his face. I feel like an 80-year-old grandma in the stands could've registered 398 passing yards and two touchdowns against the Saints. She may not have even thrown an interception! ",
            "2": "New Orleans got back to .500 (4-4) by cruising to a win over the hapless 49ers (1-7). With Tampa Bay losing on Thursday night, the Saints are in second place in the NFC South and remain in the wild-card race. San Francisco, meanwhile, protected its draft status with its seventh-straight loss and is only one game behind Cleveland for the No. 1 overall pick. At this point, any wins the 49ers get would be meaningless and could hurt them for years to come. ",
            "3": "The 49ers struck first in this contest with a Phil Dawson 49-yard field goal, which was set up by a 31-yard pass to Quinton Patton. The Saints came back with Drew Brees throwing lasers to Michael Thomas for 23 yards and tight end Josh Hill for 32 yards. To finish the drive, Tim Hightower scored from four yards out. Colin Kaepernick set up the Saints for more points as he didn't bother to read the Saints' defense before throwing a pass right to linebacker Craig Robertson. Robertson returned the pick 29 yards, which aggravated by a horse-collar penalty, put the ball at the 12-yard line. Brees, of course, finished the drive, throwing a touchdown pass to Thomas. The Saints quickly scored again as Brees and Hightower continued to move the ball. That drive ended with a five-yard scoring pass to Mark Ingram. Surprisingly, the 49ers answered with Kapernick throwing a dump off to DuJuan Harris, who ran untouched down the sideline for a 47-yard touchdown. Just seconds later though, Ingram took off on a 75-yard touchdown run to put the Saints up 28-10. The 49ers' next drive saw a 31-yard pass to Garrett Celek set up another Dawson field goal. Just before the half, Kaerpernick hit Vance McDonald on a short crossing route, and McDonald turned down the field to run 65 yards for a touchdown. The Saints had completely busted coverage as they forgot to account for McDonald. In the final minute before the half, Brees ripped the ball down the field to get a field goal and a 31-20 lead at intermission. The 49ers opened the third quarter by moving the ball quickly down the field, but Nate Stupar forced a fumble from Mike Davis at the one-yard line and New Orleans recovered the loose ball. The 49ers got the ball back after forcing a four-and-out, however, and produced a field goal drive. Late in the third quarter, the Saints missed a long field goal, but Brees threw some beautiful passes, including a 32-yard touchdown to Thomas. It was a tremendous juggling catch by Thomas along the sideline. New Orleans added a field goal and then stopped the 49ers on a fourth down in the red zone as Kaepernick fumbled the snap away. In garbage time, Kenny Vaccaro forced another fumble that was recovered by the Saints. ",
            "4": "Brees completed 28-of-39 passes for 323 yards with three touchdowns. Thomas led the Saints with five receptions for 73 yards and two scores. Brandin Cooks (5-66) chipped in as well for New Orleans. ",
            "5": "Tim Hightower (23-87-1) and Mark Ingram (15-158-1 rushing, 2-13-1 receiving) ran wild on the 49ers. It was good for Ingram to get back on track after being demoted for fumbling issues. ",
            "6": "Kapernick was 24-of-39 for 398 yards with two touchdowns and an interception. His touchdowns were lucky plays and the result of terrible defense by the Saints. ",
            "7": "DuJuan Harris (10-59 rushing, 5-83-1 receiving) was San Francisco's best offensive weapon with Carlos Hyde out. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "26"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> So, the Colts get blown out by the Chiefs at home, and yet they go into Lambeau and dominate the Packers, who just nearly won in Atlanta? Wutz goin onnn hear??? I feel like I've just taken a sip out of Derek Anderson's flask because this makes no sense. ",
            "2": "Another week, and another late loss for the Packers. The team was looking to bounce back from a loss to the Falcons, but was unable to do so. The Colts came in and were able to notch the win, which could prove critical to their season. ",
            "3": "Andrew Luck had an up-and-down game, going 23-of-36 for 281 yards, one touchdown and two picks. He looked good in the 2-minute drill to close the first half, and also was able to waste some time near the end of regulation with a key third-down conversion. That really helped the Colts to finish strong and win. Luck, however, just was not sharp at times in this contest. He looked nothing like the highly touted, smart quarterback who was a sure-fire success coming out of Stanford. In fact, his football I.Q. was completely lacking. At one point, he underthrew Donte Moncrief on a play that could have resulted in a touchdown. It was a throw that the quarterback should have made, and it could have cost the Colts had the Packers completed the comeback. Luck threw two early interceptions, and both were avoidable. The first was the worst of the two. He had a wide-open receiver in space, but instead of throwing a hard pass, he lofted it. That allowed Ha Ha Clinton-Dix to come over and get under the ball. The second pick came on a throw that should never have happened. Luck had quite a bit of time to throw before he was put under pressure. He did not get a pass off until he was getting hit. As a result, he overthrew Jack Doyle on the play and Clinton-Dix again was the beneficiary. Luck would have been better off taking the sack or lofting it out of bounds. He needs to improve his decision-making if he wants to be a truly elite quarterback. ",
            "4": "For most of the day, Luck relied on three receivers to do a brunt of the work. T.Y. Hilton (6-81) led the team in both catches and yardage. The speedy top option is still not at full health as he recovers from a hamstring injury. Still, his big-play ability makes him a high-upside WR1 week in and week out in fantasy. After Hilton, Jack Doyle (5-61) and Donte Moncrief (3-55, 1 TD) were the major producers. Moncrief looked healthy in his second game back from injury, and he should be the bona fide No. 2 option for Luck. In fantasy, he is probably a high-end WR3 most weeks, unless the team has a great matchup. Doyle, meanwhile, has turned himself into a security blanket for Luck. Doyle led the team in targets with nine, and he seems to be getting better each week. Doyle is a TE2 with upside, so if you are hurting at the position, try to pick him up. ",
            "5": "In terms of the running game, Frank Gore was surprisingly strong. The Packers boast one of the league's best run defenses, but the 12-year veteran was able to do well on Sunday. Gore's numbers do not look great on paper - he had 19 carries for 60 yards - but he was elusive, shifty and able to make plays against Green Bay's defense. Also, Gore had two touchdown runs that helped to drive the Colts' offense. The first touchdown was a result of impressive blocking from the line on a pitch play. Gore was able to walk in untouched. On the second, he plowed through the offensive line and some Packers defenders to reach the end zone. It will definitely be interesting to see if Gore continues to be a red-zone threat for Indianapolis, especially given Andrew Luck's trouble with turnovers of late. ",
            "6": "The Colts really started the game off on the right foot when Jordan Todman had a huge kick-return touchdown. He took the opening kick back 99 yards for the score. Todman looked explosive and was able to follow the blocking. He had another big return on a kick later in the game. Perhaps Indianapolis should consider giving him some carries, since the team does not have much behind Gore. ",
            "7": "For the Packers, this was yet another disappointing loss. Aaron Rodgers was able to rally Green Bay late, but he could not do enough to carry the team. Rodgers' stat line is a little bit deceiving. He went 26-of-43 for 297 yards, three touchdowns and a pick. Two of the touchdowns came in the fourth quarter, however, and Rodgers had some issues getting the offense moving early. His throws were not bad. Rather, he could not find an open receiver against the Colts' defense. Rodgers was able to move around the pocket effectively as the contest went on, and that really helped him out. Once he did that, the Colts had more trouble following the receivers and Rodgers was able to hit the open man. The performance was not as good as the one he had last week against the Falcons, but his play late could have won the game for Green Bay. ",
            "8": "Rodgers spread the ball around a fair amount on Sunday. Jordy Nelson (7-94, 1 TD) and Richard Rodgers (6-64) led the team in receiving. Nelson looked solid for the second straight week, and it appears that the veteran is finally healthy. He made a beautiful catch on a long pass on what was a free play, and that was how he scored his touchdown. Rodgers, meanwhile, was solid but unspectacular. He is too inconsistent of an option for most fantasy leagues. Davante Adams (4-41, 1 TD) came on late, catching a 40 yard pass and a short touchdown on the team's final scoring drive. He has really done a good job of fixing his issues with drops, and is far more consistent as a result. Randall Cobb (2-14, 1 TD) played sparingly as he continues to recover from an injury. When healthy, he can be considered a WR2 in most formats. ",
            "9": "One frustrating part of today's game was the usage of Ty Montgomery. In the first half, the dual-threat player only had four carries. He had a big burst on the opening play, where he slipped through the offensive line and followed his blockers for a big gain, but he was not used for a while afterward. The team insisted on giving Don Jackson carries. He only managed eight yards on four attempts. Montgomery was able to rush for 53 yards on seven carries and caught three passes for 38 yards. He caught a screen pass late where he ducked away from defenders, and that is where many of his receiving yards came from. Moving forward, the team should give him a few more touches each week. Granted, Montgomery may not be able to handle a full workload, but he is a greatly talented player. The more touches he gets, the better the offense will be. ",
            "10": "Final Note: Ha Ha Clinton-Dix was very strong in today's game. In addition to the two picks, he notched half of a sack on a blitz. He continues to develop into one of the better safeties in the league. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "When is Jared Goff going to play? That was on the mind of everyone watching this game, namely the fans in the stands, who constantly showered Case Keenum with boos. We want Goff! they chanted throughout the afternoon, but to no avail. Tee-bow! they curiously shouted as well, for some reason, but that didn't work either. Jeff Fisher stubbornly stuck with Keenum despite coming off a bye. Keenum was as bad as the fans made him out to be. He was absolutely brutal. In the early going, he missed a wide-open Brian Quick downfield on a third down, which bailed out James Bradberry, who bit on a double move. Keenum then fumbled, but was fortunate that Benny Cunningham was right next to him to recover the ball. Keenum followed that up by firing a horrible pass following a nifty Todd Gurley Wildcat play, ruining all momentum the Rams had on a second-quarter drive. Following halftime, Keenum threw an interception, which was a ridiculously underthrown ball that sailed right to Thomas Davis. The ball was so underthrown, it was almost as if Keenum threw a brick. Keenum finished 27-of-46 for 296 yards, one touchdown and the interception. He wasn't completely to blame for the offense's ineptitude, as the team was guilty of five drops, including one where Lance Kendricks had the ball hit him right in the numbers as he was standing in the end zone. Still, Keenum was horrible enough that any competent coach would've made a change, yet Fisher stuck with the ineffective veteran. ",
            "2": "As for the Panthers, they continue to win following their 1-5 start. They're now 3-5, though there are still some concerns. Their secondary would've given up some big gains if the Rams had a competent quarterback. The offensive line, meanwhile, was getting pushed round by Los Angeles' stalwart front. The Panthers gained just 244 net yards and averaged a putrid 3.9 yards per play. ",
            "3": "Cam Newton finished 20-of-32 for 225 yards and a touchdown. He also carried the ball seven times, but the Rams were prepared for his scrambles, as he was limited to just 16 yards on the ground. Newton made a big stink about not getting any personal-foul calls, and that continued to be the case. The whistles were silent even though there appeared to be one occasion in which he should've drawn a flag, as Mark Barron smashed into him with a helmet-to-helmet hit. ",
            "4": "Only three Panthers caught more than two passes. Kelvin Benjamin led the way with five grabs for 76 yards. Greg Olsen (5-52) found the end zone, while Ted Ginn reeled in five passes for 40 yards. Ed Dickson (2-17) dropped a pass. ",
            "5": "The Panthers couldn't find any running room for Jonathan Stewart, who was limited to 42 yards on 15 carries. Carolina simply couldn't push around Aaron Donald and the Rams' great defensive line. ",
            "6": "Moving back to the Rams, they also struggled to run the ball, as Todd Gurley managed only 48 yards on 12 attempts, most of which came on an 18-yard burst. Gurley continued to be a factor in the passing game; he caught four passes for 26 receiving yards. ",
            "7": "Despite his horrible drop, Kendricks paced the Rams with seven catches for 90 yards. Kenny Britt, meanwhile, snatched four balls for 49 yards and a late touchdown. ",
            "8": "Speaking of the Britt touchdown, it came under strange circumstances. The Rams were down 10 at the Carolina 10-yard line with about 30 seconds left. They needed a field goal, an onside kick recovery and a touchdown in some order. Considering it was fourth down, the announcers just assumed that Fisher would summon his kicking unit. Following a timeout, Fisher apparently changed his mind and went for the touchdown. Britt magically caught the ball in the end zone. The touchdown pushed the spread, which made me wonder if Fisher happened to be more concerned with covering/pushing than actually winning the game. I know that may seem strange to say, but there's no logical reason to bypass the field goal at that juncture. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "35"
        },
        "comments": {
            "amount": "8",
            "1": "Melvin Gordon is a beast. He almost literally carried the Chargers to victory over the Titans, saving their season. San Diego is still not in a great spot, but at 4-5, the team still has a chance to make a run at a wild-card spot. The Titans had no answer for Gordon. He gashed them the entire afternoon, generating 100 rushing yards by halftime. His best run came at the end, however. Tennessee, down eight with a few minutes remaining, was trying to stop San Diego to get one final possession in regulation. On third-and-long, Gordon got the carry, and he appeared to be stuffed for a short gain. Gordon, however, broke free of two tackles and then eluded two other Tennessee players downfield. He gained 47 yards on the play, and that sealed the victory for the Chargers. Gordon finished with 196 yards and a touchdown on 32 carries. He also caught four balls for 65 receiving yards. The stats don't do him justice, and it could be argued that Gordon is the best running back in the AFC. The difference between him this year and last season is colossal, as Gordon is no longer nursing an injury that plagued his rookie campaign. ",
            "2": "Aside from Gordon, San Diego's defense was the main reason for this victory. The stop unit actually struggled for most of the afternoon, but came through with two big plays, both of which were returned for touchdowns. The first was Marcus Mariota fumble, which was forced by Melvin Ingram's helmet hitting the ball, allowing Dwight Lowery to get the scoop and score. Mariota was also responsible for the second turnover, as he fired a pick-six in Brandon Flowers' direction late in the game. ",
            "3": "As for Philip Rivers, he had a strong performance as well. He misfired on just nine occasions, going 24-of-33 for 275 yards and two touchdowns. Tennessee's secondary has struggled, so it's not a surprise that Rivers enjoyed so much success. The Titans had their usual blown coverages and missed tackles. Perrish Cox had a horrible instance of the latter in the first half. ",
            "4": "Rivers' touchdowns went to Antonio Gates (5-75) and Tyrell Williams (6-65). Rivers didn't have his receiving and tight end corps completely intact. Hunter Henry was out, while Travis Benjamin, who caught only one pass for five yards, is dealing with a sprained PCL. ",
            "5": "Before moving on to the Titans, it's worth noting that Orlando Franklin sustained a concussion. The Chargers have endured tons of injuries to the offensive line in recent years, so hopefully Franklin can recover quickly. The silver lining is that San Diego has a bye coming up in Week 11. ",
            "6": "Marcus Mariota had a mixed performance for the Titans. He was responsible for the two turnovers that were taken back for touchdowns. He also fired another ugly interception on a careless deep shot in which he didn't see Casey Hayward. However, Mariota did a terrific job of moving the chains at times, though he didn't have any sort of success while playing under center. Most of his completions came in shotgun, and he finished 27-of-43 for 313 yards, four touchdowns (three passing, one rushing), two picks and a lost fumble. ",
            "7": "Two of Mariota's touchdowns went to Rishard Matthews, who caught six of his 10 targets for 63 yards. Delanie Walker (5-42) scored the other Mariota touchdown. Both Kendall Wright (2-64) and Tajae Sharpe (4-58) contributed, with the latter drawing a pass interference in the end zone. ",
            "8": "DeMarco Murray's numbers weren't great, as he mustered only 51 yards on 14 carries. However, he bailed out his fantasy owners with a touchdown. Derrick Henry was expected to see more of a workload in this contest, but he left the game early with a calf injury. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "This was billed as the biggest game in Oakland in quite a long time. The Raiders hadn't been in the playoffs since 2002, but they appear to finally be in position to snap that dubious streak. The question was whether or not this would be too big of a stage for them. Could they defeat the defending Super Bowl champions, or would they flop, much like the Bills did at home versus the Patriots last year? Well, we have our answer, but we didn't need to wait all four quarters to learn what it would be. The Raiders came to play, and they did not disappoint. They dominated on offense, defense and special teams, slaying their arch rival and taking control of the AFC West with a 7-2 record. ",
            "2": "In terms of the offense, the Raiders were able to dominate using their ground attack. I didn't think Oakland could take advantage of Denver's weakness versus the rush, but I was way wrong. The offensive line blew open huge holes for their running backs, who were able to take advantage of those massive running lanes. Latavius Murray, who hadn't even eclipsed 60 rushing yards in any contest this year, was able to burst for 114 yards and three touchdowns on 20 carries. It wasn't just Murray gashing the Broncos, as Jalen Richard (8-62) and DeAndre Washington (10-35) picked up chunks of yards as well. The Broncos struggled to tackle and took bad angles all evening in addition to having their defensive line pushed around as if they were all on roller skates. It only got worse after Derek Wolfe was carted off the field. ",
            "3": "Derek Carr didn't have his best performance, but he played well against a defense that is usually terrific against the pass. Carr finished 20-of-31 for 184 yards. The stats don't look very appealing, but Carr helped draw countless pass interference flags versus a secondary missing a couple of players, including Aqib Talib. The Broncos were flagged for a whopping four interference flags in the end zone alone! Carr's only real blemish was a near-interception by T.J. Ward, but the ball grazed the grass. ",
            "4": "The Broncos erased Michael Crabtree, who was limited to two catches for 27 yards. Amari Cooper led the way with six grabs for 56 yards. Seth Roberts (3-32) should've scored a touchdown on the opening drive, but he slipped in the open field. ",
            "5": "In terms of Oakland's defense, the unit wasn't as dominant as the offense, but it did a great job of stopping the rush. Devontae Booker couldn't find any sort of running room, and he was limited to just 22 yards on 10 carries. This was a huge shocker to me, as the Raiders had struggled to defend the run all season. ",
            "6": "Trevor Siemian, meanwhile, failed to complete half of his passes. He began the game 1-of-8 for only four yards, as it didn't seem like the Broncos would be able to achieve a first down all evening. Siemian eventually got into a rhythm, but it was too little, too late because the Raiders were able to hold a lead throughout. Siemian was also hurt by drops. He finished 18-of-37 for 283 yards, two touchdowns, a late interception and a lost fumble, but it's worth noting that a 69-yard score of his was a fluky one, as Kapri Bibbs caught a short pass and went the distance against an Oakland defense that appeared to be disinterested because it was up 17 points. ",
            "7": "Save for Bibbs, Demaryius Thomas was Denver's leading receiver, as he caught five balls for 56 yards. He drew an interference flag, but also dropped a pass. Emmanuel Sanders reeled in five passes for 47 yards. He dropped a ball as well, but his blunder was more painful, as he could've scored a long touchdown had he held on to the potential reception. ",
            "8": "The Raiders, as mentioned, dominated on special teams as well, save for Sebastian Janikowski's missed 48-yard field goal. Punter Marquette King was incredible, pinning the Broncos inside their own 2-yard line on two occasions. Meanwhile, for Denver, Bibbs foolishly took multiple kickoffs out of the end zone and repeatedly failed to get to the 25-yard line. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "25"
        },
        "comments": {
            "amount": "7",
            "1": "This was an unbelievable game. The Seahawks and Bills were engaged in a thrilling shootout that went back and forth, and it actually was determined in the final minute. That's why it's a shame that this matchup has to be overshadowed by an all-time screw-up by the officials. If you somehow missed it, the Bills were lining up to kick a field goal right before halftime. The play was called dead for an offsides, but that didn't prevent Richard Sherman from running full speed into Dan Carpenter, ramming right into his leg. When I saw this live, I thought the officials would eject Sherman for what seemed like a blatantly dirty play from a viewer's perspective. It at least would be a personal foul. The officials, however, didn't call Sherman for anything. Instead, they forced Carpenter to leave the game because he needed the help of the trainers, and the officials had the audacity to charge Buffalo with a fourth timeout, which resulted in a delay-of-game penalty. Rex Ryan wisely spiked the ball so Carpenter could come back out following his missed play. Carpenter hit the kick, so it appeared as though there was no harm, no foul. However, the refs ruled that the Bills let the play clock expire even though an official stood over the ball until there were five seconds remaining. Buffalo figured the refs reset the play clock. Thanks to another 5-yard penalty, Carpenter whiffed on his next kick. It was an absolutely embarrassing moment for Walt Anderson and the NFL in general. Anderson ended up costing the Bills three points, and with those three points, Buffalo could've kicked a field goal at the end of regulation to send the game to overtime. The Bills had all the momentum at that point, so they could've easily won in the extra session. They didn't have an opportunity to do so, however. Anderson and his crew seriously need to be reprimanded. I won't call for their firing, but they should at least be suspended and forced to attend seminars so they can learn the basic procedures and rules of football. ",
            "2": "The other big take-away from this game is how well Tyrod Taylor played. Taylor had the best game of his career, going 27-of-38 for 289 yards, one touchdown and an interception on a miscommunication. He also rushed for 43 yards on eight scrambles with a second score. Taylor did this in an extremely hostile environment without his top receiver, and he didn't even have his Pro Bowl center for the final quarter, as Eric Wood was carted off with an injury. Taylor's pocket awareness and accuracy were absolutely fantastic. His best play came in the fourth quarter on a third-and-21 when he avoided multiple pass-rushers, scrambled right, and then found Robert Woods for a gain of 22, all while drawing a roughing-the-passer penalty on Bobby Wagner. Taylor looked like a franchise quarterback. ",
            "3": "Taylor may have been missing Sammy Watkins, but Robert Woods picked up the slack. Woods had one of the best performances of his career as well, as he hauled in 10 grabs for 162 yards, including some great receptions along the sideline. His only blemish was a dumb taunting penalty, but it didn't end up hurting the Bills because they scored a touchdown on that drive. ",
            "4": "LeSean McCoy returned to action, and he was huge for the Bills. McCoy did a great job dancing around Seattle's dynamic defenders, gaining 85 yards on 21 carries. He was also a big factor in the passing game, snatching four balls for 35 receiving yards. He didn't look hampered at all by his hamstring injury, though he had a touchdown vultured away by Mike Gillislee (8-32). ",
            "5": "The Seahawks will play better defensively once Michael Bennett and Kam Chancellor return from injury. Thus, it's a great sign that the offense is finally clicking. Russell Wilson was absolutely amazing, and while he's not 100 percent yet, it's apparent that his throwing ability is completely unaffected by his various leg maladies. Wilson misfired on just six occasions, going 20-of-26 for 282 yards and two touchdowns. He nearly had a third aerial score, but Doug Baldwin was at least able to draw pass interference in the end zone on Ronald Darby, which set up a Christine Michael touchdown. Wilson completed numerous bombs to his targets, who made circus catches all night. I say he's not 100 percent because he only scrambled thrice, picking up 10 yards and another touchdown on the ground, but on his longest run, an 8-yarder, Wilson stopped short and slid, whereas he would've tried to pick up more yardage prior to his injuries. Having said that, Seattle's offense still had its problems. Some drives were ruined by pressure, as left tackle George Fant struggled again. The offensive line desperately needs to improve, though I'm not sure where the Seahawks will get their reinforcements from. ",
            "6": "I mentioned that the Seahawks made numerous circus catches. Jimmy Graham had two one-handed grabs in the end zone. He was amazing, hauling in all eight of his targets for 103 yards and two touchdowns. Jermaine Kearse (2-36) also had a ridiculous reception, catching a pass thrown way behind him while falling down. Baldwin (6-89), as mentioned, drew an interference flag in the end zone. He also snagged a 50-yard bomb from Wilson. ",
            "7": "The Seahawks didn't try to run the ball very much, opting instead to attack Buffalo's weak cornerbacks. Michael scored, as mentioned, but he had just one yard on five carries. Seattle really needs Thomas Rawls to return from injury. It's been reported that Week 11 is his target. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "13"
}