{
    "year": "2016",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "19"
        },
        "comments": {
            "amount": "8",
            "1": "Because of the nature of Thursday night games, and the pattern of the superior team prevailing, I was trying to figure out whether the Giants or Eagles were better heading into this contest. Given that the Giants were 10-4, and the Eagles were 5-9, common sense would've said the road team had the upper hand, but New York wouldn't have Janoris Jenkins and Jason Pierre-Paul, while Philadelphia would be getting Lane Johnson back from suspension and Darren Sproles returning from injury. As it turns out, we still don't have a clear answer. This was a tightly contested game that could've gone either way. The Eagles led throughout the entire evening, while the Giants won the yardage battle, 470-286. Yards per play was even, however, with New York edging out Philadelphia, 5.3-5.2, and the Giants had two opportunities to take the lead on consecutive fourth-quarter drives. New York has been one of the luckiest teams in the NFL this year, pulling out close victories against bad and mediocre opponents, so it appeared as though it would do that again. That would not be the case, however. On the first drive, guard John Jerry false started on a fourth-and-1, and the next pass fell incomplete to Sterling Shepard, though Nolan Carroll committed an uncalled pass-interference penalty. The next possession concluded with an Eli Manning interception thrown up for grabs. ",
            "2": "Manning had a very mixed performance. He began the game 1-of-6 for only one yard and a pick-six in which he didn't see Malcolm Jenkins. Manning caught fire after that, as he seemed to figure out what the Eagles were doing defensively. He engineered some scoring drives, but his hot streak fizzled when he threw his second of three picks, as he telegraphed a throw that was snatched by Malcolm Jenkins. Manning finished 38-of-63, 356 yards, one touchdown and three interceptions. It certainly wasn't a horrible showing, but his first two picks were absolute killers and allowed the Eagles to prevail. Manning is a weak spot on the Giants' roster as it stands, but he's not getting much help from his offensive line. That said, the blocking has been better with Justin Pugh on the field. ",
            "3": "Despite facing constant double teams, Odell Beckham Jr. saw a whopping 20 targets. He snatched 11 of them for 150 yards. Beckham dropped a pass in the third quarter, but he should've caught a touchdown, as Manning overthrew him in the final frame. Shepard and Victor Cruz were targeted a ton as well, which isn't a surprise considering that Manning threw the ball 63 times. Shepard (7-61) hauled in Manning's sole touchdown, while Cruz caught eight balls for 84 yards. ",
            "4": "The Giants ran better than expected once again, thanks in part to Pugh's return. Paul Perkins and Rashad Jennings combined for 112 rushing yards, as Perkins out-carried Jennings, 15-9, winning the yardage battle as well, 68-44. ",
            "5": "Speaking of improved blocking, the Eagles were happy to welcome back Lane Johnson, who had been suspended when the team was 3-1. Philadelphia had gone 2-8 since, as missing its top offensive lineman certainly took its toll. Johnson made a big impact right away, as the Eagles ran behind him very successfully on the opening touchdown drive. I was perplexed that they shied away from that as the evening had progressed, but Johnson's presence allowed Carson Wentz to have better protection. Wentz saw some pressure, but wasn't sacked on a single occasion. Wentz finished 13-of-24 for 152 yards, one touchdown and an interception, which occurred when he danced around the pocket forever and then fired carelessly downfield. Wentz made some mistakes - he nearly had a second pick, but the ball was dropped - and had to leave the game for a bit because of a potential concussion, but he had a solid game overall. He was victimized by some drops, of course, while his best play occurred when he somehow ducked underneath two pass-rushers and scrambled for a first down. Philadelphia fans have to feel very optimistic about Wentz going forward. Wentz went through a rookie funk after beginning the year ablaze, but it's evident that the potential is there, and he'll have more success as long as Johnson stays on the field. Wentz is now 4-1 with Johnson blocking for him, with wins over the Giants and Steelers. ",
            "6": "Sproles also returned, and he had a significant impact. He rushed for 40 yards and a touchdown on seven carries, and he also caught a pair of passes for 23 receiving yards. Ryan Mathews (18-46) was the team's leading rusher. ",
            "7": "Though Agholor dropped a pass that disrupted an early drive, he led the team in receiving (2-47) and also caught a touchdown. Jordan Matthews, however, was only able to reel in two of his six targets for 12 yards. Zach Ertz (2-33) wasn't much better, which was a disappointment because he had such an easy matchup. ",
            "8": "There was another controversial play regarding a quarterback slide. Contrary to the Monday night game, the defense was flagged for a penalty when Wentz slid forward. Eli Apple was the culprit. This call was completely bogus, as Apple attempted to pull up to avoid hitting Wentz, and he dived simultaneous to Wentz's slide. Most disagreed, but the Cam Newton hit Monday was legal. This was even less severe, so Apple shouldn't have been flagged. The penalty was crushing, as the Eagles scored on that drive. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "The Patriots won in an easy blowout, but they could've done absolutely nothing and still prevailed. The Jets gave New England a 27-0 lead by halftime by self-destructing with devastating mistakes. It began when Bryce Petty threw an interception, though it wasn't his fault, as the ball tipped off Robby Anderson's hands. This led to a New England touchdown to make the score 10-0. Khiry Robinson then fumbled, which Malcolm Butler recovered on an instance in which Petty injured his arm trying to retrieve the football. This set up a field goal, though the officials ignored an obvious pass-interference flag on Julian Edelman in the end zone. Still, the Patriots went up 13-0, and they maintained their shutout when Austin Seferian-Jenkins dropped a touchdown for the Jets, setting up a missed 34-yard Nick Folk field goal. And if all of that wasn't enough, Ryan Fitzpatrick was picked off, thanks to Eric Rowe's perfect coverage on Brandon Marshall. The Patriots quickly scored after that, and it was suddenly 20-0. Just like that, the game was over. ",
            "2": "The Patriots didn't need to be great offensively, and they weren't, but they still did enough to put the Jets away. Tom Brady finished 17-of-24 for 214 yards and three touchdowns. He did this in three quarters of action before taking the final 15 minutes off. Brady obviously didn't have the best game, but he did have plenty of time in the pocket, as the Jets had absolutely no pass rush. ",
            "3": "Because New England didn't have to throw the ball very much, only one player accumulated more than 32 receiving yards. That was Edelman, who snatched five balls for 89 yards. As mentioned earlier, he should've drawn pass interference in the end zone. Malcolm Mitchell (3-29) disappointed his fantasy owners, failing to come up with an end-zone grab in the early going, while James White (3-32) and Martellus Bennett (2-19) caught Brady's touchdowns. White dropped a long gain. ",
            "4": "LeGarrette Blount and Dion Lewis nearly split the workload evenly. Blount ended up with more carries than Lewis, 20-16, but only because the Patriots fed Blount while running out the clock. Lewis had more attempts in the opening half, 9-7. Lewis also outgained Blount, 52-50, but Blount scored twice. ",
            "5": "As for the pathetic Jets, Petty was knocked out without completing a pass; he was 0-of-3 with a pick. As mentioned, the interception wasn't his fault, but it was still disappointing that the Jets couldn't use Christian Hackenberg once Petty left the game. Hackenberg was inactive for some strange reason, though perhaps it had to do with Todd Bowles' hospitalization. Bowles clearly didn't have all of his mental faculties intact when he made the decision to deactivate Hackenberg. Fitzpatrick played the rest of the way and was his usual, pedestrian self. Fitzpatrick's numbers were awful - 8-of-21 for 136 yards, two interceptions - but he should've thrown a touchdown, as Seferian-Jenkins had the aforementioned drop. If Petty can't play in Week 17, Hackenberg needs to start. There's absolutely no reason to keep trotting out a woeful, bearded quarterback with no future within the organization. ",
            "6": "The Jets wanted to establish Bilal Powell early and often, but couldn't because of the early deficit; 11 of Powell's 15 carries came in the opening half. Powell gained 60 yards on the ground, but saw a strange lack of usage in the passing game. He had just three targets, catching two of them for 14 yards. I don't understand this game plan, but once again, Bowles' hospitalization needs to be brought up as a possible explanation. ",
            "7": "No Jet eclipsed 30 passing yards. In fact, Marshall and Powell were the only players on the team to catch more than one pass. Marshall's two receptions went for just 28 yards. ",
            "8": "This game was not entertaining, so at least we were able to hear official Gene Steratore get caught with his mic on saying something very strange: Get a towel. Did you put any of that warm-skin s**t on your hands? I feel like that's something that has been said in Matt Millen's hotel room. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Packers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "25"
        },
        "comments": {
            "amount": "6",
            "1": "Aaron Rodgers told the media that his team was going to run the table. He's been backing that declaration up with some great play, and that continued in this game. Rodgers was on fire, and the Vikings, despite getting Harrison Smith back from injury, couldn't do anything to stop him. In fact, Rodgers was so hot that he accounted for four touchdowns by intermission. What's more amazing is that he had more touchdowns in the first half than incompletions (3)! <br. (3= 1= 19-of-22= 268= 8.6= <br= a= able= after= air= also= an= and= as= average= ball.= because= being= bit= breath,= but= by= collective= convert= cooled= danielle= down= down.= eric= fans= field= for= four= get= getting= had= half,= he= helped= his= holding= hunter= hurt,= in= intermission,= kendricks= later= moment= nifty= no= of= off= on= only= out= own.= packer= packers= passing,= per= play= play.= potential= rodgers= rushing)= sack= sack.= sandwiched= scary= second= showed= signs= team= the= their= there= third= to= took= touchdowns= undoubtedly= unreal= walk= was= were= which= while= yards=> Rodgers' final numbers were 28-of-38 for 347 yards and five touchdowns (4 passing, 1 rushing). He nearly had a sixth score, but Davante Adams dropped a ball in the end zone. If Rodgers keeps playing like this, it's going to be extremely difficult for anyone to beat the Packers. ",
            "2": "Congratulations if you started Jordy Nelson in your championship. Nelson was awesome, reeling in nine of his 11 targets for 154 yards and two touchdowns. Adams (4-44) and Richard Rodgers (2-20) were the others who scored. ",
            "3": "The Packers ran all over the Bears last week, but despite their big lead, Ty Montgomery was given just nine carries, which he turned into 23 yards. Montgomery also caught four passes for 17 receiving yards. ",
            "4": "Sam Bradford posted some big numbers in this game, but his output was a bit misleading. Bradford finished 34-of-50 for 382 yards and three touchdowns, but a big chunk of his yardage came on one play in the opening half when he hit Adam Thielen with a 71-yard bomb. Thielen beat the Packer defender with a double move, and I'm sure Green Bay was just utterly shocked that Bradford took a chance downfield. Bradford also compiled yardage in garbage time. Bradford made a number of mistakes, which is another reason why his stats were misleading. He began by missing Thielen for a touchdown on the second drive with a high throw. He then couldn't connect with an open Kyle Rudolph for a first down and followed that up with a delay-of-game penalty when he left the clock expire in the red zone. That 5-yard penalty proved to be huge, as the Vikings needed the yardage because Stefon Diggs was short of the first down on the ensuing catch. If that's not enough, Bradford was later charged with two fumbles. One was a botched snap, but the second was a strip-sack in which Bradford didn't feel the blind-side pressure from Clay Matthews. On another occasion, Bradford needed to convert a third-and-9, but threw a short pass that actually ended up being a loss of two yards. It was a pathetic display, emblematic of why Bradford has been a failure of a quarterback when he's been able to play. ",
            "5": "I gave congrats to Nelson owners. A mega congrats to the few who used Thielen. The slot receiver had a huge game, catching 12 passes for a whopping 202 yards and two touchdowns. He could've scored thrice, but Bradford missed him in the end zone. Thielen's output is a clear indicator of how horrible Green Bay's secondary is. Elsewhere in the Minnesota receiving corps, Stefon Diggs caught four passes for 29 yards and a touchdown. Kyle Rudolph, meanwhile, snatched six balls for 53 yards. ",
            "6": "With Adrian Peterson out, Jerick McKinnon (11-50) and Matt Asiata (6-34) shared the workload. Both were factors in the passing game; McKinnon and Asiata caught five and three passes for 35 and 30 receiving yards, respectively. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I doubt the Titans ever imagined that it would end like this. They dominated the Broncos and pulled an upset in Kansas City, and they were in control of their own destiny. Beating the Jaguars must have seemed like a given to them, especially following their blowout victory over Jacksonville back in Week 8. Not only did they suffer a loss, but they managed to watch their franchise quarterback get knocked out with a worrisome injury. The Jaguars dominated the game the entire afternoon, but the nail in the coffin for the Titans was Marcus Mariota's injury. Mariota was down for a while and had to be carted into the locker room. He couldn't put any pressure on his leg while getting onto the cart, and he was later diagnosed with a fractured fibula. It's a shame for the Titans, who had been enjoying a terrific season. Granted, they were probably going to lose, but they had no chance when Matt Cassel replaced Mariota. Mariota definitely was not on his A game prior to his injury. He failed to complete half of his passes, going 8-of-20 for 99 yards and a touchdown. On one sequence in the opening half, Mariota missed Rishard Matthews downfield on a slight overthrow after the receiver beat Telvin Smith; Mariota then threw wide of Delanie Walker for a substantial gain; after that, Mariota was almost picked by Jalen Ramsey with a late throw across the middle of the field. Ramsey would eventually get his turnover when he snatched a Cassel pick-six. ",
            "2": "The Titans couldn't move the chains because the tough Jacksonville run defense prevented DeMarco Murray (14-42) and Derrick Henry (4-13) from doing anything. Mariota didn't scramble much either, running just twice for three yards. ",
            "3": "Thanks to the struggles of Mariota and Cassel, no Titans player had more than 50 receiving yards. Harry Douglas (5-48) and Tajae Sharpe (3-48) led the way, while Matthews (3-31) and Walker (3-23) caught touchdowns. ",
            "4": "Moving on to the victors, teams typically rally around a new coach, and that's exactly what the Jaguars did with Doug Marrone replacing the utterly incompetent Gus Bradley. The Jaguars played with a tremendous amount of effort, while the Titans, fresh off emotional, difficult victories versus the Broncos and Chiefs, appeared to be sleepwalking, taking this game for granted. As a result, Jacksonville had its best performance of the season, finally displaying the potential the Jaguar truthers have been clamoring about all of these years. ",
            "5": "Blake Bortles had perhaps the best game of his career. He went 26-of-38 for 325 yards and a passing touchdown. He also caught a score from Marqise Lee on a trick play. Everyone was well aware of the struggles of Tennessee's secondary, but this is a new low. Being incapable of stopping Bortles, new coach or not, is absolutely inexcusable, and it's clear that the Titans need to address their defensive backfield this offseason. Here are that Tennessee will consider. ",
            "6": "A major reason why Bortles was so successful in this game was Allen Robinson's effort. Robinson had been dogging it all year, but finally appeared as though he was trying. Robinson caught nine passes for 147 yards, including an amazing, one-handed, back-shoulder catch while falling out of bounds. The only thing that was missing was a touchdown, which he almost snared, but the ball just barely hit the ground. Lee (3-37) snatched Bortles' sole score. ",
            "7": "Chris Ivory handled most of the workload, gaining 45 yards and a touchdown on 14 carries. T.J. Yeldon had just two attempts because he hurt his ankle. Ivory made more of an impact in the passing game, snatching four balls for 69 receiving yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Redskins' brutal and embarrassing loss Monday night means that they need a lot to happen to make the playoffs. This includes taking care of business with two victories over their own, and they were able to do just that, thanks to numerous big plays. It seemed like every time the Redskins were faced with a third-and-long situation, they converted. Not only did they move the chains, but they usually hit a huge play. For instance, the Bears had Washington way backed up and bound to force a punt to set up great field position, but Kirk Cousins was able to hit DeSean Jackson with a long pass. Jackson also caught a 57-yard bomb because of a blown coverage. On a third-and-long, Jackson drew a deep pass-interference flag. The Bears had the Redskins pinned at the 1- and 9-yard lines on consecutive drives in the second quarter, but the Redskins were able to score on both possessions, thanks to how explosive their offense was on this afternoon. This was surprising, to say the least. Not because of Cousins' struggles on Monday night, but because of how well Chicago's defense has been playing most of the year. The Bears had surrendered 19.2 points per game over the past five weeks, yet they allowed 24 in the first half alone! Sure, Leonard Floyd was carted off, and Pernell McPhee was knocked out with a shoulder, but the Bears had gotten stud linebacker Jerrell Freeman back after his extended absence. ",
            "2": "Cousins finished 18-of-29 for 270 yards and a touchdown. He didn't begin the game very well, overthrowing Ryan Grant for a potential touchdown, but he caught fire and was unstoppable in the final three quarters. Cousins was also a force on the ground, scrambling five times for 30 rushing yards, and he was also able to trot into the end zone twice. ",
            "3": "Jackson had a huge afternoon. He caught five passes for 114 yards, and he also drew a deep interference flag. Pierre Garcon (4-94) was the only other Redskin to accumulate more than 25 receiving yards, as Jordan Reed was out. Vernon Davis, who caught only one pass for 13 yards, had a brutal drop inside the red zone on a fourth-down attempt. ",
            "4": "Robert Kelley had a scare in this game when he appeared to suffer an injury, but he was able to return to action. Kelley gained 76 yards on 19 carries, but was vultured by his own quarterback. Kelley didn't lead the Redskins in rushing; tha was Mack Brown, who tallied 82 yards on eight attempts. Brown, who was very impressive in the preseason finale, scored on a 61-yard burst at the end of regulation. ",
            "5": "Moving on to the Bears, if there's at least one silver lining for this embarrassing loss, it's that they discovered for certain that Matt Barkley is not the quarterback of the future. Barkley put together some solid performances leading up to this contest, but he unraveled with a meltdown. Barkley threw five interceptions in this game, most of which were his fault. The first was a poor decision, as Barkley took a deep shot into triple coverage. The second occurred because Barkley was in full panic mode, launching a pass as he was in the grasp. The third was the only one that wasn't his fault, as it was off a deflected ball. The fourth was an atrocious throw; Alshon Jeffery was wide open for a significant gain, but Barkley fired the ball way over his head. The fifth pick was a throw that Barkley fired off his back foot. Barkley finished 24-of-40 for 323 yards, two touchdowns and the five picks. He made some nice throws in this game and was able to move the chains somewhat successfully throughout the afternoon, but his mistakes absolutely crushed his team. ",
            "6": "Barkley once again showed that he's more comfortable throwing to Cameron Meredith than Jeffery. Meredith caught nine of his 12 targets for 135 yards and a touchdown, while Jeffery converted on only half of his 10 targets. His five receptions went for 92 yards. Jeffery limped off the field at the end of the opening quarter, but he turned out to be OK. ",
            "7": "Jordan Howard was also knocked out of the game temporarily. However, he was able to return quickly enough to save a potential Barkley interception from being a pick-six with a great effort on a tackle. Howard ran well once again, gaining 119 yards on 18 carries. It could've been a better afternoon, but a 16-yard burst was negated by a hold, and a touchdown was vultured by Jeremy Langford. Also, the Bears couldn't stick with the run because they trailed throughout most of the afternoon. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Browns",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Browns finally won a game, preventing them from being the second team in NFL history to go 0-16. That was nice, but let's not forget that the outcome of this contest is also detrimental for Mike McCoy's job security. San Diego's ownership doesn't like to fire anyone, but it could be so utterly embarrassed by this performance that it could force its hand. There's no excuse for losing to an 0-14 team that hasn't been competitive whatsoever since losing some key players to injury. The Chargers have constantly found ways to lose under McCoy, and that was once again the case in this game. The Chargers outgained the Browns by 100 net yards and averaged 1.7 more yards per play, but made too many mistakes. Philip Rivers was picked off on an underthrown pass; there was a botched snap toward the end of the game; and then blocked and missed field goals did San Diego in. ",
            "2": "Rivers finished 24-of-47 for 321 yards, two touchdowns and the aforementioned interception. Rivers dealt with accuracy issues throughout the afternoon, though he did nearly throw a third touchdown, but Jamar Taylor broke up a pass to Tyrell Williams in the end zone at the very last second. ",
            "3": "Antonio Gates enjoyed a great matchup versus a defense that has struggled to defend tight ends. Gates caught eight passes for 94 yards and a touchdown. The Browns inexplicably left Gates wide open in field-goal range at the very end, but it didn't matter because Josh Lambo choked. Elsewhere in the passing game, Williams (4-64) snatched Rivers' other touchdown, while Dontrelle Inman proved to be inefficient, hauling in three of his 10 targets for 44 yards. Travis Benjamin (3-75) looked healthier, reeling in a 50-yard reception. ",
            "4": "Kenneth Farrow had just nine carries because he left the game with a shoulder injury. He gained 28 yards in the process, and he also caught four passes for 29 receiving yards. Ronnie Hillman took over for Farrow and was completely ineffective, mustering just seven yards on eight tries. ",
            "5": "San Diego incurred some injuries in this game. It lost center Matt Slauson, while Jaleel Addae and Denzel Perryman actually got hurt on the same play, and Perryman was carted into the locker room. This was part of the reason why the Chargers struggled to stop Cleveland, though some credit needs to be given to Robert Griffin, whom I jokingly compared to Johnny Hekker because the Rams' punter's career completion percentage was better than Griffin's this year. Griffin finally played well, going 17-of-25 for 164 yards. He also scrambled six times for 42 rushing yards. Unfortunately for Griffin, he was knocked out of the game when he was sacked for the seventh time. Cody Kessler had to enter, and he completed two of three passes for 11 yards. It's hardly a surprise that Griffin got hurt, as his durability has been a major issue for him throughout his career. Griffin was pretty roughed up in this game, as Joey Bosa enjoyed a terrific performance. Bosa sacked Griffin twice, though he was unjustly called for roughing on one occasion. It was a clean hit, but the penalty didn't amount to anything for the Browns. ",
            "6": "Though Griffin was better than usual in this game, he still couldn't connect with Terrelle Pryor, who caught just three passes for 36 yards. Gary Barnidge (5-42) led the Browns in receiving. ",
            "7": "Isaiah Crowell gained just 54 yards on 16 carries, but he managed to score twice. Duke Johnson (7-28) got pretty banged up twice in this game. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> Congratulations to the Panthers for their Week 16 vacation. They actually arrived to the stadium physically, but they were completely absent mentally. They put forth zero effort into this game. Even the FOX announcers yelled at the Panthers for a lack of effort. They did this multiple times throughout the afternoon, even laughing at Carolina's tackling efforts, saying that this is not two-hand touch. It'd be nice if a team announced that it wouldn't be trying at all ahead of time, so suckers like myself wouldn't bet so heavily on them. The Falcons set themselves up to clinch the NFC South as Matt Ryan gave further evidence of his MVP candidacy with a dominant performance against Carolina. Conversely, Cam Newton was terrible versus Atlanta. His field vision was horrible, as he stared down receivers, missed other wideouts open downfield, and let poor footwork lead to inaccurate passing. Atlanta's offense, on the other hand, was clicking on the ground and through the air, as the Falcons illustrated they will be a very tough opponent in the playoffs. Ryan is playing the best football of his career and has an excellent supporting cast. NFC defenses will face a tough challenge with the Falcons in January. ",
            "2": "On the opening drive, Ryan ripped the ball down the field, distributing it to a variety of weapons before throwing open tight end Josh Perkins (2-34-1) over Thomas Davis for a 26-yard touchdown. Carolina started moving the ball, but then rookie Brian Poole intercepted Cam Newton with a return close to midfield. The Falcons turned that into a 51-yard field goal for Matt Bryant and a 10-point lead. Ryan set up Bryant for a 48-yard field goal shortly later. Newton really struggled in the first half. On the the Panthers' best drive, Newton had Kelvin Benjamin wide open for an easy touchdown, but overthrew his big receiver and had to settle for a field goal. Late in the second quarter, Ryan scrambled near the goal line and found backup tight end D.J. Tialavea wide open for a touchdown. Newton stared down another receiver with about 90 seconds remaining in the half, and Falcons cornerback Jalen Collins broke on the ball in zone coverage to pick off the pass. He then bolted down the field to Panthers' 21-yard line, but the Falcons had the field goal blocked by Carolina rookie Vernon Butler. Atlanta took a 20-3 into the half. Newton was horrible in the first half, going 6-of-18 for 58 yards with two interceptions. Atlanta added a third-quarter field goal before Newton finally made a good throw as Benjamin (4-63-1) went over a corner for a 26-yard touchdown catch. Entering the fourth quarter, the Falcons were up 23-13 when Ryan converted a third-and-21 with a pass to an uncovered Tevin Coleman. Coleman then used the next play to run virtually untouched for a 55-yard touchdown, thanks to a pathetic tackling effort from Tre Boston and James Bradberry. The teams then traded field goals before the clock ran out on Carolina. ",
            "3": "Ryan was 27-of-33 for 277 yards with two touchdowns. Julio Jones made four catches for 60 yards. ",
            "4": "Tevin Coleman ran for 90 yards and a touchdown on nine carries while catching three passes for 45 yards. Devonta Freeman (13-53 rushing, 8-35 receiving) chipped in as well. ",
            "5": "Newton was a dreadful 18-of-43 for 198 yards with one touchdown and two interceptions. He missed open receivers for points due to horrible field vision. ",
            "6": "Jonathan Stewart led Carolina with 50 yards on 11 carries. Benjamin (4-63-1) led Carolina in receiving. Olsen (6-59) became the first tight end in NFL history to record three straight 1,000-yard seasons. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "31"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Considering that this was the only game I had a chance of winning in the early session, I nearly had like five separate heart attacks when the Bills charged back, forced overtime and then drove down the field on the first possession of overtime. I'm somehow still alive. ",
            "2": "At one point, it looked like this game was going to be a romp for the Dolphins. Then, the Bills made a pretty huge comeback at the end of regulation. Though the Dolphins managed the victory, it came at the very end of overtime, and they were in danger of tying their rivals. The end of the game was quite entertaining. Out of nowhere, the Bills pieced together a terrific final drive. They had some good offensive momentum, but their ability to get down the field did not come from their passing offense. Instead, Buffalo relied on running the ball to move toward the end zone. The Bills then were able to utilize a flea flicker to get to the red zone before a fourth-down touchdown pass to Charles Clay gave them a three-point advantage. Then, the Dolphins drove to kick a field goal and tie things up. The overtime saw the teams exchange a couple of meaningless possessions, including a missed field goal by Bills kicker Dan Carpenter. Then, with four minutes left, the Dolphins got a huge run from Jay Ajayi to get into scoring range. They then ran the clock down and attempted a game-winning field goal. It was good from Andrew Franks. ",
            "3": "Tyrod Taylor put together what was a very solid performance in the passing department. After starting the game looking shaky, Taylor slowly built up his confidence as the contest went along. In short, he kept getting better as time went on, and most notably, his deep accuracy improved. After missing several passes early on, Taylor was able to create a strong connection with Sammy Watkins and make some of the downfield throws. Overall, Taylor went 26-of-39 for 329 yards and three touchdowns. He really helped to lead the team's comeback, and if he plays like he did in the second half, he can be a franchise quarterback. His mobility really helps him, and it was a huge reason that the Bills were able to make the comeback. My theory on why Taylor struggled early is the rumors that have been swirling around him. Rex Ryan may not be returning as the head coach, and if he is not back, the Bills may opt to make a change at quarterback. Taylor is probably thinking about that possibility and may have been trying to force it too much. That would explain why he struggled. He was overthinking everything. ",
            "4": "As usual, Buffalo's receiving attack generated a couple of strong performances from its top receivers. Leading the way on Saturday was Sammy Watkins (7-154, 1 TD), who put together a strong performance and really established himself as a downfield threat. If he is fully healthy in 2017, he could be a massive weapon for the Bills. The other top receiver for Buffalo was Charles Clay. The tight end, going against his former team, saw 10 targets and snatched eight of them for 85 yards. He also caught two touchdowns and should be an athletic red-zone weapon. ",
            "5": "Despite the strong performance from the passing game, the Bills' rushing attack was really what carried them. Once again, LeSean McCoy put together an absolutely stellar showing. He saw another 24 carries for 128 yards and parlayed one of the carries into a touchdown. He was able to follow his blockers very well and used his shifty running style to rip off chunks of yardage. Mike Gillislee also helped to contribute to Buffalo's success on the ground. He looked strong in his role as a backup, and he had a big role in the go-ahead drive. In overtime, Gillislee broke a huge run that put the Bills into scoring position. Had Carpenter not missed a field goal, the Bills would have had a chance to shut down the Dolphins on defense to possibly win. Overall, Gillislee racked up 91 yards on 11 carries. Taylor totaled 60 yards on 12 scrambles of his own. ",
            "6": "At the end of regulation, Rex Ryan made a scene. It appeared that both Corey White and Ryan had tried to call a time out prior to Andrew Franks' game-tying field goal. However, Ryan called time out simultaneously with the snap, so the officials rightfully did not call the time out. ",
            "7": "For the Dolphins, this was another solid showing for Matt Moore. The veteran quarterback was a solid game-manager, going 16-of-30 for 233 yards, two touchdowns and a pick. The interception was very costly, as it came in the end zone and cost the team points heading into halftime. That said, Moore was able to keep Miami's offense moving, and he opened things up for the running game. ",
            "8": "Once again, the Dolphins rode Jay Ajayi to a huge performance. The second-year star saw 32 carries and turned them into a ridiculous 209 yards. He also ran for a touchdown. Ajayi looked very strong, yet also displayed a lot of speed. He was able to rip mercilessly through the Buffalo front, thanks to some poor tackling by the Bills. Change-of-pace back Kenyan Drake also had a good game for the Dolphins. He saw four carries for 56 yards, but most of his yardage came on a 45-yard touchdown. Drake looked to be wrapped up, but he escaped on the play and ran out to the sideline. None of the Bills could catch him as he scored. ",
            "9": "In the receiving corps, DeVante Parker (4-85, 1 TD) and Kenny Stills (3-35, 1 TD) led the way for the Dolphins. Parker had a phenomenal touchdown grab that saw him basically run through the defender on his way to the end zone. Meanwhile, Stills had a nice touchdown grab, and he continues to grow in Adam Gase's offense. Jarvis Landry (3-29) did not do much during the contest. ",
            "10": "Final Note: The Dolphins look like a team that could be dangerous in the postseason. The AFC teams have to make sure that they do not underestimate Miami. Even without Ryan Tannehill, the Dolphins have proven that they can win. The best teams in the conference should be very afraid. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "25"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> My condolences to the Raider fans. You've suffered this long, and now you'll finally be in the playoffs - but with Matt McGloin as your quarterback. Yes, the football gods are cruel, but I can sympathize, given that I lost like a billion units in Week 16. ",
            "2": "",
            "3": "One wouldn't have thought that this game would throw the entire AFC playoff picture into a huge upheaval, but that was the case as MVP candidate Derek Carr suffered a nasty looking leg injury in the fourth quarter. The Raiders were up 33-14 at the time of Carr getting his right leg turned and rolled up on by Colts edge rusher Trent Cole. Carr limped off while not putting any weight on the leg and then was carted into the locker room. He was diagnosed with a fractured fibula, so Oakland will have to count on Matt McGloin moving forward. For the Colts, this loss put a nail in the coffin to their slim playoff hopes. ",
            "4": "In the first quarter, the Raiders snuffed out a fake field goal to take away points from the Colts. That stop went nowhere before a punt, but Oakland was set up near midfield after Andrew Luck got crushed by three Raiders, leading to an errant throw that was intercepted by Nate Allen. Pass interference by the Colts near the end zone on a third down during the next drive set up Oakland for points, as Carr took advantage with a 1-yard touchdown pass to Andre Holmes (3-33-1). The Colts answered with a drive into Oakland territory that ended with Donte Moncrief (2-30-1) getting open in busted coverage for a 24-yard touchdown reception. Undaunted, the Raiders answered, as Carr threw a beautiful pass to Michael Crabtree (7-90) for 35 yards into Colts' territory. Clive Walford (2-20-1) caught a short pass a few plays later, and T.J Green missed the tackle to let Walford dart into the end zone for the a 5-yard score. The Colts moved back into Oakland territory, but Pro Bowl safety Reggie Nelson intercepted Luck in the end zone. Carr took advantage by lofting a pass into Amari Cooper for a 34-yard gain. Carr soon finished the drive with a 4-yard touchdown pass to Jalen Richard. The Raiders took a 19-7 lead into halftime. To start the third quarter, the Raiders' offensive line dominated the Colts' front seven to open huge rushing lanes. That led to DeAndre Washington ripping off a 22-yard touchdown run. On the ensuing Colts possession, Malcolm Smith forced a fumble from Frank Gore (13-73), and the Raiders recovered it at the Indianapolis 38-yard line. A few plays later, Washington bolted for another 22-yard scoring run as he was untouched. That pushed the Raiders' lead to 33-7. The Colts finnaly got going again with a pass to T.Y. Hilton going for 39 yards to the 5-yard line. That set up a short touchdown pass from Luck to Robert Turbin. Early in the fourth quarter, Carr suffered his injury, leaving his team visibly crushed. Luck then moved the ball down the field before running a short touchdown into the end zone and converting a two-point conversion to Hilton. At 33-22, the Colts got the ball back and promptly Luck hit Hilton on the run for 39 yards. The Colts settled for a field goal to make it 33-25 with 2:30 remaining. McGloin made a great throw to Cooper to get a first down on a third-and-long conversion just before the 2-minute warning. That allowed the Raiders to run out the clock on the Colts. ",
            "5": "Carr was 20-of-30 for 228 yards with three touchdowns prior to the injury. Cooper had four catches for 72 yards. ",
            "6": "DeAndre Washington was excellent for the Raiders with 12 carries for 99 yards with two scores and an 18-yard reception. Jalen Richard had 66 yards on six carries with three receptions for 13 yards and a touchdown. ",
            "7": "Luck was 19-of-29 for 288 yards with two touchdowns and two interceptions. The Colts' offensive line didn't give up a sack, but that was because of Luck. Indianapolis' blockers really struggled with Khalil Mack and Bruce Irvin, allowing Luck to take a lot of hits and forcing him to throw before he was ready. ",
            "8": "Gore notched 13 carries for 73 yards. Hilton had four receptions for 105 yards with a two-point conversion. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> There were so many injuries this week that it makes me wonder if it's a result of teams not practicing as much because of the short week. The Seahawks were definitely impacted, as Kam Chancellor was knocked out. I don't get why all of these games were on Saturday, by the way. I always figured that Christmas Eve was more important than Christmas Day. Once the presents are open, what's there left to do? ",
            "2": "What a game. It looked like the Cardinals had this wrapped up, leading by 10 points in the fourth quarter. But then, the Seahawks strung together an offensive showcase and looked like they were in line to get win the 10th of their season. Of course, it looked like the Seahawks were going to win. They drove for a touchdown with just a minute left to tie the game, only needing an extra point to take the lead with one minute remaining. And, of course, Steven Hauschka missed. Left with only one minute until the end of regulation and the prospect of overtime, the Cardinals moved down the field thanks to David Johnson. He caught a couple of passes to get the team into field-goal range. Chandler Catanzaro tried to kick the game winner. His 43-yarder was good, and that ended the contest. Though the win will hurt their draft positioning, the Cardinals have to be happy with their performance. They played a complete game against one of the best defenses in the NFL, and Carson Palmer put together a solid showing. ",
            "3": "Palmer compiled one of the best games of his entire season. He went 16-of-26 during the contest for 284 yards and a touchdown. Palmer was very accurate and was able to succeed despite seeing a lot of pressure. For the first time all year, he looked entirely comfortable in the pocket, and he was able to show his arm strength as well. Perhaps the best trait about Palmer is that he knows when to target certain players. He did not try to force anything today, and that was apparent by the fact that he did not log any turnovers. Palmer should build on this skill for next season, and perhaps he will be able to do that and get the Cardinals back to the postseason. ",
            "4": "In the receiving corps, it was clear that the Cardinals were missing Michael Floyd. Though he had not been a major factor during the season, the team lacked a de facto No. 2 option. The leading receiver for the Cardinals was actually J.J. Nelson. The speedster had an early 80-yard touchdown catch, and later used his speed to nearly score another later on. He finished the day with three catches for 132 yards and appears to have taken over John Brown's role. Speaking of Brown, he only logged a single catch for 12 yards. Larry Fitzgerald (4-31) was also a major disappointment, though he dealt with Richard Sherman for a majority of the day. Fitzgerald also caught a key pass to set up Catanzaro's game winner. ",
            "5": "David Johnson was absolutely terrific on the ground. Despite being stopped behind the line a number of times and committing a horrendous fumble, the second-year back continues to be one of the best dual-threat players in the league. During Saturday's contest, Johnson saw 28 carries and turned them into 95 yards. He also reeled in four passes for 41 yards. Almost all of that came on the final drive in regulation. He had an impressive burst in the fourth quarter to help set up a Cardinals scoring drive, but his most impressive work came on the goal line. Overall, Johnson was able to score three touchdowns on Saturday. That not only gave his fantasy owners some holiday cheer, but it really allowed the Cardinals to do as they pleased in the red zone. Johnson was able to power through the tough Seahawks front every time the team got close. Even when he was stuffed at the line, his team kept coming back to him. The coaching staff obviously has faith in Johnson, and that will likely make him the top fantasy player for all formats next season. ",
            "6": "For the Seahawks, this performance was a mix of highs and lows. In the first half, they could do nothing on offense, but played great defense. It was the exact opposite during the second half. One consistent aspect for them was the play of their starting quarterback Russell Wilson. Wilson put together a stellar stat line for the Seahawks, and his play reflected that. Wilson went 29-of-45 for 350 yards and four touchdowns. He not only led the team in passing yards, but he was their leading rusher as well - 10 carries for 36 yards. On the game-tying drive, Wilson orchestrated an excellent offensive sequence that featured him entirely. Wilson was able to move around the pocket and correctly diagnose all of his reads. He was able to isolate the matchups that he wanted to target, all while avoiding targeting Patrick Peterson too much. Any other week, this type of performance would have won Wilson the game. This week, it did not. Still, if he plays like this in the playoffs, the team will be in excellent shape. ",
            "7": "That said, Seattle's running attack will not be in good shape. Thomas Rawls was supposed to lead the way for the team. That is why they waived Christine Michael. Instead, Rawls put together another unimpressive performance, carrying the ball eight times for eight yards and dropping a pass. He never saw the field in the second half due to a shoulder injury. Moving forward, it would behoove the Seahawks to use Alex Collins more. Collins took over for Rawls and made a few nice runs against the Cardinals' stout front. The rookie saw seven carries and turned them into 28 yards. He has a lot of potential, so perhaps he and C.J. Prosise will see more action, provided that the latter is healthy. ",
            "8": "Seattle's receiving game was controlled by Doug Baldwin. The Stanford product caught a whopping 13 passes on 19 targets, totaling 171 receiving yards. The stellar wideout also made a nice touchdown grab, where he caught the pass and then juked the defender, Brandon Williams, before running all the way to the end zone. Baldwin will continue to be Wilson's top receiver. Elsewhere, Jermaine Kearse (4-37, 1 TD) logged a nice game for the Seahawks. Jimmy Graham and Paul Richardson also caught touchdowns. One of the biggest disappointments was that Tyler Lockett (2-38) had to be carted off the field in an air cast. The second-year player reportedly broke his leg. Final Note: Many media pundits have made a big deal about how little the Seahawks spend on their offensive line in comparison to how productive they are. In some weeks, they play well, but this was not one of them. The unit surrendered six sacks to the Cardinals. Left tackle George Fant had major issues with Chandler Jones, while Markus Golden got two sacks working mostly against Garry Gilliam. Calais Campbell gave the interior linemen absolute fits. The Seahawks need to upgrade their offensive line, or they will have trouble getting back to the Super Bowl. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I guess we can stop it with this silly narrative that the Buccaneers have an improved defense. No. They still suck. And why the hell is Chris Conte playing? Wasn't Tampa better when Conte got hurt and had to miss some time? Why would the Buccaneers use him at all? He's horrible. ",
            "2": "These two teams met just two weeks ago in Tampa Bay, in a game that the home team slowed down tremendously. This kept Drew Brees off the field, and when he was on the field, he threw no touchdowns and was picked off three times as the Buccaneers held the best offense in the league to just 11 points on their way to the win. This week, the Buccaneers headed to the Superdome where Brees has historically been much better than on the road. Could Tampa Bay slow him down again? Well, the answer is not really, but Mark Ingram was the motor of the Saints' offense, as they played balanced football, with 34 passing attempts and 30 rushing attempts. ",
            "3": "New Orleans struck first with a 6-yard touchdown run by Mark Ingram, who last week was extremely unhappy that he was on the sideline near the goal line and Tim Hightower was able to score twice in his stead. There was no doubt that Ingram wanted to prove himself, and a score from six yards out did stop any thought of bringing Hightower in for a goal-line play. The Buccaneers struck back in the second quarter with a 12-yard pass from Jameis Winston to Cameron Brate for a touchdown, the big tight end's eighth of the season. Brate has been incredibly steady this year and appears to have solidified his role with this team going into next season. Unfortunately, Brate took a hard hit in the back in the third quarter and couldn't return to the game. ",
            "4": "When these teams last met, it was Brees turning the ball over, but this time it was Winston, who was intercepted twice by Jarius Byrd. Winston's first interception came early in the third quarter, which the Saints capitalized on quickly with Ingram's second rushing touchdown, a 14-yard score on the next play, which gave the Saints a 20-7 lead. The Buccaneers rallied back with a 10-play, 75-yard drive that ended with a Jacquizz Rodgers 3-yard touchdown run. Why was Rodgers the goal-line back you ask? Well, Doug Martin was a healthy scratch after starting the last six games after returning from his hamstring injury. There was no real reason given for his absence, but he is healthy and the coach didn't want him playing, so Rodgers got the call and had a decent game. The two teams traded touchdowns again to end the third quarter, with an 11-yard touchdown pass from Brees to Travaris Cadet and then a 34-yard pass from Winston to Mike Evans. So after three quarters, the Saints held a 28-21 lead. The Buccaneers had chances in the fourth quarter, but Winston was without Brate, which put the second-year signal-caller in a tough place, especially as the field shrunk the closer he got to the end zone. ",
            "5": "Winston has shown improvement this season, and you can tell a top quarterback is just waiting to come out, but he's still a bit erratic. Winston also doesn't have many weapons to throw to. The Buccaneer loss gives the Atlanta Falcons the NFC South. Tampa Bay's only chance now is to beat the Panthers next week and have Washington lose to the Giants and Green Bay to lose to Detroit. A number of other things need to happen as well, including the 49ers beating the Seahawks. ",
            "6": "The Saints are always at their best as a team when they are balanced, as seen over their last eight games, when Ingram tops 14 carries they've won. The Saints, however, were eliminated from any chance of getting in the playoffs despite their win. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "Though this game held zero playoff implications, this NFC West battle had some importance in the wake of the Cleveland victory. The 49ers moved into position to earn the top pick of the draft, so all they needed to do in order to clinch the No. 1 selection was to lose out. In typical 49er fashion, they managed to ruin a good thing, prevailing over the Rams in an absolutely Pyrrhic victory. For a long while, it didn't appear as though the 49ers would win. The Rams led 14-7 or 21-7 for the majority of the contest, though neither team was moving the chains very much. These teams combined for 13 consecutive punts in the second and third quarters, as they were both guilty of some absolutely miserable quarterbacking. Of course, that was expected of Colin Kaepernick, but the Rams have to be very discouraged by what they saw out of Jared Goff. Goff failed to complete half of his passes against one of the worst defenses in the NFL, going 11-of-24 for only 90 yards, one touchdown and two interceptions. The 49ers already were devoid of talent, but they lost talented linebacker Gerald Hodges on top of that. Yet, Goff failed to do much in this easy matchup. He had a couple of positive moments, including a fourth-and-1 conversion that eventually led to a Todd Gurley score, but the negatives far outweighted the positives. Goff's two interceptions were both ugly. The first occurred at the beginning of the afternoon, when he threw a ball right to Tramaine Brock. I can't explain the throw any better. Goff hurled it right to the San Francisco corner. Goff's second pick ended the game. The Rams had great field position after squandering their lead, but Goff ruined it by telegraphing a bad throw. Goff could've been intercepted on some other occasions as well; right before halftime, he was nearly pick-sixed on a bad throw on a third-and-5 to Tavon Austin. Brock nearly had another one, but didn't see the ball. Goff is horrible so far, and if he doesn't progress at all next year, the Rams will have to declare him a sunk cost and just give up on him. That may seem like it's too soon, but Goff doesn't appear to have the stuff of an NFL quarterback. He might just be the worst quarterback in the entire NFL right now. ",
            "2": "Despite the miserable quarterbacking, Kenny Britt managed to eclipse 1,000 receiving yards on the season, becoming the first Ram to do so since Torry Holt in 2007. Britt, however, didn't do much, catching just one pass for 15 yards. He was knocked out of the game in the third quarter with a shoulder injury. As a result, Lance Kendricks led the Rams in receiving with a meager 36 yards. ",
            "3": "Todd Gurley was expected to have a huge game versus the 49ers' horrible rush defense, but that never materialized. Gurley finished with just 67 yards on 23 carries. Gurley did manage to score, but he didn't have much blocking, and even when he did, he failed to show the same burst he possessed as a rookie. The FOX announcers commented about this as well. Gurley's inability to pick up chunks of yardage is one of the reasons why the Rams failed to hold on to their lead. ",
            "4": "The other primary reason for this was that the Rams had yet another epic collapse. We've seen this before, as this contest mirrored the Rams-Dolphins affair from back in Week 11. The Rams led the entire game, and Miami had been doing nothing, but the defense had a meltdown, surrendering two touchdowns in a matter of minutes. That's exactly what happened in this game, as the 49ers roared back from down 21-7 to take a lead following a two-point conversion. Colin Kaepernick was brilliant on the final two possessions, but I have to think that it had more to do with the Rams collapsing because Kaepernick really struggled for most of the afternoon. Some of that was his offensive line's inability to block, but Kaepernick also had some pretty poor moments. He floated an interception on a high throw in the early going, leading to a Rams touchdown on a Tavon Austin run. Kaepernick then had his tight end open for a sizable gain, but didn't pull the trigger for some reason. Later, he overthrew Jeremy Kerley for a potential score. Still, he was able to go 28-of-38 for 266 yards, three touchdowns (2 passing, 1 rushing) and the pick. ",
            "5": "Kaepernick threw exclusively to Rod Streater (6-63) and Kerley (5-62) during his fourth-quarter comeback. Streater scored once, as did Carlos Hyde. ",
            "6": "Speaking of Hyde, the tough runner exited the game in the third quarter when he suffered an injury on what appeared to be an incompletion. The Rams challenged, and it was ruled a lost fumble. Hyde finished with just 38 yards on 13 carries, though he did reward his fantasy owners with a receiving touchdown. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Texans",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Texans had gone through way too much agony with Randy Bullock, that if he had converted a field goal at the final seconds, numerous fans may have literally died of depression. Bullock, however, whiffed on his 43-yard try, which gave the Texans the victory. Thanks to Tennessee's loss to Jacksonville, Houston clinched the AFC South. That said, this win was certainly an adventure. The Texans didn't score at all in the opening half, generating just 34 net yards of offense. They averaged just 1.5 yards per play, an embarrassing figure, to say the least. Tom Savage was a mess. He held on to the ball too long twice, taking sacks as a result. He also threw way behind Will Fuller on a third down. I thought there was a chance Bill O'Brien could pull Savage in favor of Brock Osweiler, given that Savage was just 2-of-7 for only 13 yards at halftime. However, the Texans were able to generate offense following the break. Savage was 16-of-22 for 163 yards in the second half. He was suddenly accurate, delivering strikes on the money. His numbers could've been even better, but DeAndre Hopkins dropped a pass. Savage's only blemish after intermission was a near-interception by Karlos Dansby. Savage finished 18-of-29 for 176 yards. Credit O'Brien for sticking with his young quarterback, as moving back to Osweiler might have been crushing for the team. Still, Savage needs to improve for the Texans not to get blown out of the water in their opening-round playoff matchup. ",
            "2": "Hopkins had a rough evening. He led his team with 43 receiving yards, but he dropped a pass and was flagged twice for offensive pass interference. C.J. Fiedorowicz (4-42) and Will Fuller (3-39) were next on the stat sheet. The former dropped a pass in the first half, while Fuller drew a pass-interference flag. ",
            "3": "With Lamar Miller out, Alfred Blue handled all but two of the carries. He gained 73 yards and a touchdown on 21 attempts. ",
            "4": "The Bengals, meanwhile, didn't appear to have much of a chance heading into this game because they were missing A.J. Green, Tyler Eifert and Vontaze Burfict. Andy Dalton wouldn't have any of his weapons, and as with the Texans, Cincinnati struggled to do anything offensively until the very end of the opening half. In fact, the Bengals couldn't get anything going whatsoever outside of the end of both halves, save for an 86-yard touchdown to Brandon LaFell that came out of nowhere. LaFell took a short pass and went the distance, thanks to a horrible angle by Andre Hal. Dalton finished 28-of-41 for 268 yards, one touchdown and an interception, but if you take out that LaFell score, he would've thrown for just 182 yards on 40 attempts, good for a 4.55 YPA. It's difficult to criticize Dalton, however, because he was playing with a skeleton-crew offense. ",
            "5": "LaFell naturally led the Bengals in receiving, catching six passes for 130 yards and his long touchdown. No one else registered more than 40 receiving yards. Tyler Boyd was a disappointment, logging just four catches for 25 yards. He was responsible for Dalton's interception, as the ball popped right out of his hands and into the arms of a Texan. Houston couldn't do anything with the turnover, however. ",
            "6": "Jeremy Hill was an even greater disappointment, logging just eight yards on seven carries. He didn't catch a pass for some reason. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "The winner of this great rivalry would almost certainly claim the AFC North, and for a while, it appeared as though it would be the Ravens. They trailed in the early going, but took a commanding 20-10 lead in the fourth quarter. The Steelers, however, put together two amazing drives after that to go up 24-20. Baltimore marched down the field and ultimately reached the end zone on a terrific power run by Kyle Juszczyk. Pittsburgh had just one more chance with 1:25 remaining, and they used up all but nine seconds. Ben Roethlisberger hit Antonio Brown on a pass short of the end zone. Had Brown been tackled in the field of play, the clock would've expired, but Brown was able to reach the ball over the goal line for the decisive touchdown. Roethlisberger struggled in the early going, but was simply amazing in the fourth quarter. How does 14-of-17 for 164 yards and two touchdowns sound? Oh, and two of his three incompletions happened to be spikes to stop the clock on the final possession! The Ravens had no chance of restricting the red-hot Roethlisberger, especially without top cornerback Jimmy Smith to cover Brown. Overall, Roethlisberger finished 24-of-33 for 279 yards, three touchdowns and two picks. If you don't feel like doing the math, Roethlisberger was 10-of-16 for 115 yards, one score and two interceptions entering the final frame. There were some things that weren't his fault, such as a long pass to Brown being negated by obvious offensive pass interference, but Roethlisberger was definitely to blame for his dual picks. The first was an overthrow in his own territory, while the second was telegraphed, allowing C.J. Mosley to jump the route. The interceptions led to 10 Baltimore points, but it easily could've been 14 had Kenny Waller not dropped a touchdown. ",
            "2": "Speaking of Brown, he was quiet for most of the evening, but came up big on the final drive. He managed to convert 10 of his 11 targets for 96 yards and a touchdown. Roethlisberger also enjoyed throwing to Eli Rogers (4-84) and Jesse James (4-49). Xavier Grimble and Le'Veon Bell snatched Roethlisberger's other scores. ",
            "3": "Bell caught three passes for 15 yards, but did most of his damage on the ground. He gashed the Ravens, who typically have a strong run defense, gaining 122 yards and a touchdown on 20 carries. ",
            "4": "The Ravens, meanwhile, had a great performance from Joe Flacco. As with Roethlisberger, the Baltimore quarterback began slowly. He threw a Sam Bradford-type short pass on a third-and-6 on one occasion, and then he fired behind Dennis Pitta inside the 5-yard line. However, he caught fire before Roethlisberger managed to do so. He did this in the third quarter, and as a result, he managed to go 16-of-22 for 125 yards, one touchdown and a meaningless interception following intermission. Flacco's final numbers looked like this: 30-of-44, 262 yards, one touchdown and the pick. Flacco should've thrown a second score, but as mentioned, Waller was guilty of a drop in the end zone. The interception occurred on the final play of the game when Flacco was just trying to get something going downfield. ",
            "5": "Flacco spread the ball around, targeting four players on five or more occasions. Steve Smith led the way in receiving, snatching all seven balls thrown to him for 79 yards and a touchdown. Pitta also had a big game with eight receptions for 75 yards. He was close to getting a touchdown at one point, but Flacco threw behind him near the goal line. ",
            "6": "Kenneth Dixon and Terrance West split carries almost evenly, but the former was predictably so much more effective. Dixon had 12 attempts compared to West's 10, but the rookie outgained the veteran, 57-27. On one occasion, Dixon converted a third-and-1 with a great power run. It's very evident that he's infinitely superior compared to West, and it's fair to wonder if the Ravens would've made the playoffs had they given the talented Dixon way more touches than the ineffective West in the second half of the season. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "The Chiefs believe that in the wake of Derek Carr's injury, they can win the AFC West. Step one was defeating the Broncos, and they managed to do that in blowout fashion. This game was never close. Kansas City ripped through Denver's declining defense with some great running and well-timed screens. The trouble really began when the Broncos, down 7-0 early on, surrendered a 70-yard run to Tyreek Hill. Later in the opening quarter, Alex Smith threw a bubble screen to Travis Kelce. The Broncos looked like they had never seen one before, and Kelce took advantage of terrific blocking to scamper 80 yards into the end zone. Just like that, it was 21-7, and the game was over. Denver would manage only three points the rest of the evening. ",
            "2": "Alex Smith performed well in the opening half, though his overall stats are deceiving. Smith went 25-of-36 for 244 yards, one touchdown and an interception. However, if you take away Kelce's touchdown, which was all Kelce and the great blocking, Smith would've gone 24-of-35, 164 yards and a pick. That would give him a YPA of 4.68, which is not acceptable for a quarterback who needs to step up to finally make a deep run into the playoffs. Like I said, however, Smith did some good things. He had a second touchdown that was dropped, and he was very effective on the ground when he needed to be, scrambling four times for 46 rushing yards and a score. His accuracy was also a positive trait, as he dinked and dunked very well to maintain control of the ball. The Chiefs won the time of possession by about 16 minutes. Smith's mistakes were pretty minimal. I mentioned an interception earlier; he threw the pick because he was hit upon releasing the ball, so it wasn't entirely his fault. In fact, Smith's first poor throw of the night came on his 10th attempt when he made an errant throw to Spencer Ware. Smith later blew a field-goal chance by hurling a poor toss downfield instead of converting a sure thing for about seven yards or so to give Cairo Santos a chance. ",
            "3": "Kelce put together one of the best games of his career. He caught 11 of his 12 targets for a whopping 160 yards and a touchdown. In addition of sprinting 80 yards into the end zone, he also had so many key conversions on third down. The Chiefs were 9-of-17 on third downs, compared to Denver's 4-of-15 figure. I know the Broncos have had their issues against tight ends this year, but you'd think Wade Phillips would've devised a scheme to restrict Kelce. Denver will have to find an inside linebacker upgrade this offseason. I have the team doing this in my . ",
            "4": "Kansas City's two receivers were disappointments in regard to their actual catching stats. Jeremy Maclin caught just three passes for nine yards, and was nearly responsible for an interception when he ran the wrong route on one play. Hill, meanwhile, failed to haul in any of his five targets. However, Hill was effective on the ground, gaining 95 rushing yards and the aforementioned touchdown on his 70-yard sprint. ",
            "5": "Ware had some nice carries as well, gaining 62 yards on 13 attempts. He lost late-game touches to Charcandrick West (14-35), as Andy Reid wanted to preserve his primary running back. ",
            "6": "Speaking of Reid, he made a questionable decision late in the game. Up 27-10 with two minutes remaining, he had nose tackle Dontari Poe attempt a trick-play pass, which he converted. It was fun to watch, but also bush league, as the Chiefs already had the win in hand. Perhaps Reid needed to remember that Step 2 of winning the division involves the Raiders losing to the Broncos, and if I'm Denver, I'm thinking about losing to Oakland on purpose so that the Chiefs don't claim the AFC West just because of that unnecessary trick play. The Bronco players looked very pissed. ",
            "7": "Of course, the Broncos could lose to the Raiders despite trying. Their offense is just that bad. Denver scored a touchdown off Smith's interception, but managed just three points otherwise. Trevor Siemian will get all of the blame, and while he was horrible in this game, I would argue that his offensive line was even worse. The tackles couldn't block whatsoever, and if that wasn't bad enough, Donald Stephenson was guilty of FIVE penalties. How can anyone be penalized five times in one game!? Many of Stephenson's infractions were very untimely, negating quality plays or putting the Broncos in third-and-long situations. Siemian finished just 17-of-43 for 183 yards and an interception on his final throw, and as unbelievable as it may sound, the night could've been so much worse for him. He's extremely fortunate that he was picked off only once. The Chiefs dropped an early interception on a 15-yard flea-flicker, and then Ron Parker let another potential turnover fall through his hands. Marcus Peters was guilty of failing to secure a sure pick in the fourth quarter. Otherwise, Siemian was generally very inaccurate. On one sequence, Siemian threw way wide of Devontae Booker on a screen, and then wasn't even close to Demaryius Thomas, who had a step downfield. ",
            "8": "Booker, sadly, was Denver's leading receiver, catching six passes for 44 yards. Jeff Heuerman (3-32) was next. As for the two star wideouts, Kansas City's cornerbacks did a terrific job of blanketing them. Thomas snatched just three balls for 20 yards and also dropped a pass. Emmanuel Sanders, meanwhile, hauled in only one ball for 26 yards. ",
            "9": "As a runner, Booker didn't have much of an opportunity because the Chiefs had a huge lead in the first quarter. He wasn't able to exploit Kansas City's poor rush defense, as he carried the ball just five times for 27 yards. One of the runs was a stuff on third-and-1, though it wasn't his fault that Dee Ford came off the edge completely unblocked. Booker, however, was guilty of a lost fumble in the fourth quarter that effectively ended the Broncos' slim chances of covering the spread. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Cowboys have made some questionable decisions in the past year, but all of them have magically worked out, almost as if Jerry Jones sold his soul. At least, that's what I believed until the final play of the third quarter. One of those questionable choices was to have the starters not only play this game, but to be on the field well into the second half. I'm fine with using starters in meaningless games, but not for 60 minutes. Yet, Ezekiel Elliott was getting touches well into the second half, and he seemed in danger of getting hurt when a Detroit defensive linemen picked him up and drove him into the ground. The Cowboys would've looked incredibly stupid had Elliott suffered an injury on the play. Elliott didn't get hurt, but stud left tackle Tyron Smith did. Smith incurred an injury on the final play of the third frame, and team trainers were looking at his knee on the sideline. He could be OK for the playoffs, but what if he's not 100 percent? Dallas' rookies have been great, but the primary reason the Cowboys have been so successful has been the play of their offensive line. Not having Smith would be a huge blow for the Cowboys' Super Bowl aspirations. ",
            "2": "Elliott was amazing once again, as the Lions didn't have any sort of answer for him. He didn't reach 100 rushing yards, but he hit 80 on 12 carries. One of his two touchdowns was a 55-yard burst. Elliott took a seat early in the fourth quarter, as Darren McFadden (14-49) was given the rest of the workload. ",
            "3": "Dak Prescott was on fire as well, and Tony Romo didn't seem anywhere close to getting any sort of snaps. Prescott began the game ablaze, converting a second-and-15 for a first down and a third-and-15 for a touchdown on the opening drive alone. Prescott misfired on just five occasions, going 15-of-20 for 212 yards. He also scrambled four times for 35 rushing yards. ",
            "4": "The Lions were missing two key players in this game, one on each side of the ball. Cornerback Darius Slay's absence was enormous, as the Cowboys made sure to target his backup. Dez Bryant had a huge performance as a result, catching four passes for 70 yards and two receiving touchdowns. He also drew two pass-interference flags, and if that wasn't enough, he threw a touchdown on a trick play to Jason Witten (2-33). ",
            "5": "As for the Lions, despite the 21-point loss, they were actually up a touchdown, 21-14, toward the end of the second quarter. They were running the ball extremely well with Zach Zenner, while Matthew Stafford was very precise. The Lions, as a result, scored seven on each of their first three drives. Things completely fell apart after that. The Lions stopped running the ball for some reason, and Dallas defensive coordinator Rod Marinelli began using an exotic blitz scheme with three down linemen, and it worked extremely well. The Cowboys were able to force Stafford into some sacks and even an ugly interception in which he threw late across his body. Stafford was nearly picked on another occasion, but a Dallas defensive back dropped the ball. Stafford finished 26-of-46 for 260 yards, the pick and a fourth-quarter lost fumble in the red zone. Though he was hurt by some drops - Eric Ebron was guilty of two, while T.J. Jones had one in the red zone - Stafford was close to inept in the second half, as Dallas' defensive front overpowered the Lions, who were also missing center Travis Swanson. That was the second major injury. Detroit absolutely needs both Slay and Swanson on the field to have a chance against the Packers next week. And it may already be too late, as Stafford was limping around in the final minutes of this contest. ",
            "6": "Detroit's leader in receiving yardage happened to be Ebron, who did well outside of the two drops. He caught eight of his 12 targets for 93 yards. Golden Tate, meanwhile, snatched all six of the balls thrown to him for 58 yards. Marvin Jones was nowhere to be seen. He saw seven targets, but reeled in just one of them for 16 yards. Stafford had great chemistry with Jones in the preseason and the early part of real action, but that's completely gone. ",
            "7": "It's mind-boggling to me that the Lions gave Zenner just two carries after halftime. The big back had 64 yards and two touchdowns on just 10 carries in the opening 30 minutes, bulldozing through Dallas' defense. And yet, Zenner was completely gone from the game plan following intermission. I don't understand it. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> </br.>"
        }
    },
    "numberOfGames": "16"
}