{
    "year": "2016",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "33"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "This was an absolutely dreadful game to watch, and I hope you weren't subjected to such torture. This contest was comprised of horrible quarterbacking, constant three-and-outs and some of the worst announcing anyone has ever heard. The Cardinals managed to prevail, but it wasn't pretty. In fact, the 49ers pretty much handed them the game. San Francisco was up 7-0 with a couple of minutes remaining before halftime when a Blaine Gabbert pass was tipped at the line of scrimmage and intercepted by Calais Campbell. Drew Stanton hit Larry Fitzgerald for the tying touchdown on the very next play. Then, right after halftime, the San Francisco kick returner fumbled the ball inside his own 20. The Cardinals quickly reached the end zone once again with the help of a running-into-the-kicker penalty, taking a lead that they wouldn't relinquish. If there's anything that could've been learned from this dreadful game from Arizona's perspective, it's that Stanton is one of the worst quarterbacks in the NFL. Battling one of the worst defenses in the NFL, Stanton struggled to move the chains. He was completely inaccurate on most of his throws. Stanton finished 11-of-28 for 124 yards. He did throw two touchdowns, but they were set up on short fields. The one silver lining is that Stanton didn't turn the ball over, but he was close on a couple of occasions. Arizona converted just 5-of-16 third downs because of his incompetence. What I really don't understand is why the Cardinals opted to keep Stanton over Matt Barkley during final cuts. Barkley was unquestionably the superior quarterback in the preseason, and it wasn't even close. Stanton was simply atrocious, and if the Cardinals played a real team this week, they would've lost. I don't understand what the point of the exhibition is if coaches are unwilling to keep obvious, superior talents at the position. All of the rhetoric that players are fighting for jobs is usually complete crap. Coaches know whom they're going to keep, and it usually doesn't matter what the players do. ",
            "2": "Two Arizona offensive play-makers were factors in this contest. David Johnson was a beast, rushing for 157 yards and two touchdowns on 27 carries, as the 49ers, missing NaVorro Bowman, can't stop the run at all. Larry Fitzgerald, meanwhile, also scored twice, catching six balls for 81 yards in the process. He also had a terrific block to spring Johnson into the end zone. The only blemish of Fitzgerald's evening was a dropped pass, though Stanton delivered that pass awkwardly. ",
            "3": "The Cardinals' other receivers did nothing. John Brown caught only one pass for 11 yards, while Michael Floyd failed to log a single reception. Floyd, who dropped three balls last week, let another one fall through his hands in this game. ",
            "4": "Before moving on to the 49ers, it's noteworthy that both of Arizona's starting guards, Evan Mathis and Mike Iupati, left the game with injuries. Fortunately for the Cardinals, they have 10 days to get them, as well as Carson Palmer, back into the lineup. ",
            "5": "San Francisco was the better team in the opening half, outgaining the Cardinals and posting a better yards-per-play average. However, their turnovers crushed them, and the defense eventually ran out of gas, as Arizona ran the ball down their throat on one soul-crushing drive in the fourth quarter. Of course, the defense was on the field a lot because Blaine Gabbert was horrible. Gabbert had one nice drive in this contest, but floundered otherwise. He finished 18-of-31 for 162 yards, one touchdown and two interceptions. He was better than Stanton, but that's not really saing anything. One of the picks wasn't his fault, but he should've thrown another in the fourth quarter. Gabbert did move around well - he scrambled 10 times for 70 rushing yards and a late touchdown - but that didn't make up for his other deficiencies. Gabbert did his usual thing where he threw way short of the first-down marker on numerous occasions, and he sailed balls on the rare occasions in which he hurled some shots downfield. He also took seven sacks - including one for a safety - but some of those occurred because he ran out of bounds for a loss, which counts as a sack. The announcers are clamoring for Colin Kaepernick, but the 49ers' controversial backup is 20 pounds underweight and was benched in favor of Gabbert last year anyway. Kaepernick refuses to put work into the mental part of the game and will ultimately be a worse option. I'd say that's for the best, as it would help the 49ers' draft position - see my <a href=/draft2017.php>2017 NFL Mock Draft</a> for more - but it doesn't matter at all. The 49ers are so devoid of talent, thanks to Trent Baalke's mismanagement, that it's going to be difficult for them to win more than three games regardless. ",
            "6": "Want an idea of how horrible Gabbert was? Aside from Jeremy Kerley and Carlos Hyde, no 49er caught passes until there were two minutes remaining in the third quarter. I don't know if that says more about Gabbert's incompetence or the lack of talent in San Francisco's receiving corps, but it's a sad state of affairs. As for Kerley and Hyde, the former caught eight passes for 102 yards and a touchdown. Given how much Gabbert loves throwing to him, Kerley should be owned in all formats. Hyde, meanwhile, gained 78 yards and a touchdown on 22 carries. He also caught all six of his targets for 36 receiving yards. ",
            "7": "I'd be remiss if I didn't mention how horrible Phil Simms was tonight. He called Jeremy Kerley Jeremy Colored - kind of racist, eh? - and then said, This game's going to come down to who can make the less mistakes. <i>The less mistakes?</i> You mean fewer mistakes? What kind of English is that? Simms' logic was poor, too. They should run more option! he exclaimed of the 49ers. So, they ran the option, prompting Simms to say, All these teams have seen it so much, they know how to defend it. Contradictory, much? I wasn't the only one to notice Simms' woeful announcing. This was the best tweet I found: "
        }
    }
}