{
    "year": "2016",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "I did not think the Panthers were prepared to play in the Super Bowl. They came into the contest highly acclaimed after their blowout victory over the Cardinals in the NFC Championship. The Broncos, meanwhile, possessed a decaying quarterback who happened to be statistically worse than Mark Sanchez. The Panthers knew they were going to win, so it seemed like they took that game for granted. The rematch was much different. The Panthers came in more focused, ready with a better game plan against the deadly Denver pass-rushing duo of Von Miller and DeMarcus Ware. They changed Cam Newton's drop-back in the pocket and gave right tackle Mike Remmers some help to combat Miller. The result was a more competitive battle in which the Panthers led by double digits at halftime. And yet, they still lost. The difference, once again, was Denver's defense. The Broncos' stop unit didn't fare all that well in the first half, but Wade Phillips made some tremendous adjustments at intermission. Following halftime, the Panthers gained just 123 net yards (210 beforehand), and Newton went just 7-of-16 for 83 yards and an interception in the final two quarters. He took some crushing hits. On one instance, he was down for a while on the sideline and appeared to be injured. On another, it seemed like he sustained a concussion, and Derek Anderson even began warming up. Newton stayed on the field, however, and even had the Panthers in a position to kick the game-winning field goal, but Graham Gano went wide left from 50 yards. ",
            "2": "The big story to come out of this game will be Trevor Siemian, who was not intimidated whatsoever to be going up against Luke Kuechly and Carolina's Super Bowl defense despite never attempting a pass in the regular season before. Siemian was very competent, making smart decisions (for the most part) and tossing precise passes, all while mixing in timely runs. He kind of looked like Alex Smith, if I had to make a comparison. Granted, he was battling a secondary that really looks like it's missing Josh Norman, but Siemian still had to deal with Kuechly, Thomas Davis, Kawann Short and the rest of Carolina's prolific front seven. Siemian finished 18-of-26 for 178 yards, one touchdown and two interceptions, and he also jogged for 20 rushing yards on five carries. Both picks occurred inside the Carolina 30-yard line - two of Denver's three give-aways took place there - as one was tipped at the line of scrimmage, while the other one transpired as Siemian was under pressure and threw off his back foot. I won't blame Siemian for the first pick, but the second one was inexcusable. That was three easy points off the board, which would've made a huge difference had Gano nailed that field goal. Siemian also got lucky on one occasion, when he had an open Virgil Green in the end zone, but underthrew him with a pass that was nearly picked off. It's too bad that Siemian is just a bridge to Paxton Lynch, because I think there's something there. Siemian is a smart, gritty quarterback who, at the very least, proved that he can be a viable backup quarterback in this league. ",
            "3": "C.J. Anderson looked like Denver's best offensive player at times. He ran extremely well with great power and burst, gaining 92 yards and a touchdown on 20 carries. He also caught four passes for 47 receiving yards and a second score. Anderson has gotten off to slow starts the past two years, thanks in part to conditioning, but he appears to be in terrific shape right now. ",
            "4": "Siemian connected with Emmanuel Sanders and Demaryius Thomas a total of nine times, as both wideouts posted meager numbers, 5-49 and 4-48, respectively. Thomas dropped a pass inside the 5-yard line that was nearly picked on a deflection. ",
            "5": "Going back to the Panthers, Newton's overall numbers were 18-of-33 for 194 yards, one touchdown and an interception that was the result of Chris Harris catching a tip pass on a diving attempt. That, combined with a personal foul penalty, allowed the Broncos to score the go-ahead touchdown. Newton also ran 11 times for 54 yards and an additional score. Newton played extremely well in the first half, but as mentioned, the Broncos made some excellent adjustments at halftime and roughed him up in the final 30 minutes. Given how horribly Carolina's 2-minute offense was at the end of the game - the team took its time and wasted a timeout - it wouldn't shock me at all if Newton were truly concussed at the very end. Fortunately for him, he gets 10 days to bounce back before battling the horrible 49ers. Oh, and speaking of Newton, he revealed his new celebration dance. He's no longer dabbing, which was sooo 2015. He's now doing the floss: "
        }
    }
}