{
    "year": "2016",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Ravens have assured themselves a share of first place in the AFC North with a victory over the Browns, but it's fair to say that we haven't learned anything about them. In fact, despite the three-touchdown victory, they were actually a bit underwhelming in this contest. Baltimore may have won 28-7, but the team trailed by a point in the third quarter. The offense was stagnant, but it seemed to start clicking all of a sudden. That's not really remarkable, however, given how poor Cleveland's defense has been this season. Every single team has scored at least 25 points against the Browns this season. This includes Ryan Fitzpatrick and the Jets (31) and Ryan Tannehill and the Dolphins (30). Cleveland has been especially poor in the second half of games, so it's not a surprise that the Ravens were able to dominate after intermission, especially when considering the immense coaching blunder Hue Jackson was guilty of, which I'll discuss later. ",
            "2": "Joe Flacco finished 30-of-41 for 296 yards, three touchdowns and two interceptions. One of his picks was an overthrow toward Steve Smith, while the other was a horrible pass he telegraphed into the end zone while throwing late across his body, and Joe Haden read his eyes perfectly. Flacco, however, was nearly perfect otherwise following intermission, as his second-half numbers were 13-of-17 for 163 yards, three touchdowns and that pick. The offense went into a quick tempo, and Flacco's throws were mostly precise, though Cleveland's atrocious defense made things very easy for him. ",
            "3": "While Flacco's three touchdowns all went to different players, they mostly had a common theme: An offensive lineman sustained an injury following two of his scores. Guard Alex Lewis had to be carted into the locker room, but X-rays were negative. Center Jeremy Zuttah was down on the field for a while after the next score, but he didn't miss a snap. Flacco's touchdowns went to Breshad Perriman (3-64), Steve Smith (5-60) and some guy named Darren Waller (2-14). Mike Wallace had a 23-yard spurt, but disappointed his fantasy owners overall, snatching just four balls for 59 yards. ",
            "4": "I expected the Ravens to run the ball well against the Browns, but Terrance West managed just 65 yards on 21 carries versus his former team. Kenneth Dixon was much better, tallying 38 yards on six tries, with five of his six attempts coming in the second half. Dixon also caught five balls for 42 receiving yards. He needs to be used more down the stretch, as he's the best running back on the roster. ",
            "5": "Moving on to the Browns, I've always defended Hue Jackson, as I liked what he accomplished in Oakland, and he had the Browns playing hard this year. What he did in this game proves that he doesn't have what it takes to be a head coach in the NFL. Rookie quarterback Cody Kessler had been playing somewhat well, as he stood 11-of-18 for 91 yards and a touchdown in slightly more than a half of action. His final snap in this contest occurred with a lead. The Ravens took over and managed to score a touchdown with a horrific non-call by incompetent official Jerome Boger on what should've been an intentional grounding on Flacco, who failed to get the ball past the line of scrimmage. The Ravens were leading only 13-7 at that point, and Cleveland was still well in the game. Considering that Kessler had not turned the ball over and wasn't performing poorly, no head coach with a clue would've benched him. But Jackson did. And the results were disastrous. Josh McCown's first drive featured an interception. His arm was hit by Terrell Suggs as he released the ball, but his throwing motion is slower than Kessler's. McCown's second possession featured a near-interception and then a fumble, which he was lucky to recover. On the third drive, McCown launched a careless interception into double coverage. He was guilty of a strip-sack on the fourth drive, as he showed zero awareness in the pocket. His fifth drive featured a tipped pass that was inches away from being a pick-six. McCown did not look ready to play, and the stats demonstrate it. He was 6-of-13 for 59 yards and two picks. He was infinitely worse than Kessler, and the Browns didn't have a chance to stay competitive with McCown under center. Again, it was a 13-7 contest when Jackson yanked a healthy Kessler. Perhaps Kessler would've been able to engineer some drives, and it's likely that he would've been more careful with the ball than McCown was. There's really no excuse for Jackson's abysmal decision-making, and if the Browns want to fire him as a result of this embarrassing performance, I couldn't blame them at all. ",
            "6": "Only two Browns accumulated more than 25 receiving yards: Terrelle Pryor led the way with five grabs for 48 yards, while Isaiah Crowell caught three balls for 30 yards, though he did drop a pass. Corey Coleman, meanwhile, was a major disappointment, as he hauled in only three catches for 17 yards. ",
            "7": "Speaking of Crowell, he didn't do much on the ground versus a stout run defense, tallying 23 yards on nine carries. Duke Johnson (2-6) was only a factor in the passing game, catching three passes for 25 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I watched it happen, but I still can't believe the Panthers lost this game. They were completely dominating it, up 17-0 in the second quarter. Carolina led the yardage battle, 228-110, going into the break. The Chiefs could do nothing offensively, averaging a meager 3.5 yards per play. Kansas City stopped making mistakes after intermission, for the most part, but it was the secondary that led the team to victory. Up 17-6 in the fourth quarter, the Panthers were trying to run out the clock when Cam Newton inexplicably fired a pick-six to Eric Berry. The throw was a horrific one, as Newton hurled the ball off his back foot and just launched it up for grabs. There was no excuse for that mistake. It later appeared as though Carolina would have to settle for overtime, but Marcus Peters ripped the ball out of Kelvin Benjamin's hands and returned the turnover to the Carolina 24. Following a nice, albeit rare run by Spencer Ware, the Chiefs were able to set up Cairo Santos with a 37-yard field goal, and the attempt converted. It's really unbelievable how Newton and the rest of the offense unraveled. Newton was on fire in the opening half, going 11-of-19 for 157 passing yards, 43 rushing yards and two touchdowns by intermission. Newton looked like his old self, and he even dabbed after scoring. This appeared to be the 2015 Panthers, but the 2016 version reared its ugly head in the second half. Newton never felt comfortable, as his offensive line failed him. He was actually sacked on consecutive plays on one drive, as a possession in the red zone turned into a punt. With Michael Oher and Ryan Kalil out, Newton simply didn't have the protection to be successful all game. ",
            "2": "Newton ended up finishing 23-of-38 for 261 yards, one touchdown and the pick-six. He also scrambled 12 times for 54 yards and a touchdown, with his longest run being a 28-yarder off a great play-action fake to open the game. However, once again, Newton ended poorly, and his second-half numbers were pretty ugly, as he went just 12-of-19 for 104 yards and an interception following the break. ",
            "3": "Newton should've had better numbers, but Greg Olsen betrayed him with a couple of drops. Olsen finished with five catches for 39 yards, trailing three players: Benjamin (7-84), Devin Funchess (3-56, TD) and Ted Ginn (5-44). ",
            "4": "The Panthers didn't have any running room, as Newton led the team in rushing. Jonathan Stewart managed just 39 yards on 13 attempts. The Chiefs stacked eight men in the box on most plays, challenging the Carolina receivers to beat one-on-one coverage, and it didn't happen very often. ",
            "5": "Meanwhile, the Chiefs, as mentioned, didn't perform well offensively. Alex Smith had a poor game, and he was bailed out by the secondary. Smith began the contest by throwing an interception into double coverage. He also overthrew Travis Kelce in the end zone for what should've been a touchdown. Smith had an awful sequence in the red zone in the fourth quarter. He had a wide-open Kelce in the end zone, but checked the ball down instead. He then had an open Chris Conley for a touchdown, but overshot him. Smith followed that up by throwing short of the first-down marker by tossing a meaningless 5-yard completion to Ross Travis. Smith finished 25-of-38 for only 178 yards and a pick. He struggled mightily, though his receivers did hurt him by some drops. Still, Smith had a great matchup against a poor Carolina secondary, but couldn't take advantage of it. Despite the victory, the Chiefs have to feel discouraged about this, as Smith is the one holding this team back. ",
            "6": "With Jeremy Maclin out, Tyreek Hill was able to lead the team in catches. He racked up 10 receptions for 89 yards. No other Chief accumulated more than 31 yards, as Kelce (3-31) and Albert Wilson (4-25) both dropped passes. Kelce at least hauled in a two-point conversion. ",
            "7": "I mentioned earlier that Ware didn't have many good runs. Ware's burst of 12 at the end gave him 61 yards on 13 carries, but he didn't have much of an opportunity to rush the ball, given that the Chiefs trailed throughout until the very end. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Everyone blamed the Vikings' recent collapse on their struggling tackles, but barely anyone mentioned their defense. Their stop unit had been dominant earlier in the season, but the group put forth a horrific effort in this contest, prompting the team to drop to 5-4. The Redskins basically did whatever they pleased, outside of some drives in the second quarter. Kirk Cousins went right down the field on the opening drive and capped it off with a touchdown, with his only blemish being an overthrow of Jordan Reed. Cousins nearly made another mistake on an incompletion in the end zone, but it worked out for the Redskins, as Eric Kendricks and Anthony Barr collided. Kendricks, who had been missing the past couple of weeks, was knocked out for the afternoon with a hip injury, which ended up being a huge blow because the Redskins were able to use bootlegs to fool the Minnesota linebackers on misdirection throughout the afternoon. Cousins was also able to torch Barr on a deep touchdown to Vernon Davis on the ensuing drive. Cousins ended up missing on a few deep shots, but he was pretty accurate for the most part. He spent most of the second half targeting Mackensie Alexander after Xavier Rhodes was knocked out with a concussion. It goes without saying that as with Kendicks' absence, Rhodes being out was absolutely huge. The Redskins' offense simply couldn't be stopped following intermission after the Vikings seemed to perhaps figure things out in the second quarter. Cousins finished 22-of-33 for 262 yards and two touchdowns. As mentioned, his accuracy was very good, and he was able to throw some perfect dimes at times. Sure, the Vikings were missing Kendricks for the entire game and Rhodes for the final quarter, but Cousins' performance was impressive nonetheless, especially when considering that Trent Williams was out of the lineup, while right tackle Morgan Moses got banged up. Moses sustained an injury, but returned after missing a few plays. He wasn't completely healthy though, as he was limping around. ",
            "2": "Robert Kelley made the start for the Redskins, as Matt Jones was a healthy scratch. Kelley ran well, gaining 97 yards on 22 carries. Kelley had some spurts in this contest that would've gone for losses, but he was able to power his way forward for pick-ups of three to four yards at a time. He's a strong runner, and he appears to definitely be an upgrade over the fumble-prone Jones. ",
            "3": "With DeSean Jackson out, Pierre Garcon saw the most targets (10) and led the team with six catches for 81 yards. Davis (3-66) and Jamison Crowder (4-37) caught touchdowns, while Jordan Reed disappointed, finishing with just two grabs for 41 yards. ",
            "4": "As for the Vikings, they have only themselves to blame for this loss. Despite Cousins' strong performance, the Vikings were in position to win. They led 20-14 at halftime, but poor play-calling crushed them in the second half. For example, Matt Asiata was stuffed twice on third-and-1. Minnesota had been throwing the ball so well, yet new coordinator Pat Shurmur continued to call ineffective runs on crucial downs, disrupting what appeared to be promising Minnesota drives. It's also worth noting that the Vikings, down 14-0, were able to take the lead via impressive Sam Bradford throws in the second quarter, yet Shurmur came out and ran the ball thrice on the opening drive following intermission, resulting in a three-and-out. Bradford played on a high level for most of this contest. The numbers prove it, as he finished 31-of-40 for 307 yards, two touchdowns and an interception. However, things came apart for him in the latter half of the fourth quarter. It began when the Vikings, down 23-20, crossed into Washington territory. Bradford hurled a poor throw, and Preston Smith made a very athletic play to bat the pass and haul in the interception while reaching back across his body. Bradford then reached the Washington 30-yard line on the final drive, but held on to the ball way too long on a second down. He took a sack, and the next play resulted in a hold and a Jake Long injury. Long had to be carted off with what turned out to be a torn Achilles. Bradford was then sacked by Smith to end the game. ",
            "5": "Bradford killed the Redskins with crossing routes most of the afternoon, and the recipient of most of those was Stefon Diggs, who reeled in 13 of his 15 targets for 164 yards. Bradford's touchdowns, meanwhile, went to Kyle Rudolph (5-69) and Adam Thielen (3-21). ",
            "6": "As hinted earlier, the Vikings couldn't run the ball whatsoever. Jerick McKinnon led the team with 16 yards on six carries, while Asiata (9-13) was stuffed on almost every try, save for a goal-line plunge in the second quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "15"
        },
        "comments": {
            "amount": "7",
            "1": "The Eagles were once 3-0, but they've dropped four of their previous five games because they've sustained some bad luck: the Ryan Mathews fumble in Detroit; the blown 10-point lead at Dallas in the fourth quarter; the blocked field goal at New York last week. All of these things have crushed Philadelphia, but things finally went the Eagles' way in this contest. The Falcons were the team that made the mental errors this Sunday. A good amount of them, anyway. Matt Bryant whiffed on a field goal and uncharacteristically missed an extra point. Julio Jones dropped a pass on a crucial third-and-12 in the fourth quarter. Austin Hooper dropped a ball as well. Matt Ryan couldn't connect with Jones on a fourth down at the end of the afternoon and also threw an interception. The Falcons appeared to be close in this game, but just couldn't quite get there. Despite Atlanta's blunders, the Eagles allowed them to hang around for most of the afternoon because they kept making mistakes of their own. Carson Wentz was strip-sacked by Vic Beasley past midfield at the end of the first half. Darren Sproles appeared to fumble, but the play was ruled incomplete. Jordan Matthews, Wendell Smallwood and Nelson Agholor each dropped passes. Doug Pederson called yet another slow-developing play on a third down, and Ryan Mathews was predictably stuffed. Special-teamer Najee Goode committed a dumb, late-hit personal foul after the play was whistled dead. With all of these blunders, the Eagles were just dying to blow this game, but the Falcons made their own mistakes and couldn't take advantage. ",
            "2": "Carson Wentz finished 25-of-36 for 231 yards and the aforementioned lost fumble. He began the afternoon on an extremely hot pace, as he was 8-of-8 for 95 yards. He didn't start playing poorly, or anything, but his receivers, as mentioned, let him down with some bad drops. Outside of the fumble, Wentz had a strong afternoon. ",
            "3": "The story of this game, from Philadelphia's perspective, was that Ryan Mathews reemerged as a big factor in the offense. Mathews played single-digit snaps the past two weeks, yet was featured heavily. Mathews was given five consecutive runs to cap off a touchdown drive to begin the afternoon. He ended up finishing 108 yards and two touchdowns on 19 attempts. It's pretty astonishing that Mathews did this after barely being seen the past couple of weeks. Sproles, meanwhile, appeared to be the featured back heading into this contest, but had just two carries for 19 yards in this contest, though he was a big factor in the passing game, catching eight balls for 57 receiving yards. Smallwood was given 13 attempts, which he transformed into 70 yards. ",
            "4": "Besides Sproles, only two Eagles caught more than two passes: Jordan Matthews (6-73) and Zach Ertz (6-55). Matthews was blown up on one play that was an obvious helmet-to-helmet call. Keanu Neal, however, wasn't flagged for it, and the Eagles whiffed on a long field goal as a result. It was inexplicable that no flag was thrown, and I imagine Neal will receive a fine. ",
            "5": "Moving on to the Falcons, Ryan didn't have his best performance. The numbers are fine - 18-of-33 for 267 yards, one touchdown, one interception - but a big chunk of his yardage, as well as his score, came on a 76-yard bomb to Taylor Gabriel in which the Eagles blew a coverage. Gabriel was wide open, so the pass wasn't anything special. Ryan had trouble with Philadelphia's pass rush and couldn't get into a rhythm as a result. His pick was a forced throw at the end of the game. ",
            "6": "As mentioned, Julio Jones was guilty of a crucial drop. He played well outside of that blunder, however, as he logged 10 catches for 135 yards. Outside of Jones and Gabriel, Devonta Freeman was the only Falcon with more than 15 receiving yards (3-32). The pedestrian Mohamed Sanu was silenced, as he had two receptions for 14 yards. ",
            "7": "Speaking of Freeman, he had issues running against a defense that welcomed back Bennie Logan. Freeman gained 49 yards on 12 carries, but a big chunk of that came on a 17-yard burst. With the Ealges well in control of the clock, Freeman didn't have much of an opportunity. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Jay Cutler knew that the second half of this season would be an audition tape for the other 31 teams in the NFL. The Bears won't be bringing him back following this season, so Cutler has to show another squad (i.e. Jets, Broncos, 49ers) that he's capable of starting for them. His first game back, a Monday night victory over the Vikings, was a good start, but his second performance was a complete flop. This performance detailed everything wrong with Cutler. His accuracy and mechanics were lacking in this contest, as he immediately began with an interception toward Alshon Jeffery, who wasn't open. His next pick occurred soon after, and it was even worse. Cutler tossed the ball off his back foot and didn't really look where he was throwing the pass. He followed that up by being strip-sacked in the red zone, showing absolutely zero awareness. On an ensuing drive, Cutler sailed a pass toward Alshon Jeffery that was way too high, and he later took a safety because he was stripped in his own end zone. He also had another potential pick that was dropped. Cutler finished 16-of-30 for 182 yards, one touchdown, two interceptions and a pair of fumbles. Sadly, those numbers are misleading because Cutler threw a 50-yard touchdown at the end of the first half that was a Hail Mary, with the ball popping into the air and landing into Cameron Meredith's hands. If it wasn't for that play, Cutler would've gone 15-of-29 for 132 yards and the four turnovers - truly an abysmal performance, especially when considering that he was battling the NFL's worst safety group. ",
            "2": "With Cutler struggling with accuracy, Jeffery managed to catch just four passes for 47 yards. He sadly would've led the team in receiving if it wasn't for Meredith's Hail Mary reception. Zach Miller (4-32) was the only other Bear to eclipse 25 receiving yards. ",
            "3": "Cutler's penchant for turning the ball over rubbed off on Jordan Howard, who lost a fumble in his own territory. That set up a Tampa touchdown. Howard was impressive otherwise, gashing the Buccaneers for 100 yards on 15 carries. However, he had just two attempts after halftime. John Fox told the media that Howard sustained an ankle or Achilles injury, but Howard completely denied those comments. I ain't suffer nothing, he said with an adamant double negative. I suppose we'll find out what happened sooner or later. ",
            "4": "One final note on the Bears: Guard Kyle Long sustained a gruesome ankle injury in the second quarter and had to be carted off. It was a somber moment, as members of his own team were hugging him as he was taken into the locker room. Tackle Bobby Massie was also knocked out and entered concussion protocol. ",
            "5": "The Buccaneers, meanwhile, appeared to be planning to match the Bears turnover for turnover in the early going. Jameis Winston was guilty of an early interception where he fired behind his receiver, and the turnover was taken back into the red zone. Winston settled down after that, however, and he was able to put forth a strong second half, going 11-of-15 for 175 yards and a touchdown following intermission. Winston's final numbers were impressive: 23-of-33 for 312 yards, two touchdowns and the early pick. Winston's best moment is one you'll likely see on <i>SportsCenter</i>. If not, he ran backward 15 yards into his own end zone, eluded a tackle for a potential safety, and then launched a 39-yard bomb to Mike Evans. It was pretty spectacular, and it was a taste of what Winston could be capable of if he becomes more consistent. ",
            "6": "Winston spent most of the afternoon targeting Cameron Brate. The tight end caught all seven passes thrown to him for 84 yards and a touchdown. Evans (4-66) didn't do much outside of that catch on Winston's crazy play. He wasn't even targeted in the first half! Tracy Porter somehow had great coverage on Evans. ",
            "7": "Doug Martin made his return to the lineup, but he was limited. He was given 16 carries, which he turned into only 33 yards. Fortunately for his fantasy owners, he was able to score a late touchdown. Because of the margin, he lost some late work to Peyton Barber, who took his 12 attempts for 38 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Texans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Texans may have won this game to improve to 6-3, but their fans can't feel good about this performance. Their offensive was horribly anemic, and the only reason they were able to prevail was that Blake Bortles self-destructed. Much like the Chiefs last week, Houston could've utilized the Bobby Boucher offense and still came away with a victory. Some kneel-downs actually would've been preferrable to what Brock Osweiler did in this contest. The good news is that Osweiler didn't turn the ball over. The bad news is that he couldn't get anything going throughout the afternoon. His woeful numbers tell the tale, as Osweiler finished 14-of-27 for 99 yards and two touchdowns. That's not a typo - in this day and age, when passing is easier than ever because bogus illegal-contact and defensive-holding penalties are called all the time, Osweiler accumulated just 99 yards. Osweiler was very underwhelming, as you might imagine. His completions were mostly dinks and dunks, and whenever he tried going deeper, he couldn't connect at all with DeAndre Hopkins. The Texans couldn't get anything going downfield, and this will cost them against opponents that aren't, well, the Jaguars. ",
            "2": "Osweiler has been capable of what appeared to be the unthinkable prior to this season: rendering Hopkins useless in fantasy football. Hopkins had performed on a high level with Brian Hoyer, Ryan Mallett and Ryan Fitzpatrick in the past, but that hasn't been the case with Osweiler. The former Bronco signal-caller targeted Hopkins 13 times, but was successful on just five occasions. Hopkins finished with 48 yards. He was just one of two Texans to accumulate more than 10 receiving yards, with C.J. Fiedorowicz being the other (3-26). Osweiler threw short touchdowns to backup tight ends Stephen Anderson and Ryan Griffin, one of which occurred following a punt return taken to the 6-yard line. ",
            "3": "The Texans were able to move the chains on the ground, as Lamar Miller rushed for 83 yards on 15 carries, though most of his yardage came on a 45-yard burst. Akeem Hunt (8-52) had a nice day, and he should've had more yardage, but he had a long gain wiped out by a Chris Clark hold. The right tackle had an abysmal afternoon, as it's clear that the Texans miss Derek Newton. ",
            "4": "Moving on to the Jaguars, I mentioned that Bortles self-destructed. The numbers don't show it, as Bortles easily out-passed Osweiler, going 32-of-49 for 265 yards, two touchdowns and an interception. As is usually the case with Bortles, however, this was all phantom yardage that occurred late in the game. And yes, if you're wondering, Bortles was actually worse than Osweiler. Bortles was 24-of-34 for only 160 yards, one touchdown and an interception by the time the game was 21-10. He gave the game away early with a pick-six. Displaying horrific mechanics, Bortles made a late throw on the outside, and it was taken back the other way, as the Jacksonville players showed very little interest in tackling. Bortles had a second pick that was actually ruled a fumble, as he fired a short, backward pass unnecessarily hard toward T.J. Yeldon, and the ball popped into the air. Bortles followed that up with a near-interception that could've been returned for a touchdown as well. Bortles is one of the worst starting quarterbacks in the NFL, despite the pretty numbers he tends to post in garbage time. His mechanics have seemingly gotten worse recently, which goes to show what happens when a team fires its only quality coach (Greg Olson, in this case). I couldn't argue with anyone who wants to refer to Bortles as a sunk cost at this point. He just doesn't care enough about football to improve his game. ",
            "5": "Allen Robinson was able to benefit from Bortles' garbage-time numbers. More than half of his numbers occurred following intermission, as he finished with nine grabs for 107 yards and a late touchdown in meaningless action. Julius Thomas (6-24) scored in the early going. Allen Hurns (2-13) was a disappointment after getting cleared for a concussion at the 11th hour. ",
            "6": "The Jaguars didn't get a chance to run the ball very much because they trailed throughout. Yeldon and Chris Ivory each had nine carries for 32 and 31 yards, respectively. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Rams",
            "Points": "9"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "There was some talk that we could see Jared Goff if Case Keenum struggled in this game. Well, the new Rams fans will have to wait another week, as Keenum played throughout this entire contest. Keenum wasn't very good, but he didn't perform poorly either. Keenum actually began the game at a relatively torrid pace, targeting Darrelle Revis on nearly every opportunity. And understandably so. Revis surrendered a 12-yarder to Kenny Britt on a third-and-9 and a 6-yard completion to Britt on a third-and-4. Revis then allowed Britt to come away with a one-handed catch for a gain of 25. The Rams were able to reach the red zone as a result of this, but squandered their opportunity, failing to get into the end zone despite having a first-and-goal from the 1-yard line. On the following drive, Britt torched Revis on a bomb for a 46-yard completion. It seemed as though this would be the formula the Rams could utilize successfully throughout the afternoon, but they went away from it for some reason. They focused instead on short throws and runs in the second half to milk the clock. It worked, but only because the Jets could do nothing on offense. At any rate, Keenum finished 17-of-30 for only 165 yards with no touchdowns or turnovers, though he was close to being picked off by Lorenzo Mauldin at one point. Most of his yardage came in the opening half (118). The same could be said for Britt, who caught seven balls for 109 yards, but accumulated just 11 yards following intermission. ",
            "2": "Outside of Britt, no Ram player registered more than 20 receiving yards. In fact, Tavon Austin (2-19) and Brian Quick (2-16) were the only other Los Angeles players in double digits. ",
            "3": "Todd Gurley once again had a disappointing fantasy performance, but he was able to run well in the second half. He finished with 64 yards on 21 carries, but managed 54 yards on 11 tries following the break, as the Jets' defensive line wore down. Gurley had a long burst called back by a Greg Robinson hold. ",
            "4": "While we didn't get to see Goff, Bryce Petty made his first start for the Jets. He was actually impressive early, as his second pass was a bomb down the sideline to Robby Anderson for a gain of 52. This was part of a 99-yard drive, capped off by a Jalin Marshall reception and a hook and lateral to Bilal Powell, who scampered into the end zone. The Jets went up 6-3 - the extra point was missed - and that was all they did during the afternoon. The Jets mustered just 197 total yards outside of that possession. Petty finished 19-of-32 for 163 yards, one touchdown and an interception late in the game on an inaccurate throw. Petty had that bomb to Anderson, but spent most of the afternoon dinking and dunking. He looked like a poor-man's Ryan Fitzpatrick, which is just sad. Granted, he didn't have Nick Mangold blocking for him against the Rams' ferocious defensive front, but he appears to be just a backup at best in this league. ",
            "5": "Matt Forte and Powell were the only productive players for the Jets. Forte gained 98 yards on 20 carries, while Powell caught seven balls for 52 yards and the aforementioned touchdown. ",
            "6": "Hindered by a weak arm, Petty couldn't get the ball to Brandon Marshall very often. Marshall saw just six targets, catching four of them for only 15 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Titans",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "25"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> It's difficult to imagine Green Bay's owner standing for a loss like this. He's not a very nice guy, so I imagine him firing Mike McCarthy following this ugly defeat. Wait, never mind, none of this is accurate. Still, the Packers almost have to make a dramatic move following an embarrassing defeat like this, right? ",
            "2": "The Titans came through with a statement win as they dominated Green Bay from start to finish. Marcus Mariota was tremendous, and the Packers' injury ravaged secondary had no answer for Mariota and Delanie Walker. Tennessee is now 5-5 and is a serious contender to win the AFC South this season. Conversely, this is the first time Green Bay is under .500 after nine games since 2008 when Aaron Rodgers was in his first year as a starter. However, the NFC North is wide open with the Vikings continuing their losing streak, so the Packers still have a shot to get to the postseason. ",
            "3": "The first half of the game felt like you were watching the Big XII, as both defenses couldn't contain the quarterbacks, each of whom threw for more than 200 yards. On the Titans' first offensive play from scrimmage, DeMarco Murray ran untouched for a 75-yard touchdown. Mariota converted a third-and-14 to Tajae Sharpe (3-68-1) and then hit Delanie Walker for 41 yards after he beat Kentrell Brice to get open and shed the tackle. A few plays later, Tennessee went into its bag of tricks as Murray took a handoff and sold a run to convince safety Morgan Burnett to move up; Murray then threw a 10-yard touchdown pass to Walker. The Titans quickly got the ball back thanks to a sack from rookie safety Kevin Byard, and Mariota kept torching Green Bay with passes to Walker. To finish the drive, Mariota hit Anthony Fasano, who was wide open, for a short touchdown, which put the Titans up 21-0 at the end of the first quarter. Green Bay got moving with a few receptions to Davante Adams and a pass to Randall Cobb (4-31) to get to the 1-yard line. To end the drive, Rodgers hit Jordy Nelson on a slant for the touchdown. Mariota quickly responded by lofting in a beautiful 32-yard touchdown pass to Rishard Matthews (3-63-1). Green Bay responded with 46-yard pass to Adams set up a Mason Crosby field goal. The Packers muffed the punt on the Titans' next drive, giving Mariota a short field. He took advantage of the oppoturnity with a touchdown pass to Kendall Wright (2-8-1). The Packers scored quickly in response, as Rodgers used Adams to move the ball and set up a screen touchdown pass to James Starks (7-33 rushing, 3-11-1 receiving). The Titans took a 35-16 lead into the locker room after Crosby missed the extra point. In the third quarter, Rodgers made a beautiful throw for a great catch by Adams for 35 yards. A few plays later, Rodgers took off on a 20-yard touchdown run. The two-point attempt was stopped, so the Titans' lead was cut to 35-22. The Packers tried an onside kick, but the Titans recovered. Mariota took advantage of the opportunity as he found Sharpe wide open in busted coverage for a 33-yard touchdown. Each team added field goal drives to make it 44-25 early in the fourth quarter. Rodgers wasn't on the same page with his tight end, and that led to an interception for Parrish Cox to give the Titans another field goal and clinch the win midway through the fourth quarter. ",
            "4": "Rodgers was 31-of-51 for 371 yards with two touchdowns and two interceptions - one came on a Hail Mary on the last play of the first half. He also ran for 27 yards and a touchdown. Rodgers played well overall and wasn't the reason for this Packers' loss. ",
            "5": "Jordy Nelson led Green Bay with 12 catches for 126 yards and one touchdown. Davante Adams had six receptions for 156 yards. ",
            "6": "Mariota was incredibly efficient and accurate, completing 19-of-26 passes for 295 yards with four touchdowns. Walker was superb with nine catches for 124 yards and a touchdown. ",
            "7": "DeMarco Murray ran for 123 yards on 17 carries with a score. ",
            "8": "Defensively, the Titans got a good game from rookie safety Kevin Byard with seven tackles and a sack. Brian Orakpo had two sacks, and Derrick Morgan and DaQuan Jones chipped in sacks as well. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "23"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> People have said that this season has been a dud. I disagree. When have we seen a team score a game-winning touchdown, only to need to attempt an onside kick on the ensuing kickoff? That's exactly what the Saints had to do in this game. Crazy! ",
            "2": "Wow. All I can say following that game is wow. The Saints had a terrific drive in the last couple of minutes of the contest to tie the score at 23. Then, the unthinkable happened as the NFL's extra point rule made a huge difference at the end. The Saints marched kicker Will Lutz onto the field to try the game tying 33-yard extra point. As Lutz wound up to kick, Broncos rookie Justin Simmons jumped over the line and successfully blocked the try. Will Parks picked up the deflected ball and started to run it back to the New Orleans end zone. He made it, giving the Broncos the 25-23 lead. The play went under review, however, and on tape, it appeared that Parks had stepped out of bounds at around midfield. The officials determined that there was not enough evidence to say that Parks went out, so the ruling on the field remained unchanged. As a result, the Saints tried an onside kick, but the Broncos recovered the attempt, allowing them to run out the clock to cement the win. Personally, I thought Parks had stepped out of bounds. There were several angles where it looked like his shoe was squarely on the boundary, and I was frankly shocked that the officials did not overturn the call. Then again, it probably was more beneficial for the league to have the Broncos win, since they are considered one of the best teams in the AFC. ",
            "3": "Anyway, speaking of the Broncos, they were not great on offense today, and Trevor Siemian played a part in that. Siemian put up some decent looking numbers, going 25-of-40 for 258 yards and two touchdowns and two picks, but the numbers are misleading. He could only really complete passes in the intermediate game and showed no ability to throw anything downfield. His arm strength is relatively weak, and for this reason alone, I would not be surprised to see Paxton Lynch on the field for the Broncos at some point this season. Siemian also looked a bit out of it mentally. His offensive line was terrible on Sunday, as they allowed a whopping six sacks to the New Orleans front, so that may have shaken his confidence a bit. Still, on his interceptions, he failed to see players moving across the field, and in general, he had issues making decisions. A good quarterback would release the ball quicker if he ends up being under pressure. Siemian simply looks like a low-end starter or high-quality backup at this point in the season. He will limit the team's potential moving forward. ",
            "4": "During the contest, Siemian primarily relied on Demaryius Thomas (8-87, 1 TD) and Emmanuel Sanders (5-54) to lead the way. Thomas was particularly good on the day, and he made a nice one-handed catch on an early drive. Thomas was able to catch a critical touchdown as well, and he used his size to jump over the New Orleans defensive back who was covering him. Thomas should be a high-end WR2 in most weeks, though he could have issues if Siemian struggles. Meanwhile, Sanders had some nice catches, but he played second fiddle to Thomas today. Sanders is still a strong option in fantasy, but occasionally, he will underproduce depending on the matchup. ",
            "5": "The running game for the Broncos was not particularly strong. Devontae Booker got 24 carries, but only recorded 76 yards. He had some nice bursts, but he should have fared better against the weak Saints defense. Kapri Bibbs was worked in a bit, but did not do much better (7-22). It seems like Booker will be the lead back going forward, but he should not be anything more than a high-upside FLEX most weeks. ",
            "6": "For the Saints, this has to have been a frustrating game. They did everything they could to make a late comeback, but they came up short. A good chunk of that effort was led by the performance of Drew Brees. Brees started the game shakily, but he absolutely caught fire later on. At one point, he went 12-of-12 for 163 yards and two touchdowns. During this stretch, the Saints claimed the lead for the first time and looked like they would pull away from the Broncos. Brees was razor sharp during this stretch, which was huge for the team. Overall, Brees went 21-of-29 for 303 yards, three touchdowns and two interceptions. One of the interceptions was not his fault, as Michael Thomas hit the ball up into the air and served it on a platter to the defense. On the other, Brees missed the safety and lobbed the ball a bit too much. That said, Brees' touchdowns were all solid. However, the last one stood out. With the Saints trailing by six, Brees lofted a pass to Brandin Cooks in the end zone, and Brees perfectly fit it into the window between two players. Cooks came down with the ball in what was a huge moment for the team. Brees has to keep making plays like this to continue be one of the best quarterbacks in the league. ",
            "7": "Despite Brees' success, his top receivers had some issues. Cooks (3-98, 1 TD) did not record a catch until there were three minutes left in the second half. He still managed to make some big plays that helped the team a great deal and should continue to be the top receiver for the team. The second-best receiver on the day was Willie Snead (5-47, 2 TD). Snead was actually a red-zone threat despite his size, and he really helped to energize the Saints. He should continue to be a favorite of Brees moving forward. The biggest disappointment of the day was the performance of rookie Michael Thomas. Thomas caught four passes for 40 yards, but he was responsible for three turnovers. The first was the aforementioned interception he caused, and the other two were lost fumbles. He needs to improve his ball security, or he could lose playing time moving forward. ",
            "8": "Mark Ingram and Tim Hightower split carries once again. Ingram looked like the better of the pair, however, totaling 50 yards on 11 carries. There is some uncertainty over Ingram's health though, as he limped off the field during the second half. Hightower only averaged 2.6 yards per carry, but he caught two passes for 34 yards. He can carry the load if Ingram is out long term. ",
            "9": "Final Note: The Saints' defensive front looked absolutely great today. They limited the Broncos' running game, plus recorded six sacks with six different players. Having rookie Sheldon Rankins back is definitely helping the Saints out. Perhaps he will help their defense even more in the future. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The Dolphins were once considered 1-4. Now, they're 5-4. Like I said before, this season is nuts! TV ratings shouldn't be down. Hey, people, come watch football. Sure, the officiating sucks more than ever, but this year is crazy. ",
            "2": "The Dolphins improved to 5-4 to stay in the AFC Wild Card race with their fourth straight victory. Miami quarterback Ryan Tannehill has been criticized a lot, but he threw some amazing passes in clutch time, and the Dolphins' defense was tremendous at producing turnovers in the second half to get Miami a tough road win against a quality opponent. The Chargers let some games get away from them earlier in the season, so they had little room for error in letting winnable games get away from them. At 4-6, San Diego's playoff hopes are on life support in the toughest division in football. Basically, the Chargers now have to run the table to have any shot at getting a wild-card berth. ",
            "3": "The first half was low scoring as both defenses did a good job of getting off the field. The first points came after Melvin Gordon ran well to set up a Chargers field goal. Philip Rivers then put together a good drive with passes to Gordon, Tyrell Williams and Antonio Gates (4-63-1) to get the ball to the Miami 11-yard line. Rivers finished the drive by throwing a bullet to Gates for the touchdown. Late in the second quarter, Tannehill threw a tremendous pass to Kenny Stills for a 39-yard touchdown to cut the Chargers' lead to 10-7 at halftime. Jay Ajayi had only 16 yards on 11 carries by halftime, but not long into the third quarter, he broke off a 40-yard run behind Laremy Tunsil. A 25-yard pass to Jarvis Landry (6-53) put the ball at the 2-yard line, and Damien Williams plunged into the end zone to give Miami the lead. San Diego responded with a completion to Tyrell Williams, a run from Gordon, and a pass interference in the end zone. On third-and-goal, Rivers connected with Hunter Henry (2-11-1) to put San Diego up 17-14. Miami quickly responded thanks to a 21-yard run from Ajayi and Tannehill had about a 15-yard run to convert a critical third-and-11. Tannehill lofted in an 18-yard touchdown pass to Williams get the Dolphins back on top 21-17. After a Miami stop, the Dolphins' Jakeem Grant muffed a punt at 5-yard line, and Darrell Stuckey recovered it for San Diego. The Dolphins had a pass interference after a third-down stop, but Rivers had a pass thrown off the mark, and it was intercepted by Tony Lippett. The Chargers were able to get the ball back, and Rivers used Dontrelle Inman (5-43) to move into Miami territory, but then he had an overthrow picked off by Byron Maxwell to deny San Diego. A good punt return set up Rivers close to midfield with five minutes remaining, and less than a minute later, San Diego had a 24-21 lead as Rivers hit Tyrell Williams on the run for a 51-yard touchdown. Miami came right back though, as Tannehill stepped into a hit and threw another dime deep down the field to connect with DeVante Parker for 56 yards with a roughing-the-passer penalty on Corey Liuget tacked on to put the Dolphins at the 10-yard line. Miami had to settled for a field goal though, but that still tied the game at 24. A run by Gordon of 13 yards and a screen to him of 20 yards moved the ball across midfield, but then disaster struck for Rivers as Kiko Alonso undercut a route to pick off the pass and return it 60 yards for a game-winning touchdown. Rivers had one minute remaining, but Tony Lippett added his second interception to clinch the Miami victory. ",
            "4": "Philip Rivers completed 23-of-44 passes for 326 yards with three touchdowns and four interceptions. Tyrell Williams led San Diego with five receptions for 125 yards and a score. ",
            "5": "Melvin Gordon was contained by the Dolphins' talented defensive line. He had 70 yards on 24 carries, but also contributed five receptions for 62 yards. ",
            "6": "Ryan Tannehill completed 17-of-24 for 240 yards on two touchdowns. The numbers don't illustrate that Tannehill made some phenomenal throws, and he threw the deep ball better than any game I've ever seen from him. ",
            "7": "Jay Ajayi (19-79) was contained by the Chargers' defense. DeVante Parker (5-103) led Miami in receiving. ",
            "8": "Cameron Wake (2 sacks) and Ndamukong Suh played well to lead the Dolphins' defense. Melvin Ingram (4 tackles, 1 sack, 1 forced fumble) thrived for San Diego. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> I didn't cover this game, obviously, but I had it on in the background, and I noticed that Ronde Barber was the color analyst. Then it hit me: I think Barber has been the color analyst for every single 49ers Sunday game this year. Seriously. He's been broadcasting every single one not on national TV. That makes me wonder what the hell the FOX executives have against him. It's almost like he ate some FOX exec's emergency Cheetos, and now he's paying the price. ",
            "2": "This was a surprisingly close game. The Cardinals were heavily favored to win over the atrocious 49ers, but the Cardinals struggled to pull away from their opponent. The Cardinals inspired hope for the 49ers, and that made this game come down to the wire. Chandler Catanzaro ended up winning it with a walk-off field goal, but the Cardinals should have been better. Carson Palmer had an up-and-down performance. There were times when the veteran quarterback looked like he was regaining the momentum he had last year. He was spry in the pocket and managed to move around to complete a lot of passes. At the same time, he made numerous mistakes, including a horrific interception that allowed the 49ers to get back into the game. There were just three minutes left in the fourth quarter when Palmer threw that pick, which was intended for nobody in particular. The Cardinals were leading 20-13 and could have run some more time off the clock. It was a major mistake by Palmer. Overall, Palmer's numbers were solid. He went 30-of-49 for 376 yards, one touchdown and two picks. He definitely has room for improvement on some of his decision-making, but he did give the Cardinals a chance to win it late. His performance on the final drive was strong, so perhaps he will turn that into a solid performance next weekend. ",
            "3": "During the contest, Palmer relied heavily on Larry Fitzgerald to carry the load. Palmer targeted Fitzgerald a whopping 18 times, and the veteran produced. Fitzgerald amassed 133 yards on 12 catches and was all over the field. The 49ers' corners just could not cover him at all; Jimmie Ward had fits trying to do so. Fitzgerald looks like a low-end WR1 moving forward in fantasy. Aside from Fitzgerald, Michael Floyd (5-101) had a strong game. Floyd made a couple of nice, high-point catches where he outjumped his defender. Floyd had a rough start to the season, but maybe he will come on moving forward. John Brown (2-30) and J.J. Nelson (2-29) counteracted each other and did not make much of an impact. ",
            "4": "Perhaps the most surprising part of this contest was the performance of David Johnson. The 49ers have the worst rush defense in the league, and many expected that Johnson would have a huge performance against them. However, Johnson had some trouble getting through San Francisco's defensive line. He ran the ball 19 times for just 55 yards and a touchdown. He also had an impact in the receiving game, catching five passes for 46 yards and a touchdown. Johnson is still the workhorse back, and he will rebound. Being without left tackle Jared Veldheer certainly had an impact on Johnson today. ",
            "5": "Defensively, Chandler Jones continues to be one of the better pass-rushers in the NFL. Jones had another two sacks against the hyper-mobile Colin Kaepernick. It really makes you wonder why the Patriots decided to deal Jones. ",
            "6": "For the 49ers, this was a really nice showing. As mentioned earlier, the team was not expected to compete with the Cardinals, but the 49ers were able to do so. Colin Kaepernick had an OK performance. As a passer, he continued to be as mediocre as ever. He went 17-of-30 for 210 yards and a touchdown. Kaepernick avoided making too many mistakes, and while some of his throws were inaccurate, he got the job done. He led the game-tying drive with poise and proves that he at least belongs in the NFL. Kaepernick made more of an impact on the ground, per usual. He ran the ball 10 times for 55 yards, and he did run for the touchdown on the game-tying drive. That run was particularly nice, as the coaching staff designed it so Kaepernick would have a one-on-one matchup. Kaepernick still tends to scramble too early, but for the most part in this game, he only did it when necessary. The 49ers have to be happy with his performance on Sunday. ",
            "7": "Kaepernick was virtually the only impactful member of San Francisco's ground game. Carlos Hyde carried the ball 13 times and only totaled a measly 14 yards. He was stopped behind the line on many tackles, and he did not look agile. The Cardinals' defense was able to really clog the lanes though, so perhaps that was part of his problem. Hyde also is coming off of an injury, so he might be shaking off some rust. Regardless, he will continue to be the primary back while DuJuan Harris (5-14) works as the backup. ",
            "8": "In terms of receiving, Kaepernick heavily targeted Jeremy Kerley (7-71, 1 TD) and Quinton Patton (3-52). Kerley was solid all around and was able to get open against Arizona's secondary. Without Tyrann Mathieu, the unit struggled to contain the speedy Kerley, and he produced as a result. Kerley could be worth a speculative add, but he is too inconsistent to be relied on in fantasy. Patton, meanwhile, only caught three of his nine targets. He could become a producer, but for now, he is just a mediocre option on a team with quarterback questions. Tight end Vance McDonald (4-50) was able to make an impact on the game as well. ",
            "9": "The 49ers' defensive line played well in this matchup. Rookie DeForest Buckner looks like a future star, and Quinton Dial was able to make some plays too. In the secondary, Jimmie Ward broke up four passes, though he had a so-so performance. Gerald Hodges made the key interception of Palmer in the fourth quarter. Hodges looks to be a quality depth linebacker who will make an impact for the 49ers going forward. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "30"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> Do you think we're finally going to stop hearing about Tony Romo's injury status after this win? It's been silly for a month now. Dak Prescott will be Dallas' starting quarterback going forward, barring injury. Enough about whether Romo is 80.5-percent healthy or 80.6-percent healthy! ",
            "2": "Not that often do games live up to the hype, but this Sunday in Pittsburgh, we witnessed an epic battle between two top offenses. There were seven lead changes, a fake spike that resulted in a touchdown and a three-touchdown day from the frontrunner for Rookie of the Year. If you like defense, maybe this game wasn't for you, but if you like offense, then you came to the right place. The Cowboys came into this day with the best time of possession per game, which had kept opponents' offenses off the field, but this week, the Steelers' offense was on point, with Ben Roethlisberger back at home and healthy. Roethlisberger got the scoring started with a 2-yard touchdown pass to Le'Veon Bell and then a 3-yard touchdown pass to Eli Rogers to put Pittsburgh up 12-3 right before the first quarter was up. And yes, those 12 points weren't four field goals; they were two touchdowns and two missed two-point conversions. Mike Tomlin's proclivity for the two-point conversion came back to bite him this week, as the Steelers scored four touchdowns on the day and failed all four of their conversions. With just 12 seconds left in the first quarter, down 12-3, Dak Prescott hit Ezekiel Elliott on a screen pass that Elliott took 83 yards for his first touchdown of the day. He had blockers helping him down the sideline, but his long speed was evident as he blew by the Steelers' defense. The second quarter and much of the third quarter slowed down a bit, as the two teams traded two field goals each to give the Steelers an 18-16 lead with a couple of minutes left in the third quarter. That's when Dak Prescott made one of the best plays of his career so far, as he eluded a heavy pass rush and hit Dez Bryant for a 50-yard touchdown. Prescott started off slowly in this one. He missed a few throws and lost an early fumble, but he never lost his poise and came on strong, leading his team on seven scoring drives. He completed 22-of-32 passes for 319 yards and two touchdowns, and has firmly taken control of the starting quarterback job over Tony Romo. Roethlisberger and the Steelers came back after the Bryant touchdown and retook the lead with a one-yard rushing touchdown for Le'Veon Bell with 7:51 left in the game. Bell hadn't scored a touchdown this season, but he managed two in this game, plus totaled 134 yards on 17 carries and nine receptions. He looked unstoppable at times as he stood at the line just waiting for a crease, which he would then explode through. He is fun to watch. That Bell touchdown put the Steelers up 24-23, as they missed yet another two-point conversion. It was again time for the Cowboys with 7:51 left in the game, and they methodically drove down the field with their mammoth offensive line and Ezekiel Elliott navigating behind it. With two minutes left in the game, the Cowboys were 14 yards from a touchdown and could easily milk more clock, but the Steelers smartly backed off a bit and let Elliott coast in untouched for a 14-yard touchdown. This fact could be debated, as the Cowboys' offensive line can make any team look like they are giving up, but it was the best play for the Steelers, and it looked like they let him score. That touchdown gave Dallas a 29-24 lead and allowed the Steelers a minute and 55 seconds to move back down the field for the win, which they did, but too quickly. Roethlisberger and company had no trouble moving the ball down field, and then Roethlisberger pulled a Dan Marino and faked a clock-killing spike only to toss a beautiful 15-yard touchdown to Antonio Brown, making the score 30-29 with 42 seconds left. Oh, and another missed conversion. Prescott used his 42 seconds well, but the play that set up the game-winning play was a facemask that pushed the Cowboys within Dan Bailey's field goal range. But, the Cowboys wouldn't need that field goal, because Ezekiel Elliott would finish off the day with a 32-yard burst up the middle for the game-winning touchdown and his third touchdown of the day. ",
            "3": "Elliott finished the day with 114 yards rushing and two touchdowns on 21 carries while adding two catches for 95 yards and a touchdown on two targets. He's now eclipsed 1,000 rushing yards on the year and has 10 total touchdowns through nine games. He's your rookie of the year unless things go south fast. ",
            "4": "The Cowboys are rolling. They've now won their last eight games after losing their season opener, and they should be favored in every game going forward. Oh, and they have an extremely good backup quarterback if their hot rookie is hurt or forgets how to play football. ",
            "5": "The Steelers aren't doing nearly as well, as they now have a losing record at 4-5. Fortunately for them, they also are only one game back of Baltimore for the division lead. Add in the facts that the Ravens play the Cowboys next week and the Steelers take on the winless Browns, and there's a decent shot the Steelers are feeling better about their long-term chances by this time next week. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks suffered tremendous heartbreak in the Super Bowl a couple of years ago when they had a goal-to-go situation that ended poorly, as Russell Wilson was intercepted by Malcolm Butler. The roles were reversed in this contest, as the Patriots had a chance to force overtime following a trip inside the 2-yard line. Tom Brady and LeGarrette Blount were stuffed for a total of three occasions, while fourth down was a throw toward Rob Gronkowski. Kam Chancellor and Gronkowski had some contact with each other, but no flag was thrown as the pass fell incomplete. Seattle held on to the victory this time. While it wouldn't make up for the Super Bowl loss, it was still sweet revenge. While the defense came up big at the end, Seattle's MVP in this victory was clearly Russell Wilson. The MVP canadate struggled earlier in the year because of multiple injuries, but his performance against the Bills on Monday night was an indication that he was close to 100 percent. While he isn't quite there yet in terms of making scrambles for long gains, he's close enough to where he can be completely dominant. Wilson finished 25-of-37 for 348 yards and three touchdowns. He threw some absolute dimes in this contest, including a perfectly placed pass to Tyler Lockett for 36 yards in the early going. He also dropped in a beautiful bomb to C.J. Prosise for a 38-yard connection late in the contest, and he managed to do so while taking a big hit. Wilson didn't post any rushing numbers of consequence (3 carries, 6 yards), but he maneuvered the pocket well and did a good job of escaping potential sacks and keeping plays alive, as he's been wont to do throughout his career. Wilson didn't make very many mistakes. There were a couple, as two potential interceptions were dropped. However, he also should've thrown a fourth score, but Jermaine Kearse let the ball slip through his hands on the team's first offensive drive of the evening. One of Wilson's touchdowns occurred at the end of the first half in which he engineered a terrific scoring drive with 70 seconds remaining on the clock following a New England score. The drive was capped off with a touchdown pass to Doug Baldwin. ",
            "2": "Speaking of Baldwin, he was the recepient of all of Wilson's touchdowns. He hauled in six of his eight targets for 59 yards. He trailed Tyler Lockett (3-72), who looked healthy once again. ",
            "3": "C.J. Prosise actually led the Seahawks in receiving. He was a monster in the passing game. He snatched all seven of his targts for 87 receiving yards, and he also rushed for 66 yards on 17 carries. He had way more of a workload than Christine Michael (5-22) and was robbed of a touchdown in the fourth quarter when the officials made an incorrect call and a terrible ruling on a replay review. Thomas Rawls will be returning soon, but it's hard to imagine the Seahawks shying away from Prosise, who was absolutely terrific. ",
            "4": "Before moving on to the Patriots, Pete Carroll's decision at the end of the game needs to be discussed. Following a touchdown, the Seahawks were up 31-24, with an extra point pending. Carroll went for two. The announcers criticized this move, but I didn't mind it. Converting would've meant a two-possession game, so the game would've effectively been over. Essentially, it came down to Carroll trusting his offense's chances of getting two yards than his defense's ability to stop Tom Brady from getting two yards. Ironically, New England was stopped at the goal line at he very end. ",
            "5": "Brady had another strong performance against a Seattle defense that welcomed back Chancellor. He finished 23-of-32 for 316 yards, but had some blemishes, including an interception into double coverage. The ball just died on him. It was the first pick thrown by a New England quarterback all year. Brady made up for it later by completing a third-and-25 pass to Julian Edelman to set up a score. ",
            "6": "Brady's top receiver wasn't Julian Edelman or Rob Gronkowski; it was Martellus Bennett, who reeled in all seven of his targets for 102 yards. Edelman had a strong evening (7-99) until the very end when he lost a fumble. Chancellor stripped the ball away, and it set up Seattle's game-winning touchdown. Gronkowski, meanwhile, also appeared to fumble, but replay review showed that his bionic commando arm was down. Gronkowski missed a bit of action with what appeared to be a concussion, but he was able to return to action and was ultimately targeted on the final real play of the game. ",
            "7": "Brady's fantasy owners weren't pleased because their quarterback didn't throw any touchdowns. LeGarrette Blount had all the scores, plunging into the end zone three times. He finished with 69 yards on 21 carries, while James White snatched four passes for 32 receiving yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Giants",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Both of these teams were overrated heading into this contest. The Giants had some sketchy victories in which they were very fortunate, while the Bengals weren't living up to preseason expectations because they lost so much personnel this season. Cincinnati, entering Monday night with a 3-4-1 record, needed to prevail to keep pace with the Ravens, but despite having a lead for most of the second half, it ended up losing to New York. The Bengals struggled to move the chains throughout the evening, as they amassed just 12 first downs. They were able to score 10 points off an interception and a kick return, but a give-away of their own - a horrible interception by Andy Dalton hurled high into double coverage, was the deciding factor. It was an abysmal decision by Dalton, as he had the team driving into New York territory, down one point. The Giants were able to take over, and while they didn't score after that, it allowed them to flip field position. Dalton had one more drive, but his offensive line, which has been a disappointment this year, let him down again. The Giants sacked him on two consecutive plays, and after Cincinnati punted the ball away, it couldn't get the ball back after Rashad Jennings inexplicably picked up first downs after not doing anything the rest of the evening. ",
            "2": "Dalton finished an underwhelming 16-of-29 for 204 yards, one touchdown and the horrible interception. A big chunk of his numbers, a 72-yarder, came on a trick play in which the Bengals had three offensive linemen, and they were able to match up Tyler Eifert on a slow linebacker. Take that snap away, and Dalton would've been 15-of-28 for 132 yards, one touchdown and a pick. On the flip side, he should've thrown a second score, but Tyler Boyd dropped the ball. ",
            "3": "I expected Eifert to do a lot in his second full game back, especially against a poor Giants linebacking corps. However, he didn't accomplish much outside of that trick play. Eifert hauled in just three balls for 96 yards. He was targeted once in the end zone, but the pass was too high. It seems absurd that Dalton threw to Eifert just five times. Dalton's touchdown went to A.J. Green (7-68), who was hobbling around after coming down awkwardly in the second half. ",
            "4": "Jeremy Hill struggled to find running room for most of the evening, but he broke free for a touchdown in the first half. Hill managed just 46 yards on 15 attempts. Giovani Bernard (7-17) even did less, and he was also guilty of a drop. ",
            "5": "Dalton struggled and lost. Eli Manning prevailed, but wasn't much better. He threw three touchdowns, but was responsible for two ugly interceptions. The first was a telegraphed pass, which Dre Kirkpatrick was able to haul in. The second was a wildly inaccurate downfield shot following Dalton's interception. Manning finished 28-of-44 for 240 yards, three touchdowns and the two picks. He started the night on a hot streak, as he was 6-of-6 for 72 yards and a score on the opening drive. He cooled off after that, however. He took a sack on a fourth-down attempt, but he did inexplicably rush for a first down, which brought the crowd to its feet. ",
            "6": "Odell Beckham Jr. had a big game, as he reeled in 10 of his 11 targets for 97 yards and a touchdown. Sterling Shepard (5-42) and Jerell Adams also scored. Shepard had a bad drop on a third down, while Victor Cruz didn't play. Roger Lewis replaced Cruz and struggled mightily. He dropped two balls, ran a wrong route and was the intended target of Manning's first interception. ",
            "7": "As mentioned, Jennings didn't do much until the very end. He picked up two first downs to ice the game, as one rush was a gain of 25. This helped his overall stat line - 15 carries, 87 yards - even though it was pretty ugly for most of the evening. Paul Perkins (9-31) actually looked better prior to the final drive. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    }
}