{
    "year": "2016",
    "week": "06",
    "Game 1": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "13"
        },
        "comments": {
            "amount": "10",
            "1": "It turns out that not having a head coach around to prepare for a game on just three days of rest is not a recipe for success. The Broncos committed countless penalties and were out-coached in this divisional battle against a San Diego squad that finally was able to hold on to a lead. It did appear as though the Chargers were going to blow it. They led 21-3 following a safety, but one of their special-teamers muffed the ensuing kickoff. The Broncos scored a quick touchdown, forced a turnover and drove down the field again. C.J. Anderson appeared to score yet another touchdown, but one of a half-a-dozen holds nullified what was a heroic effort by Anderson in which he broke four tackles to reach the end zone on a would-be 20-yard reception. Following a sack, Trevor Siemian hit Demaryius Thomas for a big gain, but the star receiver lost a fumble. The Chargers recovered, and following a late scare that involved an onside kick recovery, they finally sealed their first victory since they beat the Jaguars in Week 2. ",
            "2": "Philip Rivers set the tone for this victory by torching the Broncos on the initial two drives. Rivers was absolutely on fire, slinging precise throws on nearly attempt. In fact, his second possession went for 10 minutes, which was the longest drive of the season for any team. He began 14-of-18 for 148 yards and a touchdown. However, Denver's defense clamped down on the Chargers after that. Rivers was just 4-of-11 for 30 yards the rest of the way, ultimately finishing 18-of-29 for 178 yards and a score. His overall numbers would've been better had Antonio Gates not dropped two passes, one of which would've moved the chains on a third down. Rivers played a great game despite the injuries he's been dealing with up front; Joe Barksdale was the latest blocker to get hurt, though he did return to action eventually. Rivers passed Dan Fouts as the Chargers' all-time passing leader in terms of yards. ",
            "3": "Gates caught only two passes for 16 yards, and he played second fiddle to Hunter Henry. The rookie tight end was terrific, catching six balls for 83 yards and a touchdown. He was dominant, and the struggling Denver linebackers didn't have any sort of answer for him. ",
            "4": "Excluding Henry and Gates, only three Chargers caught multiple passes: Tyrell Williams (3-28), Travis Benjamin (3-17) and Dexter McCluster (2-15). Benjamin muffed a punt in the opening half, setting up a Denver field goal. However, he made up for it by drawing a pass-interference flag on Aqib Talib. ",
            "5": "Melvin Gordon struggled to find running room for the most part, but finally broke free for a 48-yard gain in the third quarter. Gordon dashed for 94 yards on 27 carries. ",
            "6": "Before moving on to the Broncos, I have to say that this was definitely a feel-good moment for Mike McCoy, who was set to be fired if the Chargers lost this game. A teary-eye McCoy addressed the media, which called for his firing during the week, and he told them that he met with his daughter right after the game. ",
            "7": "Denver struggled to move the chains until garbage time at the end that nearly turned into an improbable comeback. The Broncos were limited to 60 net yards of offense in the opening half. Part of this was because the Chargers controlled the clock, holding the ball for 20:27 of 30 first-half minutes. The other part was that the entire offense was both ineffective and mistake-prone. Trevor Siemian struggled. His final numbers don't look horrible - 30-of-50, 230 yards, one touchdown - but at the end of the third quarter, he was just 10-of-19 for only 58 yards. He didn't have any significant yardage, as most came with the Broncos down two or three scores and the Chargers turning into a prevent defense that nearly lost them the game. It's unknown why they changed their strategy, but it nearly clost them. Siemian had chances to score points in meaningful action, but missed throws. He had Emmanuel Sanders open for a deep touchdown in the first quarter, but overshot him. There were other passes he should've converted, including a gain of 15 or so to Demaryius Thomas that would've moved the chains on a third down, but Siemian just missed him. He also nearly threw an interception, but the ball was dropped. ",
            "8": "Mistakes killed the Broncos all evening. For instance, C.J. Anderson rushed for only 37 yards and was outgained by Devontae Booker (5-46), but he had runs of 15 and 12 negated by holds by Max Garcia (who was responsible for the safety) and Matt Paradis. Plus, as mentioned, Anderson's impressive touchdown reception was nullified by another hold. The Broncos racked up 103 penalty yards, indicating that they simply weren't prepared to play, as a result of Kubiak's absence. ",
            "9": "Both of Denver's receivers disappointed their fantasy owners. Thomas saw 10 targets, but caught five balls for only 35 yards. He also lost the aforementioned fumble. Sanders (4-40) was only slightly better. Sanders sustained some sort of injury in the second half, but was able to return to action. Both wideouts would've done much better if Siemian didn't struggle with accuracy issues. ",
            "10": "Phil Simms, as usual, was horrible. Here were some of his quotes from tonight: To get 66 percent of any people to agree on anything is next to impossible. Simms said this about the Chargers' stadium deal. What's funny about this is that three days ago, the Las Vegas stadium passed at a 76.2-percent rate. Nice one, Phil. In golf terms, Jim, it's just like a golf swing keeping that arm straight with his swing. I have no idea what this means. I guess that was for the 10 golf fanatics watching Thursday Night Football. Simms also poked fun at fantasy football at some point in the first half. He did the same thing last week, according to Matthew Berry, who went savage on Simms on Twitter. Simms, proving that he's completely out of touch, needs to understand that most people were watching this game because they're fantasy football owners checking out what their players were up to. The completely arrogant Simms just offended most of his viewer base instead. Why the hell is CBS still employing this guy!? Besides, it's not like Simms has many fans. Check out these tweets that I found: "
        }
    }
}