{
    "year": "2016",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Lions",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "It's been a running theme for weeks now. The Lions find themselves trailing in the fourth quarter, but thanks to some late heroics by Matthew Stafford and Matt Prater, they've been able to pull out victories. That was once again the case on Thanksgiving, as Detroit trailed 13-10 with only a few minutes remaining. Stafford, despite starting a possession on his own 2-yard line, was able to engineer a tying drive, and following a Sam Bradford interception, Prater sealed the victory with yet another clutch kick. The Lions, as a result, have established sole possession of first place of the NFC North with a 7-4 record. Stafford was amazing in this game. His fourth-quarter effort was absolutely brilliant. He was able to escape pressure to scramble for a first down on a third-and-15. He then ripped a pass to Anquan Boldin for a gain of 29 yards while taking a bit hit on a third-and-18. This improbable conversion set up the tying field goal after Minnesota linebacker Eric Kendricks was able to temporary stop the bleeding with a terrific tackle on third down. The Kendricks stop seemed to be absolutely huge, especially after the Vikings moved the chains on the ensuing drive, but Cordarrelle Patterson negated that conversion by lining up incorrectly. The play immediately following the penalty was Bradford's pick, snatched by Darius Slay. Stafford was also on fire in the early going, starting 8-of-8 for 69 yards. His initial incompletion was a Golden Tate drop. Stafford's receivers betrayed him throughout the afternoon. Andre Roberts dropped a deep touchdown after a Minnesota corner fell down. Marvin Jones also had a considerable gain wiped out when the ball slipped through his hands. Stafford finished 23-of-40 for 232 yards and a touchdown (as well as 30 rushing yards), but as you can see, his numbers should've been a lot better. The Vikings were able to stymie Stafford in the third quarter with some great pressure, but the Detroit signal-caller eventually came through in the clutch, as he's been wont to do this year. ",
            "2": "Stafford's sole aerial score went to Boldin, who caught seven passes for 69 yards. He trailed only Tate in that category, as Tate snatched five balls for 77 yards. Jones saw the most targets (11), but had a disappointing result - four catches, 54 yards - thanks to Xavier Rhodes' terrific coverage. ",
            "3": "Theo Riddick gained 45 yards on nine carries. A big chunk came on a 12-yard burst early on, so Riddick didn't do much otherwise. Still, it was an improvement over last week, when the Lions couldn't even gain 20 yards on the ground. ",
            "4": "As for the Vikings, Bradford's stat line might look pretty good because of his completion percentage. He went 31-of-37 for 224 yards and the aforementioned interception. I'm sure some NFL talking heads who slurp quarterbacks will compliment Bradford for that completion percentage, but it's just further proof that stats can be very misleading. Bradford misfired just six times because he dinked and dunked most of the time. There were so many occasions when he settled for short passes on third-and-medium or third-and-long, which would explain why the Vikings were just 2-of-10 on third down. Minnesota's offense was just agonizing to watch. The team had just one completion of longer than 21 yards, and that was a 41-yard short toss to Jerick McKinnon that the spry running back was able to turn into a big gain because of a blown coverage. Take away that fluky connection, and Bradford would've thrown for just 183 yards on 30 completions, which is just sad. I don't completely blame Bradford for being a checkdown machine because he can't exactly trust his offensive line, plus Stefon Diggs was out. However, there times when Bradford had plenty of time in the pocket, and he still settled for 3-yard completions on a third-and-8. ",
            "5": "With Diggs out, Bradford spent the majority of the time targeting Kyle Rudolph and Adam Thielen, both of whom drew double-digit targets. Rudolph hauled in nine of 10 passes thrown his way for 64 yards, with the sole failed connection being a drop. Thielen, meanwhile, snared eight of his 11 targets for 53 yards. He was also guilty of a drop. Patterson, who made the greatest mistake of all, reeled in five passes, but for only 15 yards. He also picked up 22 rushing yards on a double reverse. Rookie Laquon Treadwell was even less of a positive factor. He failed to haul in his only target, as he dropped it. The ball popped into the air and was picked off by Slay. However, Slay was called for pass interference on what was a very shaky penalty. This occurred on the first drive, and Treadwell wasn't heard from again. He's been a huge disappointment thus far. ",
            "6": "The Vikings once again struggled to run the ball. McKinnon tallied 31 yards on nine carries, most of which came on a 10-yard burst. He also caught four balls for 45 yards, which includes the 41-yard reception I mentioned earlier. Matt Asiata, meanwhile, gained 27 yards and a touchdown on five attempts. ",
            "7": "As if the Vikings didn't have enough injuries, they lost stud center Joe Berger in the middle of this contest, as he was knocked out with a concussion. ",
            "8": "This game took a while to start because Chef's mother, I mean, Aretha Franklin took what seemed like 10 minutes to sing the National Anthem. I just had to post this on Facebook: "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "The Cowboys continue to look unstoppable. Though they won by just five points, they were up by double digits for most of the afternoon, as they dominated a hot Redskins team. In the wake of this latest victory, Dallas is now 10-1. The Cowboys were flawless on offense, scoring on nearly every possession. The only times they didn't put points on the scoreboard was when the officials missed obvious pass-interference flags on the Washington defensive backs. This happened on a couple of occasions, so it's impressive that the Cowboys were still able to lead by double digits for most of the second half. ",
            "2": "Dak Prescott was nearly flawless, going 17-of-24 for 195 yards and a touchdown. He also scored a second time on the ground, rushing for 39 yards on eight scrambles. The numbers don't look overly impressive, but his play was so much better than his stats indicate. He made numerous breath-taking throws, including a perfect pass to Cole Beasley to convert a third-and-14. He was also betrayed by a drop by Dez Bryant in the red zone. Prescott's only mistake on the afternoon was overthrowing a wide-open Brice Butler for a potential touchdown in the second quarter. ",
            "3": "Ezekiel Ellott was dominant, as usual. He trampled the Redskins, gaining 97 yards and two touchdowns on 20 carries. He also caught two passes for 23 receiving yards. The Redskins managed to stuff him in the backfield on some instances, but Elliott's tough running sparked many of Dallas' successful drives. ",
            "4": "I mentioned earlier that Bryant was guilty of a drop. He still managed to lead the Cowboys in receiving, hauling in five balls for 72 yards. However, he was kept out of the end zone, thanks to Josh Norman's coverage. Beasley (5-56) was next on the chart. Dallas' best catch came from Terrance Williams. It was his only reception of the afternoon, but he made it count. Williams leapt for a pass in the end zone, but before falling out of bounds, he tapped both of his toes in the field of play somehow. ",
            "5": "The Redskins had a number of terrific catches of their own, as Kirk Cousins went 41-of-53 for 449 yards and three touchdowns. Cousins' stats were inflated because he constantly had to keep throwing because the Cowboys were way ahead. However, Cousins was excellent, as he went an unreal 23-of-27 for 233 yards in the second half. Cousins continues to improve following the slow start to his season, and he's sure to obtain a massive contract at some point in the near future. ",
            "6": "Two of Cousins' touchdowns went to Jordan Reed (10-95), who was briefly knocked out of the game with an injury at the beginning of the second quarter. However, he came on strong at the end and racked up plenty of points for his fantasy owners. He trailed only DeSean Jackson in receiving, as Jackson caught four of eight targets for 118 yards and a touchdown. Three other Redskins logged at least 43 receiving yardage: Jamison Crowder (8-88), Vernon Davis (5-68) and Pierre Garcon (4-43). ",
            "7": "Robert Kelley had some tough runs in this contest, but didn't produce much yardage, as the Redskins had to abandon the run because they trailed throughout. Kelley's 14 carries went for 37 yards, but he punished the Dallas front with his tough plunges. ",
            "8": "One thing I forgot to mention was that the sun was once again a factor, as the glare helped distract the Washington receivers in the first quarter. For all the money Jerry Jones put into the stadium, there sure are some major design flaws. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Colts came into this game without much of a chance because Andrew Luck was sidelined with a concussion. No one told them that, as they were competitive with the Steelers, which is contrary to what the final score says. Indianapolis trailed by two touchdowns for most of the second half and were moving the chains pretty well. However, red-zone blunders, coupled with a late-game meltdown from Scott Tolzien, gave the Steelers a victory, allowing them to improve to 6-5. ",
            "2": "Ben Roethlisberger threw just 20 times, but he was unstoppable for the most part, completing 14 of the attempts for 221 yards and three touchdowns. Roethlisberger aired out numerous impressive deep shots against an injury-ravaged Indianapolis secondary featuring a hobbled Vontae Davis and a sidelined Clayton Geathers. Roethlisberger could've posted a better stat line, but there were a couple of drops, one by Sammie Coates that would've moved the chains on a third-and-12. ",
            "3": "All of Roethlisberer's touchdowns were hauled in by Antonio Brown, who made Davis look completely incompetent. It's a shame for Davis, as he's clearly not 100 percent. Thus, it was impossible for him to keep up with the best receiver in football. Brown caught five passes for 91 yards. Roethlisberger spent most of the evening targeting Brown, as only three other Steelers caught multiple passes, and only one other logged more than two catches. Ladarius Green (2-67), Eli Rogers (2-67) and Le'Veon Bell (4-22) were next on the stat sheet. ",
            "4": "Speaking of Bell, he was terrific, gashing the Colts with his trademark great patience. Bell gained 120 yards and a touchdown on 23 carries in addition to his receiving numbers. He had a long run negated by a penalty. ",
            "5": "The Colts came into this game without Luck, and they sustained more injuries, as two linemen went down early. Ryan Kelly was knocked out of the game with a shoulder on the first drive, while guard Denzelle Good got hurt on the very next possession. With two linemen down, Scott Tolzien took plenty of big hits throughout the evening, and this pressure forced some late turnovers that allowed the Steelers to seal the victory. Tolzien got off to a poor start. His first possession featured a sack-fumble, an overthrow and a loss of five yards. The Colts couldn't really do anything on offense until punter Pat McAfee connected on a fake punt pass. Indianapolis scored a touchdown on the drive, and Tolzien made some impressive passes in the second half. He converted a third-and-15 and then moved the chains on a throw to Dwayne Allen on a fourth-and-4. Tolzien, however, self-destructed late. He overthrew a receiver, allowing Michael Mitchell to snatch an interception. Tolzien was picked off shortly after on an underthrown pass. Earlier, he hurled the ball behind his receiver on a fourth-and-1 in the red zone, negating a scoring chance. The Colts failed once again later in the red zone. They passed on two field goals, and had they decided to kick them, they would've been down just eight in the fourth quarter and wouldn't have had to force the issue. For his overall numbers, Tolzien went 22-of-36 for 205 yards, one touchdown and the two interceptions. He played much better than expected. Considering he was recently a third-string quarterback playing on just three days of preparation, Tolzien could've easily been a disaster, but he made numerous impressive throws, showing that he can definitely be a backup in this league. He easily could've posted better numbers, but was hurt by some deep drops. ",
            "6": "T.Y. Hilton led the Colts with 54 receiving yards on three catches. Hilton was guilty of a drop way down the field, but he hauled in a 32-yarder and took a crushing hit at the end of it. He was down for a while, but was able to return to action. Meanwhile, Donte Moncrief (6-45) scored Tolzien's sole touchdown. He was also guilty of a drop around the 5-yard line. Dwayne Allen (5-49) was also a solid contributor. ",
            "7": "Frank Gore struggled to find running room, as the Steelers played closer to the line of scrimmage and forced Tolzien to beat them. As a result, Gore gained just 28 yards on 15 carries. He was stuffed a couple of times at the goal line. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "19"
        },
        "comments": {
            "amount": "8",
            "1": "Despite what the score says, the Cardinals managed to outgain the Falcons in terms of yards per play for the duration of the afternoon. Based on most of the plays, they appeared to be the slightly better team, or at the very least, they were even with Atlanta. However, self-inflicted wounds and horrible coaching absolutely ruined any chance they had of winning this game and keeping their season alive. In a tight game in the early going, the Cardinals were going for the lead while in the red zone. A high snap in a short-yardage situation caused a big loss, forcing Arizona into a field goal. Deone Bucannon then picked off Matt Ryan, but that was wiped out by a shaky pass-interference call on Patrick Peterson. Jermaine Gresham followed that up with a dropped pass on a third down. Following halftime, safety D.J. Swearinger dropped an easy Ryan interception, giving Atlanta new life. Ryan was able to take the opportunity to pick up a first down on a third-and-10 scramble. And if all that wasn't bad enough, the Cardinals forced a punt, down 24-13 early in the fourth quarter, but Calais Campbell inexplicably lined up offside. The Falcons' drive continued, and was capped off with a touchdown, giving them an insurmountable 31-13 advantage. The Falcons, meanwhile, didn't do anything that impressive, despite their blowout victory. Most of their chunks of offense came on fluky plays, whether they were screen passes to Taylor Gabriel, or Ryan third-down scrambles, or poor pass-interference calls on Patrick Peterson. Again, Atlanta was being outgained in yards per play the entire afternoon, so its offense wasn't as good as Arizona's, and anyone who paid close attention to this game would probably agree. ",
            "2": "Ryan finished 26-of-34 for 269 yards, two touchdowns and an interception. He played well overall, but wasn't great. Statistics can often be misleading, and that was certainly the case in this instance. Two of Ryan's longest completions, a 35- and a 25-yarder, were short tosses to Gabriel, who did all the work against a sloppy Arizona defense. Ryan's pick wasn't his fault, as it was a Julio Jones bobbled that popped up into the air, but Ryan should've been picked on a couple of other occasions, as referenced earlier. Perhaps his best play was the aforementioned 11-yard scramble on third-and-10 that helped seal the victory. ",
            "3": "Gabriel happened to be Atlanta's leading receiver. He caught four balls for 75 yards and two touchdowns, which came on a combined 60 receiving yards. Gabriel also had a 27-yard rush. It's baffling that the Browns let him go for nothing; Gabriel isn't reliable enough to be a fantasy option, but he's a dynamic weapon to have in an offense, and he'll serve the Falcons well going forward. ",
            "4": "Jones, meanwhile, couldn't get much going against Peterson. Arizona's stud corner was unjustly flagged for interference on some occasions, but he managed to limit Jones to four grabs for 35 yards. Peterson missed a few plays with an injury and looked somewhat gimpy upon his return, but Jones couldn't take advantage. Meanwhile, Mohamed Sanu caught all eight of his targets for 65 yards. He was the recipient of a fourth-and-3 conversion on the opening drive. ",
            "5": "The Cardinals were able to limit Devonta Freeman for the most part, though he had some nice bursts late in the game when Arizona's effort level went down. Freeman gained 60 yards and two touchdowns on 16 carries. ",
            "6": "As for Arizona's ground attack, it's baffling to me why David Johnson was given just 13 carries. Don't blame the deficit, as this was a close affair for two-and-a-half quarters, and Johnson had just 10 rushes at halftime. Johnson gained 58 yards on those 13 attempts. He did catch eight passes for 103 yards and a touchdown, but Bruce Arians has to be downgraded for this silly game plan, given that the Falcons have been proven to be soft up the middle. ",
            "7": "While Johnson carried just 13 times, a decrepit Carson Palmer aired the ball out on 45 occasions despite continued poor pass protection; 21 times in the first half. Again, Arians is looking more clueless each week. Palmer went 25-of-45 for 289 yards, two touchdowns and an interception. The numbers don't look horrible until factoring in the fact that Atlanta was missing top cornerback Desmond Trufant. Also, one of Palmer's scores came in garbage time. ",
            "8": "With Trufant out, Larry Fitzgerald was expected to have a big game. That did not happen, as Fitzgerald caught four passes for only 53 yards. He was targeted just four times for some reason. Fitzgerald opened the game with a crazy, one-handed grab over Brian Poole, but saw just three targets after that. Arians opted to work Gresham (5-35, TD) over the middle of the field instead, which turned out to be yet another mistake. This was just yet another baffling error from Arizona in this game. Elsewhere in the Arizona passing game, Michael Floyd (2-31) and J.J. Nelson (2-30) did nothing. John Brown (1-19) left the game with an injured hamstring, forcing a hobbled Floyd into action. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "31"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Dolphins may have won their sixth in a row to improve to 7-4, but there's definitely some concern - and not all of it is on offense. Of course, there are problems with the blocking unit, thanks to numerous injuries. However, the defense had major trouble stopping the 49ers, who went up and down the field quite often against the Dolphins. The scary thing, for any Dolphin supporter, is how close the team was to blowing this game. The 49ers had an early lead, as they easily went down the field for an opening touchdown. San Francisco lost a scoring opportunity in the second quarter when Garrett Celek lost a fumble in the red zone. The 49ers had another scoring chance negated at the very end, of course, as Colin Kaepernick was tackled short of the goal line of the final play of the game. The 49ers have no talent on offense outside of Carlos Hyde, so this has to be a major concern for Miami. The Dolphins had no answer for Kaepernick, who helped rack up 475 net yards of offense and 25 first downs. Had Miami surrendered 477 net yards instead of 475, this game would've gone to overtime. ",
            "2": "Kaepernick finished 29-of-46 for 296 yards, three touchdowns and an interception that wasn't his fault; Torrey Smith had the ball pop out of his hands on the opening play of the third quarter. He was welcomed to the field by a chorus of boos, but those quickly transformed to oohs and ahhs, as Kaepernick was able to make some dazzling plays to help the 49ers move the chains consistently. Most of his great plays came on the ground, as Kaepernick accumulated 113 rushing yards on 10 scampers. ",
            "3": "Kaepernick's touchdowns went to Hyde, Smith and Celek. However, his leading target, Vance McDonald (4-60) didn't find the end zone. Smith, as mentioned, was responsible for Kaepernick's sole interception. He once again proved to be inefficient, securing just thee of his seven targets for 24 yards. I'll never understand why he was the center of all of those trade rumors several weeks ago. As for Hyde, his receiving numbers - five catches, 30 yards and a touchdown - saved his lacking rushing numbers; he gained 65 yards on 13 carries, most of which came on a 24-yard burst. ",
            "4": "As for the Dolphins, Ryan Tannehill posted solid numbers, going 20-of-30 for 285 yards and three touchdowns. He didn't have three of his best offensive linemen, but was also battling an injury-ravaged team completely devoid of talent. Tanehill was robbed of a fourth score, but DeVante Parker was ruled out of bounds on what appeared to be a touchdown at first glance. Jay Ajayi ran in the score shortly afterward. Having said all of this, Tannehill made some mistakes. He should've thrown an interception, but it was dropped. He also was guilty of taking a bad sack to move his team out of field-goal range in the third quarter. ",
            "5": "Parker missed out on having a monster day. He had a touchdown wiped out because his forearm landed out of bounds before his second foot was planted in the end zone. He also had a 32-yard leaping grab along the sideline wiped out by another review. As a result, Parker caught three passes for 64 yards, but he easily could've eclipsed the century mark and scored a touchdown. Adding injury to insult, Parker was knocked out of the game with a back injury. Elsewhere in Miami's receiving corps, Kenny Stills (3-72), Dion Sims (4-53) and Leonte Carroo (1-15) caught Tannehill's touchdown. Jarvis Landry had a disappointing afternoon with four grabs for 47 yards. He dropped a pass. ",
            "6": "Ajayi, missing three offensive linemen, didn't have the best rushing day, gaining just 45 yards on 18 carries. As mentioned, however, he managed to find the end zone as a result of Parker's overturned touchdown. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Giants",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "Giants fans were holding their breath when Odell Beckham Jr. was taken into the locker room in the first half. Beckham had some sort of a thumb problem, and his status wasn't known. That was adding injury to insult, as the Giants were sluggishly trying to separate from the Browns. Some may have thought that New York was playing down to its competition, but the Giants have barely beaten bad or middling competition all year, so this was hardly a surprise. Beckham, however, was able to return to action after missing a couple of drives, and the Giants managed to take the lead by capitalizing on some Cleveland mistakes. Isaiah Crowell lost a fumble in his own territory, which set up one of New York's two touchdowns in the opening half. Later, after the Browns had drawn to within one score, Johnathan Hankins hit Josh McCown's arm as he released the ball. The pass was picked off and taken back for six. That effectively sealed the victory for New York, as the Browns didn't have much going on offense throughout the afternoon. ",
            "2": "The Giants are fortunate that the Browns were guilty of dumb errors, as they couldn't do much on offense either. Again, 13 of their 27 points - an extra point was missed - came as a result of Cleveland turnovers. With that in mind, it's a horrible sign that New York was able to muster just 14 points against Cleveland's woeful defense. And don't blame Beckham's injury either. Though he missed some action, he still saw 11 targets. He reeled in six of them for 96 yards and two touchdowns. He could've had a third score, but Eli Manning overthrew him on the first drive, as Beckham torched Joe Haden. ",
            "3": "Manning accumulated three touchdowns, but struggled once again. He barely completed half of his passes, going 15-of-27 for only 194 yards. That is a truly horrible stat line against one of the worst secondaries in the NFL. Most quarterbacks have torched the Browns this year, so it has to be very discouraging for the Giants that Manning couldn't do much. He should've been able to make several downfield throws, but was just inaccurate. Of course, it wasn't all Manning's fault, as his offensive line had issues keeping the Browns out of the backfield. Cleveland sacked Manning once, but that's not indicative of the pressure Manning saw. Rookie Emmnauel Ogbah put some good heat on the Giant signal-caller. ",
            "4": "Excluding Beckham, only one Giant had more than 18 receiving yards. That was Victor Cruz, who snatched just one of his five targets for 37 yards. Sterling Shepard didn't see a single target. ",
            "5": "It wasn't a surprise that New York didn't run the ball very well against the Browns. Rashad Jennings gained 55 yards on 15 carries, while Paul Perkins (9-29) did about half as much. ",
            "6": "As for the Browns, Josh McCown was able to post solid stats, going 25-of-43 for 322 yards and a touchdown. Don't be deceived, however, as much of this occurred in garbage time. To prove it, McCown was just 10-of-20 for 112 yards in the opening half. Many of his passes were way off the mark; on one occasion, he missed a wide-open Gary Barnidge (1 catch, 11 yards) for a substantial gain in New York territory. McCown wasn't officially charged with an interception, but he effectively had a pick-six when a pass of his popped up in the air and into the arms of Jason Pierre-Paul, who ran back into the end zone. McCown was credited with a lost fumble on the play. He later lost another fumble, which ended all hopes for a Cleveland back-door touchdown. ",
            "7": "Speaking of fumblers, Crowell, as mentioned, gave the Giants seven free points in the first half. He gained 44 yards on 16 carries, as he continued to be ineffective on the ground. The Browns need to think about featuring Duke Johnson more, though it probably doesn't matter, as Cleveland hasn't been able to run block effectively ever since losing Joel Bitonio to injury earlier in the season. Crowell caught six passes for 47 receiving yards as well. ",
            "8": "Terrelle Pryor was the only dynamic Cleveland player on offense, as he racked up 131 receiving yards on six catches. He didn't find the end zone, but rookie Corey Coleman did. Coleman snatched three of his seven targets for 38 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Saints",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "Sometimes, the NFL makes absolutely no sense, though that was a common theme this weekend. The Rams came into this game with a prolific defense that has been statistically atop the NFL's rankings over the past month. The offense, meanwhile, hasn't been able to muster any points. Well, in this completely inexplicable Sunday of NFL action, the Rams were able to score on the Saints, but couldn't contain Drew Brees at all. It didn't appear that would be the case in the early going. Aaron Donald ripped through the Saints' interior offensive line and strip-sacked Brees, setting up a quick touchdown from Jared Goff to Kenny Britt. Donald then forced Brees into an intentional-grounding penalty, putting the Saints into a third-and-15. The Rams, who were winning at the time, had a ton of momentum, but it quickly vanished when a pass interference bailed New Orleans out. Ever since that play, the Saints were unstoppable on offense. They ripped through Los Angeles' defense with ease, thanks to poor tackling and even worse play-calling by Gregg Williams. The Saints' former coordinator was absolutely bewildered at times. He had no sense for what the Saints were trying to do, getting caught with his pants down on some trick plays. He also called a completely senseless blitz on a third-and-long, allowing Brees to score a touchdown to Mark Ingram on a simple dump-off pass. ",
            "2": "Brees finished a nearly flawless 28-of-36 for 310 yards and five touchdowns (four passing, one rushing). Again, he was guilty of two early mistakes, but he recovered and was completely unstoppable after that. He misfired on just three occasions after halftime! ",
            "3": "Two of Brees' four aerial touchdowns went to Michael Thomas, who reeled in nine of his 10 targets for 108 yards. Thomas was a monster, as he was able to rebound off of two poor performances. The dynamic rookie made only one mistake on the afternoon, failing to run out of bounds in the 2-minute drill, which negated a scoring opportunity. Brees, meanwhile, didn't throw at all to Brandin Cooks. He was definitely on the field a bunch, but he inexplicably didn't see a single target. It's impossible to criticize this, however, as the Saints scored 49 points. Brees' other scores were thrown to Mark Ingram and Brandon Coleman. Tim Hightower also scored on a reception, a 50-yarder, but that was thrown by Willie Snead. Hightower was wide open, as it was one of Gregg Williams' many blunders of the afternoon. ",
            "4": "Speaking of the running backs, Ingram performed brilliantly. He burst for a 61-yard rush to open the third quarter and later scored a touchdown when Williams foolishly called an all-out blitz. Ingram gained a whopping 146 yards on the ground and two total touchdowns on just 14 carries. Hightower (15-51) saw most of his workload in garbage time. ",
            "5": "Moving on to the Rams, they had some unexpected offensive success in the early going, as Jared Goff torched the Rams on the opening drive. Delvin Breaux tripped on a completion to Kenny Britt, and then Tavon Austin torched B.W. Webb for a touchdown. Goff then capitalized on Brees' strip-sack with a touchdown to Britt. Goff was 12-of-20 for 167 yards and three touchdowns in the first half alone. Unfortunately for Goff, the wheels fell off after intermission, as he went 8-of-12 for only 47 yards and an interception in the second half. Goff was strip-sacked after holding on to the ball forever, and his pick was a poor throw into double coverage. He took some bad sacks as well, though it needs to be noted that he lost left tackle Rodger Saffold to an injury. Otherwise, Goff just dinked and dunked and couldn't get anything going against one of the worst defenses in the NFL. ",
            "6": "Goff's touchdowns were fired to Britt (5-52), Lance Kendricks (4-51) and Austin (4-45). Only one other Ram (Todd Gurley) logged more than one reception. Britt helped ruin an early scoring chance by getting flagged for a false start in New Orleans territory. ",
            "7": "Gurley, meanwhile, was a big disappointment, considering the matchup. However, it wasn't his fault because the deficit restricted him to just five carries after halftime. He gained 50 yards on just 13 carries to go along with four catches for 39 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "The Bengals lost A.J. Green and Giovani Bernard to injury last week, but when it was announced that there was a chance Green could return at some point, Cincinnati had some life. A victory here and a Pittsburgh loss next week to the Giants would put them just a half of a game behind both teams in the AFC North. However, despite this new hope, the Bengals continued to kill themselves with dumb mistakes, which has been a theme for them his season. Things began innocently, when a Cincinnati third-down conversion from Andy Dalton to Tyler Boyd was negated by a Tyler Eifert hold. Joe Flacco then gift-wrapped an easy scoring opportunity when he threw an interception that was tipped at the line of scrimmage. The Bengals took over deep in Baltimore territory, but a botched snap gave the ball right back to the Ravens on a fumble recovery. In the second quarter, the Bengals were given a generous spot on a third down, converting it. They took a timeout for some reason, and Baltimore used that time to determine that the spot was off. John Harbaugh challenged the play, and won the review. The Bengals then declined a penalty that would've taken the Ravens out of field-goal range. Instead, Baltimore was able to kick for three points - one of two occasions in which Justin Tucker drilled a 50-yard field goal in the first half alone. Things didn't get much better for the Bengals after halftime. Mike Nugent missed yet another extra point - this prevented the Bengals from covering the spread - and Andy Dalton was strip-sacked a whopping THREE times. Dalton was fortunate that two fumbles that were forced by Terrell Suggs were recovered, but the third one, created by Elvis Dumervil, was the decisive one, as Baltimore was able to fall on the football. ",
            "2": "Dalton couldn't do much without A.J. Green, going 26-of-48 for only 283 yards and a touchdown. That's a YPA of 5.89, which is pretty bad. He wasn't intercepted, but he easily could've been picked off by Eric Weddle in the first half, as the stud safety dropped the ball. It was apparent that Dalton missed Green, as he threw some passes up for grabs that his pedestrian receivers couldn't come up with. Dalton also had numerous passes tipped at the line of scrimmage. It seemed like this happened four times in the final quarter alone. ",
            "3": "Only three Bengals logged more than 38 receiving yards: Eifert (5-68), Boyd (5-62) and Jeremy Hill (6-61). Eifert reeled in Dalton's sole touchdown. Brandon LaFell couldn't do much - three catches, 38 yards - but the fact that the officials allowed the Raven defensive backs to get away with murder didn't help matters. There were two occasions in which Tavon Young should've been flagged for obvious pass-interference calls, but the officials didn't penalize the Ravens. They threw the flags once on one of the instances, but they changed their mind and inexplicably said that there was no penalty. The CBS announcers vehemently disagreed. ",
            "4": "Hill did a good job of racking up receiving yardage, replacing the injured Bernard. However, he didn't do much on the ground, as he was limited to just 21 yards on 12 carries. He was outgained by Rex Burkhead (5-29). ",
            "5": "Moving on to the Ravens, Flacco finished 25-of-36 for 234 yards, one touchdown and the aforementioned interception that was tipped at the line of scrimmage. Flacco appeared to injure himself on an awkward slide in the second quarter and even sought some attention from the team doctors immediately afterward. However, if Flacco was affected by this, I didn't notice, and the stats would say the same thing. Flacco went 8-of-11 for 73 yards following intermission. Flacco played very well overall, which hasn't always been the case this year. However, before anyone gets too excited, Flacco was up against a secondary that has been atrocious this year. Reggie Nelson is missed, while Pacman Jones has regressed. Safety Shawn Williams was also out, which didn't help. ",
            "6": "No Baltimore receiver dominated, as Mike Wallace (3-57) was the only Baltimore player who eclipsed 35 receiving yards. Steve Smith (4-20) had a disappointing day, and adding injury to insult, Smith took a huge shot on a second-half reception. ",
            "7": "A positive development for the Ravens in this game was that Kenneth Dixon had just as many carries as Terrance West. I've been calling for Dixon to be a greater part of the offense, and it finally appears as though that's happening. Both Dixon and West had 13 carries for 49 and 48 yards, respectively. Dixon did more in the passing game, catching all four of his targets for 31 yards. ",
            "8": "If you're wondering how the Bengals went from 12 to 14 at the very end, John Harbaugh brilliantly had his punter remain in the end zone as the clock expired, while all of his linemen intentionally held. A game can't end on a defensive penalty, but it can on an offensive penalty, and Harbaugh took advantage of the loophole. The NFL rules committee should think about making some changes this offseason. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Titans",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "It was puzzling as to why John Fox refused to announce Jay Cutler as being out throughout the week despite the fact that it was reported that his quarterback sustained a partially torn labrum. Fox may have thought he was gaining a competitive advantage, and it seemed as though that he might have been on to something when the Bears took an early 7-0 lead. The Bears were shockingly moving the chains well on a solid Tennessee defense, while the Titans committed a bunch of penalties. They also made some mistakes, failing to cover Jordan Howard on a screen on a third-and-15, for example. The Bears' chances quickly vanished, however, as the Titans stopped screwing up and established complete control of the game. Marcus Mariota engineered several successful drives; Derrick Henry proved to be too much to handle; and Matt Barkley finally began making mistakes. They led 27-7 and appeared to think that this game was over. Except, it wasn't. Thanks in part to Jurrell Casey's injury (sprained foot), the Bears roared back, trimming the lead to 27-21. They had a chance to win at the end and even had the game won, but Josh Bellamy dropped an easy catch in the end zone. This was one of countless drops Chicago was guilty of down the stretch. The Bears were able to get wide open against Tennessee's poor secondary, but couldn't prevent themselves from dropping lots of passes. Of course, this is what happens to a team missing three of its top weapons. ",
            "2": "At any rate, Mariota finished 15-of-23 for 226 yards and two touchdowns. He played well overall, especially in the first half, but he barely threw the ball following the break; he was just 5-of-9 for 87 yards after intermission. The Titans didn't need to throw much at first, and this appeared to ruin Mariota's rhythm. This was apparent when he overthrew a wide-open Kendall Wright for a long touchdown late in the game. Mariota, by the way, didn't have to do much running. He scrambled only four times, but picked up 46 yards in the process, which includes a 29-yard scamper. ",
            "3": "Mariota's scores were thrown to Rishrd Matthews (3-64) and Delanie Walker (3-50). Neither Wright (0 catches) nor Tajae Sharpe (2-11) did much, though the former would've secured a long touchdown had Mariota not missed him. ",
            "4": "It might be time for the Titans to give Henry a greater workload. DeMarco Murray couldn't do anything on the ground, mustering only 43 yards on 17 carries. Given how much of a workload he has shouldered, he appears to be worn down, though he did catch five passes for 41 receiving yards. Murray also fumbled in the red zone, but was fortunate that Anthony Fasano was able to fall on the loose ball. Henry, meanwhile, looked much fresher, accumulating 60 yards and a touchdown on just eight attempts. ",
            "5": "The best running back on the field, at least statistically, was Jordan Howard, who gained 84 rushing yards on 18 carries to go along with three catches for 43 receiving yards. Stats can be misleading, however, and that would be the case here, as Howard dropped a couple of passes, one of which was in the end zone. Also, 22 of Howard's 84 rushing yards came on one burst that caught the Titans off-guard. ",
            "6": "Speaking of misleading stats, Matt Barkley was 28-of-54 for 316 yards, three touchdowns and two interceptions. However, Barkley was just 7-of-16 for 63 yards, one touchdown and a pick by halftime. Most of his positive stats came after halftime when the exhausted Titans, who haven't had a week off yet, forgot to cover the horrible Chicago receivers. They nearly paid the price, but managed to hold on. Now, they'll be able to enjoy their bye week before entering the final quarter of the season. If you're wondering about Barkley's interceptions, only one was his fault. His first was wrestled away by linebacker Wesley Woodyard, who ripped the ball out of the arms of a Bears player. Barkley's second pick, however, was launched late across his body into the middle of the end zone. That was one of the worst throws of the afternoon from any quarterback. ",
            "7": "With the top Chicago weapons out, Marquess Wilson (8-125) and Deonte Thompson (5-44) led the way and scored touchdowns. They were able to accumulate their yardage in garbage time, so don't read into this at all. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> You never know how bad a quarterback is until you bet on him. I can't believe how awful Brock Osweiler is. I also can't believe that the Texans paid $72 million for this. Forget the million; I wouldn't even pay $72 for Osweiler, period. ",
            "2": "San Diego got a nice road win over the offensively challenged Texans, as Philip Rivers played an efficient game, with Houston's turnovers helping to gift a win to San Diego. The Chargers are a good team, and if it weren't for games they gave away at the beginning of the season, they could be a dangerous team in January. ",
            "3": "Early in the first quarter, a questionable holding call took an interception away from Houston's A.J. Bouye. The punters were getting a lot of use before the second quarter when the Texans got moving thanks to a 16-yard run by Akeem Hunt. Osweiler dropped in a 33-yard pass to Will Fuller (4-60), and the Texans' quarterback used his big frame to leap over the top for a one-yard touchdown. The Chargers tied it up right away though, as Rivers and Dontrelle Inman burned safety Quintin Demps on a double move for a 52-yard touchdown. Osweiler was then intercepted by Casey Hayward on a pass forced to DeAndre Hopkins. Rivers took advantage by quickly moving the ball into Houston territory before hitting Tyrell Williams (8-70-1) for a 21-yard touchdown. Josh Lambo missed a 54-yard field goal on the final play of the half, and the Chargers led 14-7 at intermission. Houston had a drive going into San Diego territory before Lamar Miller fumbled for the first time this season thanks to a hit by Dwight Lowery. The loose ball was recovered by the Chargers at their own 21-yard line. They gave it back shortly later, however, after Demps intercepted an errant pass at the San Diego 38. The Texans got inside the 5-yard line, but settled for a field goal. Early in the fourth quarter, Rivers led a drive, with Inman making receptions of 25 and 11 yards, to set up a short touchdown toss to Hunter Henry (2-20-1). Lowery later picked off an overthrow by Osweiler, and that basically clinched the game for San Diego. In garbage time, the Texans added a field goal and then recovered an onside kick, but one Hail Mary attempt fell incomplete and the final one was intercepted. ",
            "4": "Rivers completed 22-of-30 for 242 yards with three touchdowns and one interception. Inman led San Diego with six catches for 119 yards and a touchdown. ",
            "5": "Melvin Gordon was held to only 70 yards on 17 carries with four receptions for 19 yards. ",
            "6": "Osweiler was 22-of-37 for 246 yards with three interceptions. He played very poorly. Hopkins was held to 70 yards on five catches. ",
            "7": "Lamar Miller ran for 57 yards on 19 carries with three receptions for 18 yards. His fumble was painful. ",
            "8": "While Dwight Lowery hasn't impressed this year, he had a big game with an interception and forced fumble. Joey Bosa had an excellent game with seven tackles, half of a sack and a lot of pressure on the quarterback. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bills",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Credit the Bills for avoiding such an obvious letdown game. That's what this contest seemed like. It was a blatant trap game, and the Jaguars even led for most of the game, but the Bills were able to come back and win to improve to 6-5. ",
            "2": "In the early stages of this contest, it looked like it was going to be sloppy defensive battle. Both teams got their offenses moving in the second half though, and they really were able to put on an exciting display. At the end of the day, the Bills were able to prevail despite some serious struggles. The first half was an absolute horror story for the Bills. They were barely able to get their offense moving. The Jaguars focused on shutting down LeSean McCoy and the ground game, and McCoy was only able to gain five rushing yards prior to intermission. In the passing game, Tyrod Taylor was constantly under pressure due to poor protection. Right tackle Jordan Mills looked particularly bad, and it looked like the Bills would have a lot of trouble against the Jaguars. McCoy made sure that changed in the second half. On the first play of the third quarter, he took a carry and made a jump cut to the outside. The talented runner blew by the defense and scampered into the end zone for a touchdown. From there, things got better. Buffalo's offense was run through McCoy, who ran for 103 yards and two touchdowns on 19 carries. He was extremely impressive in the second half, and he helped to ice the game with a 7-yard run near the end of regulation. ",
            "3": "In the passing game, Tyrod Taylor really had a hard time. He went 12-for-18 for 166 yards and a touchdown, but the numbers are misleading. Taylor gained 62 of those yards on one pass to Sammy Watkins, so if you take that out, Taylor only went 11-for-17 for 102 yards. He was unable to do much aside from dinking and dunking, and that was partially due to his lack of receivers. Still, Taylor was able to get the job done on the ground. He used his speed and athleticism to gain the edge on a touchdown run. Overall, he totaled 38 yards on seven carries and was able to do some damage late. He definitely has to improve his pocket presence though. He was sacked five times during the game, and though that was partially due to the protection, he has to get rid of the ball quicker. ",
            "4": "The Bills' offense only really is able to support one receiver in fantasy each week. This week, it was Sammy Watkins' turn, his first game back from injury. Watkins (3-80) was able to get the job done when he was on the field. He looked pretty healthy and should be at full speed as the season closes. Elsewhere, Charles Clay (2-17) was a disappointment. He really did not do much for the team. Taylor's touchdown went to Justin Hunter on a nicely thrown high ball that the receiver jumped up to catch. The 16-yard grab was the only one for the receiver on the day. ",
            "5": "The Bills have to be happy with the way Marcell Dareus played today. The talented defensive tackle wreaked havoc on the Jaguars, picking two sacks. He blew up numerous plays, and he was the only member of the defense who was really able to pressure Blake Bortles. ",
            "6": "Speaking of Bortles, he had yet another mixed outing through the air on Sunday. Bortles went 13-of-26 for 126 yards and two touchdowns. He had some strong throws, and some that he probably wishes he could have taken back. Though Bortles did not make any crucial mistakes, he was far from perfect. He alternated between trying to dump off short passes to launching downfield balls to Allen Robinson. Bortles' accuracy was only decent, but he did make some nice throws. On the touchdown throw to Marqise Lee, Bortles threw a bullet that Lee nabbed to get the big score. One thing that Bortles actually did well was running the ball. He posted a career-high 81 rushing yards on eight carries. He was able to scramble out of the pocket as the Bills had issues containing him. If Bortles can continue to make those kinds of plays, then defenses will respect his running a bit more. That would open things up for the passing game. ",
            "7": "Bortles spent most of the afternoon targeting a trio of third-year receivers. Marqise Lee (4-37, 1 TD), Allen Robinson (2-24) and Allen Hurns (1-12, TD) all saw a great deal of attention from their quarterback. Lee was able to do the most, working across the middle of the field and has really established himself as a solid slot guy. He should be added in all fantasy formats and can be used as a FLEX in certain matchups. Meanwhile, the two Allens were underwhelming. Robinson saw four targets, but Bortles overthrew him on one. He simply cannot get the ball to Robinson downfield. Hurns was utterly brutal on the day. He was targeted a team-leading seven times, but he only got the one catch. Hurns was also guilty of a brutal drop that could have gone for a huge gain in the first half. ",
            "8": "After today's game, the Jaguars could have some issues in the backfield. Chris Ivory was looking great before exiting with a hamstring injury. He had totaled nine carries for 44 yards and had some strong runs. The offensive line finally gave him some good blocking, and that contributed to his success. Once Ivory left, T.J. Yeldon and Denard Robinson carried the load. Yeldon, who was dealing with an ankle injury, totaled 17 yards on six carries. He looked only OK and was clearly hampered by his ankle. Robinson got 13 carries and turned them into 39 yards. He simply does not have the strength to be an every-down back, and he should only be used in a change-of-pace scenario. If Ivory misses any amount of time, Yeldon would likely take over the lead-back role and could be a low-end RB2. ",
            "9": "Defensively, the Jaguars got a great effort out of their pass-rushers. Highly touted free agent signee Malik Jackson had two sacks and led the way with pressure from all over. Rookie Yannick Ngakoue was able to notch a sack as well. The highly athletic player looks like he could be a solid starter in the NFL. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "5"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> I mentioned earlier that the NFL makes absolutely no sense sometimes. Here's another example. The Seahawks lost, 14-5, at Tampa? What the f***? I have no explanation for this nonsense. ",
            "2": "Entering this game, some pundits thought that the Seahawks were playing the best football in the NFC, even better than Dallas. The weak Seattle offensive line, however, made the Buccaneers' defensive front look like the 2002 Bucs that dominated defensively on their way to a Super Bowl championship. Tampa Bay made a statement that it is a legit playoff contender in the NFC South with a tremendous defensive effort to hold the Seahawks' offense to only three points. Seattle was only 1-of-11 on third downs, and the Seahawks' offensive line was awful. ",
            "3": "The Buccaneers got moving on the opening drive with Jameis Winston ad libbing a completion to Mike Evans to move the chains. A 26-yard pass to Evans converted a third-and-long. On third-and-goal, Winston scrambled before finding Evans for a short touchdown. Tampa Bay quickly got the ball back thanks to a Noah Spence sack that set the tone for the day. Tampa Bay moved into Seattle territory with a third-down conversion on a screen to Doug Martin and then a 26-yard completion to Cameron Brate (4-49). Evans then beat Richard Sherman down the sideline for a 23-yard touchdown. Spence had another sack to force a punt, but Luke Stocker was called for a hold in the end zone to give Seattle a safety. The Seahawks took advantage thanks to a 29-yard pass interference to add a field goal. Before halftime, Tampa Bay moved into Seattle territory, but Roberto Aguayo missed the 48-yard field goal attempt. Wilson moved the ball into Tampa Bay territory before throwing an interception to Alterraun Verner. The Buccaneers took a 14-5 lead into the half. Both defenses played well in the third quarter, as the teams traded punts. Early in the fourth quarter, Seahawks defensive lineman Ahtyba Rubin punched the ball out from Doug Martin and free safety Steven Terrell recovered the ball for Seattle close to midfield. The Seahawks moved well into Tampa Bay territory, but then Jimmy Graham fumbled the ball and Lavonte David scooped it up to return it 53 yards to the Seattle 25-yard line. A few plays later, Winston threw a touchdown to Brate, but a penalty on Demar Dotson took the score away. Winston threw a bad pass into the end zone on the next play, which was easily intercepted by Kam Chancellor. The Seahawks trailed by nine with just over four minutes remaining. They converted a fourth-and-14 from inside their own 20-yard line with a pass to Jermaine Kearse (1-18). However, more Tampa Bay sacks continued to hurt Wilson, and then Bradley McDougal picked off Wilson in front of the end zone to clinch the win for Tampa Bay. ",
            "4": "Wilson was 17-of-33 for 151 yards and two interceptions. He ran the ball eight times for 80 yards. Thomas Rawls had only 38 yards on 12 carries. ",
            "5": "Graham led the Seahawks in receiving with six catches for 67 yards, but his fumble was costly for Seattle. ",
            "6": "Winston was 21-of-28 for 220 yards with two touchdowns and one interception. Evans led Tampa Bay through the air with eight catches for 104 yards and two scores. ",
            "7": "Doug Martin had 87 yards on 23 carries. ",
            "8": "Gerald McCoy dominated in the trenches with three tackles and 1.5 sacks. Spence had 1.5 sacks as well, and the Bucs totaled six sacks. Seattle's rookies on the offensive front, guard Germain Ifedi, center Joey Hunt and left tackle George Fant really struggled in pass protection. The offensive line could be the Achilles heel for the Seahawks. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "22"
        },
        "comments": {
            "amount": "4",
            "1": "<i> EDITOR'S NOTE: </i> The way this game went, I'm shocked I didn't have five units on the Raiders, as they were well ahead, up 24-7, but then lost their lead because of Derek Carr's finger injury. Carr came back and won, but failed to cover the 3.5-point spread, so it's fair to assume Oakland would've covered had Carr not missed action, given that the Panthers were energized by his absence. ",
            "2": "There were some good games this weekend, but I don't think you can find one that was more exciting than the Raiders and Panthers (Editor's Note, Again: This was written before the Denver-Kansas City game). You had huge defensive plays, a big comeback, an injured quarterback gutting it out for yet another comeback, and a game that went down to the wire. This high-powered roller coaster of a game started off evenly in the first quarter as Derek Carr tossed a 2-yard touchdown to Seth Roberts and Cam Newton rushed in from three yards out on the next drive to tie it 7-7. That was the score to end the first quarter, i.e. the calm before the storm. The second quarter was all Oakland. A 4-yard Latavius Murray touchdown run, a Sebastian Janikowski field goal, and then, to cap it off with less than a minute before half, Khalil Mack picked off a Cam Newton screen pass and waltzed into the end zone for a 6-yard interception return for a touchdown. That put the Raiders up 24-7 at half. A 17-point lead is always nice to have at halftime, but those numbers seemed even more daunting when you realize that Newton had completed just three passes on 12 attempts in the first half. The Raiders got the ball to start the second half, and quickly, disaster struck as Derek Carr dislocated his right pinkie while fumbling a snap. That mangled pinkie was the spark the Panthers needed, because they then went on to score three touchdowns in the third quarter, two short Jonathan Stewart runs and a 88-yard score from Newton to Ted Ginn Jr. The Panthers had turned a 17-point deficit into a 1-point lead by the end of the third quarter, and they weren't done yet. After Carr left the game, Matt McGloin came in for the next possession. He wasn't able to move the ball, and by the time the Raiders got the ball back, the Panthers had scored two touchdowns and were only down by four points. If Carolina hadn't have scored so quickly, we might not have seen Carr back in this game, but as his lead had disappeared, he came back in with a glove on his throwing hand and promptly threw an interception, which led to Stewart's second rushing touchdown of the day. Now in the fourth quarter, Newton struck again with a 44-yard touchdown to Kelvin Benjamin to give the Panthers a 32-24 lead. At this point, the Raiders had given up four unanswered touchdowns, lost a 17-point lead, and their star quarterback was hurting. Things did not look good for the home team. Carr had the glove on and couldn't take snaps from center, but he lined up in the shotgun and started the work to bring his team back. He methodically led his offense down the field on a 10-play, 75-yard drive that ended in a 12-yard touchdown pass to Clive Walford. Then, Carr hit Seth Roberts for the two-point conversion to tie the game midway through the fourth quarter. The Panthers then stalled at midfield, and coach Ron Rivera opted to punt on fourth-and-1 with five minutes left in the game. This was a decision that Riverboat Ron probably wants back. Carr then promptly moved his team down the field again, hitting Michael Crabtree twice, which Crabtree turned into great receptions; the last taking the Raiders down to the 5-yard line where Janikowski kicked a field goal to give his team the lead with 1:45 left on the clock. Newton had plenty of time to move his team down the field, but Greg Olsen dropped a pass that would have put the Panthers well within field-goal range, and then Khalil Mack strip-sacked Newton to end the game. This was a wild affair to say the least, but Carr was the catalyst behind Oakland's fourth-quarter comeback and showed why he's right in the thick of the MVP race. ",
            "3": "The Raiders at 9-2 are tied with the Patriots for the best record in the AFC, but the AFC West is tough, and Kansas City and Denver will play the Raiders again this year. ",
            "4": "The Panthers are last in the NFC South at 4-7, and they go to Seattle next week. It's time to start thinking about next year. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Based on all of the BS that happened on Sunday, I expected the Patriots to score after Ryan Fitzpatrick's fumble at the end to cover the spread. And yet, my heart nearly exploded when LeGarrette Blount ran down to the 1-yard line. ",
            "2": "It seemed like the Jets had the advantage for most of this game. They were restricting the Patriots and were doing a great job of limiting mistakes on offense. Unfortunately for the Jets, they were unable to do enough to beat their opponents because of the efforts on the Patriots' penultimate offensive drive. On that possession, Tom Brady was nearly spotless. The team had to make lot of plays to get down the field, but Brady was able to pick apart the defense. The Jets had several coverage busts, and Brady delivered balls on the money that allowed the Patriots to move down the field. They scored a touchdown on a throw to Malcolm Mitchell, but there was one crucial play on the drive. On a key 4th-and-4, Brady threw a quick out route to James White to get an imperative first down. It was a good move by Bill Belichick, as Stephen Gostkowski had missed a field goal attempt earlier in the game. The 54-yard kick alternative would likely have been asking a bit too much. The Patriots scored the touchdown, but failed on the two-point conversion. They took the 22-17 lead that they would not relinquish. Brady's performance on Sunday was up and down. The veteran quarterback had been dealing with a knee injury during the week, and he looked a little bit banged up in the first quarter. He had trouble getting in a rhythm, and the Patriots' offense sputtered as a result. However, as the game went along, Brady got better, and by the fourth quarter, he was making all the throws he would normally make. Brady went 30-of-50 for 286 yards and two touchdowns. It was not his best performance of the season, as he did make some errors. He overthrew Mitchell for a potential touchdown at one point and overthrew Rob Gronkowski in the first quarter. That can be chalked up to Brady's knee injury though. He still was able to make some nice throws, and as he gets healthier, he will continue to be the best quarterback of all time. ",
            "3": "One of the biggest storylines of this contest was an injury to Rob Gronkowski. Early in the game, Gronkowski went down the field and dived to try to catch a pass. He came up looking a little bit gimpy, and he went back to the locker room. He would not return. There have been reports that Gronkowski's injury is not too severe, but it is definitely worth monitoring. In terms of fantasy, definitely add a backup, given how fragile he has proven to be in the past. With Gronkowski out, Julian Edelman (8-83) led the way. Brady targeted him 11 times, and he was a beast over the middle of the field. He beat Darrelle Revis a couple of times and should get a boost if Gronkowski misses time. Martellus Bennett (3-22) left for some time with an injury as well, but he returned. He had a minimal impact on the outcome. ",
            "4": "Elsewhere, Chris Hogan (4-70) looked solid and Malcolm Mitchell (5-42, 2 TD) looked like a star in the making. The rookie had been getting more involved in New England's attack in the previous weeks, but it now looks like he is becoming one of Brady's favorite targets. If Mitchell is available in your league, add him as soon as possible. ",
            "5": "LeGarrette Blount put up some good numbers. However, going into the final drive, he had only eight carries for 36 yards. He had a 23-yard burst on the last run of the game to pad his stats at 11 carries for 67 yards. Meanwhile, Dion Lewis got 10 touches and totaled 58 scrimmage yards. He looks healthier and as gets back into shape, he will steal some playing time from Blount. ",
            "6": "For the Jets, this was certainly a disappointing loss. The team put together a very strong effort, but they could not do enough to take down the Patriots. It is hard to blame Ryan Fitzpatrick for the results of today's game. The veteran got the start, despite some cries for Bryce Petty, and actually played relatively well. Fitzpatrick went 22-of-32 for 269 yards and two touchdowns. He displayed excellent accuracy and touch on his passes, and was able to limit his mistakes. The most impressive throw of Fitzpatrick's day came on a touchdown pass to Quincy Enunwa. Fitzpatrick placed the ball in the back corner of the end zone where only his man could get it. It had just the right amount of air under it, and Enunwa brought it in for an amazing catch. If Fitzpatrick can build off of this performance, perhaps he will return to his 2015 form. ",
            "7": "Speaking of Quincy Enunwa, he put together a terrific performance on Sunday. The third-year receiver was able to catch all five of his targets for 109 yards and the aforementioned touchdown. He looked sure-handed and really proved to be a solid player. If Fitzpatrick is playing well, Enunwa can definitely be used as a WR2 or WR3, as he is the No. 2 option in the Jets' passing attack. Brandon Marshall (6-67, 1 TD) also had a pretty good outing for the team. He was able to get going early in the contest, and that opened things up for Enunwa and the others. Robby Anderson (2-34) flashed a bit at times, but was guilty of a critical fumble that ended up costing the Jets dearly. ",
            "8": "In the running game, Matt Forte was not able to do much. He looked spent for most of the day, and only managed a paltry 27 yards on 13 carries. He simply does not have anything left in the tank at this point in his career. Conversely, Bilal Powell ran with a bit of burst. He totaled eight carries and managed 36 yards, but he showed some elusiveness in the process. He could be a candidate to get more touches as the season rolls onward. ",
            "9": "Final Note: Chris Long had a key strip sack of Fitzpatrick to effectively end the game for the Patriots, but they were not able to get a lot of pressure on Fitzpatrick during the day. The team is sorely missing Chandler Jones and Jamie Collins, and trading those players could come back to bite the team. If they were on the roster, New England's defense could be one of the strongest in the league. Instead, the Patriots field a middling unit that has had success in the red zone. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "This was a crazy game in the wild AFC West. It began as a dominant performance by two dueling defenses, featuring tremendous performances by numerous elite defenders. It then morphed into a crazy shootout in the second half, packed with huge plays and high drama. The game went into overtime, thanks to a terrific drive by Alex Smith. Fifteen minutes of game action later, the Chiefs put themselves in position to win, thanks to a controversial move by Gary Kubiak, and the kick hit the upright - except that it deflected inside the other upright to give Kansas City the victory. It was hard for me to determine where to begin otherwise, given how insane this game was. But I kept going back to two words: Justin Houston. The Chiefs came into this divisional battle extremely banged up, but one player they had back from injury happened to be Houston. He was on the field last week, but didn't quite look like himself. Well, he's definitely back, as he racked up three sacks and a forced fumble. That doesn't tell the whole story though, as he completely dominated the line of scrimmage, especially in the first half. He may have cost Ty Sambrailo his job, as the Colorado State product was benched in favor of Donald Stephenson, who was yanked last week. One of Houston's sacks featured a strip in the end zone, resulting in a safety. On the ensuing kickoff, Tyreek Hill scored a touchdown on the return. Thus, Houston was effectively responsible for nine early Kansas City points. ",
            "2": "Speaking of Hill, he also had a huge performance. In addition to his return touchdown on the free kick, he caught nine of the 10 targets thrown his way for 52 yards. He also reached the end zone on offense, which was the touchdown that sent the game to overtime. It appeared as though Hill was tackled short of the goal line, and that's how the officials ruled it at first, but following replay review, it was stated that Hill didn't have full possession when he was touched, and by the time he obtained the ball, he had crossed the goal line. ",
            "3": "Alex Smith finished 26-of-44 for 220 yards and a touchdown. He was dreadful in the opening half, as he was 5-of-12 for only 26 yards prior to intermission. It wasn't all Smith's fault, as he saw tons of pressure from Ambassador Von Miller and the rest of Denver's front. However, the Broncos were gassed at the end of regulation, allowing Smith to march down the field to overcome an eight-point deficit. Smith hit Hill for the aforementioned touchdown and then converted the two-pointer to send the game to overtime. Smith then had some clutch first-down conversions at the end of the extra session to move Cairo Santos in position to kick the decisive field goal. ",
            "4": "While Hill saw 10 targets, he wasn't even close to the team-leader in that department. Travis Kelce had 15 balls go his way, and he snatched eight of them for 101 yards. ",
            "5": "I thought the Chiefs would be able to run the ball successfully on the Broncos, but they didn't manage to do so. Ware gained 64 yards on 17 carries to go along with two catches for 32 receiving yards. ",
            "6": "While the Chiefs were victorious, all questions were directed at Gary Kubiak for trying a 62-yard field goal with about a minute remaining in overtime. The miss gave Kansas City the ball on the Denver 48-yard line, effectively handing the Chiefs a free win. There were two reasons why Kubiak's decision was wrong. First, kicker Brandon McManus' career-long happened to be 57 yards, so that was five yards shy of the attempted distance. He also said that his limit happened to be 60. It's not like the Broncos still had Matt Prater; McManus can't hit a 62-yard try. Second, while punting it would've effectively given Kubiak's team a tie, a loss here was absolutely crushing, as it moved the Broncos behind the Dolphins in the AFC wild-card pecking order. A tie would've still kept Denver in playoff position. ",
            "7": "It's a shame for Trevor Siemian that his team lost because he had a tremendous performance, especially in the second half. Siemian finished 20-of-34 for 368 yards and three touchdowns. Yeah, those were his real numbers. I can't believe I wrote them either. Siemian, who was 11-of-19 for a whopping 279 yards and three touchdowns following halftime, torched Phillip Gaines mercilessly. It's more clear than ever that the Chiefs miss Sean Smith, as Gaines can't cover anyone. Emmanuel Sanders torched him on multiple occasions, and then Bennie Fowler did the same thing. Speaking of Sanders, he led the Broncos with seven catches and 162 yards. He also scored. Fowler (1-76) caught only one pass, but he found the end zone as well. Demaryius Thomas, meanwhile, was restricted to five catches for just 60 yards. He didn't secure a touchdown. ",
            "8": "As with the Chiefs, the Broncos didn't achieve much on the ground either. Devontae Booker gained 79 yards on 24 carries. He handled much more of a workload than Kapri Bibbs (9-22), who was temporarily knocked out of the game following a crushing hit. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Packers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "Based on what ESPN was saying prior to the game, it was as if the sky was falling in Green Bay. The Packers were 4-6, after all, and they had lost four in a row heading into this imperative Monday night affair. Their atrocious defense had surrendered 120 points in their previous three contests, so how were they possibly going to stop Carson Wentz and the Eagles? Well, as it turns out, the sky is definitely not falling in Green Bay. The team restricted the Eagles to just 13 points, while Aaron Rodgers was extremely precise the entire evening. It was Philadelphia's defense that looked completely helpless. ",
            "2": "Aaron Rodgers was terrific, going 30-of-39 for 313 yards and two touchdowns. He was every bit as good as those numbers indicate, and it was evident in the early going that Rodgers would be on fire, making a ridiculous tight-window throw to Davante Adams for a touchdown. Rodgers was particularly tremendous on third down, converting 10 of 14 third-down tries. This allowed the Packers to control the time of possession, winning that battle by about 11 minutes. This was crucial, as it kept their defense off the field. The one dark cloud over the victory was a hamstring injury Rodgers sustained in the third quarter. Rodgers, who scrambled six times for 26 rushing yards, didn't run at all after that. His throws were still on the money, but his mobility was gone. Unfortunately for Rodgers, he'll have to prepare for his next opponent on short rest. Green Bay's next foe is Houston, which rushes the passer especially well, so if Rodgers is immobile, it could hurt. ",
            "3": "Rodgers threw the most passes to Jordy Nelson, targeting him with 12 balls. Nelson snatched eight of them for 91 yards. He could've had a much better night, but missed out on a long completion because a Philadelphia corner grabbed his one arm, preventing Nelson from reaching for the ball with two hands. The officials didn't call the penalty for some reason. Nelson saw twice as many targets as Adams. However, Adams led the team in receiving with five receptions for 113 yards. He also snatched both of Rodgers' touchdowns. Adams has been ridiculous this season, despite the team's struggles. Meanwhile, the other Packers who logged more than two catches were Randall Cobb (6-41) and James Starks (5-27). ",
            "4": "Speaking of Starks, he was given 17 carries, but didn't do much with them, gaining just 41 yards. It would behoove the Packers to get Christine Michael more involved; Michael was given one attempt, which he turned into four yards. ",
            "5": "As for the Eagles, Carson Wentz looked like he would be able to match Aaron Rodgers point for point after a brilliant opening drive. Wentz then made a ridiculous back-shoulder throw out of the back of his own end zone. However, he saw some pressure, which disrupted drives. The reason for this was the absence of stud guard Brandon Brooks, who was hospitalized with an illness prior to the game. Brooks' health concern was a major factor in deciding this contest. <br. 24-of-36= 254= 33= <br= a= also= an= and= but= converted= finished= for= four= had= he= his= hurled= in= interception= legs= like= looked= of= on= one= overall= overthrow,= played= pocket.= rodgers= scrambling= some= spurts,= the= third-and-6.= time= times= touchdown.= ugly= used= well= well,= wentz= whenever= which= yards= yards.=> ",
            "6": "Unfortunately for Wentz, he doesn't have the receiving support. His best receivers are Jordan Matthews (4-47), who missed some time with an ankle injury, and Dorial Green-Beckham (6-82). Green-Beckham saw a team-high 10 targets. He played well outside of an offensive pass interference call that wiped out a big gain for Darren Sproles. Zach Ertz (6-36) dropped a pass. ",
            "7": "With Ryan Mathews out, Wendell Smallwood handled most of the workload. He carried the ball nine times, but gained just 37 yards. Darren Sproles didn't do much on the ground (3-6) but caught five passes for 48 receiving yards. As mentioned, he had a long reception negated by penalty. ",
            "8": "Doug Pederson needs to be mentioned for one of the worst successful challenges ever. Late in the third quarter, Pederson challenged a completion to Jared Cook. It was a 2-yard gain. Yeah, that's it. And it's not like it moved the chains or anything; Pederson wanted second-and-10 instead of second-and-8. Making matters worse, this was Pederson's final challenge of the evening. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> </br.>"
        }
    },
    "numberOfGames": "16"
}