{
    "year": "2016",
    "week": "07",
    "Game 1": {
        "Team 1": {
            "Name": "Packers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Those who began watching this game had one question on their mind: What's wrong with Aaron Rodgers? The future Hall of Famer hasn't played like himself since the beginning of last season, and many theories spawned. A reader even had a great crackpot theory on our <a href=/podcast.php>podcast</a> this week. The first half of this game confirmed everyone's suspicions. Rodgers was 19-of-30 in the opening 30 minutes, but for only 150 yards (an abysmal 5.0 YPA), as he missed numerous throws. It only got worse at the beginning of the third quarter, when Rodgers didn't recognize Leonard Floyd's blind-side pressure and was strip-sacked. The ball trickled into the end zone, and the Bears recovered the touchdown, giving them the lead. Lambeau Field was completely quiet at that point, as the Packer supporters were stunned. Moments later, Rodgers drove down the field and helped get the team into the end zone with some clutch third-down conversions. Rodgers did the same thing on the next couple of possessions, and before anyone knew it, the Packers were up 16. Rodgers finished 39-of-556 for 326 yards and three touchdowns. The stats look great, and everyone on NFL Network and CBS will tell you that there's nothing wrong with Rodgers. There definitely is something wrong, however. The Rodgers of old would've thrown for at least 450 yards on 56 attempts, and he wouldn't have missed so many throws. His receivers were covered tightly for the most part, but Rodgers has always been able to hit them on impressive back-shoulder throws. That's still happening on occasion, but it's not nearly as consistent as it once was. ",
            "2": "Rodgers' three star receivers were Davante Adams, Randall Cobb and Ty Montgomery, as Jordy Nelson did nothing. Adams caught a ridiculous 13 passes for 132 yards and two touchdowns, which is remarkable because he wasn't even expected to play, given that he was going through concussion protocol on a short work week. Cobb snatched 11 balls for 95 yards and a late score, though he dropped an early touchdown on the opening drive. Montgomery, meanwhile, played running back, yet was still able to catch 10 passes for 66 yards. He also rushed for 60 yards on nine carries. The one dark cloud over Montgomery's performance wasn't his fault. For some reason, Mike McCarthy called a run for Montgomery up the middle on fourth-and-goal at the 1-yard line. Montgomery was predictably stuffed. That's right - with Aaron Rodgers as his quarterback, McCarthy called a rush up the middle with a receiver on what might have been one of the most important plays of the game. It was completely irresponsible play-calling, and had the Packers lost this contest, fans could've pointed to that moment for a major, recent reason to fire McCarthy. As for Nelson, it's clear that he's not 100 percent. Tracy Porter had coverage on Nelson, yet the wideout couldn't get open. Nelson would've laughed at Porter in the past, but he can't get open now. Nelson was limited to just one catch for nine yards. ",
            "3": "As for the Bears, you have to feel for Brian Hoyer. The former Texan had been playing relatively well for his new team, but he broke his arm in the second quarter after falling hard on his shoulder. Hoyer wasn't playing that well (4-of-11, 49 yards), missing an open Josh Bellamy for a long touchdown on the second drive. However, he was light years better than Matt Barkley, who was a disaster. Barkley went 6-of-15 for 81 yards and two interceptions. The first pick was a tipped pass by Morgan Burnett into the arms of rookie linebacker Blake Martinez. The second interception occurred when the ball popped into the air as Barkley was hit. Barkley would be a horrible option as a starter, but Jay Cutler could be back in Week 8. ",
            "4": "With Barkley under center for more than half the game, none of Chicago's play-makers could post significant numbers. Zach Miller (2-40), Alshon Jeffery (3-33) and Cameron Meredith (1-12) were all silenced. ",
            "5": "The one major surprise on Chicago's side was what happened at running back. Rookie Jordan Howard, who has dazzled in relief of Jeremy Langford, didn't have as many carries as Ka'Deem Carey. Both running backs had half of their yardage come on their longest burst. Howard (7-22) had a gain of 11, while Carey (10-48) made a burst of 24. I wouldn't cut Howard in fantasy just yet, though the declining usage is worrisome. ",
            "6": "The silver lining for Chicago is that Leonard Floyd was terrific. The first-round rookie put together a strong performance, as he was a nuisance for Rodgers all evening. Floyd registered two sacks and a forced fumble. ",
            "7": "I'd be remiss if I didn't discuss Phil Simms and some of the strange things he said during the telecast. Simms opened the evening by saying that the Packers, due to a lack of their running game, were going to get the ball to Aaron Rodgers. Am I missing something, or were the Packers just planning on direct snapping to their running backs? What does he mean by getting the ball to Rodgers? Doesn't Rodgers always have the ball? Perhaps even more confusing, there was this: He was trying to go across the middle and it was not a person. If anyone can decipher what the hell that possibly means, you should probably be hired by the government as someone who can decript alien languages. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Giants",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "This was yet another poorly played game in London, which can be attributed to the ridiculously early start. It was even worse for the Rams, who would be kicking off at 6:30 a.m. their time, which is completely unreasonable. To my surprise, Los Angeles was sharp early, establishing a 10-0 lead and playing with more energy than the lethargic Giants. However, they absolutely blew this game, thanks to numerous mistakes by Case Keenum and Tavon Austin. Austin scored the game's first touchdown, but was responsible for the early blunders. He dropped a potential gain of 10-15 yards that would've taken the Rams to midfield, up 10-3, and the ball popped out of his hands and sailed right to Landon Collins, who had a spectacular return for a pick-six. Austin then muffed a punt, but was lucky to recover. He followed that up by fair-catching the ball inside his own 5-yard line. What Austin did, however, was not nearly as egregious as Case Keenum's errors. Though Keenum began 9-of-10 for 91 yards and a touchdown, he melted down as the morning progressed. He was nearly picked on a downfield shot on a flea-flicker. Then, on one play, he fumbled the ball, recovered it, then was almost intercepted while throwing the ball away. Keenum opened the third quarter by overthrowing an open Kenny Britt on what could've been an 80-yard touchdown. Keenum then effectively lost the game with a miserable interception; the game was tied at 10, but he fired an inaccurate ball to Austin, which was tipped by Keenan Robinson and caught by Collins again. The Giants scored shortly later, taking their first and only lead of the contest. Keenum managed to drive deep into New York territory twice after that, but sailed a horrible ball into double coverage, which was picked off. He had another interception, but Brian Quick ran the incorrect route. Keenum, as mentioned, began the game well, but his numbers after his first 10 throws display how bad he was. He was 23-of-43 for 200 yards and four interceptions after the first couple of drives (32-of-53, 291 yards, TD, 4 INTs overall), and those numbers even include garbage time on the last couple of possessions. Keenum was even worse than those stats indicate. He was wildly inaccurate, had numerous other picks dropped, showed zero pocket awareness - he ran into multiple sacks - and he constantly threw short of the first-down marker on third down. He is garbage, and he needs to be benched in favor of Jared Goff. There's no point in starting this middling backup anymore. ",
            "2": "Austin, despite his mistakes, caught 10 passes for 57 yards and the early touchdown. Quick (4-92) led the Rams in yardage, while Kenny Britt (3-43) predictably disappointed because, well, he's Kenny Britt. To be fair though, Britt should've had an 80-yard score, but Keenum overthrew him. ",
            "3": "Todd Gurley struggled again, mustering only 57 yards on 15 carries. He did catch six balls for 35 receiving yards, however, helping his PPR owners. He's been a huge disappointment. ",
            "4": "As for the Giants, they didn't really do anything. They just sat back and allowed the Rams to self-destruct; they had just one good drive the entire game, generating 232 net yards on a 4.1 yards-per-play clip (Rams had 4.5). They could've utilized the Bobby Boucher offense and kneeled down every play and still won. Eli Manning didn't have to do much, but he struggled to move the chains for the most part. He went 24-of-37 for 196 yards. Most of his throws were short, as he released the ball quickly to nullify the Rams' pass rush, sparked by the return of Robert Quinn. Manning was off the mark on several of his attempts, as his poor season continued. Manning was just 4-of-13 on third down, and he had a potential interception that was dropped by Mark Barron. ",
            "5": "Odell Beckham's status was a concern heading into this game, thanks to a hip pointer. He wasn't himself, catching five passes for just 49 yards. He dropped a pass in the third quarter, but made a great reception in between defenders to set up the decisive touchdown. Aside from Beckham, only one Giant generated more than 32 receiving yards. That was Victor Cruz (5-55), though he dropped a pass. Sterling Shepard (5-32) wasn't very effective either. ",
            "6": "The Giants didn't run well. Rashad Jennings mustered only 25 yards on 13 carries, but he scored the go-ahead touchdown on a 1-yard plunge, thanks to a poor defensive formation by the Rams. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Vikings and Eagles entered this game with three combined turnovers on the season. Anyone who thought that this would be a clean contest would end up being disappointed. In fact, the two teams were guilty of five turnovers in the first 10 minutes alone. Both offenses were a mess. For the Eagles, there was an early false start, followed by a Dorial Green-Beckham drop on third down. A hold ruined the second possession. Carson Wentz then threw an interception on an extremely poor throw to set the Vikings up deep in Philadelphia territory. Wentz fumbled on the ensuing drive on a botched hand-off with Darren Sproles, allowing the Vikings to take over on Philadelphia's 17-yard line. Wentz continued to struggle after that, forcing a horrible throw into heavy coverage that was easily picked off. You'd think the Vikings would be able to take advantage of these errors. They made nearly as many blunders, however, and theirs were more egregious because they made their mistakes in the red zone. Sam Bradford, who came into this contest with no interceptions on the year, fired a pick into the end zone under heavy pressure when he didn't see Rodney McLeod. Pressure was an issue all afternoon for the Vikings, as their fumble recovery turned into a Bradford strip-sack seemingly returned for a touchdown, but ruled down at the Philadelphia 24. Connor Barwin easily beat Jake Long, who was benched for a while after that. Long was swapped back in, but then was benched again, as Mike Zimmer and Norv Turner seemingly couldn't decide which crappy left tackle to have Bradford get killed. The Eagles ultimately got their act together offensively, sparked by a kickoff return touchdown. The Vikings never did, save for the very end in garbage time, ultimately prompting their first loss of the season. ",
            "2": "Wentz finished 16-of-28 for 138 yards, one touchdown and the two interceptions. Wentz began the game very poorly, but was sharp toward the end. He was actually 7-of-8 for 85 yards and a score following the break, so credit Philadelphia's coaching staff for making the proper adjustments. This was especially remarkable considering that left tackle Jason Peters left the game with an injury. ",
            "3": "No Philadelphia player registered more than 40 receiving yards. Josh Huff (4-39) led the way, while Jordan Matthews was limited to three grabs for 10 yards. Green-Beckham (2-8) caught Wentz's sole touchdown, but had the aforementioned drop. ",
            "4": "The Eagles got a good run out of Ryan Mathews, a burst of 20, but he didn't do much otherwise. He finished with 56 yards on 14 attempts, but handled most of the workload. ",
            "5": "As for Bradford, he never got on track like Wentz did. He finished 24-of-41 for 224 yards, one touchdown, his end-zone pick and two lost fumbles, and this was aided by garbage time. Bradford was fortunate that he didn't have other turnovers, as he had a potential pick-six dropped by Leodis McKelvin. I wouldn't blame this all on Bradford though, as Minnesota's offensive line couldn't block, and he seemingly got killed every time he took a deep drop in the pocket. The Vikings should seriously consider trading for Joe Thomas, who is reportedly available for a second-round pick. ",
            "6": "Stefon Diggs was expected to have a big game against a struggling secondary. That never materialized, as he was limited to two catches for 18 yards. Bradford simply didn't have time to get him the ball, and it didn't help that the officials missed an obvious pass-interference call that Diggs should've drawn. With Diggs limited, Bradford's leading receivers were Cordarrelle Patterson (7-67), who caught the touchdown at the very end, and Kyle Rudolph (5-55). I wouldn't read much into Patterson's garbage-time production. Rudolph, meanwhile, dropped a pass. ",
            "7": "Jerick McKinnon sustained an injury in the second quarter, but managed to return to action. He gained 43 yards on 11 carries, trailing Matt Asiata (12-55). Asiata had a big gain on a third-and-long, but didn't do much otherwise. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "If someone were watching football for the first time, and they were unfortunate enough to pick this matchup, they might come away thinking that the point of the game was to lose. Both teams seemingly tried their hardest to give this contest away, with Tennessee ultimately prevailing in that dubious regard. The Colts maintained a 17-6 lead despite countless drops. They were guilty of two on their opening drive, while Jack Doyle let the ball slip through his hands in the end zone on an ensuing possession. The Titans managed to roar back, thanks to numerous Indianapolis blunders. For instance, the Colts came up with an interception of Marcus Mariota while up 20-13, but unnecessary roughness negated the turnover. The Titans maintained possession and managed to move the chains via a pair of pass-interference flags. Tennessee established a field-goal lead, and the Colts seemed willing to allow them to keep it, as Andrew Luck nearly threw an interception, though the ball was tipped and sailed into the arms of Doyle. A bit later, Luck threw a touchdown to T.Y. Hilton, but an illegal shift nullified it. Devin Street then came up with a big catch for a first down in the red zone, but was flagged for spinning the ball. It's ridiculous calls like these that are driving fans away, by the way. Roger Goodell needs to crack down on this, and he should consider getting rid of Jerome Boger, whose officiating crew bungled yet another NFL game. Luck ultimately found Doyle for what would be the decisive touchdown. The Titans still had a chance to re-take the lead, but Mariota was strip-sacked, and Robert Mathis returned the turnover for a touchdown. ",
            "2": "Luck played extremely well, save for the near-interception. He finished 27-of-39 for 353 yards and three touchdowns, which is impressive considering that he endured countless drops to begin the game. Tennessee's secondary made things easy, however, as the team has major issues both at cornerback and safety. I have them addressing both spots in my <a href=/draft2017.php>2017 NFL Mock Draft</a>. ",
            "3": "Luck's touchdowns went to his only reliable players who happen to be healthy at the moment. Hilton caught seven balls for 133 yards and should've had that second score. Frank Gore caught all five of his targets for 22 yards. And then there was Doyle, who had a huge performance, snatching nine passes for 78 yards. Jack Doyle rules. ",
            "4": "Gore, by the way, didn't do much on the ground. He was limited to 61 yards on 17 carries. The Titans have one of the top run defenses in the NFL, so this wasn't much of a surprise. ",
            "5": "As for the Titans, Mariota didn't post as great of a stat line as his counterpart, though he didn't play poorly either. Mariota went 22-of-37 for 232 yards, two touchdowns and the lost fumble. As mentioned, he should've thrown an interception, but was bailed out by a Colts mistake. ",
            "6": "Only one of Mariota's touchdowns went to a likely target. Delanie Walker caught it, snatching seven passes for 84 yards. Mariota worked it to his tight ends early and often, abusing the Colts' beleaguered linebacking corps. The other touchdown was thrown to left tackle Taylor Lewan, who lined up as eligible on a first-quarter drive. ",
            "7": "None of Mariota's receivers did much. Tajae Sharpe caught four passes for 59 yards, with most of his production coming late. Kendall Wright didn't produce at all, reeling in just two balls for 12 yards. ",
            "8": "DeMarco Murray continued to run well, gaining 107 yards and a touchdown on 25 carries. However, more was expected of him, given the matchup. Lamar Miller trampled the Colts last week, so I thought Murray should've gone for at least 150 on 25 attempts, but he didn't break free for any long gains. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "This appeared as though it would be another ugly loss by the Jets. They surrendered an early touchdown on special teams when their punter dropped the ball, and then they trailed 10-0 following a big Baltimore play. Nick Mangold sustained an injury, and then Brandon Marshall kept screwing up - a big drop over the middle and a false start - and that was followed by Geno Smith getting knocked out. Smith held on to the ball too long, as he is wont to do, and took a sack as a result. He left the game after getting shaken up, and he was knocked out on a permanent basis. With Ryan Fitzpatrick under center, and Mangold out of the lineup, I didn't have much hope for the Jets, who were trailing when Smith left the game. And yet, the Jets prevailed. The Ravens, as it turned out, had way too many injuries to be competitive. And this includes the shoulder problem that apparently is really bothering Joe Flacco. Flacco didn't look right whatsoever. Some expected him to torch the Jets' miserable secondary, but he couldn't because he obviously wasn't 100 percent. He threw two interceptions; one pass was telegraphed, while the other was made because he heaved the ball off his back foot, prompting a high pass. Flacco actually seldom stepped into his passes in this contest. His mechanics were horrible, which might be a sign that he wasn't feeling well. Flacco finished 25-of-44 for 248 yards and those two picks. It wasn't all on him, as he didn't get much help from both his offensive line and receiving corps, missing stud guard Marshal Yanda and Steve Smith, respectively. ",
            "2": "Only three Ravens accumulated more than 11 receiving yards: Mike Wallace (10-120), Kamar Aiken (3-55) and Dennis Pitta (4-40). Wallace caught a 53-yard bomb in the first half to set up a field goal. ",
            "3": "The Jets have a strong run defense, so it's not surprise that Terrance West was limited to just 10 yards on eight carries. West got banged up on the opening drive, so perhaps that had something to do with his limited production as well. Another factor is that he had a gain of about 50 wiped out by an Alex Lewis hold; Lewis was in the lineup because of Yanda's injury. ",
            "4": "New York managed to run the ball much better than Baltimore. Matt Forte hadn't done anything since Week 2, but he hit the century mark in this contest, though he had 30 opportunities to do so. He also scored a touchdown. Sixty-eight of Forte's yards came in the second half, though he was extremely lucky at one point. Forte fumbled inside the 5-yard line. Baltimore lineman Timmy Jernigan picked up the ball, but then fumbled it himself, which the Jets recovered to preserve the scoring opportunity. ",
            "5": "As for the Jets' passing attack, I wrote that things seemed extremely bleak when Fitzpatrick took over, but he actually redeemed himself, playing better than Smith. The latter went 4-of-8 for 95 yards and a touchdown, with one of those incompletions being a drop by Charone Peake on third down. Fitzpatrick, however, finished 9-of-14 for 120 yards and a score. He made some mistakes - he took a sack to knock the team out of field-goal range and was whistled for a delay of game - but he was uncharacteristically sharp. It should be noted that the Ravens didn't have half of their defense on the field and couldn't generate any sort of pass rush as a result, so it's not like the Jets should suddenly have hope in Fitzpatrick. Still, it would be a surprise if Fitzpatrick didn't start the next game. ",
            "6": "One key Baltimore defender who was still on the field despite coming into the game as very questionable was cornerback Jimmy Smith, who shadowed Brandon Marshall on most snaps. Marshall, as a result, caught only three passes for 39 yards, though he hurt his stat line with a deep drop. Quincy Enunwa (2-73) and Forte (4-54) snatched Fitzpatrick's touchdowns. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "Kansas City's defense hadn't been the same to open the season, thanks to Justin Houston's injury and Sean Smith's departure. However, it appears as though the stop unit is rounding into 2015 form. One week after limiting the Raiders' offense to just 10 points, the Chiefs stomped all over Drew Brees, basically allowing nothing to him until very late in the game when they were up multiple scores. It didn't help the Saints that Terron Armstead sustained an injury on the second drive, but New Orleans couldn't block the Chiefs' defensive front. The sack count might not seem low - Drew Brees was brought down only once - but the Saints' blockers were responsible for numerous holding penalties, which disrupted drives in the opening half. As a result, Brees was constantly stuck in third-and-long situations, and he threw a pick-six on the second drive, which was deflected. Stats can be deceiving, and that's the case here, as Brees went 37-of-48 for 367 yards, three touchdowns and the pick-six. Brees definitely did not play poorly at all, but he wasn't as great as those stats indicate. He was very jittery in the pocket, as it was apparent that the Chiefs' pressure rattled him. The crowd noise was bothersome as well, as Brees took a delay-of-game penalty and had to waste a precious second-half timeout. He also missed some receivers, including Michael Thomas for a big gain on a third down at the end of the opening half, and he should've been picked off another time, but Ron Parker dropped the ball. ",
            "2": "The Chiefs will only get better defensively, as it's a great sign that they're 4-2 right now with Justin Houston not even seeing any game action yet. It'll be up to the offense to produce, and it's too bad for them that they don't get to beat up on the Saints' sorry defense every week. Alex Smith misfired on just seven occasions, going 17-of-24 for 214 yards and two touchdowns. Most of his throws were of the short variety, as you might expect, though he did connect on a long touchdown to Tyreek <strike>Lanister</strike> Hill for a 38-yard strike. He also made an impressive completion to Chris Conley toward the end of the game. It was a third-and-17, and Smith hit Conley for a gain of 18, as Conley somehow managed to tap both toes inbounds before falling out of play. ",
            "3": "Both Jeremy Maclin and Travis Kelce disappointed their fantasy owners, especially when considering the promising matchup. Maclin had four catches for 40 yards, while Kelce logged just two receptions for 24 yards. ",
            "4": "Another Chief who disappointed his fantasy owners was Jamaal Charles, though no one should have started him after he sustained an injury in practice. There was a question of whether Charles would even play. He touched the ball once, gaining nothing on the carry. He tried to get the edge on the play, but couldn't do it. Charles clearly wasn't 100 percent, so it's strange that he even dressed. Besides, Kansas City has the luxury of having Spencer Ware in the backfield, so Charles isn't really necessary at this point. Ware was terrific once again, gaining 77 yards on 17 carries and also caught a 46-yard touchdown. Thanks to Ware, the Chiefs should just rest Charles until he's absolutely 100-percent healthy. ",
            "5": "As for the rest of the Saints' offense, rookie Michael Thomas caught a whopping 10 balls for 130 yards. He outgained both Willie Snead (9-87) and Brandin Cooks (7-58), all of whom played well. Cooks, as well as Brandon Coleman, both caught Brees' touchdowns. ",
            "6": "Mark Ingram may have cost the Saints a victory. Ingram was guilty of a crucial fumble in the second half, coughing the ball up at the Kansas City 7-yard line. Had the Saints found the end zone on that possession, it would've been a completely different game in the fourth quarter. Nick Fairley, meanwhile, could also be considered a goat, as a stupid unnecessary-roughness penalty of his allowed the Chiefs to eat more time off the clock at the end of the contest. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "You can look at what the Browns have endured in two ways. You can consider them unfortunate because none of their quarterbacks can stay healthy. Cody Kessler played well in the first half versus the Bengals, but sustained an injury and was knocked out. It's a shame that the Browns couldn't get a full look at their young quarterback against a divisional rival, especially when considering that he was playing well. On the other hand, you could consider Cleveland to be very lucky that it continues to lose, given that it is currently the favorite to land the No. 1 overall pick in the 2017 NFL Draft. It seems as though the Browns would've been more competitive had Kessler managed to stay on the field. It was a tight game when he got knocked out, as Kessler was 9-of-11 for 82 yards. Even when Kessler was playing, Cleveland was utilizing fifth-string quarterback Kevin Hogan in these strange read-option plays that were inexplicably effective. Hogan actually led the Browns in rushing and managed to eclipse the century mark, gaining 104 yards and a touchdown on seven scrambles. Hogan's passing, on the other hand, left much to be desired. Watching him complete his dinks and dunks and misfire on anything longer than that was a clear reminder of why the Chiefs cut him despite using an actual pick on him in the 2016 NFL Draft. Hogan connected on half of his 24 passes for only 100 yards. He also threw two interceptions. ",
            "2": "The Bengals, battling a fifth-string quarterback, didn't need to do much in the second half, especially after A.J. Green hauled in a Hail Mary at the end of the first half with one hand off of a tip. Green also snatched a 48-yard reception in the third quarter with one hand as well. Green was a monster in the wake of Joe Haden's absence, converting all eight of his targets for 169 yards and the Hail Mary touchdown. ",
            "3": "With Green going nuts, Andy Dalton was able to post a great stat line, going 19-of-28 for 308 yards and two touchdowns. His other score was a 44-yard bomb to Brandon LaFell (4-83). Dalton wasn't as great as those numbers indicate, as he held on to the ball too long on occasion, taking three sacks in the process. However, Dalton will continue to improve as long as Tyler Eifert gets healthier. Eifert didn't see much action in this contest; he was targeted twice, converting just one of them for nine yards. Eifert was on the field for just 15 snaps. He could round into shape following Cincinnati's Week 9 bye. ",
            "4": "Jeremy Hill posted a great stat line, rushing for 168 yards and a touchdown on only nine carries. Hill wasn't as great as those figures might say, as he picked up chunks of 54 and 40, thanks to his offensive line blowing open huge holes for him. Hill got banged up in the second half, aggravating his shoulder injury. Giovani Bernard was more consistent anyway, tallying 80 yards and a touchdown on 17 attempts. He caught only one pass. ",
            "5": "The one dark cloud over this victory for the Bengals was that left tackle Andrew Whitworth suffered a concussion. Whitworth is one of the best left tackles in the NFL, so it'll be a huge blow for the offense if he misses any time. ",
            "6": "Going back to the Browns, Terrelle Pryor was able to suit up, but didn't do much, thanks to the fact that he was on the field for only half of the team's offensive snaps. Hogan taking over at quarterback didn't help matters either. Pryor caught only two passes for 18 yards. Gary Barnidge (6-66) was the only Cleveland player to accumulate more than 21 receiving yards, as Hogan was clearly locked in on him. ",
            "7": "I mentioned earlier that Hogan led the Browns in rushing. Isaiah Crowell didn't run poorly (12-63), but didn't get much of an opportunity because the Browns trailed for most of the afternoon. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Raiders were coming off a blowout loss to the Chiefs at home last week, but apparently battling the Jaguars, even in an early-start game on the East Coast, was exactly what the doctor ordered. Oakland dominated this contest to get back on the right track, improving to 5-2. Despite the 33-point total, it wasn't Oakland's offense that sparked the victory, however. The defense played well, but that wasn't the primary catalyst either. It was actually the Jaguars, who had an epic meltdown in front of their former head coach. Blake Bortles began the afternoon by missing an open Allen Robinson. Bortles then fired an interception into the end zone, recklessly heaving a pass into triple coverage. Marquise Lee was whistled for unsportsmanlike conduct, and then Malik Jackson was flagged twice on the same play; once for roughing the passer and another time for yelling at the official. He was eventually ejected, as was Jalen Ramsey for fighting. Bortles, meanwhile, continued to do more harm than good, missing an open Julius Thomas for a touchdown and then getting flagged for intentional grounding on a play in which the Raiders were offside. Robinson, meanwhile, spent the afternoon dropping passes, while the special teams were guilty of a muffed punt. The Raiders, meanwhile, did just enough offensively to prevail. Derek Carr went 23-of-37 for 200 yards and a touchdown. He could've thrown a second score, but Clive Walford dropped the ball in the end zone. With the Raiders leading throughout, Carr didn't have to force the issue at all, so he effectively was just a game-manager in this contest, all while the Jaguars melted down in front of his very eyes. ",
            "2": "Michael Crabtree was Oakland's only productive receiver in this contest. He caught eight balls for 96 yards and the only touchdown Carr threw on the afternoon. Amari Cooper didn't do much - four catches, 29 yards - but that's because Ramsey was draped all over him. ",
            "3": "Latavius Murray returned from injury, and while he didn't run particularly well - he gained 59 yards on 18 carries - he managed to find the end zone twice, rewarding those who were bold enough to start him in fantasy. ",
            "4": "As for the Jaguars, I detailed their numerous blunders. Bortles was absolutely awful, and he doesn't seem to be progressing mentally. This was a concern for Bortles coming out of Central Florida, so it's not a surprise that he's regressing like this, despite the great offensive coaching he's been receiving. If Bortles can't ever develop into a consistent passer with Greg Olson aiding him, there might not be any hope. Bortles finished 23-of-43 for 246 yards, one touchdown and two interceptions, and even those pedestrian numbers were helped by garbage time. Bortles was just 5-of-14 for 57 yards and a pick in the first half. Oakland's pass defense has gotten better in recent weeks, but there's still no excuse for this. ",
            "5": "Allen Robinson posted a miserable stat line, catching just two of his eight targets for nine yards. Robinson wasn't completely to blame for this, as Bortles constantly missed him on numerous basic throws. Robinson, as mentioned, was guilty of two drops. Allen Hurns (4-45) wasn't much better. Marquise Lee (7-107) was the grand-prize winner of the Blake Bortles Garbage Time Sweepstakes, while Julius Thomas (3-20) caught Bortles' sole touchdown, but would've secured another score had Bortles been accurate. ",
            "6": "Chris Ivory led the Jaguars in rushing (5-48), however, all but six of his yards came on one burst. T.J. Yeldon (6-24) didn't do much better. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Lions",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> As if the Lions didn't have enough injury issues. They were missing two of their top three defensive players (Ziggy Ansah, DeAndre Levy) for the majority of the season, and now their other great defensive player, Darius Slay, is hurt. The Lions should figure out which Indian burial ground they desicrated and apologize. ",
            "2": "The Redskins' four-game winning streak came to an end against Detroit even though they got a quality performance from their defense and Kirk Cousins. Washington running back Matt Jones had a disastrous performance with three fumbles, including one into the end zone to take away critical points from his team. The Lions earned their third-straight win to stay in the playoff race, while the Redskins were dealt a blow with the Giants and Eagles both winning on Sunday. ",
            "3": "Late in the first quarter, the Redskins got on the move with a completion to Niles Paul taking the ball across midfield. They moved the ball close to the end zone, but Matt Jones had his second fumble of the game and the Lions recovered the ball in the end zone to take points away from Washington. Detroit took advantage by getting on the move with a 27-yard screen pass to Golden Tate (6-93). That set up a 43-yard field goal for Matt Prater. The Redskins were set to tie the game at three thanks to completions to Jamison Crowder, but Dustin Hopkins missed a 45-yarder off the upright. On the final play of the half, Hopkins tied the game at three. In the third quarter, the Lions got moving with an 18-yard run from Stafford and then a 52-yard bomb to Marvin Jones, who got a step on Josh Norman. Norman was injured on the play and went into the locker room with a concussion. A few plays later, Zach Zenner (9-29-1) plunged into end zone. Matt Jones then had his third fumble of the game, which was recovered by the Lions' Kerry Hyder. A shovel pass to Tate went for 22 yards, and the Lions expanded their lead to 13-3 early in the fourth quarter. The Redskins responded with a touchdown drive to cut the lead to 13-10. The big play was Cousins hitting Vernon Davis (6-79) for a 27-yard reception to the Lions' 1-yard line, and that set up a short touchdown pass to Robert Kelley. Chris Baker bull-rushed through Larry Warford to help get the ball back for the Redskins. Washington moved down the field with Chris Thompson receiving and running the ball into the red zone. Head coach Jay Gruden and offensive coordinator Sean McVay made a great play call with a zone-read run that Cousins took into the end zone from 19 yards out. It caught Detroit's defense completely by surprise. The Redskins held a 17-13 lead with 1:05 to go. With the ball back, Stafford hit Marvin Jones on the run to get the ball to midfield and then took off on a scramble to get inside the 40-yard line. Andre Roberts (1-20) made a great leaping grab to move the ball inside the 20. With just under 30 seconds remaining, Stafford threw a frozen rope to Anquan Boldin (3-28-1) for an 18-yard touchdown pass to win the game for Detroit. ",
            "4": "Stafford entered this game red hot, but the Redskins' defense put the clamps on him in the first two quarters while being aided by some dropped passes by his receivers. He was only 7-of-13 for 79 yards at the intermission, but came up big in crunch time to finish 18-of-29 for 266 yards with a touchdown. Stafford also ran for 32 yards. ",
            "5": "Justin Forsett led the Lions with 33 yards on eight carries, plus two receptions for 15 yards. Marvin Jones led Detroit with four catches for 94 yards. ",
            "6": "Kirk Cousins completed 30-of-39 passes for 301 yards with a touchdown. Jamison Crowder (7-108) led Washington through the air. ",
            "7": "Matt Jones (10-27) turned in a meltdown performance with three fumbles. Chris Thompson (12-73) should take over as the feature back for the Redskins. ",
            "8": "Defensively, the Redskins ramped up the edge rush, with Ryan Kerrigan beating Riley Reiff for a sack. Preston Smith and Trent Murphy also added sacks. Tahir Whitehead (12 tackles) played well for Detroit. Kerry Hyder caused a lot of disruption with a steady interior pass rush. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "25"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Just losing to the Dolphins wouldn't have been so bad for Rex Ryan. Miami is underrated and will continue to do well as long as its offensive line is intact. But Ryan bungling the LeSean McCoy issue is unforgiveable. All reports indicated that McCoy would miss multiple games, and some said that McCoy didn't look right in pre-game warmups, yet Ryan forced McCoy to play. Lo and behold, McCoy re-injured his hamstring. ",
            "2": "This game was a surprising one, to say the least. The Bills looked to have this contest all but wrapped up before blowing the lead late. They were still almost able to make a miracle comeback, but could not get the job done. Instead, the Dolphins escaped with their second-straight impressive win. The Bills could not get anything going in the run game. Part of the problem was the health of LeSean McCoy. Coming into the contest, it was widely expected that McCoy would be unable to play due to a hamstring injury he had suffered on Wednesday. However, the team elected to dress him, and he was in the starting lineup. McCoy had the worst performance of his season, getting just eight carries for 11 yards. Making matters worse, he left the game midway through the second half after aggravating his hamstring injury. The Bills were foolish to play McCoy as they have now risked his long-term health. Soft tissue injuries tend to linger, so it now may be a long time before McCoy is fully healthy again. Top backup Mike Gillislee looked better than McCoy did in limited action. Gillislee only got five carries, totaling 20 yards. However, he had a big run of 20 yards that saw him burst through the defense and scamper upfield for a huge gain. The only reason Gillislee did not have more yardage was because of a busted wildcat play that saw him lose 11 yards. Gillislee may end up carrying the load for the next couple games depending on the health of McCoy. Reggie Bush (1 carry, 1 yard, 1 TD) will also see action. ",
            "3": "The real force on the ground was actually quarterback Tyrod Taylor. Taylor was solid on scrambles and managed 35 yards and a touchdown on seven carries. He had a great read-option touchdown that saw him fake a run to the back and then use his speed to get the edge. The Dolphins had no chance to stop him. In the air, Taylor once again put together a good performance, though he tapered off at the end of the day. During the contest, Taylor went 14-of-28 for 221 yards and a touchdown. He made some very nice throws, including the touchdown to Marquise Goodwin. The ball was perfectly placed by Taylor despite the fact that he was dealing with pressure. Taylor launched the ball downfield and got crushed as soon as he released it. The pass hit Goodwin perfectly in stride and allowed the receiver to speed into the end zone. It was a 67-yard score that gave the Bills a 17-6 lead. ",
            "4": "Goodwin was the best of the receivers for the Bills on the day. He caught four passes for 93 yards and the aforementioned touchdown. He appears to be Taylor's favorite target right now. Charles Clay (2-29) and Justin Hunter (2-25) were the other favorites of Taylor on the day. The offensive unit performed pretty well considering that it was missing its top two receivers, Sammy Watkins and Robert Woods, during the game. ",
            "5": "The reason that the Bills lost was that they were unable to hold up on defense late. The unit just seemed to tire out and could not stop the Dolphins any longer. In fact, before the Bills' final drive, the Dolphins had outgained the Bills 178-6 in the fourth quarter alone. Still, the defensive stars for the Bills performed well. Lorenzo Alexander added yet another sack to his league-leading total. He was able to constantly break into the backfield and looked great. It makes me wonder where this production has been throughout his career. Zach Brown also looked very good during the game. He added seven tackles to his season total and was seemingly involved in every play. ",
            "6": "For the Dolphins, this was a huge win. Coming off of a surprising blowout win over the Steelers, Miami was looking to build momentum. The Dolphins were able to do that. The catalyst behind this was the performance of Jay Ajayi and the offensive line. Ajayi was simply terrific. The Buffalo front could not contain the second-year back at all. He finished the day with 29 carries for a whopping 214 yards and a touchdown. He constantly ripped off 10-yard chunks and had numerous impressive runs. One of his best came when he broke for a 53-yard run when the Dolphins were backed up in their own territory, and that run helped to flip field position. Ajayi looks to be the workhorse back for the team working forward. He has back-to-back 200 yard games, and he could end up being a huge pick-up if he is available in your fantasy league. Part of the reason that Ajayi was able to run so well was the performance of his offensive line. This was the second time that the normal starters played all together, and they were able to open some huge lanes. If they stay healthy, the Dolphins could end up making a playoff push. ",
            "7": "In the passing game, Ryan Tannehill was pretty strong. He went 15-of-25 for 204 yards and a touchdown. Tannehill did not do anything spectacular, but he was able to do his job and play efficiently. He also did make one great throw. On a third-and-7, Tannehill rolled out to the right and threw a ball slightly across his body. He completed it and got a huge first down. Of Tannehill's receivers, Kenny Stills definitely stood out. He caught five passes for 100 yards and a touchdown. Stills was able to work into open space, and for the first time, he looked like more than just a speed threat. Granted, 66 of his yards came on the touchdown catch, but he still was able to get into open space. Aside from him, Jarvis Landry (5-78) and DeVante Parker (3-20) led the way for the team. Speaking of Landry, he made a play that was absolutely hard to watch. On a play in the first half, he made a vicious block on Bills safety Aaron Williams. Williams went down on the play and was declared out with a head/neck injury. Williams suffered a nearly career-threatening neck injury last year, so he may be in trouble. To his credit, Landry apologized and looked upset. Nonetheless, it was a dirty play, and he should expect a hefty fine from the NFL. ",
            "8": "Final Note: Cameron Wake looked great today. He was able to constantly get into the backfield and wreak havoc. He finished the day with 1.5 sacks and looks to be back to his old self. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> If the NFL thought that they were losing viewers as a result of Colin Kaepernick's pre-game antics, just wait until what happens until people catch wind of the racist t-shirt he wore in the post-game press conference. The 49ers should just do the league a favor and cut him. Maybe once they do that, they'll recoup the fans they lost this season - and believe me, based on the feedback I've received, they've lost many people to Kaepernick's stance. ",
            "2": "The 49ers almost were able to exorcize their demons in this game. They jumped out to a 14-0 lead, and it looked like they were coming together. However, they collapsed after that and allowed the Buccaneers to take control. From there, the 49ers had no chance of winning; not that they ever did have a chance, given their quarterback play. Colin Kaepernick was pretty dreadful in the contest, going 16-of-34 for 143 yards for an awful yards-per-attempt statistic of 4.8. He did throw a touchdown, but that was negated by the two turnovers he had - a pick and a fumble. Frankly, Kaepernick does not look like a quarterback at all; neither a starter nor a backup. He needs to change positions. Kaepernick does have some serious athletic ability, which was on display during this game. He carried the ball nine times for 84 yards and demonstrated great instincts when looking for lanes. He has great speed and size, so perhaps switching to wide receiver or tight end would be beneficial for him. It may be too late for him, but given the recent success of Terrelle Pryor some team may take a chance on Kaepernick. It makes more sense for him to make change than to continue struggling as a quarterback. Christian Ponder is probably a better option at this point. ",
            "3": "The receivers for the 49ers had a tough day because of Kaepernick's struggles. No wideout had more than 37 yards on the day. Quinton Patton (3-13), Jeremy Kerley (2-15) and Torrey Smith (1-17) were all relatively disappointing. They may have performed better with a different quarterback, but they were still underwhelming. ",
            "4": "In terms of the running game, the 49ers used a rather ineffective rotation of DuJuan Harris and Mike Davis. Carlos Hyde was out for the game, so Davis was expected to carry the load; however, Harris got 11 carries, for 39 yards, while Davis just received seven, for 21 yards. Harris looked like a decent change-of-pace back, but Davis is just a plodder at the best. Shaun Draughn did not see a carry, but he did have five catches for 37 yards and a touchdown. Perhaps he will get more carries moving forward if Hyde misses any more time. ",
            "5": "Defensively, the 49ers suffered a lot of injuries. At any point, it seemed like they were missing multiple players. Rashard Robinson, Arik Armstead and Nick Bellore were among the many players to go down. It will be interesting to see how San Francisco's injury report shakes out following this contest. ",
            "6": "As for the Buccaneers, this was a very encouraging performance. Most importantly, they got a great effort out of their second-year quarterback, Jameis Winston. Winston was incredibly sharp during this game. He went 21-of-30 for 269 yards and three total touchdowns. Winston did throw a pick, but that was probably his only blemish. On all three of his touchdowns, Winston made excellent throws. The first one went to Mike Evans (8-96) after Winston moved around the pocket and stepped up into open space. It was a nice display of his mobility. The second touchdown went to Russell Shepard (5-77). Winston lofted a perfect pass into a small window that allowed Shepard to go up and catch the pass. It was definitely Winston's best throw of the game. The final score went to Evans as well. Winston put the pass up where only his tall receiver could get it. It was a smart play that really helped to solidify the lead for the Buccaneers. If Winston can continue to play like this against major competition, that would be great for Tampa. They definitely need him to play well if they want to have any chance of competing in the future. ",
            "7": "In terms of the receivers, Evans and Shepard really led the way for the team. They combined to catch 13 of Winston's 21 completions. It looks like they will be the top guys moving forward. Aside from those two, tight end Cameron Brate (3-29) and wide receiver Adam Humphries (2-17) will continue to see targets. Brate is worth consideration as a TE2 with upside, while Humphries is too inconsistent to be relied on in fantasy. ",
            "8": "The other player who really helped the Bucs win today was running back Jacquizz Rodgers. The veteran looks to be a terrific fit in the Tampa Bay offense. Rodgers got 26 carries during the game and totaled a whopping 154 yards. He was able to gash the 49ers' poor run defense and should be the top running option moving forward. He will be a FLEX with upside most weeks. Aside from him, Peyton Barber totaled 12 carries for 84 yards, most of which came on a late 44-yard touchdown burst. He will probably be the top backup until Doug Martin gets healthy. ",
            "9": "On defense, the Buccaneers got a terrific performance from their defensive linemen. Gerald McCoy was able to put a lot of pressure on Kaepernick. Though McCoy only had one sack, he broke through the 49ers' offensive line repeatedly and set up his teammates for the other sacks. Tampa Bay collected four in total, and this was a really strong performance for the unit. ",
            "10": "Final Note: Both of these teams ended up having special-teams issues in the contest. For the 49ers, they had a terrible play occur that helped the Buccaneers stay in the game. On a punt, rookie wideout Aaron Burbridge crashed into the return man Jeremy Kerley, and that resulted in a critical fumble. Tampa recovered the fumble, eventually turning that into three points. Meanwhile, the Buccaneers had some problems of their own. Their rookie kicker, Roberto Aguayo, has continued to struggle. In this game, he made two of his three field goals, but he did miss a 50-yarder. Granted, that is a long kick, but the fact of the matter is that he was a second-round pick. You do not pick kickers in the second round unless they can make 50-yarders in their sleep. Aguayo is now 6-of-11 on the season. He needs to improve, or he will continue to be a liability for the team. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "30"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> As I wrote in the comments of my <a href=/picks.php>NFL Picks</a> page, the Chargers will give me a heart attack one of these weeks. I had them as my October NFL Pick of the Month, and I'll be honest - I didn't think I was going to make it! ",
            "2": "For the Chargers to claw their way back into the AFC West race, they needed this road win badly. Their margin for error was killed when they gave some games away early this season to the Chiefs, Saints and Colts. Improving to 3-4 was a necessity. Philip Rivers and Melvin Gordon came through to carry San Diego to a win. Atlanta's defense struggled, and Dan Quinn made a terrible decision that backfired on the Falcons to set up the Chargers for an easy overtime field goal and the win. If Atlanta doesn't end up winning the NFC South, this game will stick out as one that the Falcons let get away. ",
            "3": "The Chargers got moving when Philip Rivers threw a beautiful pass of 49 yards to Tyrell Williams. Melvin Gordon finished the drive with two runs to find the end zone. The Falcons moved the ball into San Diego territory with passes to Julio Jones, but the drive was held to a Matt Bryant 42-yard field goal. Atlanta was quickly set up for more points as Deion Jones caught a deflected pass off the hands of Dexter McCluster, and Jones returned the interception 42 yards to the Chargers' 10-yard line to set up a second Bryant field goal. The Chargers responded with a field goal drive of their own. Ryan then lofted in a perfect 50-yard bomb to Jones, and on third-and-13, Ryan threw a frozen rope to Jacob Tamme for a 17-yard touchdown. Atlanta expanded its lead with Tevin Coleman (8-64) exploding down the field for a 30-yard touchdown. Right after a Brooks Reed sack, Vic Beasley strip-sacked Rivers. Adrian Clayborn scooped up the ball and rolled into the end zone to give the Falcons a 27-10 lead. Rivers came right back to hit Tyrell Williams for 38 yards in busted coverage. A 21-yard pass to Travis Benjamin (4-54) got San Diego in the red zone at the 2-minute warning. A bullet to Hunter Henry (1-16) moved the ball to the 3-yard line, and Gordon ran in the touchdown to cut the Falcons' lead to 27-17 at the half. Midway through the third quarter, Rivers led a field goal drive to cut the point deficit to seven. Atlanta responded with runs from Devonta Freeman of 15, 14, and eight yards to set up another Bryant field goal. San Diego then marched down the field as Rivers picked apart the Falcons' defense. He used Gordon as a receiver on a number of plays, including a five-yard touchdown toss. That cut the Falcons' lead to 30-27 with six minutes remaining. San Diego's defense came through as Denzel Perryman picked off Matt Ryan to get the ball back. Close to midfield on a fourth-and-2, Rivers hit Antonio Gates (5-38) to move the chains. Gordon had a great run on a third-and-1 where he was stuffed by Deion Jones but bounced off the tackle to turn the other way for a run of more than 10 yards. Atlanta got a stop, but Josh Lambo tied the game with a short field goal. The Falcons got the ball to San Diego's 40-yard line with one second remaining, but Bryant's 58-yard field goal was no good. On the first possession of overtime, Falcons head coach Dan Quinn made a crushing decision. It was obvious that Atlanta should punt and force the Chargers to drive the field, but Quinn showed no confidence in his defense as he went for a fourth-and-1 at his own 45-yard line. That didn't work out, as Perryman fired into the backfield to notch a tackle for a loss. The Chargers moved the chains with Gates and Gordon to set up Lambo to hit a 42-yard field goal for the win. ",
            "4": "Philip Rivers was 27-of-44 for 371 yards with a touchdown pass and an interception. Tyrell Williams led the Chargers with seven catches for 140 yards. ",
            "5": "Melvin Gordon ran for 68 yards on two scores with 22 carries and caught six passes for 53 yard with a touchdown. Gordon is turning into a difference-maker for San Diego. ",
            "6": "Matt Ryan was 22-of-34 for 273 yards with one touchdown and an interception. The Falcons' offense played well, but settling for field goals ended up hurting them. ",
            "7": "Julio Jones was phenomenal as usual. He had nine receptions for 174 yards. Devonta Freeman ran for 58 yards on 15 carries and had five receptions for 42 yards. Tevin Coleman left the game with a hamstring injury. ",
            "8": "The Chargers' defense struggled to slow down Jones, but they came up with some critical stops and held the Falcons to field goals. Melvin Ingram (9 tackles, 1 sack), Joey Bosa (2 sacks, 5 tackles) and Denzel Perryman (7 tackles, 1 interception) all played really well. Atlanta got a good game from Vic Beasley has he had two sacks with a forced fumble. Rookie safety Keanu Neal played well with nine tackles. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> The most underrated part of this game was when the clueless Phil Simms said, Landry Jones is the most seasoned and prepared backup in the NFL. Literally, seconds later, Jones threw an interception. It was incredible. ",
            "2": "The New England Patriots came into Pittsburgh as a touchdown favorite and with a clear path to a win with quarterback Ben Roethlisberger out for the Steelers with a knee injury. And in the end, the Patriots did handle the Roethlisberger-less Steelers and showed just how good they can be, but the Steelers also showed that they aren't completely dead without their star quarterback, as Landry Jones and company were able to move the ball on a strong New England defense. The Patriots got out to a quick lead in this game when Tom Brady hit James White on a short pass that White took to the house for a 19-yard touchdown - his third in his last two games. Then, early in the second quarter, LeGarrette Blount went in from three yards out to put the score at what appeared to be an insurmountable 14-0 lead. Jones, who had a poor pass intercepted in the end zone to start this game, never lost his cool, which we've seen happen in the past as poor decisions accumulate. His best drive of the game came midway through the second quarter when he hit Antonio Brown with a beautiful pass for 51 yards, and then, four plays later, hit Darrius Heyward-Bey for a 14-yard touchdown on yet another nice throw. I bring up these nice throws because I have rarely seen Landry Jones put more than one good throw together on a drive. If you had Brown on your fantasy team last season, you knew that he was toast if Jones was in there, but amazingly, Brown pulled down 7-of-11 passes for 106 yards and added a 13-yard rush. Of course, Brown still hasn't caught a touchdown pass from anyone other than Roethlisberger, but this was a great step forward for Jones. Unfortunately for the Steelers, the Patriots had on their big-boy pants and didn't have nearly as much trouble getting into the end zone as the Steelers, who continually settled for field goals or field goal attempts. ",
            "3": "The Patriots did let the Steelers get within one-point, as the game was 14-13 midway through the third quarter, but two strong runs by Blount picked up 36 yards and then Brady hit Rob Gronkowski for a 36-yard touchdown. It was a play over the middle that very few, if any defenders, could have stopped and very few tight ends could have made. The Brady-Gronkowski connection sets the New England offense apart, as we could see when they hooked up for a 37-yard reception, which was the key play on the Patriots' last scoring drive, and one they dial up whenever they are in need. ",
            "4": "Even though receiving specialist James White was able to score, this game would easily be considered a Blount game. Blount, who was dismissed from the Steelers due to walking off the field while time still remained on the clock, might have had some revenge on his mind this week, as he accumulated 134 yards and two touchdowns on 25 touches. He was the closer in this one, with the bulk of his yards coming in the second half to salt the earth. ",
            "5": "Le'Veon Bell continued to show just how good he is, as he rushed 21 times for 81 yards and caught 10-of-13 targets for 68 yards. His touchdowns will be fewer while Jones is in there, but Bell is such a special talent, that he can get yards in many ways. ",
            "6": "Julian Edelman was, by far, the lead target for Brady this week, as he saw 10 and caught nine for 60 yards, but he did drop yet another pass and has yet to have that breakout game we expect from him. The good news is that Edelman is still a big part of this offense and should come around for all you fantasy footballers. ",
            "7": "Landry Jones was outmatched in this game, but not many quarterbacks would have been a match for Brady. The good news for the Steelers is that Jones probably would have beaten a lesser team, and there's a chance they will need him to come up big this season if they want to make some noise this postseason. The Patriots, on the other hand, are getting healthier by the day it seems, and at 6-1 after missing Brady for the first four games, they couldn't be in a better position. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "6"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "I don't know how to begin this recap. The Cardinals and Seahawks felt like they played eight quarters in this defensive slugfest. Both teams made numerous mistakes all evening amid great plays by both stop units. Ultimately, the game went to overtime, and both teams had a chance to seal the victory with chip-shot field goals. Chandler Catanzaro hit the left upright on a 24-yard try, though he was bothered by pressure from Richard Sherman and Bobby Wagner. On the ensuing possession. Steven Hauschka whiffed on a 28-yard attempt, though I bet he wishes he hit the post because his kick wasn't even close. The game ended in a senseless tie, something that the NFL should've abolished long ago. Ultimately, this tie hurts the Cardinals more; they were at home, and they needed to rebound off their 3-3 start, while the Seahawks were 4-1 and had a greater margin for error. ",
            "2": "Going into this game, I spent some time writing about how I was confused about why the top entrants in the Supercontest and the sharps all were wagering on the Cardinals. During this contest, I spent the majority of the evening wondering how they possibly knew that Russell Wilson wasn't nearly 100 percent in terms of his passing ability. Wilson, of course, has been dealing with some knee problems, he had been able to throw the ball well in his past three games. That was not the case in this contest, as he struggled throughout most of the evening. This almost went down as one of Wilson's worst games ever. Sure, the offensive line didn't do him any favors; they surrendered constant pass rushes to Chandler Jones and Markus Golden. The latter proved to be a huge problem for the Seahawks. The Seattle blockers also were constantly flagged for holding penalties. By the time the second half commenced, I was shocked when there was an offensive play in which one of the linemen wasn't guilty of a hold. However, Wilson was way off the mark on most of his passes, even on the rare occasions in which he had time to throw. He definitely did not look right, and I was wondering if he's dealing with some new, undisclosed injury. I noted that Wilson was horrible for most of the evening. Things somehow changed in overtime. Wilson made a great touch pass to Jermaine Kearse for 31 yards, and then he hit Doug Baldwin for a 27-yard toss in which Baldwin got away from Tyrann Mathieu. This set up Hauschka's 28-yard try, but he ruined Wilson's sole positive drive with a miss. Wilson finished 24-of-37 for 225 yards. Those aren't horrible numbers, but keep in mind that he had a big chunk of his yardage in overtime. Wilson definitely did get better as the evening progressed, as he was 5-of-14 for 34 yards in the opening half. Maybe he doesn't have a new, undisclosed injury, but the offensive line is definitely a big problem. I was thinking Seattle's coaching staff would be able to remedy this issue during the bye as it has been able to in previous years, but apparently, that was not the case. ",
            "3": "Wilson's targets didn't have quality numbers as a result of his struggles. Baldwin caught six balls for 69 yards, with 27 of those yards coming in overtime. His only blemish was a drop with four minutes remaining in regulation. Jimmy Graham (5-53) also dropped a pass. Tyler Lockett, meanwhile, was a disappointment with just two receptions for 13 yards. ",
            "4": "Christine Michael was also affected by Seattle's poor offensive line. Michael had a nice run in overtime, but he was limited to 52 yards overall on 16 carries. ",
            "5": "The main advantage Arizona had in this contest, aside from its ability to refrain from committing stupid penalties throughout the evening, was the rushing attack. The Seahawks were able to clog rushing lanes pretty well, and yet, David Johnson still picked up decent gains. Most of his attempts ended with Johnson twisting or pushing forward to pick up extra yardage, and all of those high-effort plays added up, as they put Carson Palmer in some favorable down-and-distance situations. Johnson gained 113 yards on 33 carries to go along with eight catches for 58 receiving yards. He also had a gain of about 30 negated by a hold. Johnson appeared to win the game in overtime, but he was tackled twice short of the goal line, prompting Arizona to try a 24-yard kick with Catanzaro, and the rest was history. ",
            "6": "Palmer finished 29-of-49 for 342 yards. I've been trashing Palmer all year because he hasn't looked the same, but he was better in this contest. He still missed on some throws he ordinarily would've made, but he was battling a tremendous secondary, albeit one without Kam Chancellor. Palmer did have an interception negated by a Sherman hold, and he nearly threw a pick-six that was dropped by Earl Thomas, but Palmer should have registered more completions, but was betrayed by numerous drops. ",
            "7": "Larry Fitzgerald caught nine passes for 70 yards. He wasn't the top Arizona receiver in the box score, however. J.J. Nelson held that distinction, snatching three balls for 84 yards, including a 40-yarder in which he beat Sherman to set up what appeared to be the game-winning field goal. Michael Floyd, meanwhile, had a miserable evening, continuing his horrible season. Floyd caught five passes for 65 yards, but that doesn't tell the whole story. Floyd dropped a pass early, forced the team to burn a timeout because he didn't line up properly, got flagged for a hold to wipe out a long run, and then dropped another pass in the red zone to force Arizona to try a field goal. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "The Texans paid $72 million for Brock Osweiler this offseason, and the Broncos were more than willing to let him go, opting to start a seventh-round first-year starter instead at quarterback. The early returns seem like Denver was wise to be frugal, while Houston has made a dire mistake. Brock Osweiler had a nice fourth-quarter performance against the Colts, but he was going up against one of the top defenses in the NFL on Monday night. If that wasn't enough, several members of the Broncos' stop unit told the media that they wanted to kill their former teammate. The malice in Aqib Talib's voice during a pre-game interview made it sound like Denver's veterans felt like spurned lovers, and they were completely focused on not letting Osweiler beat them. Mission accomplished. Osweiler was absolutely atrocious in this contest. He went 22-of-41 for only 131 yards and a lost fumble. That's right - he had a 3.2 YPA. Brodie Croyle could've done better while tripping on LSD. Only Jesse Palmer generated fewer yards on 40-plus attempts in NFL history. And yet, the numbers don't even appropriately describe how abysmal Osweiler was. Osweiler's downfield passes were all off the mark. He missed open receivers all evening. All of his completions were dinks and dunks, and he often threw way short of the first-down marker on third down. Osweiler's fumble was ridiculous - the ball just slipped out of his hand without getting hit, and if the Broncos knew what was going on, they would've returned it for six - and he was nearly pick-sixed by T.J. Ward in the early going. The one silver lining for Houston fans who are worried that Osweiler is an absolute bust is that he didn't have much of a chance behind his offensive line. His blockers struggled versus Denver's ferocious pass rush, especially in the wake of right tackle Derek Newton's injury. Newton was carted into the locker room at the end of the first quarter, and Lisa Salters later reported that he tore both of his patellar tendons. Newton's career could be over. ",
            "2": "Thanks to Osweiler's incompetence, both of Houston's primary receivers struggled. DeAndre Hopkins saw 12 targets, but caught only five passes for 36 yards. Will Fuller (4-22) was worse, as he had a drop in the red zone. Osweiler tried to take some deep shots to them, but his accuracy betrayed him. ",
            "3": "The Texans were able to move the chains and keep this game close for a while via the ground attack. Lamar Miller had a nice, 25-yard burst, but was only given 11 carries (61 yards) because he was constantly on and off the field with a shoulder injury. Alfred Blue mostly looked good in relief, gaining 63 yards on 11 attempts. Blue, however, ended up costing the Texans the game. Houston had the ball in the red zone, down just 14-9 in the third quarter, but he lost a fumble. This appeared to take the air out of the tires for the Texans, and after a few plays, the Broncos found the end zone to go up 21-9, which proved to be an insurmountable lead. ",
            "4": "The Broncos didn't have much offensive success early because they hurt themselves with holding penalties. However, they ultimately got their act together and then had some positive drives. Trevor Siemian outplayed Osweiler, though he didn't exactly have as difficult of a matchup. He finished 14-of-25 for 157 yards and a touchdown. He had a deep completion nullified by a Russell Okung hold, and he also endured some drops by Demaryius Thomas. ",
            "5": "Thomas redeemed himself by catching a touchdown, though his yardage total (6 catches, 40 yards) was disappointing considering the matchup. Emmanuel Sanders (4-86) was the better receiver again. ",
            "6": "The Broncos ran the ball extremely well. Surprisingly, Devontae Booker had more carries than C.J. Anderson, 17-16, though Anderson outgained Booker, 107-83. Both scored touchdowns. Still, Booker was highly impressive, and it's clear that the Broncos want him to be a major part of the offense going forward. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "15"
}