{
    "year": "2016",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "0"
        },
        "comments": {
            "amount": "9",
            "1": "The Texans were favored heading into this game, and no one seemed to be giving the Patriots a chance. After all, New England was set to battle a strong Houston team with its third-string quarterback, Jacoby Brissett, who was making his first professional start. No one expected it, but the Patriots dominated this contest from start to finish. Bill Belichick and his staff created the perfect game plan, comprised of a dominant defense that kept the Texans from crossing midfield until the middle of the third quarter, and an offense that put the rookie quarterback in position to succeed. Combine both of those facets with some terrific special-teams play - the Patriots recovered two fumbles and constantly pinned the Texans inside their own 15 - and it turned out to be an easy, 27-0 victory for New England. ",
            "2": "Brissett had a solid debut. He made some mistakes, namely a few overthrows on some deep shots and not recognizing when some players were open, but he did a good job overall, considering the circumstances. Brissett was battling a very tough defense with just three days to prepare, and yet he made enough quality plays to ensure the Patriots prevailed. Brissett went 11-of-19 for 103 yards, but did most of his damage on the ground. He scrambled eight times for 48 rushing yards and a touchdown. Brissett's passing was inconsistent, but he made some key strikes on third down, including a 27-yarder to Malcolm Mitchell in which he beat Houston's blitz. He also nearly had a passing touchdown, but Julian Edelman dropped the ball in the end zone. ",
            "3": "Speaking of Edelman, he led the Patriots in receiving yards with just 38, accumulating that on four catches. Edelman had the drop, but did a lot of good things that didn't show up in the stat box. He happened to draw a pass interference flag and opened some opportunities with some key blocks, including one on a 41-yard touchdown run. What was disappointing, however, is that Edelman didn't play quarterback at all. There was talk that Edelman, as a former signal-caller at Kent State, would see some snaps under center in trick plays, but that never transpired. He did happen to rush for 14 yards, however. ",
            "4": "Only three Patriots caught multiple passes. Besides Edelman, there was Danny Amendola (2-23) and Martellus Bennett (2-10). Bennett, like Edelman, played much better than the stats indicate. Bennett drew two pass interferences in the end zone and was open for a score, but Brissett didn't see him. As for Rob Gronowski, he was targeted once on a poor throw. Gronkowski didn't look like he could move very well, and he pretty much served as a distraction on what appeared to be five or so snaps. ",
            "5": "LeGarrette Blount had a huge game. He was stuffed on his first several carries, but got stronger as the game progressed. He eventually had a 41-yard burst for a score, thanks to an Edelman pancake block. Blount punched through for 105 yards and two touchdowns on 24 carries. ",
            "6": "The Texans, meanwhile, had to be a huge disappointment for those who thought they could take the next step. They flat out choked in this game. They showed everyone that they absolutely weren't ready for primetime, as they constantly made horrible mistakes throughout the evening. It began with a Stphen Anderson drop. The Texans then fumbled on a kickoff return, setting up a Brisett touchdown run, helped by a missed tackle by safety Andre Hal. Brock Osweiler screwed up after that, firing a careless interception in which he didn't see Jamie Collins. Following another fumbled kickoff return, the Patriots scored another quick touchdown, and just like that, it was over. Bill O'Brien, who wasted timeouts and had to be alerted by his punter to challenge a play, was outcoached by a mile in this game, and his team didn't seem ready for the big stage. ",
            "7": "Osweiler went just 24-of-41 for 196 yards and an interception. He was hurt by some drops, but he was also bailed out with some spectacular catches by DeAndre Hopkins. Osweiler did not look like a high-priced quarterback in the slightest, and even appeared to have a pick-six dropped by Malcolm Butler in the fourth quarter. There will be better days, but this was an awful showing by Osweiler. As for Hopkins, he caught four balls for 56 yards. The stats are disappointing for his fantasy owners, but Hopkins did all he could. At one point, he made an amazing, back-shoulder grab while falling out of bounds. ",
            "8": "Osweiler's other primary targets didn't do much. Will Fuller caught only three passes for 31 yards, and he naturally was guilty of a drop. Braxton Miller was out, so Jaelen Strong saw more action, but didn't do much with the opportunity, catching only one of four targets for 15 yards. ",
            "9": "Lamar Miller opened the game with a nice run, but didn't get much help from his blocking the rest of the night. Miller gained 80 yards on 21 carries and also caught four balls for 27 receiving yards. He came on and off the field in the second half, constantly getting his leg wrapped up, but he seems to be OK. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "The Dolphins were tied as the largest favorite this week, and nearly everyone had them as their pick in the survivor pool. No one expected the Browns to be competitive, and rightfully so. Missing numerous players, including Josh McCown, Corey Coleman, Joe Haden and Carl Nassib, how could the Browns possibly stand a chance? Well, that's why they play the games, apparently. Things looked grim for the Browns at first. They had a delay-of-game penalty on their first offensive snap; Cody Kessler fumbled his first snap; and then Kessler was strip-sacked on third-and-9 when Cameron Wake ran around Austin Pasztor quite easily. Following a Miami touchdown, it appeared as though the Dolphins would win this game quite easily, but the Browns managed to hang around and even hold a 13-10 lead into the third quarter. The offense was run primarily through Terrelle Pryor, who threw passes, rushed on some plays and caught some balls. The Dolphins, meanwhile, killed themselves with mistakes, which I'll discuss later. Miami managed to take the lead, but the Browns struck back with multiple scores and put themselves in position to kick a game-winning field goal. Cody Parkey whiffed on a 46-yarder, however - the third time he missed on the afternoon - and the Dolphins ultimately prevailed in overtime. ",
            "2": "I wasn't expecting much from Cody Kessler, whom many teams gave a seventh-round or UDFA grade to prior to the draft. However, Kessler was poised in the pocket and showed a tremendous amount of toughness while dealing with Miami's merciless defensive line. Following the early gaffes, Kessler did a solid job of moving the chains despite having a depleted receiving corps. He went 21-of-33 for 244 yards and would have achieved the victory had Parkey not whiffed from 41, 42 and 46. ",
            "3": "Pryor, as mentioned, was huge. He did everything. He threw five passes, completing three of them for 35 yards. He rushed four times, gaining 21 yards and a touchdown. He also caught all eight of his targets for 144 yards. He was an absolute monster, and it makes me wonder what Oakland's offense would look like if it had Pryor in addition to Amari Cooper and Michael Crabtree. ",
            "4": "Duke Johnson and Gary Barnidge were the other big performers for the Browns. Johnson gained 69 yards on 10 carries and also caught five passes for 12 receiving yards. It seemed like he got hurt at one point, but he managed to return to action. Barnidge, meanwhile, secured all five of his targets for 66 yards, as Kessler liked throwing to him as a security blanket. Kessler is limited physically and can't get passes downfield, so he should target Barnidge quite often going forward. ",
            "5": "Johnson was actually outgained in the running game, as Isaiah Crowell registered 79 yards on 15 carries. However, most of it came on a 25-yard burst in the second half. ",
            "6": "As for the Dolphins, Ryan Tannehill didn't perform very well. He threw for 319 yards and three touchdowns, but made some mistakes throughout the afternoon. He opened with an interception on his first throw, firing inaccurately. He was then pick-sixed right before halftime. After establishing the lead, Tannehill could've put the game away by hitting Dion Sims for an open touchdown, but he didn't see his tight end. Tannehill then allowed the Browns to have a chance to win the game by being strip-sacked. Tannehill held on to the ball for an eternity, and he's very fortunate that Parkey missed the ensuing field goal that would've won the game for Cleveland. It just goes to show that stats can be very misleading sometimes. Despite the blunders I mentioned earlier, Tannehill did a good job of moving his team down the field in overtime. He had Miami in field goal range, thanks to a catch by Jarvis Landry, who scored one of Tannehill's touchdowns. Landry was great, hauling in all seven of his targets for 120 yards and the score. ",
            "7": "Tannehill's other touchdowns went to DeVante Parker (3-51) and backup running back Damien Williams (3-10). Kenny Stills was actually second on the receiving chart with five grabs for 76 yards. ",
            "8": "Kenyan Drake started over Jay Ajayi, but they shared carries along with Isaiah Pead. There are too many cooks for Drake (9-37), Ajayi (7-28, TD), Pead (5-17) and Williams (four touches, TD) to start any of them in Arian Foster's absence. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "I called the Ravens the most underwhelming 2-0 team of all time on the podcast. Well, I guess I can now say that they're the most underwhelming 3-0 team of all time. Baltimore may have won this game, but was very fortunate to do so. The Jaguars maintained a one-point advantage toward the end of the fourth quarter, but were in a position to extend their lead with a short field goal. However, Blake Bortles threw a pass on third down, and it was tipped and picked. The Ravens, staying within a point, were able to barely move into field goal range on their final drive, and the ultra-clutch Justin Tucker connected to secure the victory. ",
            "2": "It's strange the Ravens scored only 19 points considering a couple of items. First, the Jaguars were missing one of their starting cornerbacks, Prince Amukamara, while safety Tashaun Gipson wasn't 100 percent. And second, Joe Flacco completed 21 consecutive passes in this contest. The streak was snapped when Mike Wallace dropped a ball in the end zone, which was a shame because Flacco was just three completions short of Donovan McNabb's record of 24. Flacco finished 29-of-40 for 214 yards and a rushing touchdown that was a result of a Wallace block. Flacco, however, threw two interceptions, both of which occurred in the final quarter. The first pick was the result of Jalen Ramsey tipping a pass, while the second occurred because Flacco was hit upon releasing the ball. Ramsey, by the way, was absolutely outstanding. He looks like the real deal, though he needs to start respecting some of the heralded veterans instead of trash-talking them like he did to Aaron Rodgers and Steve Smith during the first three weeks. ",
            "3": "Only one Raven logged more than 42 receiving yards, and that was Steve Smith, who secured eight balls for 87 yards. Smith came up huge on a fourth down during Baltimore's game-winning drive. Dennis Pitta was next on the receiving list (6-42), while Wallace (3-34) didn't do much outside of springing Flacco on his touchdown run. ",
            "4": "It's no surprise that Baltimore didn't run the ball very well. Terrance West gained 45 yards on 10 carries, but most of that came on a 15-yard gain. Justin Forsett (7-20) wasn't much of a factor. The Ravens really need Kenneth Dixon to return, as he's their most talented running back. ",
            "5": "Speaking of the ground game, many made a big deal of Chris Ivory's return, and I'm not sure why. Looking slow and sluggish, Ivory mustered only 14 yards on 12 carries, looking very much like the sloth-like back who was benched by the Jets at the end of last season. T.J. Yeldon outgained Ivory, 17-14, despite having half as many carries. It's a huge mistake to give Ivory the ball over Yeldon, as the latter is immensely more talented. Either way, the Jaguars will have trouble running as long as Kelvin Beachum and Brandon Linder are out with injuries. ",
            "6": "Blake Bortles missing two linemen didn't appear to hurt as much as anticipated, as the Ravens didn't collect a sack until the fourth quarter. However, they started putting lots of pressure on him then, and Bortles self-destructed. Bortles threw a crushing interception that I referenced earlier, and he was picked off again on the ensuing drive. Bortles actually threw three interceptions, and the first one was the worst of them all, as he fired a pass off his back foot, allowing C.J. Mosley to make a brilliant, one-handed catch. Bortles ended up going 24-of-38 for 194 yards, two touchdowns and the three picks. If you're wondering where Bortles' garbage-time numbers were, he actually got them. He managed just 78 yards in the opening half. ",
            "7": "Both of Bortles' touchdowns went to Allen Robinson (7-57). There was some controversy on one of them, as Robinson dropped the ball after he fell out of the field of play. The officials ruled it incomplete, but changed their mind after a challenge. I thought it should've been a catch in terms of pure common sense, but it appeared to be a carbon copy of many of the incompletions the officials have ruled in recent years. I don't understand why this one was any different, but enjoy the six points if you own Robinson. ",
            "8": "None of the Jaguars' other prominent receiving options did much. Allen Hurns (4-40) and Julius Thomas (2-13) struggled, but there will be some buy-low opportunities there. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "27"
        },
        "comments": {
            "amount": "10",
            "1": "This was an insane game. It had everything - intrigue, a heated player rivalry, crazy plays, an ejection, officials getting assaulted, kicking nets being broken, stupid quarterbacking, injuries, a fake punt, multiple lead changes and a close finish. Of course, all eyes were on the Odell Beckham versus Josh Norman matchup. Things were understandably feisty early on, as Norman actually picked Beckham up and carried him around on one play. The officials did nothing about it. Norman then dropped an interception the first time Eli Manning targeted Beckham, and this allowed the Giants to score touchdown. Beckham was actually limited to just two receptions in the opening half, but came alive after the break. It all started with a brilliant, one-handed grab. Odell then ran right through Norman with a punishing stiff-arm. Beckham helped bring the Giants down to the goal line, but Eli Manning threw an ugly interception, prompting Becham to throw a fit on the sideline. He destroyed one of the kicking nets and then yelled at everyone before Manning calmed him down. Beckham was then seen crying on the sideline. Later on, Norman knocked the hat off an official for some reason, and then Beckham was flagged for the most blatant offensive pass interference of all time on New York's final drive, ultimately leading to a game-ending interception where Su'a Cravens undercut a throw to Shane Vereen. Beckham ended up catching seven passes for 121 yards. He truly redeemed himself following last year's performance, but he once again ended up losing to Norman's team. This was a huge victory for the Redskins, who couldn't afford to fall to 0-3. It didn't appear as though they were impacted at all by the seemingly bogus locker room-related story reported by the NFL's tabloid man. ",
            "2": "Even if there happened to be conflict in the locker room surrounding Kirk Cousins, it won't manifest itself this week. Cousins played somewhat well for the most part, going 21-of-35 for 296 yards and two touchdowns. However, Cousins appeared to have cost his team the game following a huge mental blunder just prior to intermission. He showed horrible clock management, failing to use a timeout after converting a long play. He finally spiked the ball with 11 seconds remaining. Following an incompletion, there were six seconds left, and it was clear Cousins had to fire a short pass and then have his kicker try a field goal. Cousins, however, held the ball for an eternity and was strip-sacked. It was almost as dumb as the time he kneeled instead of spiking the ball. Cousins has a nice skill set, but it's quite apparent that he struggles with the mental part of the game. In addition to that red-zone blunder, he also threw way short of the line to gain on multiple third downs. He was nearly picked on one occasion, so it's not like he was just being safe. Cousins made some great throws as well, but the mistakes can't keep happening if he wants to receive the huge contract he's been pining for. ",
            "3": "Cousins had long touchdowns of 55 and 44 to Jamison Crowder (4-78) and DeSean Jackson (5-96), respectively, with the latter catching a true bomb. Jackson got hurt in the second half, however, prompting Troy Aikman to say that Jackson has spent his entire career being banged up. Pierre Garcon (5-59) tied Jackson for the team lead in receptions, while Jordan Reed caught four balls for 56 yards. Reed's numbers weren't impressive, but he had a great play in which he reeled in a pass thrown behind him, broke two tackles and then sprinted for the first down. ",
            "4": "Matt Jones didn't have a great stat line either, mustering 65 yards on 17 carries. However, he was huge at the end of the game, running powerfully and breaking tackles. He was instrumental in Washington's victory. Jones appeared to suffer a concussion at one point, but didn't miss much action. Robert Kelley (4-7) took his place for a bit. ",
            "5": "The Redskins sustained multiple injuries in this contest. The maligned Bashaud Breeland was helped off the field early on when he couldn't put pressure on his leg. Later, center Kory Lichtensteiger got knocked out with a calf malady. DeAngelo Hall sustained the worst injury of them all, tearing his ACL. ",
            "6": "Moving on to the Giants, it's safe to say that they absolutely blew this game. I mentioned the Manning interception at the goal line and Beckham's offensive pass interference, but there were numerous other plays where they made mistakes. Manning was strip-sacked early, but a teammate recovered. Shane Vereen fumbled, which would've led to Washington points had Cousins not screwed up at the end of the first half. Following the break, Manning threw an interception in the red zone, but the officials ruled it to be incomplete for some strange reason. They then weren't prepared for a Redskins fake punt conversion, which ended up costing them three points. The Giants blocked a punt after that which would've set them up for at least three points, but an unnecessary roughness penalty negated it. And speaking of unnecessary roughness, center Weston Richburg was ejected for two such penalties. ",
            "7": "Manning finished 25-of-38 for 350 yards, one touchdown and two picks. Manning's passing yardage is great, and his fantasy owners can't be too disappointed, but he made a number of mistakes in this game, as referenced earlier. Manning also nearly threw a third pick, but two Redskins ran into each other, negating a potential turnover. ",
            "8": "Sterling Shepard secured Manning's sole touchdown, catching five balls for 73 yards. Victor Cruz, meanwhile, caught three passes for 70 yards. ",
            "9": "Shane Vereen and Orleans Darkwa split the workload with Rashad Jennings out. Both ran well, with Vereen gaining 67 yards and a touchdown on 11 carries, while Darkwa managed 53 yards and a score on 10 tries. Vereen fumbled, but managed to draw an illegal contact on a big third down that led to a Giants touchdown. ",
            "10": "The Redskins weren't the only team that sustained injuries, as the Giants lost Eli Apple in the second half. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "No Teddy Bridgewater. No Adrian Peterson. No Matt Kalil. And yet, the Vikings just might be the team to beat in the NFC. Minnesota marched into Carolina as seven-point underdogs and put together a dominant defensive performance. They erased an early 10-0 deficit and scored 22 consecutive points, limiting the Panthers to just 101 net yards after intermission. The Vikings made the reigning MVP look like a turnover-prone scrub. Abusing the poor Carolina offensive tackles, they put tons of pressure on Newton, who was sacked a mind-boggling eight times, one of which resulted in a safety. Newton also threw three interceptions, panicking under pressure. One of his interceptions was a desperation heave at the end of the first half, while another was telegraphed. Adding injury to insult, Newton tweaked his ankle in the opening half. He may not be 100 percent against the Falcons in Week 4. Newton finished 21-of-35 for 262 yards and the three picks, but helped his fantasy owners out a bit by rushing for 26 yards and a score. Newton also had a long passing touchdown to Fozzy Whittaker wiped out by a Kelvin Benjamin block-in-the-back penalty. ",
            "2": "Speaking of Benjamin, he had a brutal game. In addition to that penalty, he didn't manage to catch a single pass. Oddly enough, Newton targeted Benjamin only once. Carolina's leaders in receiving were Greg Olsen (6-64) and Ted Ginn (3-62). Devin Funchess, like Benjamin, didn't log a reception either. ",
            "3": "Much was made of the Panthers' running back decision with Jonathan Stewart out. Cameron Artis-Payne had more carries than Fozzy Whittaker, 12-5, with Artis-Payne tallying 47 yards. However, Whittaker was more of a factor in the passing attack, logging five receptions for 34 yards. As mentioned, Whittaker scored on a long touchdown, but Benjamin ruined it with a penalty. ",
            "4": "The Vikings, meanwhile, weren't doing anything offensively in the first half. They managed just 34 net yards, averaging only 1.6 yards per play. However, they came alive after intermission when they began running a no-huddle offense. The Vikings were suddenly sharp offensively, with Sam Bradford converting 14 of his 17 pass attempts after halftime. One of the incompletions was actually a dropped touchdown by Kyle Rudolph, so the Vikings could've scored even more consecutive points. Bradford ultimately went 18-of-28 for 171 yards and a touchdown. He was brutal in the first half, going just 4-of-11 for 26 yards. He was nearly picked by a rookie corner and missed an open receiver on a low throw. He was hurt by a dropped deep pass by Charles Johnson, so it's not like he was the only one at fault in the early going. ",
            "5": "Only two Vikings had more than 30 receiving yards. Those were the usual suspects. Rudolph caught seven passes for 70 yards and a touchdown, while Stefon Diggs hauled in four balls for 40 yards. ",
            "6": "The Vikings gave Matt Asiata the start, but Jerick McKinnon had more carries, 16-6. Asiata plodded for only 15 yards, while McKinnon was much more spry, tallying 45 yards. Both caught one pass. ",
            "7": "Minnesota sustained another injury in this game, with stud guard Alex Boone getting knocked out in the opening half. Bradford had protection issues as a result prior to halftime, but the Vikings' coaching staff made terrific adjustments during the break. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Broncos didn't seem to have many believers heading into the season. Some pointed toward their missing defensive players - Malik Jackson and Danny Trevathan left via free agency - but it seemed like the majority of the public didn't consider Denver to be one of the elite teams because of the quarterbacking situation. The Broncos lost Peyton Manning, after all, and the three candidates to replace him were Mark Sanchez, Trevor Siemian and first-round rookie Paxton Lynch. Perhaps Lynch had potential, but the other two were considered horrible replacements. Everyone has seen enough of Sanchez, while Siemian was unknown to many. As it turns out, Siemian, thus far, has proven to be a big upgrade over Manning. It sounds crazy to say it, and I actually can't believe I'm typing it, but Manning was horrible last year, and Siemian, at least in this contest, was far more than just some game manager. Siemian didn't begin the afternoon all that well. The Broncos actually threw the ball on their first three plays. One pass was off the mark, while the other was swatted away. Siemian also had some poor throws in the red zone a bit later, which forced Denver into a field goal. However, Siemian improved as the afternoon progressed, and he was unstoppable in the second half. I'm not exaggerating. Siemian went 10-of-11 for 168 yards and two touchdowns after intermission. He sliced through Cincinnati's secondary, constantly connecting on deep throws to Emmanuel Sanders and Demaryius Thomas. I don't want to get carried away with Siemian yet. It's still a small sample size, and teams could figure him out. However, he's playing better than the decrepit Manning ever had this past season. The Bengals actually did a good job of pressuring Siemian, but his pocket presence was impressive, as he slid around in the backfield very well. ",
            "2": "Sanders complained to the media during the week that he wasn't being used properly. He won't be upset about that after this performance. Sanders caught two of Siemian's touchdowns, racking up nine grabs for 117 yards in the process. Thomas also had a big game, snatching six balls for 100 yards and a score. Tight end John Phillips hauled in Siemian's fourth touchdown. ",
            "3": "What's remarkable about this victory for Denver is that the team scored 29 points without much of a running game. C.J. Anderson was restricted to just 37 yards on 14 carries. The Bengals were playing close to the line of scrimmage, as they didn't respect Siemian's deep ball. Siemian made them look pretty stupid. ",
            "4": "As for the Bengals, they were the team with the supposed superior quarterback entering this game, but it didn't appear that way. Andy Dalton had just a mediocre performance, going 21-of-31 for 206 yards and a crushing interception at the end in which a poor throw was tipped into the air. Dalton was very fortunate to get away with another pick earlier in the second half when he made another inaccurate heave way short of the first-down marker on third-and-11. ",
            "5": "Despite Dalton's pedestrian outing, the Bengals still had a chance at the very end, but their best player, A.J. Green, screwed up. Green dropped a pass on third down that was going to move the chains. It was an absolutely crushing blow, as the play occurred near midfield, with the Bengals still only down one score. Green caught eight passes for 77 yards, but ended up costing his team the victory. ",
            "6": "Jeremy Hill had a huge fantasy day, gaining 97 yards and two touchdowns on 17 carries. However, 50 of his yards came on one burst, so it's not like the Broncos were gashed. Giovani Bernard did nothing on the ground (5-8), but caught five passes for 36 receiving yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Packers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "People were asking what's wrong with Aaron Rodgers following a middling showing against the Jaguars and an ugly performance at Minnesota. Well, I suppose we now know the answer: Absolutely nothing. Rodgers toyed with Detroit's inept and injury-ravaged defense as if he were throwing effortlessly against some junior varsity high school squad. The Lions offered no resistance, often doing strange things like covering Jordy Nelson wth someone named Thurston Armbrister and dropping Haloti Ngata into coverage. Bad schemes plus missing talent (Ziggy Ansah, DeAndre Levy) is no recipe to contain Rodgers, which was quite apparent in this contest. Rodgers finished 15-of-24 for 205 yards and four touchdowns. The yardage may seem low, but 66 yards are missing because of a long pass interference. Plus, Rodgers didn't have to throw very much because the Packers maintained a 31-3 lead at one point. Rodgers was so efficient that the Packers didn't even punt until there were 11 minutes remaining in regulation. ",
            "2": "Rodgers showed tremendous chemistry with Jordy Nelson, as the two looked great together again. Nelson looked 100 percent once again, catching six of his seven targets for 101 yards and two touchdowns. Richard Rodgers (2-9) and Davante Adams (2-23) caught the other touchdowns. Randall Cobb, meanwhile, did nothing outside of catching a 33-yard pass. ",
            "3": "Eddie Lacy had a nice game, gaining 103 yards on 17 carries. It's surprising that he rushed just 17 times though, given the enormous lead the Packers maintained. ",
            "4": "As for the Lions, even when they were down 31-3, it didn't feel like they were out of it. In fact, the teams were even in terms of yardage at halftime. The Lions simply shot themselves in the foot too many times. For instance, Eric Ebron had the ball ripped out of his hands in the red zone, and the Green Bay defender ran the ball back deep into Detroit territory. Matt Prater, meanwhile, whiffed on a 43-yard field goal after one of the announcers jinxed him, shouting, He's got plenty of leg! right as Prater was set to kick. Stafford moved the chains well throughout the afternoon otherwise, going 28-of-41 for 385 yards, three touchdowns and an interception. He needed just one more drive to get the tie, but a possession was disrupted because of a couple of sacks. Taylor Decker was responsible for both of those. He had a rough afternoon. ",
            "5": "Marvin Jones had a huge performance. He kicked things off with a great catch on an underthrown pass and ultimately finished with six grabs for 205 yards and two touchdowns. Ebron (5-69) and Golden Tate (4-40) were next on the receiving chart, while Anquan Boldin (4-22) secured Stafford's third touchdown. Ebron was banged up in the second half. ",
            "6": "The Lions didn't have a quality offensive strategy early on. I don't know why they tried to slam Theo Riddick into the middle of the line of scrimmage repeatedly, but it didn't work at all. Riddick mustered just nine yards on 10 carries. He was a factor in the passing attack (7 catches, 39 receiving yards), but rookie Dwayne Washington (10-38) was more effective as an interior runner. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> It looked like the Titans were going to tie this game, but the official on the field set the world record for latest pass interference flag thrown of all time. It's almost like he was thinking, Wait a second, hold on, which team does Vegas need me to help cover here? Let me check... umm... oh yeah, Raiders. CRAP, I NEED TO THROW THE PENALTY FLAG! ",
            "2": "In order for the Raiders to be a true playoff contender, the defense is going to have to play a lot better than it did in the first two weeks with shootouts against the Saints and Falcons. Oakland's defense gave signs for optimism as it got on track against the Titans. However, the Raiders were aided by Marcus Mariota being careless with the football and playing with terrible ball security. ",
            "3": "On the first drive, Mariota moved the ball into field goal range with passes to Rishard Matthews (3-32) and Jace Amaro. DeMarco Murray also added a 14-yard run, but the Titans had to settle for a field goal. The Raiders answered with a 25-yard completion to Amari Cooper. Carr moved the chains on third-and-10 with a 13-yard pass to Jalen Richard (6-28 rushing), and then Latavius Murray (10-37) went untouched on a 22-yard touchdown run straight up the middle. After trading a few punts, Mariota took off on a run and ended up fumbling the ball away after getting hit by Bruce Irvin. Oakland recovered at the Tennessee 24-yard line, and on the next play, Carr hit Clive Walford (2-27) for a touchdown, but a holding penalty on Donald Penn took the score away. The Raiders settled for a 52-yard field goal from Sebastian Janikowski. That play rewrote NFL record books, as Janikowski became the kicker with the most field goals of 50-plus yards in NFL history, breaking the record held by former Lion Jason Hansen. The Raiders got moving again with a pass to Cooper, while DeAndre Washington (6-57) exploded downfield on runs of 30 and 14 yards. Carr finished the drive by throwing a quick out to Seth Roberts (2-27), and Brice McCain took a terrible angle to let Roberts get the sideline as he darted down the field for a 19-yard touchdown. With only seconds remaining before the half, Mariota forced a pass to a covered receiver, and it was deflected to Reggie Nelson for an interception. Luckily for the Titans, the clock ran out and the Raiders couldn't kick another field goal as they were in Janikowski's range. Oakland took a 17-3 lead into the half. The Titans' offense finally started moving in the third quarter thanks to DeMarco Murray ripping off a run of 36 yards. Mariota then got away with a dangerous pass to Amaro for 26 yards. Murray ran the ball in from five yards out to cut the Raiders lead to 17-10. Early in the fourth quarter, Sean Smith picked off Mariota at midfield, but Oakland gave it right back when a deflected pass was picked off by Avery Williamson. Both teams had drives stall. With less than two minutes remaining, Mariota made a great throw to Harry Douglas (2-20) for 25 yards. He then hit Tajae Sharpe (3-48) for gains of 23 and 19 yards to get inside Oakland's five-yard line. A personal foul penalty on Taylor Lewan pushed the ball back. Mariota then connected with Andre Johnson for a touchdown, but Johnson was called for pushing off the corner. On fourth down, Mariota threw incomplete for the end zone to Douglas, and the Raiders were fortunate they weren't called for pass interference. ",
            "4": "Derek Carr completed 21-of-35 passes for 249 yards with one touchdown and one interception. Amari Cooper had four receptions for 62 yards, while Michael Crabtree had eight catches for 102 yards. ",
            "5": "Mariota completed 17-of-33 passes for 214 yards with zero touchdowns and two interceptions. Tight end Delanie Walker was out with a hamstring injury, and replacement Jace Amaro led the Titans in receiving with three catches for 59 yards. ",
            "6": "DeMarco Murray ran for 114 yards and a touchdown on 16 carries. He also had five receptions for 41 yards. Derrick Henry (10-45) ran well, too. ",
            "7": "Oakland's secondary played much better this week, but Tennessee's wide receivers really struggled. The Titans front seven got good games from Avery Williamson (9 tackles, 1 interception), Brian Orakpo and Jurrell Casey. Surprisingly, Khalil Mack's slow season continued as he had two tackles and zero sacks. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bills",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "18"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Major props to Kenny Ortiz, my co-host on the picks/fantasy podcast, for calling this game correctly. I was too much of a coward to wager on the Bills, but Kenny called it perfectly and even bet real money on it. I guess I should have seen this coming because I came into the season thinking the Cardinals are overrated, but as the great Emmitt once said, hindsight is 50-50. ",
            "2": "This game was definitely one of the bigger surprises of the week. The Cardinals were widely favored in this game, as the Bills had performed poorly in their first two games. After firing offensive coordinator Greg Roman, it was assumed that the Bills were throwing in the towel for the season. Instead, the Bills came out extremely motivated and managed to knock off the Cardinals thanks to a prolific offensive display. ",
            "3": "The Bills were led by their rushing attack in this game. LeSean McCoy had a very strong showing and emerged as the top weapon on the team. McCoy carried the ball 17 times for a whopping 110 yards. He looked shifty and was able to do a lot in space during the contest. McCoy notched two touchdowns on the day as well. He burst through a hole for a 24-yard score early in the game. He was virtually untouched and got great blocking on the play. On his second touchdown, McCoy ran to the edge and eluded several defenders before diving into the endzone. McCoy is going to have a huge year, and this game could be the beginning of a great stretch for him. ",
            "4": "Tyrod Taylor also was a major factor in the running game for the team. He toted the rock seven times during the game, totaling 79 yards and a touchdown on the ground. While Taylor ran some designed runs, including a pretty 49-yard scamper on an option play where he beat the defense, he did a lot of damage scrambling from the pocket. The Cardinals really struggled to contain Taylor, and he moved around to make plays a lot. On his 20-yard touchdown run, Taylor was looking to pass but escaped to the outside and saw a lane to the endzone. Taylor played smart football, and his mobility was a major asset during this game. Through the air, Taylor had a solid showing as well. He went 14-of-25 for just 119 yards and one pick. However, Taylor was without Sammy Watkins during the game and had to make use of mediocre options for the entirety of the contest. Robert Woods led the way posting six catches for 51 yards. Walter Powell (3-28) looked to have good chemistry with Taylor as well. Perhaps Powell could make an impact if given more time on the field. ",
            "5": "Defensively, the Bills got a stellar performance out of safety Corey Graham. He was all over the Arizona receivers and defended three passes, including multiple deep balls from Carson Palmer. Graham grabbed a crucial late interception that took away a scoring chance in the red zone. Graham also posted a sack and played an all-around great game. ",
            "6": "For the Cardinals, this game was a massive disappointment. Carson Palmer was absolutely terrible, and his final numbers do not even tell the whole story. He finished the game 26-of-50 for 264 yards and a ridiculous four picks during the game. Palmer started the game horribly, and at one point, he was 2-of-10 for just eight yards. As Walt would say, Brodie Croyle would scoff at that YPA of 0.8. Palmer threw behind receivers and constantly tried to force passes down field. His picks at the end of the game were careless, forced throws. He simply was off for the entirety of the game. ",
            "7": "Because of Palmer's troubles, Arizona's receivers had trouble catching passes until garbage time. The team's Big Three of receivers ended up with solid numbers, but they were definitely skewed. John Brown (6-70) led the way for the team. Larry Fitzgerald paced the group in receptions with seven and had 60 yards. Michael Floyd recorded only four passes and totaled 65 yards. If Palmer had not been under so much pressure during the game, perhaps they would have produced earlier. ",
            "8": "The lone bright spot in this contest for the Cardinals was the play of running back David Johnson. Johnson helped to get the team's offense going in the second half. His ability to get the run game started allowed the Cardinals to really get everything going after being severely limited in the first half. Overall, Johnson carried the ball 19 times for 83 yards and two touchdowns. He showed some good strength and speed. Johnson will be crucial to their offensive success moving forward. ",
            "9": "It is not often that a long snapper causes so many problems for a team, but Kameron Canady has been atrocious to start the season. The Cardinals rookie out of Portland State had a high snap on a field goal attempt with the Cardinals driving. The team was down 23-7 at the time, and a field goal would have made it a two-score game. Instead, the bailed sailed over the holder's head and the Bills picked it up and returned it for a touchdown. That put the game out of reach at 30-7. Canaday also had a bad snap on Chandler Catanzaro's game-winning field goal attempt against the Patriots. Canaday should be cut as soon as possible. ",
            "10": "Some final notes: Kyle Williams was a force early in the game for the Bills. The veteran helped to pressure Palmer and recorded 1.5 sacks for the team. For the whole day, the Bills recorded five sacks as a team. Patrick Peterson made a beautiful interception for the Cardinals. Taylor slightly overthrew his target and Peterson made a one-handed grab in stride. He managed to stay in bounds, and it really was an impressive and natural-looking play by the superstar corner. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> It's insane how lucky the Eagles are that the Rams are so truly inept. Had Los Angeles realized like the rest of the teams that Carson Wentz was the superior prospect, the Eagles would probably be 1-2 right now with Jared Goff or Chase Daniel quarterbacking them. Wentz, on the other hand, is already breaking Tom Brady's early-career records. Crazy. ",
            "2": "Both of these teams came into this game undefeated, but only one of those teams showed up, as the Philadelphia Eagles stomped their in-state rivals, the Pittsburgh Steelers, 34-3. The Steelers had a chance to get up to an early lead as Ben Roethlisberger and company drove into Eagles territory, but were stopped when Markus Wheaton dropped a touchdown pass that hit him squarely in the chest. Then, to add insult to inability, the Eagles blocked the field goal attempt by Chris Boswell, and they were off to the races. That first drive was probably Pittsburgh's best, as the Philadelphia defense showed up with intensity, shutting down the Steelers' run game, which had helped sustain them through their first two wins. The Steelers had a total of two rushing first downs and a net total of 29 yards rushing on 10 carries for the game, compared to the 135.5 rushing yards they averaged through the first two games. ",
            "3": "This Eagles' stop unit is the real deal. Coming into this contest, Football Outsiders ranked them as the second-best defense in the league, with the best pass defense, which was based on games against Robert Griffin III and Jay Cutler, but now the Eagles can proudly say they held Ben Roethlisberger to a 54.5 percent completion rate, with 24-of-44 completions for 257 yards, no touchdowns, an interception and a fumble. Once Roethlisberger was forced to throw, his offensive line couldn't contain Philadelphia's front line and he was constantly running for his life. The Eagles sacked him four times and hurried him multiple times. Roethlisberger had thrown for three touchdowns in each of his first two games this season before running into the Eagles. ",
            "4": "Eagles rookie quarterback Carson Wentz continued his stellar play on Sunday, spreading the ball around well as he hit receivers from multiple angles. His pocket awareness was superb, as he moved his team with ease on almost every drive. The offensive line held the Steelers to no sacks, and the offense had the Steelers on their heels at all times. Now three games into his rookie season, Wentz has now thrown 102 passes with no interceptions. He's good at football. Wentz completed 23-of-31 passes for 301 yards, two touchdowns and no interceptions. His numbers would have been even better if it weren't for the Eagles defense, which stifled the Steelers at every point, which helped the Eagles create a big enough lead to run the ball in the fourth quarter. ",
            "5": "Philadelphia's lead running back, Ryan Mathews, was injured early in the game, and Wendall Smallwood took over for him. Mathews' injury isn't known at this time, but he had been dealing with an ankle problem. Smallwood took over rushing work, while Darren Sproles worked in the receiving game. Both put up nice numbers, with Sproles connecting on a 73-yard catch-and-run touchdown and Smallwood getting a goal-line score. The Steelers' run defense had been one of the best in the league through two games, but the Eagles kept at it and totaled 30 rushing attempts for 125 yards and two touchdowns. This is what an offense can do, even against a good defense, when they are working in all aspects of the game. ",
            "6": "The Steelers don't have much to praise, but once again Antonio Brown put up good numbers, with 12 receptions for 140 yards on 18 targets, which leads all receivers this week. Coming off a poor Week 2, he wanted to get his numbers, but unfortunately for the team, they did little to stop the beat down. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Rams",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "32"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Can we all agree that the schedule-makers are idiots for having a 4 p.m. game in Tampa in the month of September? Hello, Tampa is the lightning capital of America - their hockey team is called the Lightning, for crying out loud - and most thunderstorms occur in the evening. Everyone knows this except the schedule-makers. It was so dumb, and the only thing worse would be scheduling the Super Bowl outdoors in a northern city. Oh, wait... ",
            "2": "Tampa Bay outplayed the Rams for most of this game as the Buccaneers put up 472 yards of offense to the Rams' 320. The difference in Los Angeles winning and the Buccaneers losing came from some critical turnovers from Tampa Bay, a defensive score from the Rams, and missed kicks by the Bucs. As a result, Los Angeles is 2-1 and the Buccaneers are 1-2. ",
            "3": "Los Angeles entered this game having not scored a touchdown in the first two games of the season, but the team quickly found the end zone in Tampa Bay. The Rams took the lead on a 44-yard touchdown pass to Brian Quick (2-53) in busted coverage. Cornerback Alterraun Verner was playing an outside technique, and the Bucs safeties blew the deep inside help letting Quick get open on the post. However, Case Keenum came back to even up the scoreboard with a pass right to Bucs linebacker Kwon Alexander, who coasted into the end zone from 38 yards out. It wasn't a good pass, but it was more on Tavon Austin as he ran a terrible route, stopping in the middle of defenders rather than continuing to run his route. Tampa Bay's kicker, second-round pick Roberto Aguayo, missed the extra point. After a good kick return, the Rams converted a third-and-17 with a draw run by Benny Cunningham for 23 yards as the Bucs had a number of missed tackles. The Rams settled for a 53-yard field goal from Greg Zuerlein. Tampa Bay came back as Jameis Winston hit Mike Evans for 19 yards and Adam Humphries (9-100) for 31 yards. Winston to Evans later converted a fourth down to set up a short touchdown run from Charles Sims. After Lavonte David forced a fumble from Kenny Britt, Chris Conte recovered for Tampa Bay just across midfield. Winston went after Mark Barron again to set up a first-and-goal with a 20-yard completion to Cameron Brate. The next play was Winston hitting Brate (5-46-2) on a rollout for a short touchdown. After a T.J. McDonald sack, Trumaine Johnson deflected a pass and Barron got some revenge by catching the errant ball for an interception. That set up Los Angeles at the Tampa Bay 22-yard line. The Bucs committed some penalties, and the Rams moved it the goal line before Todd Gurley powered in from a yard out. The Bucs took a 20-17 lead into halftime. In the third quarter, Tampa had a good drive going before Aquayo missed a 41-yard field goal. That miss gave the Rams some juice as Gurley rolled over the Tampa Bay defense. He had a tremendous stumbling run of 16 yards to get to the 1-yard line before he finished it off with another goal-line score. That gave Los Angeles a 24-20 lead going into the fourth quarter. The Bucs moved the ball into the red zone thanks to completions to Evans. However, on a third down, Robert Quinn beat left tackle Donovan Smith to strip Winston of the ball. Rams defensive tackle Ethan Westbrooks scooped up the fumble and returned it 77 yards for a touchdown. With the Rams up 31-20, the Buccaneers got back into Los Angeles territory with a 33-yard screen pass to Sims, and a few plays later, Winston threw an easy touchdown pass to Brate. The Bucs went for two, but it was incomplete; that cut the Ramss' lead to 31-26. Los Angeles benefited from a huge holding call on Alterraun Verner to give the Rans a first down. They got Austin matched up on a safety, and that led to Austin getting a 43-yard touchdown after a missed tackle. That restored the Rams' lead back at 11 points. Winston and Sims led a drive that featured Evans making a leaping touchdown reception. Once again, the two-point conversion failed. Tavon Austin made a huge mistake when he could have downed the kickoff in the end zone but took it out and was tackled at the six-yard line. The Rams went backward before the 2-minute warning, and then a lightning delay stopped the game for over an hour. The Bucs got the ball back at their 44-yard line with 1:42 remaining down by five. Completions to Vincent Jackson (3-37) and Sims moved the ball around the Rams' 20-yard line. A penalty on Barron gave the Bucs a critical first down, but they surprisingly didn't use their two timeouts after completions in the field. It was terrible clock management, and the Rams stopped Tampa as time expired. ",
            "4": "Jameis Winston completed 36-of-58 passes for 405 yards with three touchdowns and one interception. The missed kicks from Aguayo cost Tampa Bay four points, and that made the difference in the Bucs needing a touchdown to win rather than a field goal. ",
            "5": "Mike Evans led the Bucs in receiving with 10 receptions for 132 yards and a touchdown. Charles Sims had a good game filling in for Doug Martin with 55 yards on 13 carries and a touchdown with six receptions for 69 yards. ",
            "6": "Case Keenum was 14-of-26 for 190 yards and two scores with an interception. The Bucs' turnovers and the Rams' defensive touchdown really helped Keenum a lot. ",
            "7": "Todd Gurley ran hard to pick up 85 yards on 27 carries with two touchdowns. Tavon Austin led the Rams in receiving with five catches for 82 yards and a score. ",
            "8": "Defensively, Gerald McCoy and Lavonte David - eight tackles, one sack, one forced fumble - were excellent for Tampa Bay. Los Angeles' Aaron Donald had his typical good performance. Robert Quinn abused Bucs left tackle Donovan Smith. Smith gave up the critical strip-sack, but also had a holding penalty that negated a first down. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Member when Ryan Fitzpatrick thought he was worth lots of money in the offseason? I member! ",
            "2": "There is one stat that tells the entire story of this game. The Jets committed a ridiculous EIGHT turnovers, while the Chiefs only were guilty of one. The Chiefs absolutely dominated the Jets, and it clearly showed that the Jets still have not solved their problems at quarterback. Ryan Fitzpatrick was absolutely dreadful for the Jets on Sunday. He played the worst game of his time with the Jets. The veteran quarterback was a turnover machine, and he just could not do anything right. He ended up throwing a career-high six interceptions and going 20-for-44 with only 188 passing yards. Of the six picks, there were three that were particularly harmful to the Jets. Two came off of tip drills in the end zone. On the first, Fitzpatrick never saw linebacker Derrick Johnson dropping into coverage. Johnson got into Fitzpatrick's passing lane and tipped the ball into the air. Eric Berry came over to grab the pass and end the scoring threat. Later, Fitzpatrick's pass was tipped at the line of scrimmage and went toward Marcus Peters. Peters reeled in the poor pass for his second pick of the day. The final pick came at midfield with just a few minutes left in the game. Fitzpatrick once again did not spot Johnson, and he undercut a route to make the play. He then returned the pick for a touchdown to make the game 24-3. That was the final dagger for the Jets. Fitzpatrick simply has to play better than he did today for the Jets. He was absolutely terrible and was a huge liability for the team. He really is not the answer at the quarterback position, and it appears as though his success last season was just a fluke. ",
            "3": "Because of Fitzpatrick's struggles, New York's receivers did not do much. Quincy Enunwa (4-37) was targeted 11 times by the quarterback, while Bilal Powell (6-41) ended up leading the team in catches and yardage. However, most of that came in garbage time, so Powell's stats were inflated as a result. Brandon Marshall (3-27) could not do much because of his banged-up knee, while Eric Decker (1-31) disappointed during the game. ",
            "4": "Matt Forte continues to be a solid back for the Jets. The ageless wonder once again was good for the team, and he carried the ball 15 times for 65 yards. He was able to rip off a few big plays, and he would have done better if the Jets were not trailing. Forte looks good now, but the Jets need to make sure that they do not overwork him early in the season. They need to have him healthy down the stretch if they want to have any chance of making the playoffs. ",
            "5": "For the Chiefs, this was a huge win. The way they approached the game was quintessential Alex Smith. The team played in an efficient manner, and they were led by their veteran quarterback. Smith had a solid performance one the day for Kansas City. He went 25-for-33 during the contest for 237 yards and one touchdown. Smith made very few mistakes, and most of his throws were accurate. It was a perfect game for the game manager, and though he struggles against tougher competition, he really helps to dominate weaker opponents. ",
            "6": "It is no surprise that Travis Kelce was the top target for Smith during the game. Kelce caught six of his seven targets for 89 yards and a touchdown. At one point, he snagged a long pass that moved the Chiefs into the red zone. He used his athleticism to beat the coverage and then used his speed to motor into the red zone. The possession resulted in an important field goal, and the Chiefs can thank Kelce for helping them to get there. ",
            "7": "Elsewhere, Jeremy Maclin was decent, catching 4-of-7 targets for 35 yards. Maclin struggled to get open against New York's secondary, but he still remains one of Smith's favorite targets. Rookie Tyreek Hill saw some action today as well, catching three passes for 26 yards. He also was active on returns, and it looks like Andy Reid wants to get him involved on offense in the future. ",
            "8": "The running game for the Chiefs was once again very strong as Spencer Ware led the way. Ware received 20 carries for 75 yards during the contest. Though he lost a fumble, Ware was able to rip off chunks of yards at various points. He showed excellent burst and strength, and he may have done better against a weaker defense. Ware has made a case to keep the starting job even when Jamaal Charles returns, and he will continue to be a threat in fantasy as a result. ",
            "9": "The Chiefs played some terrific defense during the game and really racked up some serious numbers during the game. One of the best stat lines came from the aforementioned Derrick Johnson. Johnson led the team in tackles with 11. In pass defense, he was great as well, recording two passes defensed and an interception. Johnson also scored a touchdown and caused another pick off of one of his pass defenses. He looked explosive and still has elite instincts. The 33-year-old is showing no signs of dropping off. Marcus Peters also was great for the Chiefs. He grabbed two more interceptions to move his season total to four. Through 18 career games, Peters has 12 interceptions. He is definitely developing into one of the best young cornerbacks in the league and should be a force for the Chiefs in years to come. ",
            "10": "One of the strangest plays of the day came on a kickoff return. Rookie Jalin Marshall fumbled a kickoff with the Chiefs leading 10-0. Demetrius Harris of the Chiefs came up with the ball and was able to run the other way for a touchdown. That gave Kansas City a commanding 17-0 lead that helped to put extra pressure on the Jets as they approached halftime. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "37"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "18"
        },
        "comments": {
            "amount": "6",
            "1": "This was the very definition of a Pyrrhic victory for the Seahawks. They did a nice job bouncing back from an ugly, 9-3 defeat at Los Angeles, blasting the 49ers in the process, but Russell Wilson sustained an injury in the third quarter and his Week 4 status is currently unclear. The Seahawks were cruising, up 27-3 in the third quarter, when Eli Harold tackled Wilson illegally. Wilson had already been limping a bit on his bum right ankle, but his other leg bent awkwardly. It appeared as though Wilson hurt his left ankle, but it was then apparent that his left knee was the body part that was the issue. Wilson left the game and never returned. Rookie Trevone Boykin piloted the offense the rest of the way. Wilson's injury is obviously huge. He had been enjoying a great performance, going 15-of-23 for 243 yards and a touchdown. He rushed only once for three yards, as he still clearly wasn't 100 percent, and now he appears to be in even worse shape. If there's a silver lining, it's that Boykin looked somewhat good, as he went 7-of-9 for 65 yards, one touchdown and an interception. I watched every snap of Boykin's in the preseason, and while he definitely has some ability and upside, the mental part of his game just isn't there yet. A team smarter than the 49ers would be able to force him into numerous turnovers. ",
            "2": "Boykin's sole score went to Doug Baldwin, who had a monstrous performance, catching eight balls for 164 yards. Wilson, meanwhile, fired a touchdown to Jimmy Graham (6-100). Graham looked good, save for a fumble that gave the 49ers an early field goal, including one instance in which he leapt over a defender. However, Graham is in danger of sustaining an injury because he returned too early for his patellar tendon, so I would try to sell him as soon as possible if you own him in fantasy. ",
            "3": "The Seahawks established a touchdown lead within a minute after a kickoff, as Christine Michael was shot out of a cannon on a 41-yard run. Michael had a huge performance with Thomas Rawls out of the lineup, tallying 106 yards and two touchdowns on just 20 carries. ",
            "4": "As for the 49ers, it would be obvious to say that Blaine Gabbert is not the answer, but it's really that simple. Gabbert went 14-of-25 for 119 yards and one interception. Sadly, he was nearly picked on three other occasions. You're going to hear the biased media pining for Communist Kaepernick, but the fact remains that Red Kaep was benched last year in favor of Gabbert because of his inability to read defenses and refusal to dedicate much time into film study. Going with Kaepernick would only make things worse, which I suppose is actually a good thing for the 49ers. They can take a quarterback early, which is what I have happening in my . ",
            "5": "Box-score observers may look at Carlos Hyde's 103-yard, two-touchdown performance (on 21 carries) and believe he ran extremely well. That couldn't be further from the truth, as Hyde generated most of his fantasy points when the game was out of reach. Hyde had just 24 yards on nine attempts at the half, and both of his scores came at the very end when the Seahawks stopped trying because they were up 37-3. ",
            "6": "Only three 49ers had more than 20 receiving yards: Torrey Smith (3-35), Jeremy Kerley (2-24) and Garrett Celek 3-25). Vance McDonald (2-4) left the game with a hip injury. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Colts",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "22"
        },
        "comments": {
            "amount": "9",
            "1": "It seemed for a while that the Chargers were going to drop the Colts to 0-3. They were up at halftime, with the home crowd heavily booing the Colts as they ran into the locker room. San Diego led throughout most of the second half and was milking the clock very well in a 4-minute drill, as the Colts couldn't cover Philip Rivers-to-Tyrell Williams slants. The Colts were able to take over, however, and because of a concussion Brandon Flowers sustained, they scored on a 63-yard touchdown to T.Y. Hilton, who blew by two San Diego defenders to score a 63-yard, go-ahead touchdown. The Chargers still had a chance to re-take the lead, but Hunter Henry fumbled near midfield, giving Indianapolis its first victory. Though the Colts prevailed, it didn't seem like they should have won. They made numerous mistakes throughout the afternoon. Frank Gore started by dropping a pass. Dwayne Allen did the same thing in the end zone. Andrew Luck was strip-sacked, and the Chargers returned the turnover for a touchdown. And on one drive, they had so many penalties that they were stuck in a second-and-40. The Colts couldn't get anything going offensively in the second half prior to that long Hilton touchdown, save for a score that only occurred because of a bogus pass interference call on Adrian Phillips, which should've gone the other way. The CBS color analyst agreed, pining for offensive pass interference on the play. ",
            "2": "Luck finished with a great stat line of 24-of-37 for 331 yards, one touchdown and an interception, plus the aforementioned fumble. He didn't play up to that stat line, however, especially in the second half. He was the beneficiary of Flowers' concussion and the poor play of Jason Verrett, who inexplicably struggled in this contest after a strong start to his 2016 campaign. ",
            "3": "Hilton finished with a huge stat line, as he caught eight balls for 174 yards and a touchdown. He blew right by San Diego's slow-looking defense on the 63-yard decisive score, but his best play came earlier in the second half when he somehow tapped both feet inbounds while falling out of play on a 33-yard reception. ",
            "4": "As for Luck's other weapons, Phillip Dorsett was a disappointment, catching three passes for 27 yards. Jack Doyle (6-65) and Dwayne Allen (3-35) picked up the slack with Donte Moncrief being out. Allen, as mentioned, dropped a touchdown. ",
            "5": "Right after Allen missed out on a score, Frank Gore took advantage with an end zone trip of his own. He gained 82 yards and the touchdown on 21 carries. Robert Turbin (4-9) vultured a score. The Colts may have run the ball better had guard Jack Mewhort not sustained an injury in the second half. ",
            "6": "The Chargers gave this game away at the end, but they also made some mistakes earlier in the afternoon. An unsportsmanlike penalty allowed the Colts to turn an early field goal into a touchdown. Philip Rivers missed an open Dexter McCluster for a score. Rivers was then strip-sacked when his backup left tackle was beaten badly, and this occurred one play after a poor pass on a terrificly designed screen. Travis Benjamin was guilty of an error later, dropping a crucial third down. The real killers occurred at the end, however. ",
            "7": "Rivers had a great game outside of the few blunders, finishing 26-of-39 for 330 yards. He was borderline unstoppable in the second half, going 18-of-23 for 224 yards following the break. Rivers, as mentioned, figured out that the Colts could not stop the slant to Tyrell Williams, who ended up catching six balls for 69 yards. ",
            "8": "Rivers did manage to spread the ball around, as three players in addition to Williams caught at least four players. They were Travis Benjamin (4-82), Hunter Henry (5-76) and Melvin Gordon (4-43). It's a shame that Henry was the goat at the end as a result of his fumble because it ruined what was a terrific first start. Benjamin, as mentioned, was guilty of a terrible drop. ",
            "9": "As for Gordon, it was shocking that he didn't run very well, given Indianapolis' struggles against the rush. He mustered 35 yards on 16 carries, but did manage to help his fantasy owners with a short touchdown. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "This wasn't a great test for the Cowboys because Chicago is missing a ton of personnel and doesn't seem capable of being very competitive at this moment. However, this game didn't do anything to deter anyone from thinking that Dallas has a very bright future with Dak Prescott and Ezekiel Elliott lining up in the backfield together. On a day in which Carson Wentz lit up the Steelers, Prescott almost had to equal that performance. Prescott was brilliant, going 19-of-24 for 248 yards and a touchdown to go along with 36 rushing yards and a second score on four scrambles. Prescott, who sliced and diced Chicago's defense while only making one bad throw on the evening - a pass behind one of his targets - could've posted an even better stat line. Prescott missed out on two other passing scores, as two of his players were tackled at the 1-yard line. Prescott also lost out on an opportunity to get another touchdown when Terrance Williams lost a fumble deep in Chicago territory. ",
            "2": "As for Ezekiel Elliott, the Bears had immense difficulty tackling him, as Elliott gashed Chicago's injury-ravaged defense. He gained 140 yards on 30 carries, and he also caught two balls for 20 receiving yards. Elliott looked great running behind his terrific defensive line, but once again, this wasn't much of a test because the Bears are missing half their defense. The one thing we can take away for sure is that Elliott didn't fumble, which has been his only issue thus far. ",
            "3": "The first drive of the game was almost disastrous for the Cowboys. Dez Bryant injured his ankle and walked into the locker room. Cole Beasley, meanwhile, was popped viciously and appeared to suffer a concussion. Fortunately for Dallas, both players were able to reenter the game, and both performed very well. Beasley secured all seven of his targets for 73 yards, while Bryant secured three balls for 40 yards and a touchdown, which was Prescott's first aerial score of his career. ",
            "4": "As for the Bears, their stats are very misleading. The box score shows that Brian Hoyer threw for 317 yards (on 30-of-49 passing) and two touchdowns, but he was stuck at 71 yards at halftime. A bulk of his yardage came late in the evening when the Cowboys were up multiple scores and were more than willing to give Hoyer everything underneath. Hoyer nearly made things very interesting with a score to bring this game within seven, but lost a fumble near midfield when he tripped over his own lineman's foot and lost the ball upon hitting the ground. ",
            "5": "Both of Hoyer's touchdowns went to Zach Miller, who finally had the big game I was expecting from him when I labeled him a fantasy sleeper in the summer. Miller caught eight balls for 78 yards and the two scores. ",
            "6": "Alshon Jeffery didn't look like himself. He logged five receptions for 70 yards, but was limping around quite a bit, especially at the end of the game. Kevin White, meanwhile, snatched six passes for 62 yards and had a long gain wiped out by an illegal-hands-to-the-face penalty by Charles Leno. White dropped a deep pass, but made up for it with a terrific catch over the top of Morris Claiborne. ",
            "7": "While the Cowboys had some big-time offensive players return from injuries, the Bears had their starting running back exit the game permanently. Jeremy Langford (3-31) left the contest with an Achilles injury. Promising rookie Jordan Howard looked good, gaining 45 yards on nine carries and catching four balls for 47 receiving yards. However, Howard needs to learn to get out of bounds in the 2-minute drill, as he hurt the Bears on multiple occasions by cutting upfield instead of heading toward the sideline at the very end. ",
            "8": "Speaking of the very end, I have to say that I loved Al Michaels' betting references when the Bears were close to getting a back-door push/cover with seconds remaining. His best quote was, All I know is that a lot of people are being 'pushed' to the edge right now. Michaels will always be the greatest. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "32"
        },
        "comments": {
            "amount": "9",
            "1": "Ten years ago, the Saints re-opened the Superdome with a very emotional victory over the Falcons. Steve Gleason blocked a punt, and the rest was history. New Orleans established one of the best homefield advantages in the NFL and enjoyed lots of success, even winning one Super Bowl, which was unfathomable back when it turned into a nomadic team in the wake of Hurricane Katrina. On the 10-year anniversary of the re-opening of the Superdome, it's become quite apparent that the current era of Saints football is officially over. The Saints, dropping to 0-3, are no longer competitive, and they are undoubtedly one of the worst teams in the NFL. New Orleans' defense is an abomination. The team simply couldn't get off the field, and the Falcons scored at will. They have numerous injuries, but the players who were out of the lineup wouldn't have made much of a difference. ",
            "2": "The Falcons attacked the Saints quite easily in terms of both the run and the pass. They actually rushed for 217 yards, with Devonta Freeman leading the way with 152 yards on 14 carries. Freeman also caught five passes for 55 receiving yards with an aerial score. Unfortunately for Freeman fantasy owners, Tevin Coleman vultured a whopping three touchdowns away, gaining 42 yards on 12 attempts. ",
            "3": "Matt Ryan faced very little resistance against cornerbacks Sterling Moore and Ken Crawley. He went 20-of-30 for 240 yards and two touchdowns, and he would've posted even better numbers had the Falcons not maintained a double-digit lead for most of the evening. Safety Roman Harper didn't help matters, taking a bad angle on an Atlanta fourth-down conversion and making matters even worse with a horse-collar tackle. This led to an Atlanta touchdown. Ryan did get away with some turnovers, however. Roman and Jairus Byrd both dropped potential picks. There was also some cause for concern at the end when Ryan appeared to injure his left thumb on a sack. Ryan didn't throw a pass after that, so it remains to be seen if that'll have any sort of impact going forward. ",
            "4": "Shockingly, Julio Jones caught only one pass for 16 yards. Jones missed out on a touchdown in the second quarter, but his toe was out of bounds. The Saints sold out on covering Jones, leaving everyone else open, so don't read too much into it if you're a Jones owner. Ryan's other top receivers, aside from Freeman, were Coleman (3-47), Justin Hardy (2-26, TD), Jacob Tamme (3-28) and Mohamed Sanu (3-31). Sanu left the game in the second quarter with a shoulder injury. ",
            "5": "The Saints can still put up points because of Drew Brees, but time is running out. Brees' contract is an albatross, and it's very difficult for the Saints to make significant moves in free agency to improve the defense because of it. Brees is still very good, but he's not the same player he once was. Brees moved the chains well for most of the evening, going 36-of-54 for 376 yards, three touchdowns and an interception. However, he made a couple of mistakes. The pick effectively ended the Saints' chances, as it went back for six. It was a poor throw forced into coverage that was tipped into the air. Brees appeared to have a second interception after that when he telegraphed a throw, but the ball was dropped by Robert Alford. ",
            "6": "With Willie Snead out, Brees focused on throwing the ball more to rookie Michael Thomas and the newly acquired Coby Fleener. Both scored touchdowns and caught seven passes each with Fleener outgaining Thomas, 109-71. Fleener, however, dropped two passes. He's not a good football player, but he just happened to be a byproduct of being in a good opportunity amid a shootout. Fleener will have some big games from time to time, but I'm sure the Saints will soon tire of his horrible mistakes. ",
            "7": "One other Saint registered more than 70 receiving yards, but it wasn't Brandin Cooks, who was limited to just two grabs for 13 yards. Brees just couldn't get the ball to Cooks, who saw eight targets. Brandon Coleman (7-78), meanwhile, led the wide receivers in yardage. ",
            "8": "Mark Ingram had a big performance. He was able to only rush 15 times, but picked up 77 yards in the process. He was also a factor in the aerial attack, snatching four balls for 30 receiving yards. ",
            "9": "Jon Gruden pulled an Emmitt Smith during the telecast, referring to the NFC South as a conference not once, but twice. I suppose there are three conferences in the NFL now: The AFC, the NFC and the NFC South. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}