{
    "year": "2016",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Lions",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "It's been a running theme for weeks now. The Lions find themselves trailing in the fourth quarter, but thanks to some late heroics by Matthew Stafford and Matt Prater, they've been able to pull out victories. That was once again the case on Thanksgiving, as Detroit trailed 13-10 with only a few minutes remaining. Stafford, despite starting a possession on his own 2-yard line, was able to engineer a tying drive, and following a Sam Bradford interception, Prater sealed the victory with yet another clutch kick. The Lions, as a result, have established sole possession of first place of the NFC North with a 7-4 record. Stafford was amazing in this game. His fourth-quarter effort was absolutely brilliant. He was able to escape pressure to scramble for a first down on a third-and-15. He then ripped a pass to Anquan Boldin for a gain of 29 yards while taking a bit hit on a third-and-18. This improbable conversion set up the tying field goal after Minnesota linebacker Eric Kendricks was able to temporary stop the bleeding with a terrific tackle on third down. The Kendricks stop seemed to be absolutely huge, especially after the Vikings moved the chains on the ensuing drive, but Cordarrelle Patterson negated that conversion by lining up incorrectly. The play immediately following the penalty was Bradford's pick, snatched by Darius Slay. Stafford was also on fire in the early going, starting 8-of-8 for 69 yards. His initial incompletion was a Golden Tate drop. Stafford's receivers betrayed him throughout the afternoon. Andre Roberts dropped a deep touchdown after a Minnesota corner fell down. Marvin Jones also had a considerable gain wiped out when the ball slipped through his hands. Stafford finished 23-of-40 for 232 yards and a touchdown (as well as 30 rushing yards), but as you can see, his numbers should've been a lot better. The Vikings were able to stymie Stafford in the third quarter with some great pressure, but the Detroit signal-caller eventually came through in the clutch, as he's been wont to do this year. ",
            "2": "Stafford's sole aerial score went to Boldin, who caught seven passes for 69 yards. He trailed only Tate in that category, as Tate snatched five balls for 77 yards. Jones saw the most targets (11), but had a disappointing result - four catches, 54 yards - thanks to Xavier Rhodes' terrific coverage. ",
            "3": "Theo Riddick gained 45 yards on nine carries. A big chunk came on a 12-yard burst early on, so Riddick didn't do much otherwise. Still, it was an improvement over last week, when the Lions couldn't even gain 20 yards on the ground. ",
            "4": "As for the Vikings, Bradford's stat line might look pretty good because of his completion percentage. He went 31-of-37 for 224 yards and the aforementioned interception. I'm sure some NFL talking heads who slurp quarterbacks will compliment Bradford for that completion percentage, but it's just further proof that stats can be very misleading. Bradford misfired just six times because he dinked and dunked most of the time. There were so many occasions when he settled for short passes on third-and-medium or third-and-long, which would explain why the Vikings were just 2-of-10 on third down. Minnesota's offense was just agonizing to watch. The team had just one completion of longer than 21 yards, and that was a 41-yard short toss to Jerick McKinnon that the spry running back was able to turn into a big gain because of a blown coverage. Take away that fluky connection, and Bradford would've thrown for just 183 yards on 30 completions, which is just sad. I don't completely blame Bradford for being a checkdown machine because he can't exactly trust his offensive line, plus Stefon Diggs was out. However, there times when Bradford had plenty of time in the pocket, and he still settled for 3-yard completions on a third-and-8. ",
            "5": "With Diggs out, Bradford spent the majority of the time targeting Kyle Rudolph and Adam Thielen, both of whom drew double-digit targets. Rudolph hauled in nine of 10 passes thrown his way for 64 yards, with the sole failed connection being a drop. Thielen, meanwhile, snared eight of his 11 targets for 53 yards. He was also guilty of a drop. Patterson, who made the greatest mistake of all, reeled in five passes, but for only 15 yards. He also picked up 22 rushing yards on a double reverse. Rookie Laquon Treadwell was even less of a positive factor. He failed to haul in his only target, as he dropped it. The ball popped into the air and was picked off by Slay. However, Slay was called for pass interference on what was a very shaky penalty. This occurred on the first drive, and Treadwell wasn't heard from again. He's been a huge disappointment thus far. ",
            "6": "The Vikings once again struggled to run the ball. McKinnon tallied 31 yards on nine carries, most of which came on a 10-yard burst. He also caught four balls for 45 yards, which includes the 41-yard reception I mentioned earlier. Matt Asiata, meanwhile, gained 27 yards and a touchdown on five attempts. ",
            "7": "As if the Vikings didn't have enough injuries, they lost stud center Joe Berger in the middle of this contest, as he was knocked out with a concussion. ",
            "8": "This game took a while to start because Chef's mother, I mean, Aretha Franklin took what seemed like 10 minutes to sing the National Anthem. I just had to post this on Facebook: "
        }
    }
}