{
    "year": "2010",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Last week, the Broncos were able to capitalize on Tennessee's mistakes and careless penalties to earn their second victory of the year. This week, it was Denver that shot itself in the foot and didn't give itself a chance to win. The Broncos fumbled a kickoff to give Baltimore three free points, and committed seven penalties - in the first half alone. One infraction (pass interference) gave the Ravens the ball on the 1-yard line. Two negated long plays. Two put Denver in third-and-long. Thanks to all of these penalties (they finished with 10), Baltimore was able to establish a 17-0 lead. And you don't come back against the Ravens down 17. ",
            "2": "Kyle Orton still managed to piece together a great statistical performance, going 23-of-38 for 314 yards and two touchdowns. However, the problems persist - Denver continued to struggle in the red zone. ",
            "3": "Brandon Lloyd caught both of Orton's touchdowns and finished with five grabs for 135 yards. He was second in the NFL in receiving yardage coming into this weekend, and it appears as though he'll be first come Tuesday. This is amazing because Lloyd was essentially out of the league prior to this season. ",
            "4": "Without Knowshon Moreno, the Broncos predictably struggled to run the ball. Laurence Maroney's six carries went for 27 yards. Correll Buckhalter wasted five attempts for 13 yards. ",
            "5": "While Denver couldn't move the ball on the ground, the Ravens were very successful in doing so. Ray Rice scored twice - his first of this game was also his first on the year - and finished with 133 yards on 27 attempts. Willis McGahee, meanwhile, totaled 67 yards and a score on 10 rushes. Even Joe Flacco scrambled for 20 yards and a touchdown. ",
            "6": "Flacco was a solid 14-of-25 for 196 yards. He did his best work on third down, keeping drives alive in the second half. Baltimore was 7-of-13 on third downs. ",
            "7": "Rookie tight end Ed Dickson led the Ravens with 58 receiving yards, but all of that came on one reception. Anquan Boldin had just one catch for eight yards, as he struggled to break free from Champ Bailey. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Colts",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "The Chiefs gave everything they had in this game. When Ryan Succop missed a 51-yard field goal with a minute left in regulation, Todd Haley and his players looked completely defeated. I was distraught as well; the kick would have covered the game for Kansas City. Haley tried to spark his team early. He called for an onside kick to start the contest, but the attempted failed. I liked the idea though; if Sean Payton's try didn't work in the Super Bowl, everyone would have called him an idiot, right? And it's not like Peyton Manning can't score on a long field. Haley attempted another ballsy move later in the first quarter. He went for it on 4th-and-2 inside Indianapolis' 5-yard line, but didn't get it. This move would really prove to be costly later; had the Chiefs kicked the field goal there, they could have went for it at the end of the game instead of asking Succop to try a 51-yarder. ",
            "2": "You have to admire Kansas City's effort, so it's a shame that the team is really limited by Matt Cassel. Cassel went 16-of-29 for 156 yards. That doesn't look too bad, but he was awful in the red zone and had seven straight incompletions in the second half. To be fair, Dwayne Bowe dropped a touchdown. ",
            "3": "The Chiefs ran the ball well, which shouldn't be a surprise when you notice that Jamaal Charles had double the carries (16) compared to Thomas Jones. Charles had 87 rushing yards; Jones had just 19. Peyton Manning looked bored on sidelines as Chiefs ate up the clock on an 8-minute drive in the first quarter, but Kansas City couldn't convert in the red zone because of Cassel's struggles. ",
            "4": "The Colts racked up 341 total yards of offense, but had just 19 points because they uncharacteristically struggled in the red zone. ",
            "5": "Manning went 26-of-44 for 244 yards and an interception. Four Colts had at least five receptions: Reggie Wayne (6-75), Pierre Garcon (6-57), Austin Collie (5-48) and Joseph Addai (5-39). Addai had 50 rushing yards on 17 carries, but left the game in the third quarter with a shoulder injury. Mike Hart totaled 50 yards and a score on 11 attempts in Addai's place. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "Forget the loss for the Packers. That really doesn't matter at this point. The more concerning issue is all of the injuries they've incurred. Along with linebacker Nick Barnett lost for the year, they saw Jermichael Finley, Donald Lee (Finley's backup), Clay Matthews and Aaron Rodgers all go down Sunday afternoon. Rodgers suffered a concussion in overtime, and his status for Week 6 is unclear. Finley, meanwhile, is likely out next Sunday with a displaced hamstring (ouch). Matthews limped off the field with his own hamstring injury. ",
            "2": "Rodgers was pressured often, taking four sacks. He went 27-of-46 for 293 yards, one touchdown and an interception on the play in which he endured his concussion. ",
            "3": "While Greg Jennings didn't do anything (2-22), three Packer receivers caught four passes: James Jones (65 yards), Donald Driver (58) and Andrew Quarless (51). Quarless, a very athletic rookie out of Penn State, is the third-string tight end. ",
            "4": "Brandon Jackson's stat line might look impressive (10 carries, 115 yards), but most of that came on a 71-yard scamper. Prior to this contest, Jackson had never recorded 71 rushing yards in a single game. ",
            "5": "Donovan McNabb had a shaky start, but really picked it up in the second half, hitting Santana Moss and Anthony Armstrong on deep bombs. McNabb went 26-of-49 for 357 yards, one touchdown and an interception. ",
            "6": "Moss (118 yards) and Chris Cooley (69) each had seven receptions. Armstrong hauled in only three grabs, but for 84 yards and McNabb's only score. ",
            "7": "Ryan Torain had just 67 total yards. If you own Torain, don't be discouraged; the Packers allowed just 3.8 yards per carry to running backs entering this contest. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "Given the score, would it surprise you if the Rams outgained the Lions in the first half? Well, they did. St. Louis was winning the yardage battle, 199-192 at intermission even though Detroit led 24-6 at that point. So what happened? A series of unfortunate events, primarily an injury to No. 1 receiver Mark Clayton. Clayton left the game in the first quarter on a stretcher. Hours later, he confirmed that he suffered a season-ending knee injury. Like Jimmy Clausen in Carolina, Bradford will now have to manage without his top wideout. Adding insult to injury, Sloppy play really haunted the Rams. Danny Amendola fumbled inside the Detroit 5-yard line when this contest was only 3-0. After a Josh Brown field goal to tie it at three, the Rams surrendered a 105-yard kickoff return score to Stefan Logan, thanks to sloppy tackling. ",
            "2": "Lacking his top weapon, Bradford went 23-of-45 for 215 yards and a pair of interceptions. Bradford threw exclusively to Amendola, who had 12 grabs for 95 yards. ",
            "3": "Steven Jackson ran really well, gaining 114 yards on 25 attempts. Once again, he couldn't find the end zone playing in a stagnant offense. ",
            "4": "Shaun Hill, meanwhile, was simply amazing, going 21-of-32 for 227 yards and three touchdowns. Of course, Calvin Johnson made things easier. Megatron had four grabs for 54 yards and a score. He nearly hauled in a second touchdown, but was ruled out of bounds. ",
            "5": "Jahvid Best registered 104 total yards (67 rushing, 37 receiving), but that's not indicative of how big of a factor he was. The Rams really struggled to tackle him. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bears",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "This game set quarterbacking back a century - even before football was invented. It was so bad that angels cried while watching Todd Collins (will be referred to as Tom Collins) and Jimmy Clausen (will be referred to as Clawful). OK, first of all, I have no idea why the Bears called a single passing play in this contest. They were running the ball all over the Panthers (Matt Forte, 22-166, 2 TDs; Chester Taylor, 18-43) and established a quick 17-3 lead in the first quarter. Despite this, Mike Martz inexplicably kept asking Tom Collins to air it out. Tom Collins played like he drank quite a few Tom Collinses; he went 6-of-16 for 32 yards and drunkenly tossed four very ugly interceptions. Caleb Hanie mercifully stepped in late and went 2-of-3 for 19 yards. ",
            "2": "With Tom Collins unable to complete a pass, Forte actually led the Bears in receiving yardage with 22 off two catches. Johnny Knox was next with one 14-yard reception. ",
            "3": "Clawful wasn't as bad as Tom Collins, but that was only by default. He went just 9-of-22 for 61 yards and an interception, which was actually a great play by Julius Peppers. Peppers tipped up the ball in the air and caught it when it came back down. To be fair though, Clawful once again had zero pass protection; he took five sacks. ",
            "4": "I guess John Fox knew Clawful would struggle against a great defense; he opted to run the ball eight consecutive times on the opening drive, including twice on third-and-long. Despite this, DeAngelo Williams (12-51) and Jonathan Stewart (8-30) didn't get many opportunities later on because the Panthers were down big early. ",
            "5": "I named Tom Collins' top receivers, so I might as well do the same for Clawful. With Steve Smith out (think that hurt?) David Gettis led all wideouts with three receptions for 32 yards. Brandon LaFell came down with just one catch (16 yards). "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "Last Sunday night, I asked the forum members how good they thought this Bengals team is. I thought about taking Cincinnati -6.5 because of the Hello, Goodbye Trend (check the <b> </b> page for details.) However, I wasn't really sure of how bad the Bengals are, so I didn't want to lay 6.5 points with a bad team. Ultimately, I decided to go with Cincinnati. Oops. I can confirm now that the Bengals are garbage. ",
            "2": "Carson Palmer really stinks. It's really unbelievable how bad he is. He went 21-of-36 for 209 yards, two touchdowns and three interceptions. That's not the worst stat line in the world, but two of Palmer's picks were disgustingly awful. The first was a pick-six. The second came as the Bengals were up seven with two minutes remaining. There was no reason to force anything, but Palmer's noodle arm betrayed him. After a Tampa game-tying touchdown, Palmer tossed yet another interception (deflected by the receiver) to give the Buccaneers the decisive field goal. ",
            "3": "Palmer isn't the only one letting the Bengals down. Chad Ochocinco, who was overly concerned with filming crap $10 reality programs this offseason, had yet another disappointing game. He recorded just three catches for 20 yards. He was also responsible for Palmer's third pick. Terrell Owens, meanwhile, hauled in seven grabs for 102 yards and a score. ",
            "4": "As the announcers commented in this game, Cedric Benson seemed to gain nine or 10 yards every single time he touched the football. He finished with 144 yards on 23 attempts. ",
            "5": "Enough with those Cincinnati losers. I'm really impressed with Josh Freeman. Freeman was 20-of-33 for 280 yards, a touchdown and an interception, but had several clutch throws in the fourth quarter, particularly to Mike Williams. Williams really played like a stud, registering seven grabs for 99 yards and a score. If you're reading this, hopefully you have him on your fantasy team. He's just going to keep getting better and better each week. ",
            "6": "I really don't understand why the Buccaneers aren't giving more carries to LeGarrette Blount. Blount had just four attempts in this contest, compared to 11 for Cadillac Williams. Williams managed just 33 yards despite the fact that he had a 14-yard gain. Earnest Graham actually paced Tampa with 65 rushing yards, but 61 came on one carry from the team's own 1-yard line. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "I was all ready to berate the Browns for starting Jake Delhomme because they gave him first-team practice reps throughout the week. Eric Mangini surprisingly made the smart decision and went with Seneca Wallace. Wallace played really well, but suffered an injury in the second quarter. And fortunately for my sanity on a rough afternoon, Delhomme was able to provide some amusement: - Delhomme fumbled a snap inside the Atlanta 5-yard line. Peyton Hillis probably would have scored otherwise. - On a Browns fourth down at midfield with five seconds remaining at the end of the first half, they didn't even try a Hail Mary. The crowd booed the Browns off the field even though they had a 7-6 lead; Cleveland essentially admitted that their quarterback can't throw a 50-yard pass even though they gave him $7 million guaranteed. - Delhomme threw a pick-six - to a defensive end. That touchdown gave the Falcons the cover. - While Wallace went 11-of-15 for 139 yards, Delhomme was 13-of-23 for 97 yards, two picks and the aforementioned fumble. ",
            "2": "Peyton Hillis continues to be a stud; he only had 28 rushing yards on just 10 carries, but caught four passes for 49 receiving yards and yet another touchdown. ",
            "3": "Matt Ryan had a pretty economical performance; he went 16-of-28 for 187 yards and a touchdown. The Falcons had issues with pass protection at times. Ryan took two sacks, but had to scramble out of the pocket more than he wanted to. ",
            "4": "Great fantasy performances from Michael Turner (19-140) and Roddy White (5-101, TD). Turner broke free for a 55-yard gain, but the Falcons inexplicably opted to use Jason Snelling (6-18) on a key third-and-short at the beginning of the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Giants",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "This seemed like a given. Of course the Texans would beat the Giants. New York stunk on Sunday night against the Bears, and Houston is awesome! <rb> Well, that's the NFL for you. The Giants completely dominated this game in every way; they had more first downs (26-11) and net yards (414-195) and a better time of possession (38:51-21:09). They were a perfect 4-of-4 in the red zone, and they limited the Texans to just 2-of-11 on third downs. ",
            "2": "Watching the first half of this contest, I felt as though Andre Johnson's presence on the field hurt Houston more than it helped. That may sound crazy, but Johnson didn't look 100 percent even though he finished with five catches for 95 yards. Note that all of those stats came in the second half. Matt Schaub simply looked like he was trying to force the issue to Johnson. He threw an incompletion to the Pro Bowl wideout on a third down in the opening quarter. On the next drive, he tossed an interception while targeting Johnson. Schaub went 16-of-34 for 196 yards, but a lot of that came in garbage time. He was just 8-of-17 for 69 yards and the aforementioned pick in the first half. ",
            "3": "A disappointing performance from Arian Foster. He had 25 rushing yards on 11 carries. The undeserving Derrick Ward vultured a touchdown. He would then comment on how much the Buccaneers suck afterward. ",
            "4": "Eli Manning went 27-of-42 for 297 yards, three touchdowns and a pair of interceptions. He targeted Hakeem Nicks early and often; the emerging Pro Bowl wideout finished with a whopping 12 grabs for 130 yards and two scores. Steve Smith had six catches for 89 yards and a touchdown. ",
            "5": "Ahmad Bradshaw recorded 67 yards on 16 carries. Brandon Jacobs stole a touchdown away, churning out 41 yards on 10 attempts. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "And you thought the Giants upsetting the Texans was unpredictable. I picked Arizona to cover the 7-point spread, and I must have received about a dozen e-mails and several more text messages saying how crazy I was. But I didn't even think the Cardinals had much of a chance of winning; I just figured that this would be a close battle. I'm really shocked by this. ",
            "2": "This may sound like a very obvious statement, but the Saints are definitely not the same team that won the Super Bowl last year. They're struggling in the red zone, calling senseless second-half timeouts and making too many mistakes. It didn't cost them much in the first quarter of the season, but the errors and sloppy play robbed them of a fourth victory this Sunday. Drew Brees took the Saints into the red zone four times, but managed only one touchdown. Brees went 24-of-39 for 294 yards, two scores and three interceptions. One of the picks came in garbage time, but the other two were uncharacteristic of Brees. ",
            "3": "With Pierre Thomas out, the Saints couldn't run the ball very well. Ladell Betts and Chris Ivory each had 10 carries for 44 and 39 yards, respectively. ",
            "4": "Marques Colston finally had a decent fantasy performance. He didn't score, but he notched seven catches for 97 yards. ",
            "5": "With Derek Anderson benched, rookie Max Hall made his first career start. Hall played pretty well, going 17-of-27 for 168 yards and an interception. The pick came early and was a dumb toss into double coverage. However, Hall made smart passes afterward. In fact, his best play came in the fourth quarter when he threw the ball out of bounds in the red zone when no one was open. Anderson would have drunkenly forced something to a covered Larry Fitzgerald. ",
            "6": "Speaking of Fitzgerald, he came up with seven grabs for 93 yards. He nearly came up with another long reception in the first half, but the ball trickled out of his hands as he hit the ground. ",
            "7": "Chris Wells finally got the majority of the carries for the Cardinals. He had 20 attempts compared to Tim Hightower's four. However, the Saints stacked the line of scrimmage, limiting Wells to just 35 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Titans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "Tom Jackson and Trent Dilfer both suggested that the Cowboys didn't show enough urgency in this game. I would definitely agree with that. Looking at Dallas' upcoming schedule, the team battles the Vikings (who knocked them out of the playoffs) and divisional-rival New York in the next two weeks. It's not excuse, but the Cowboys were certainly looking past the mediocre Titans. The Cowboys made numerous mistakes, namely six sacks allowed (most in the first half) and 12 penalties. The huge infraction occurred on Dallas' final touchdown. Jason Witten scored, and handed the ball to teammate Marc Colombo. Colombo spiked the ball, which drew a yellow flag because two players were involved on a celebration (a B.S. rule, but the right call). The Cowboys were pushed back to their 15 on the kickoff, which helped Marc Mariani set up the Titans in the red zone thanks to a 73-yard kickoff and a face mask penalty. Chris Johnson scored the game-winning touchdown three plays later. ",
            "2": "Tony Romo went 31-of-46 for 406 yards, three touchdowns and three interceptions (one came in desperation mode). Believe it or not, Romo became the first Cowboys 400-yard passer since Troy Aikman in 1998. ",
            "3": "Romo went to Miles Austin-Jones early and often. Austin-Jones had nine catches for 166 yards and a score. Roy Williams (6-87) and Jason Witten (5-84) also caught touchdowns. As for Dez Bryant, the rookie wideout had only three catches for 22 yards. He injured his ankle in the second quarter. He missed some action and then limped around for the rest of the game. ",
            "4": "Felix Jones looked great. While he ran like a sloth in the first three weeks of the season, he suddenly showed great quickness. Jones finished with 109 yards on 15 carries, while Marion Barber collected just 19 yards on six attempts. ",
            "5": "For the third consecutive week after that awful outing against the Steelers, Vince Young did not throw an interception. Young went 12-of-25 for 173 yards and two touchdowns. Young found Kenny Britt for a 52-yard completion in the third quarter. Britt, who finished with four grabs for 86 yards and a score, completely abused Mike Jenkins all afternoon. Britt torched Jenkins on that 52-yard reception and also drew two pass-interference flags on the opening drive, and probably should have gotten a third later on. ",
            "6": "Chris Johnson finally had a great fantasy performance; he ran for 131 yards and two touchdowns on just 19 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "The lead I wrote for the Chargers-Seahawks Week 3 recap applies here, so let me use the wonderful technology of copy-paste: In the movie <i> Groundhog Day</i>, Bill Murray woke up and re-lived the same day over and over again. Every time Norv Turner goes on the road, he re-lives the same game over and over again. Let's just hope he doesn't electrocute himself in the bath tub one of these weeks. Every Chargers road game is the same. They suffer untimely fumbles (three lost fumbles). They screw up on special teams (two punts blocked that led to 12 points for Oakland). And their final drive in an attempt to either tie the contest or take the lead ends up badly. ",
            "2": "Philip Rivers really played his heart out in a contest where many Charger players didn't give it their all. Rivers went 27-of-42 for 431 yards and two touchdowns, almost single-handedly willing San Diego to victory. ",
            "3": "I received an angry e-mail from someone who benched Malcom Floyd per my suggestion. Floyd caught eight balls for 213 yards and a touchdown. Nnamdi Asomugha had to help out on Antonio Gates (5-92, TD), allowing Floyd to go nuts. My bad. ",
            "4": "Ryan Mathews and Mike Tolbert nearly had an equal amount of carries; Tolbert had only 11 yards and a touchdown on 12 rushes, while Mathews was much more impressive with 59 yards on nine attempts. Tolbert also fumbled at the goal line, which has to make you wonder why Norv Turner won't give the ball to the guy he moved all the way up to No. 12 for in the 2010 NFL Draft. ",
            "5": "Having said all that, congratulations must be given to the Oakland Raiders, who beat the San Diego Chargers for the first time in 14 tries. The last time Oakland beat San Diego was 2003... ...And the Raiders didn't even do it with their Polish Point-Shaver! Bruce Gradkowski was just 1-of-7. He injured his shoulder early on and couldn't complete a pass afterward. He was then taken out of the game in favor of Jason Campbell, who was a solid 13-of-18 for 159 yards and a touchdown to Zach Miller (6-62). ",
            "6": "Louis Murphy caught two balls for 61 yards, most of which came on a 58-yard reception. Darrius Heyward-Bey didn't make a single catch. ",
            "7": "With Darren McFadden out, Michael Bush really impressed, collecting 104 yards and a touchdown on 26 carries, as well as three catches for 31 receiving yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "Alex Smith was finally benched. No, really, he was. Mike Singletary told David Carr to warm up as Smith struggled and was nearly booed out of the stadium. Despite the crowd chanting, We want Carr! Smith talked Singletary out of benching him. From that point on, Smith went 12-of-16 for 123 yards, leading the 49ers on two touchdown drives. Smith went into Beast Mode and simply was unstoppable. However, he played just like this against the Saints on Monday Night Football, so there's no reason to think that this will carry over to next week's game against Oakland. Smith does seem to perform better in the no-huddle, two-minute drill style of offense, so San Francisco should think about playing this way going forward. ",
            "2": "In total, Smith went 25-of-39 for 309 yards, three touchdowns, two interceptions and a horrifying fumble returned for an Eagles score. ",
            "3": "On the bright side, Michael Crabtree recorded nine catches for 105 yards and a touchdown. Vernon Davis also had a big game against Stewart Bradley, hauling in five grabs for 104 yards and a score. ",
            "4": "As for the Eagles, Kevin Kolb went 21-of-31 for 253 yards and a touchdown. Considering that this was the first time all year that Kolb was facing a non-Super Bowl favorite and playing in a game with all of the first-team reps during practice, his performance should not be surprising. Kolb actually showcased impressive mobility; left tackle Jason Peters left the contest early, and King Dunlap was completely inept in his place. ",
            "5": "LeSean McCoy was the star for the Eagles. He rushed for 92 yards and a touchdown on 18 carries, and also had five catches for 46 receiving yards. I guess it's a good thing he was able to play. ",
            "6": "Kolb's top target was Jeremy Maclin, who had six catches for 95 yards. Brent Celek hauled in three grabs for 47 yards and a score. DeSean Jackson recorded only two receptions for 24 yards. He missed some action with a minor injury. ",
            "7": "This is a cool stat, if you're into this sort of thing: As Al Michaels pointed out, the two quarterbacks at the beginning of this contest completed 10-of-10 passes on 10/10/10. Unfortunately, this made me remember ESPN's horrible skit Sunday morning where they had a bunch of kids pooping, peeing and yelling about the number 10 incoherently. </rb>"
        }
    },
    "numberOfGames": "12"
}