{
    "year": "2010",
    "week": "13",
    "Game 1": {
        "Team 1": {
            "Name": "Packers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "If the Packers advance deep into the playoffs, they may look back at this victory as the turning point of their season. Yes, the 49ers suck, but that's irrelevant; the important thing is that Green Bay may have found its running game. Rookie James Starks, a talented back out of Buffalo who hasn't been able to play because of injuries, rushed for 73 yards on 18 carries. Those may not be overly impressive numbers at first glance, but they are when you consider that the 49ers ranked third against the run going into this weekend. Pick up Starks immediately. ",
            "2": "With Starks running well, everything was clicking for the Packers. Aaron Rodgers went 21-of-30 for 298 yards and three touchdowns, connecting on multiple deep throws to Greg Jennings (6-122, 2 TDs) and Donald Driver (4-73, TD). Driver's 61-yard score was especially impressive, as he broke three tackles and found the end zone to really open up this game. ",
            "3": "The 49ers had the chance to draft Rodgers back in 2005, so if watching him thrive was bad enough, San Francisco fans had to endure Troy Smith's anemic quarterbacking. Smith went 10-of-25 for 194 yards, one touchdown and an interception, but should have been picked a couple of other times and was unbelievably inept in the red zone. Most of Smith's yardage came on a 66-yard touchdown to Vernon Davis (4-126, TD) on a missed tackle. Davis has to be happy in the wake of his first solid outing in a long time, but the 49ers will need to address the quarterback position this offseason because Smith certainly isn't the answer. ",
            "4": "With Frank Gore out for the year, Anthony Dixon and Brian Westbrook each saw nine carries for 33 and 31 yards, respectively. Dixon caught one pass; he was one of only four 49ers who logged at least one reception. ",
            "5": "Jeff Jersey Shore Reed - yes, THAT Jeff Reed - was 3-of-3 for 44 yards for the 49ers. I still can't believe it. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bears",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Poor Lions. They just can't catch a break. Detroit played the Bears very hard. They led 20-14 in the fourth quarter. But just as we saw in the season opener, a bogus call allowed Chicago to prevail over the Lions. If you missed it, the Bears were driving in the fourth quarter. Jay Cutler scrambled in the Detroit red zone. Ndamukong Suh tackled Cutler, but was whistled for unnecessary roughness. Despite Jim Schwartz's crazed reaction, the officials incorrectly awarded Chicago with a 1st-and-goal at the 7-yard line. On the next play, the Bears scored the game-winning touchdown. ",
            "2": "Despite taking four sacks (three from Cliff Avril), Cutler had a very efficient performance, going 21-of-26 for 234 yards and a touchdown. Johnny Knox caught only three balls (34 yards), while Cutler's busiest receiver was Earl Bennett (7-104). ",
            "3": "The Lions amazingly generated 253 total yards of offense in the first half with their third-string quarterback, as Chicago had major tackling issues prior to intermission. The Bears cleaned things up in the second half, limiting Detroit to just 51 total yards after the break. ",
            "4": "Drew Stanton was a solid 16-of-24 for 178 yards and two touchdowns (one pass, one rush), though he seemingly ran 15 yards backward on every single dropback. His score went to Calvin Johnson (3-66). ",
            "5": "After missing last week's game, Jahvid Best returned to rush for 65 yards on just nine carries. Best showed solid burst for the first time in a long while, as the week off apparently worked wonders. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Saints",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "30"
        },
        "comments": {
            "amount": "5",
            "1": "It's almost as if the Bengals don't want to win. Every week, they seem to find a new way to lose. This time, it was an untimely offsides. If you didn't see it, the Saints were in position for a game-tying field goal deep in Cincinnati territory on a 4th-and-2. Instead of sending on the kicker, the Saints had Drew Brees line up under center. This was clearly a ruse to get Cincinnati to jump offsides, and the Bengals fell for it. A play later, Brees found Marques Colston for the 3-yard decisive touchdown. ",
            "2": "It's a shame Cincinnati ruined a potential victory because they played really well. They had the defending Super Bowl champions down late, as Carson Palmer played his best game in a very long time. Palmer went 23-of-33 for 249 yards and a touchdown. Both Chad Ochocinco (5-96) and Terrell Owens (6-47, TD) were heavily involved on offense. ",
            "3": "Drew Brees, meanwhile, put together yet another magnificent game-winning drive. It's just amazing how he can keep doing this every single week. Brees finished 24-of-29 for 313 yards, two touchdowns and an interception. The Saints probably could have ran away with a victory - they led 20-6 at one point - but they killed themselves with a with a whopping 11 penalties. ",
            "4": "The Saints may not care when Pierre Thomas comes back. Chris Ivory rushed for 117 yards and two touchdowns on just 15 carries. Ivory definitely deserves consideration for more touches going forward; Thomas simply just can't be trusted because he's too injury-prone. ",
            "5": "Speaking of getting more touches, rookie tight end Jimmy Graham caught three balls for 72 yards. Graham out-produced Jeremy Shockey (2-28) and figures to be a huge part of the offense in the near future. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "6"
        },
        "comments": {
            "amount": "4",
            "1": "Kansas City fans attempting to convince me that their team is for real are going to have to try again another week. The Chiefs won this game, but very unconvincingly; they gave the Broncos multiple chances to obtain the lead, but Denver's offense was simply too inept to take advantage. Kyle Orton, the NFL's leading passer going into this weekend, was just 9-of-28 for 117 yards. It seemed like he underthrew every single pass he attempted, and it goes to show that his production was just the result of Josh McDaniels' offensive scheme and a ton of garbage numbers. To be fair though, you can't complete put this on Orton. He was sacked four times, twice by both Tamba Hali and Javier Arenas. ",
            "2": "Knowshon Moreno was the only Bronco who could do anything on offense; he rushed for 161 yards on just 23 carries. Not even Brandon Lloyd posted his usual awesome fantasy numbers (2-31). ",
            "3": "Matt Cassel was better than Orton, but only by default. Cassel went 17-of-31 for 196 yards and a touchdown. He had numerous ugly passes, as Champ Bailey completely clamped down on Dwayne Bowe. Bowe didn't even catch a single pass. ",
            "4": "Luckily for the Chiefs, Denver's rush defense was pathetic as ever. Jamaal Charles (21-116) and Thomas Jones (11-53) ripped right through the Broncos' defensive line, which was getting pushed around as if they were small children. Kansas City was consequently able to win the time of possession, 37:14 to 22:46. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Browns",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "After this game finished, Facebook friend John Y. sent me the following message: I think it's time everybody gets off the 'Chad Henne is going to be a good NFL quarterback' bus. Forget getting off the bus; I think that bus exploded. As I wrote in the live in-games thread in the forum, Henne may have volunteered to save Delhomme's kidnapped son today. Henne was completely disgraceful. He went 16-of-32 for 174 yards, one touchdown and three interceptions. The first pick was a poor underthrow. The second was a horrible overthrow. And the third gave the Browns their game-winning field goal - ironically a minute after Delhomme nearly tossed his own pick-six. Not even the Dolphins coaching staff had any faith in Henne; amid numerous Wildcat plays - Ronnie Brown (16-50) and Ricky Williams (10-48) at least ran well - offensive coordinator Dan Henning called a rushing play on 3rd-and-8 near midfield in the third quarter of a tie game. That's how scared he was to have Henne throw the ball. ",
            "2": "As for Delhomme, he miraculously didn't commit a single turnover. He went 24-of-34 for 217 yards and a touchdown, though he almost had that aforementioned pick-six that would have sealed a victory for Miami. ",
            "3": "Peyton Hillis didn't have his trademark monstrous fantasy outing; he rushed for 57 yards on 18 carries, and caught seven passes for just 22 receiving yards. Ben Watson (10-100, TD) and Mohamed Massaquoi (4-81) did most of the damage, as Miami focused on stopping Hillis. ",
            "4": "Dan Carpenter hit a 60-yard field goal in this contest, which is tied for the third-longest kick in NFL history. Maybe that's some sort of consolation prize for Miami fans. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "When Brett Favre left the game with a shoulder injury and the Bills immediately went up 7-0, I wrote the following in the forum: Looks like I'll be losing 2 units because of the Favre injury. Sucks. Whoops. All Minnesota did after that was reel off 31 consecutive points to close out the half. ",
            "2": "Tarvaris Jackson played well for the most part. Things looked ugly when he tossed a pick-six in the first quarter, but he rebounded from that and finished 15-of-22 for 187 yards, two touchdowns and three interceptions. The second pick wasn't his fault - it was bobbled by his own receiver - but the third interception was an ugly, unnecessary heave in the second half as he was falling back into the pocket. Jackson's inconsistency is nothing new; he has always been pretty erratic. Favre still gives Minnesota its best chance to win, so he should start if he's healthy. ",
            "3": "Adrian Peterson rushed for 107 yards and three touchdowns on just 16 carries. Peterson looked incredible, displaying his trademark speed and power. Wasn't he supposed to be hurt? ",
            "4": "With Percy Harvin out, Sidney Rice came up with five grabs for 105 yards and two scores. It's nice to see him back. ",
            "5": "Bills fans, I hope you know now what you're getting yourselves into with Ryan Fitzpatrick. Fitzpatrick finished 15-of-25 for 158 yards, one touchdown and an ugly, weak-armed interception. He also fumbled three times. More importantly though, Fitzpatrick was just 4-of-9 for 9 yards and that pick by halftime. When the game mattered, Buffalo couldn't move the ball whatsoever; the team had just two first downs and 41 total yards in the first half. ",
            "6": "As you can guess, none of the Bills' skill players did anything. Fred Jackson (11-42) and Steve Johnson (2-36) both disappointed their fantasy owners. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Giants",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "Remember when the Redskins were considered a Super Bowl contender after they traded for Donovan McNabb? That seems like a long time ago. This Washington squad looks more like the miserable 4-12 team that completely humiliated itself on national TV on a couple of occasions late last year. This game was over by halftime, with New York owning a 28-0 lead early in the third quarter and 102-yard edge by intermission. ",
            "2": "The Redskins looked completely helpless to stop New York's ground attack; Brandon Jacobs (8-103, 2 TDs) and Ahmad Bradshaw (25-97, 2 TDs) both had monstrous performances. ",
            "3": "With the Giants owning a big lead throughout, Eli Manning didn't have to do much. Manning went 15-of-25 for 161 yards and an interception. Derek Hagan was his top receiver (7-65). ",
            "4": "Donovan McNabb, meanwhile, was dreadful yet again. He went 26-of-44 for 296 yards, a late touchdown and two interceptions. He also fumbled thrice. McNabb had a couple of other potential picks that were dropped, so his afternoon could have been much worse. ",
            "5": "McNabb's garbage-time score went to Anthony Armstrong (6-97), who had a key fumble in the second quarter that led to a Giants touchdown. ",
            "6": "The Redskins once again couldn't get their ground attack going, as James Davis (9-40) and Keiland Williams (5-29) didn't get many opportunities because the team was down early. ",
            "7": "Rookie end Jason Pierre-Paul had two sacks in this contest after registering a pair last week. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "When the Jeff Fisher-Vince Young fiasco went down, I thought the Titans could have a huge hangover against the Texans the following Sunday. Apparently, that hangover hasn't ended. Tennessee looked completely disinterested in this contest, as the Jaguars basically did whatever they wanted. Jacksonville dominated Tennessee. At halftime, when the Jaguars led 17-0, they had 219 yards to the Titans' 74. They also had way more first downs (15-2). Chris Johnson, meanwhile, was limited to just nine yards on six carries (Johnson finished 13-53). ",
            "2": "The main problem for the Titans' offense was all of their dropped passes. There were four in the first half, and Bo Scaife bobbled an easy touchdown in the third quarter. Collins consequently finished just 14-of-32 for 169 yards and two interceptions. ",
            "3": "As you may guess, Randy Moss did nothing. He caught just one pass for 13 yards. He was open deep on a 4th-and-7 in the second quarter, but Collins completely missed him. ",
            "4": "Like I wrote earlier, Jacksonville basically did whatever it wanted to do on offense. They attempted multiple fourth-and-short situations and were successful almost every time. The offensive front pushed the Titans around, allowing Maurice Jones-Drew to rush for 186 yards on 31 attempts. Rashad Jennings (10-44) and David Garrard (10-19) also found the end zone on the ground. ",
            "5": "Garrard, meanwhile, went 14-of-19 for 126 yards. With his team up for the entire game and the Titans unable to stop Jones-Drew, Garrard just didn't need to throw the ball much. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "San Diego never loses in December! They're sure to make a comeback and win the AFC West! *** Insert fart noise here. *** ",
            "2": "Instead of the clutch team that perennially rallies to win the division, the Chargers of September and October showed up to play the Raiders this Sunday. There were no blocked punts, but numerous mistakes, including dropped passes, a muffed punt, horrible throws from Philip Rivers and back-to-back infractions for 12 men on the field killed San Diego. At 6-6, the Chargers have their work cut out for them. They're no longer in control of their own destiny. ",
            "3": "Credit has to be awarded to the Raiders though, as they played a terrific game after not showing up at all against the Dolphins last week. Oakland rammed the ball down San Diego's throat, as Darren McFadden (19-97, TD) and Michael Bush (23-95, TD) couldn't be tackled. ",
            "4": "Jason Campbell went 10-of-16 for 117 yards and a touchdown. He suffered a minor injury and was replaced by Kyle Boller in the second half. Fortunately for the Raiders, Campbell reentered the game shortly afterward. ",
            "5": "The Chargers, meanwhile, couldn't do anything on the ground despite the fact Oakland's defense ranked 26th against the rush entering the weekend. San Diego didn't get many attempts to run the ball, but Mike Tolbert still had only 16 yards on seven carries. Ryan Mathews did not play. ",
            "6": "Rivers went 23-of-39 for 280 yards, one touchdown and an interception. As indicated, he was erratic all afternoon, though it didn't help that his offensive line couldn't keep the Raiders out of the backfield; Oakland sacked Rivers four times. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Rams",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "6"
        },
        "comments": {
            "amount": "4",
            "1": "The Rams seem to have this habit of allowing teams to put together a couple of impressive drives in the first quarter. This happened last week at Denver, and the Cardinals did the same thing on Sunday. Fortunately for St. Louis, Arizona is so inept that impressive drive means a possession concluding with a field goal. The Cardinals hit two kicks in the first quarter thanks to numerous long runs from Tim Hightower (15-81) and Chris Wells (3-24). However, St. Louis then habitually clamps down on its opponent once it figures things out. The Cardinals predictably couldn't do anything after those two field goals. ",
            "2": "The Rams now stand at 6-6. They seem to be gaining momentum each week, and as I've written, they're not going to be an easy out in the playoffs. ",
            "3": "Sam Bradford went 18-of-29 for 187 yards and an ugly interception on an overthrow. Unfortunately, Bradford couldn't get things going with talented rookie Danario Alexander (2-20). ",
            "4": "As for the Cardinals, the Derek Anderson era appears to be over. Anderson took one last swig out of his magic flask and went 7-of-20 for 93 yards and an interception. Max Hall replaced him and suffered an injury after going 1-of-3 for 10 yards and a pick. The Hall injury was actually very fortunate because it finally forced Ken Whisenhunt to use John Skelton, the best quarterback on his roster. Skelton promptly opened with a 22-yard completion to Steve Breaston, which nearly gave me a heart attack because I had the Rams for three units. Fortunately for my sportsbook account, Skelton's offensive line would go on to betray him. The rookie out of Fordham finished 3-of-6 for 45 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "35"
        },
        "comments": {
            "amount": "5",
            "1": "I can understand Peyton Manning tossing interceptions against the Chargers. He's never fared well against them throughout his career. But to heave four picks against the Cowboys, including a game-clinching interception in overtime? I watched this game, and I still can't believe it. Manning, who went 36-of-48 for 365 yards, two touchdowns and four picks, now has 11 interceptions (included four pick-sixes) the past three weeks. It's hard to blame Manning though. His supporting cast is pretty abysmal right now. The offensive line stinks. Dallas Clark, Joseph Addai and Austin Collie are all out. Pierre Garcon (8-56, TD) isn't very good. And Reggie Wayne, despite his great statistical outing (14-200, TD) keeps dropping passes. Wayne had a huge drop in overtime, which pretty much cost Indianapolis its seventh victory. ",
            "2": "The Colts once again struggled to run the ball. Neither Mike Hart (5-8) nor Donald Brown (4-4) could do anything. ",
            "3": "Dallas outgained Indianapolis, 218-117, in the first half. The Colts eventually took the yardage lead thanks to a furious comeback by Manning, but the Cowboys really trampled Indianapolis' defense. Felix Jones (22-83) ran well, but Tashard Choice (19-100, TD) really stole the show. Shame on Jason Garrett for not using Choice more often earlier in the year. ",
            "4": "Jon Kitna capitalized off his team's great ground game by going 18-of-26 for 167 yards and a touchdown, as he made clutch throws all afternoon. Unfortunately, one of Kitna's targets, Dez Bryant (1-14) fractured his ankle. His season is over. ",
            "5": "The Cowboys are now 3-1 with Garrett as their head coach, with the sole loss coming on that fluke fumble on Thanksgiving. It makes you wonder what could have happened if Jerry Jones fired Wade Phillips earlier. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Bleh. That's all I have to say about this game. Bleh. ",
            "2": "I had the Panthers +6 for three units. I was thrilled to see them establish a 14-0 lead early on. Jimmy Clawesome looked great, the running game was working well, and the defense really clamped down on Matt Hasselbeck and company. Unfortunately for my wallet, the second half included a Clawful pick-six, a Seattle punt return that went to Carolina's 5-yard line, a penalty that nullified a Carolina kickoff return for a score, and really horrific tackling by the Panthers in the fourth quarter. This was a complete meltdown by Carolina. ",
            "3": "Clausen finished 18-of-34 for 169 yards and the aforementioned pick-six, which was a horrendous throw. He had absolutely no time in the pocket on most plays, and when he actually did, it seemed like his offensive line was guilty of a penalty to bring a positive play back. Carolina committed eight infractions, but four came via the offensive front or blocking tight end. And as mentioned, another penalty negated a Panthers kickoff return for a touchdown. ",
            "4": "On the bright side, Jonathan Stewart played well. He had 92 yards and a score on 21 carries. ",
            "5": "Speaking of running backs posting great stats, Marshawn Lynch totaled 83 yards and three touchdowns on 21 rushes. Don't think Lynch has suddenly turned it around though; his production was the result of absolutely zero-effort tackling by Carolina in the fourth quarter. ",
            "6": "Matt Hasselbeck went 17-of-30 for 229 yards and two picks. Hasselbeck will need a healthy Mike Williams to be effective again; Williams didn't catch a single pass and suffered an ankle injury. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "This was a great battle between young quarterbacks. But even as I write that, it sounds kind of silly considering how clutch Matt Ryan has become. When the Falcons obtained possession in the fourth quarter, down 24-21, there was really no doubt that Ryan would lead a comeback and at least set Atlanta up with a game-tying field goal. Ryan eventually found Michael Jenkins for a decisive 9-yard touchdown. Of course, what we didn't know was that the Buccaneers would greatly assist Ryan in achieving this comeback. Tampa Bay was guilty of two key penalties worth 25 yards on the drive, including a silly personal foul by Quincy Black to give Atlanta a 1st-and-10 at the 16. ",
            "2": "Josh Freeman (19-38, 181 yards, TD, INT) had his own chance to lead the Buccaneers to victory on the ensuing possession, but tossed an interception to Brent Grimes. At 7-5, Tampa Bay's season is essentially over unless they can upset the Saints. The Buccaneers were really a year ahead of schedule, so their fans have a lot to look forward to in the near future. ",
            "3": "Tampa's rookies played really well. LeGarrette Blount (20-103, TD) now leads all first-year players in rushing. Meanwhile, Mike Williams (5-59, TD) had yet another solid performance. ",
            "4": "Ryan finished 18-of-36 for 205 yards, two touchdowns and a pair of interceptions, as Tampa Bay's defense was solid throughout. ",
            "5": "Roddy White didn't find the end zone, but came up with seven grabs for 74 yards, including a 25-yard completion on a 3rd-and-20 in the fourth quarter. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Mike Tomlin said it all during his post-game press conference: That's Steelers-Ravens football right there. This was an intense, defensive battle that lived up to the hype. This contest could have gone either way, and was ultimately decided by two sequences. The first was a horrible call by Baltimore offensive coordinator Cam Cameron, who had Joe Flacco throw a pass on 2nd-and-5 on his 43-yard line with 3:22 remaining and a 10-6 lead. Flacco was strip-sacked by Troy Polamalu. On the ensuing drive, Ben Roethlisberger somehow shrugged off Terrell Suggs and threw the ball away instead of taking a 7-yard sack. Two plays later, Roethlisberger found Ike Redman, who broke a tackle and scored the decisive touchdown. ",
            "2": "Roethlisberger went 22-of-38 for 253 yards, one touchdown and an interception. He was immobile early on and often lined up in the Pistol formation. However, as Al Michaels and Cris Collinsworth noted, Roethlisberger's ankle loosened up as the game went on, and Big Ben regained some of his mobility. Roethlisberger suffered a broken nose in the first quarter when Haloti Ngata hit him in the helmet. The officials didn't flag Ngata on what should have been a personal foul. Big Ben would play the rest of the contest with dry blood on his jersey. Later, Heath Miller was drilled on a hit to the helmet. Miller left the game with a concussion. Collinsworth sounded like he had an aneurysm when the officials missed yet another personal foul. As this happened, I tweeted (<a href=https://twitter.com/walterfootball target=blank>@walterfootball</a>), James Harrison should never pay another fine after the crap officiating tonight. What a disgrace. Tomlin was much more serene, though winning the game must have helped. Said Tomlin, who appeared to be freezing his balls off, I coach; I don't officiate. I work in Pittsburgh; not New York. ",
            "3": "As for the Ravens, Flacco went 17-of-33 for 266 yards and a score to Anquan Boldin (5-118). Flacco played pretty well, but his final attempt on a 4th-and-2 on Pittsburgh's 31 felt short of his intended target. ",
            "4": "I don't know what Cameron is thinking by not involving Ray Rice more on offense. Rice touched the ball only 11 times; he had 32 rushing yards on nine carries and two catches for 18 receiving yards. "
        }
    },
    "numberOfGames": "14"
}