{
    "year": "2010",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "I'll forever remember this game as the battle of two players who shouldn't have been on the field. Roy Williams and Reggie Bush seemed to take turns killing their team, with Williams ultimately prevailing (i.e. being responsible for his team's loss.) Bush didn't seem ready for live game action. On his first play, the football hit him right on the helmet on an attempted throw. Bush later dropped an easy pass on third down that would have set the Saints up on a first-and-goal. Afterward, Bush fumbled a punt return, setting up the Cowboys with a short field and a subsequent touchdown. Williams, meanwhile, dropped a pass, but was ultimately responsible for the loss. He took a long completion deep into New Orleans territory, but fumbled the ball away. The Saints scored the winning touchdown on the next possession. One has to wonder why Williams continues to see so many snaps. ",
            "2": "Jon Kitna actually had to go to Williams (5-83) early and often because the Saints made sure Dez Bryant wouldn't beat them. New Orleans doubled Bryant on every play. The stud rookie consequently caught no passes. Miles Austin-Jones, meanwhile, had just three receptions for 25 yards, but had a 60-yard touchdown on an end-around. ",
            "3": "I talked about the crappy players, but Drew Brees ultimately stole the show with a brilliant 89-yard drive in 1:08 to win the game. Brees went 23-of-39 for 352 yards, one touchdown and an interception. After a great start to open up a 17-0 advantage, Brees cooled off until his final possession, allowing Dallas to come back and obtain an unlikely cover. ",
            "4": "Robert Meachem caught just one pass for 55 yards, but it was the big play to put the Saints into scoring position on the final drive. Marques Colston, meanwhile, had six grabs for 105 yards. ",
            "5": "The Cowboys fumbled a whopping seven times in this game. Though they recovered six of them, it made me wonder if the Ghost of Wade Phillips was coaching his old team again. Dallas was back to its old tricks - playing well but screwing itself with dumb mistakes. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jets",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "This might go down as one of the most discouraging 16-point victories in NFL history. The Jets dominated this game defensively - they held the Bengals to 39 total yards of offense in the second half - but they nearly lost because of Mark Sanchez. Sanchez went 16-of-28 for 166 yards, one touchdown and an interception. However, the Bengals dropped two potential picks, one of which could have been returned for six. Sanchez nearly took a sack for a safety, and later would miss a wide-open Braylon Edwards for a 60-yard touchdown. It's really difficult to explain this. Sanchez was so brilliant the past couple of weeks, particularly in the final stages of the Houston and Cleveland games. He looked like a crappy rookie against a Bengals skeleton-crew defense. ",
            "2": "If it weren't for Brad Smith, Cincinnati may have pulled the upset. Smith scored on a 53-yard rushing touchdown in the third quarter, and then took an 89-yard kickoff return for a score in the final period. He actually lost his shoe 50 yards before he crossed the goal line, yet was still able to outrun everyone. ",
            "3": "One other notable thing for the Jets: Shonn Greene (18-70) received the carries when the Jets were trying to ice the game late in the fourth quarter. This is significant because Greene fumbled late in the Houston victory to give the Texans a field goal. ",
            "4": "The Jets obviously aren't easy to throw against, but Carson Palmer still played horribly. He went 17-of-38 for 135 yards, one touchdown and two interceptions. Once again, Palmer displayed no arm strength and made some very poor decisions. The Bengals will need a new quarterback next year. ",
            "5": "Darrelle Revis and Antonio Cromartie did their job; Terrell Owens (3-17) and Chad Ochocinco (4-41) were non-factors in this game. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "Football is often described as a game of inches. This was a game of exactly one yard for the Packers. Green Bay had three opportunities to pick up a first down or touchdown with one yard to go Sunday afternoon, but failed each time. On the first occasion, running back Dimitri Nance was stuffed in the red zone on a 3rd-and-1, forcing the Packers into a field goal. Later, Aaron Rodgers fumbled on the 1-yard line, negating a possible touchdown or chip-shot field goal. And in the fourth quarter, Green Bay failed on a 4th-and-1 on its own territory. The Packers outgained Atlanta, 418-295. But the short-yardage screw-ups were the deciding factor. ",
            "2": "The Falcons ultimately prevailed on a game-winning 47-yard field goal by Matt Bryant, thanks in part to a face mask penalty that set up Matt Ryan at midfield. Ryan was brilliant all afternoon, completing 24-of-28 passes for 198 yards and a touchdown to Tony Gonzalez (6-51). ",
            "3": "Ryan really capitalized off Michael Turner's incredible running; Turner trampled the Packers for 110 yards and a touchdown on 23 carries. Green Bay really had to sell out to stop Turner. ",
            "4": "With no running game to speak of - Brandon Jackson, at one point, had minus-2 yards on five carries - Aaron Rodgers pretty much did everything for his team. He went 26-of-35 for 344 yards and a touchdown. He scored another time on a run, compiling 51 yards on 12 scrambles. He was clutch in a fourth-quarter comeback, but left too much time on the clock for the Falcons. ",
            "5": "Five of Rodgers' receivers caught five passes: Greg Jennings (119 yards), Nelson (61, TD) and James Jones (44). <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "It's really unbelievable that the Bills nearly won this game considering how one-sided this contest was in the first half. In fact, I started writing this recap at intermission. Here was the lead: <i> Did the Bills even play this game? From what I saw, the Steelers held a scrimmage against a local high school team. Buffalo really embarrassed itself. Consider the following numbers in the first half: Four first downs, six rushing yards, 51 total yards and 6:02 time of possession (23:55 for the Steelers). </i> The Bills, however, came out as a completely different team in the second half. They completely clamped down on the Steelers, sacking Ben Roethlisberger five times. Ryan Fitzpatrick, meanwhile, finished very well (23-45, 265, 1 TD, 1 INT) after beginning just 4-of-11. He threw the game-winning touchdown to Steve Johnson in overtime, but the ball bounced right out of Johnson's hands. Johnson really was responsible for this loss. Though he caught seven passes for 68 yards, he dropped five balls, including the would-be decisive score. ",
            "2": "With C.J. Spiller out again, Fred Jackson had a monstrous performance. He was OK on the ground (12-59), but did most of his damage as a receiver coming out of the backfield, catching five balls for 104 yards and a 65-yard score. ",
            "3": "The Steelers ultimately won after the Johnson drop with a Shaun Suisham 41-yard field goal. The fact that they won like this is very significant considering the problems they've had in the kicking game all year. Suisham was 4-of-4, nailing attempts from 45, 46, 48 and 41. ",
            "4": "Ben Roethlisberger went 20-of-33 for 246 yards. After an impressive opening possession, Big Ben had trouble keeping drives alive because of poor pass protection. A dropped potential touchdown by Emmanuel Butterfingers Sanders didn't help. ",
            "5": "Rashard Mendenhall rushed for a whopping 151 yards and a touchdown on 36 carries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Browns",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "23"
        },
        "comments": {
            "amount": "4",
            "1": "Jake Delhomme's son's kidnappers must be very happy right now. Delhomme fooled everyone by playing well in the first half of this game, but tossed a pair of interceptions on his first two throws after intermission, one of which was returned for a touchdown. Delhomme finished 24-of-35 for 245 yards and those two picks, so it's a good thing the Browns had Peyton Hillis at their disposal. Hillis was a freaking monster, rushing for 131 yards and three touchdowns on 26 carries. He also caught six balls for 63 more yards. The Panthers looked like helpless children trying to tackle him. Delhomme was undoubtedly reminded of his own kidnapped son while he watched his old teammates attempting to tackle the massive runner. ",
            "2": "Some notable receivers for the Browns: Brian Robiskie caught seven balls for 50 yards, which has to be encouraging. Mohamed Massaquoi (4-52) was also effective. ",
            "3": "As for Jimmy Clausen (16-28, 195, 1 INT), there was some Clawesome and Clawful. Clawesome made some nice throws, including a 15-yard strike to Steve Smith on a 3rd-and-11. He also had an impressive heave to Brandon LaFell along the sideline, but LaFell dropped the ball after the play was reviewed. Later on, Clawesome led the Panthers all the way down to the Cleveland 24-yard line in just 59 seconds after starting from his own 5. Unfortunately, John Kasay doinked the ball off the left up-right on what would have been a game-winning 42-yard field goal. As mentioned, however, there was some Clawful. He made some really poor throws (his interception was horrible), displayed shoddy pocket presence and should have thrown a couple of more picks. His receivers bailed him out with some great catches, but to be fair, his offensive line didn't give him much time. ",
            "4": "Jonathan Stewart is back! Though Mike Goodson started and received 22 touches (14 carries, 55 rush yards, 8 catches, 81 rec. yards, TD), Stewart totaled 98 yards on 12 carries. However, Steve Smith (2-33) didn't do much. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Texans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "0"
        },
        "comments": {
            "amount": "4",
            "1": "This game was so uneventful that the biggest moment was a fight between two players. Cortland Finnegan and Andre Johnson got into it in the fourth quarter. Finnegan punched Johnson and then ripped off his helmet. Johnson then punched Finnegan three times. Both players were ejected, and both will be fined. It's also possible that both will be suspended - a huge blow for anyone who has Johnson on their fantasy team for a crucial Week 13 matchup. ",
            "2": "I moved the Titans down from No. 12 into the bottom 10 of my <b> <a href=/nflpowerrankings.php> NFL Power Rankings</a></b> last week for one reason: Rusty Smith. Tennessee could not do a single thing on offense in this game. Smith was absolutely horrible, going 17-of-31 for 138 yards and three interceptions (all to Glover Quin) on some of the ugliest throws I've ever seen. The Titans had just two first downs and 54 total yards at halftime. Chris Johnson finished with five yards on seven carries, while Randy Moss caught only three passes for 23 yards. Remember, it's not like Houston has a great defense that just clamped down on the Titans; this is what we're going to see out of Tennessee's offense until Kerry Collins comes back. ",
            "3": "The Titans had no answer for Arian Foster. He rushed for 143 yards on 30 carries, and also caught nine balls for 75 receiving yards. ",
            "4": "Johnson, meanwhile, hauled in nine receptions himself for 56 yards and a touchdown before getting kicked out. Matt Schaub went 25-of-35 for 178 yards and two scores. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Giants",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Jaguars had complete control of this game. They led 17-6 at halftime, at which point they were trampling the Giants. They totaled 145 rushing yards by intermission, as New York looked helpless while trying to tackle Maurice Jones-Drew (21-113) and Rashad Jennings (7-53, TD). Things completely changed in the second half. Jacksonville had just 62 rushing yards after intermission, causing David Garrard to struggle. Garrard finished 20-of-35 for 162 yards, a rushing touchdown and a tipped interception. However, he could have easily thrown a couple more picks that were dropped by the Giants. He also fumbled thrice. ",
            "2": "Mike Sims-Walker was responsible for Garrard's pick. He wasn't even supposed to play, so give him credit for suiting up and catching four balls for 48 yards. However, Sims-Walker dropped a couple of passes in addition to tipping Garrard's throw into Terrell Thomas' arms. ",
            "3": "With no Eugene Monroe in the lineup, the Giants totaled four sacks - an impressive number considering how well Jacksonville's ground attack was working. Marcedes Lewis (3-36) couldn't do much because he focused on blocking the entire afternoon. ",
            "4": "The Giants could have easily lost this game, but they have to be encouraged based on how they were defeated by the Eagles the preceding Sunday. New York didn't turn the ball over a single time. It nearly happened on the first drive when Derek Hagan fumbled in the red zone. However, the Giants challenged and the pass was ruled incomplete. ",
            "5": "As for the Giants' ground attack, Brandon Jacobs had more carries (14) than Ahmad Bradshaw (9). Both were effective, with Jacobs and Bradshaw gaining 87 and 49 yards, respectively. Bradshaw chipped in with four receptions for 34 more yards. ",
            "6": "Eli Manning went 14-of-24 for 226 yards and two touchdowns to Kevin Boss (3-74) and Mario Manningham (3-61). He wasn't sacked once, marking the fourth game in a row he hasn't taken a sack. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "At this rate, NFL teams may opt to fire coaches every week. Like the Cowboys earlier in the year, the Vikings rallied around their new interim head coach and achieved a victory after a series of ugly losses. ",
            "2": "Of course, a Minnesota win doesn't matter at this point in the season. The big news coming out of this game was Adrian Peterson's injury. Peterson (6-36, TD) had his leg rolled up in the second quarter and limped off the field. The word is that Peterson sprained his ankle, but it's unclear if he'll miss next week's game. Toby Gerhart replaced Peterson, and gained 76 yards and a touchdown on 22 carries. He must be added in all leagues. ",
            "3": "Brett Favre, meanwhile, went 15-of-23 for 172 yards. The Vikings were either tied or ahead for most of this game, so he just didn't need to throw all that much. That would explain his receivers' meager numbers: Visanthe Shiancoe (3-54), Percy Harvin (5-32), Sidney Rice (1-20). ",
            "4": "The Redskins actually opened this contest up with an impressive scoring drive. Donovan McNabb went 8-of-8 for 84 yards and a touchdown on the first possession. However, he was just 13-of-27 for 127 yards and a pick afterward, finishing with pedestrian numbers (21-35, 211, 1 TD, 1 INT). McNabb has always been erratic throughout his career, and this game was just a microcosm of that. ",
            "5": "Santana Moss and Chris Cooley each caught five balls for 40 and 49 yards, respectively. Moss had a huge drop on a key third down at midfield that would have resulted in a fresh set of downs for the Redskins. ",
            "6": "What happened to Mike Shanahan's running game? James Davis led all backs with 11 yards on six carries. Keiland Williams, who started the contest, had just five yards on three attempts. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "So much for the Raiders being good and contending for a playoff spot by winning the AFC West. The Dolphins came into this game and completely humiliated Oakland. Miami outgained the Raiders, 473-263. They had way more first downs (24-11) and held the Raiders to just 16 rushing yards. Fourteen of Oakland's 17 points came on two big plays - an opening kickoff return for a touchdown and a 52-yard Bruce Gradkowski to Jacoby Ford score. ",
            "2": "Chad Henne started for the Dolphins. Though he didn't have Brandon Marshall, he went 17-of-30 for 307 yards, two touchdowns and an interception. The pick was terrible, but Henne was otherwise terrific. Henne was curiously replaced by Tyler Thigpen on a couple of plays in the second half and watched Thigpen run for an 8-yard gain. This really confused Gus Johnson and his broadcasting partner, who spent about 15 minutes trying to figure out what was going on. ",
            "3": "With Henne back and Marshall out, Davone Bess naturally led the Dolphins with six grabs for 111 yards. Meanwhile, Ricky Williams (20-95, TD) and Ronnie Brown (24-85) completely gashed Oakland on the ground. ",
            "4": "Bruce Gradkowski, meanwhile, didn't play so well. He went 17-of-32 for 252 yards, one touchdown and two interceptions. It appears as though the magic he had at the end of last year has fizzled out. Of course, Gradkowski didn't have much of a chance because of an anemic ground attack. Darren McFadden shockingly had just two rushing yards on eight carries, though he chipped in as a pass-catcher out of the backfield (7 catches, 63 yards). "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "comments": {
            "amount": "4",
            "1": "The final score of this game isn't indicative of how one-sided it was. The Chiefs absolutely dominated the Seahawks. The only reason Seattle was able to hang around is because of a blocked punt for a touchdown, a recovered fumble that led to a field goal and late garbage touchdown in the fourth quarter. Kansas City outgained Seattle, 503-288, and won the time of possession, 41:03 to 18:57. The Seahawks weren't able to achieve a first down until 10 minutes into the second quarter. Matt Hasselbeck (20-37, 282 yards, 2 TDs, 2 INTs) was completely helpless without Mike Williams; most of Hasselbeck's yardage came in junk time. Hasselbeck forced poor passes all afternoon. It's hard to blame him though, seeing as how his top targets were John Carlson, Ben Obomanu, Brandon Stokley and Deon Butler. ",
            "2": "Seattle's ground attack - surprise - absolutely sucked yet again. Marshawn Lynch totaled 20 yards on seven carries, which is yet another reason Hasselbeck struggled. He'll be better once Williams returns to the lineup. ",
            "3": "The Chiefs moved the chains at will against the Seahawks. Matt Cassel went 22-of-32 for 233 yards and four touchdowns, three of which went to Dwayne Bowe. Bowe hauled in a whopping 13 catches for 170 yards. You may officially crap your pants if you have to play against him in fantasy over the next four weeks. ",
            "4": "Jamaal Charles actually had more carries (22) than Thomas Jones (20), which is really surprising. Charles gained 173 yards and a touchdown, while Jones managed only 68 yards. Of course, Todd Haley had to pull his trademark douche-bag move, giving defensive lineman Shaun Smith a goal-line carry in the second quarter. Smith scored in a Refrigerator Perry-type fashion, screwing all Jones fantasy owners. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Buccaneers deserve a ton of credit for scratching and clawing to keep this game close because by halftime, it looked like Baltimore was going to run away with an easy victory. The Ravens led 17-3, outgained Tampa Bay by 120 yards and held Josh Freeman to 8-of-19 for 64 yards. As the teams went into the locker room, Raheem Morris ran with the officials and spent about five minutes arguing a bogus 24-yard pass interference penalty on Myron Lewis that led to a Ravens touchdown. But Tampa Bay held Baltimore scoreless in the second half. Freeman (17-37, 162, TD) had his trademark backdoor touchdown late in the fourth quarter. Freeman could have thrown another score, but Michael Spurlock dropped an easy pass. ",
            "2": "LeGarrette Blount had 55 yards on 13 carries. Mike Williams, meanwhile, notched just two catches for 20 yards. Williams ran long routes, but Freeman simply didn't have enough time in the pocket to find him downfield (although he wasn't sacked.) ",
            "3": "Joe Flacco was spectacular, particularly in the first half, going 25-of-35 for 289 yards, two touchdowns and an interception. I don't think it's a coincidence that Flacco couldn't get anything going after left tackle Michael Oher suffered a game-ending injury. Oher limped off the field and was later diagnosed with a knee sprain. Flacco was consequently sacked four times (twice by Gerald McCoy). The good news is that Oher tweeted that he'll be good to go next week. ",
            "4": "Flacco's scores went to Derrick Mason (8-87) and Todd Heap (2-79). Anquan Boldin (3-27) once again struggled to do anything. He didn't even catch his first pass until the third quarter. ",
            "5": "Ray Rice failed to find the end zone, but compiled 132 total yards (85 rushing, 47 receiving). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Bears",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "26"
        },
        "comments": {
            "amount": "4",
            "1": "After this game finished, I must have received a dozen e-mails and texts from Bears fans (random people and friends) who all asked the question, Do you believe in us yet? No, I don't. This win was impressive - major credit needs to be given to Chicago's defense for slowing down Philadelphia's offense - but I will never trust the combination of Jay Cutler, Mike Martz and their offensive line. Cutler was masterful in this contest, going 14-of-21 for 247 yards and four touchdowns. But there's always a good chance that he'll relapse and have another horrendous performance one of these weeks. The offensive line still isn't very good, and the maniacal side of Mike Martz could always show up. ",
            "2": "Cutler's touchdowns went to Johnny Knox (3-68), Earl Bennett (4-56, 2 TDs) and Greg Olsen (1-9). But it was Matt Forte and Devin Hester who did the most damage. Forte rushed for 117 yards on just 14 carries, while Hester had three receptions for 86 yards. Hester also had some nice punt returns. ",
            "3": "As well as Chicago's defense played, the Eagles could have easily been much more successful on the scoreboard. QB Dog Killer (29-44, 333 yards, 2 TDs, 1 INT) had a tipped pass interception inside the red zone when trailing by one point just before halftime. He also missed a wide-open Brent Celek for a possible touchdown in the first quarter. DeSean Jackson also screwed up, dropping two passes - one in the red zone, and one in the end zone. I also have to criticize Andy Reid for game mismanagement in the fourth quarter. Down 18, Reid had a 4th-and-goal at the 4-yard line. Reid opted to kick a field goal to bring the deficit to within 15, which I don't have a big problem with. However, on the next drive, the Eagles had a 4th-and-goal at the 18. Reid called for another field goal despite the fact that there was 4:52 remaining in regulation. Now, converting a 4th-and-goal from the 18 is pretty improbable, but what the hell was the point of that field goal? Whether the deficit is 15 or 12, the Eagles still needed two touchdowns. There simply wasn't enough time for a meaningless kick like that. ",
            "4": "At any rate, QB Dog Killer's touchdowns went to Celek (3-50) and Jeremy Maclin (4-47). Jackson did nothing but drop passes (2-26), while LeSean McCoy had 136 total yards, thanks to eight catches. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Rams",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "33"
        },
        "comments": {
            "amount": "6",
            "1": "This was a huge victory for the Rams. Yes, the Broncos absolutely stink and are one of the worst teams in the NFL, but prior to this game, Sam Bradford had not been able to win on the road. This was a big step for Bradford, who was nearly flawless, going 22-of-37 for 308 yards and three touchdowns. Bradford's only bad play was breaking a FOX sound machine when he crashed into it while running out of bounds on a scramble. ",
            "2": "Though the score may make it seem like this was a close battle, the Rams pretty much dominated after a quick 10-0 start by Denver. At one point, St. Louis led 33-13, but Kyle Orton mounted a comeback against the Rams' prevent defense. The Broncos did have the ball to potentially tie the contest, but Chris Long dominated the line of scrimmage and destroyed all of Orton's momentum. ",
            "3": "Orton finished with pretty numbers (24-41, 347 yards, 3 TDs), but as indicated, most of the damage was done in junk time. Orton found Brandon Lloyd twice in the end zone; Lloyd had four grabs for 76 yards otherwise. ",
            "4": "Knowshon Moreno also had a great fantasy outing, totaling 56 rushing yards, 62 receiving yards (six catches) and a touchdown. ",
            "5": "As for St. Louis' ground game, I was surprised to see Steven Jackson struggle to run the ball (29-72) against Denver's rush defense, which was ranked 24th coming into this week. ",
            "6": "Danario Alexander returned to the lineup for the Rams, and caught four balls for 95 yards. He's a really physically gifted receiver and could post big numbers as Bradford progresses. Pick him up immediately if he's available in your fantasy league. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "The Chargers are now 5-1 against the Colts in their previous six meetings. That's amazing given how much success Indianapolis' has had in the past decade. Peyton Manning, who once tossed six interceptions against the Chargers in a Sunday night game, went 31-of-48 for 285 yards, two touchdowns and four interceptions (two pick-sixes) in what was his largest home loss in his career. Manning had numerous things go against him - namely some drops by Reggie Wayne (5-42) and a blown non-call on what should have been a pass interference on one of his picks - but it still doesn't change the fact that he struggles against San Diego. Why is this? I may have the answer - and it'll blow your mind. Check back tomorrow in the <b> <a href=/nflpowerrankings.php> NFL Power Rankings</a></b>. ",
            "2": "The Colts had absolutely no running game; Donald Brown registered 24 yards on 11 carries. Manning has to be praying for Joseph Addai (or even Mike Hart) to return soon. ",
            "3": "Philip Rivers took a major step backward in his hunt to break Dan Marino's single-season passing yards record, but was pretty brilliant; Rivers went 19-of-23 for 185 yards, including 11-of-11 for 113 yards in the second half. Rivers' performance is especially spectacular because Antonio Gates (4-46) was hobbling around and Vincent Jackson left the game early with a calf injury. As I tweeted (<a href=https://twitter.com/walterfootball>@walterfootball</a>) during the game, I really have to wonder if Vincent Jackson is faking his calf injury. ",
            "4": "The Chargers did a good job of exposing Indianapolis' last-ranked rush defense; Mike Tolbert gained 103 yards and a touchdown on 26 attempts. Tolbert left for a while in the second quarter with a hand injury, but re-entered the game after halftime. "
        }
    }
}