{
    "year": "2010",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "I'm going out on a limb here, but this battle between an old decrepit quarterback and a young signal-caller making his first start is not going to be re-aired on NFL Network anytime soon. Starting with the young guy, Jimmy Clausen was 16-of-33 for 188 yards and a costly interception inside the red zone. The biggest problem for Clausen was that he and center Ryan Kalil just couldn't get on the same page. There were three botched snaps, and the Panthers lost two of them. Carolina had only two first downs in the opening half. Still, despite Clausen's struggles, the Panthers were driving down the field for a potential game-winning touchdown in the middle of the fourth quarter. However, Jonathan Stewart (8 carries, 13 yards) was guilty of an ugly fumble, which the Bengals recovered. Cincinnati scored a touchdown a couple of plays later to ice this contest. ",
            "2": "As with Joe Flacco last week, Clausen had zero time to throw in this game. Because of this, Steve Smith managed only three receptions for 22 yards. ",
            "3": "DeAngelo Williams rushed 10 times for 64 yards. Stewart had a score in addition to his fumble. On the bright side, Mike Goodson didn't get a single carry; John Fox must have read our interview in the ",
            "4": "As for Carson Palmer, he had another ugly game, going 19-of-37 for 195 yards, one touchdown and two ugly interceptions. Neither Terrell Owens (4 catches, 42 yards) nor Chad Ochocinco (4-34) could do much. ",
            "5": "Jermaine Gresham actually paced the Bengals in receiving with four grabs for 59 yards. The other rookie, Jordan Shipley, had three catches for 37 yards. ",
            "6": "Cedric Benson was easily Cincinnati's most effective offensive player, gaining 81 yards and a touchdown on 27 carries. He also had another receiving score. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "It looked like it was going to be a long day for the Steelers. Charlie Batch tossed an ugly interception on the first drive, setting up the Buccaneers with a field goal. Batch went on to finish the first half 11-of-14 for 177 yards, three touchdowns and that pick. He barely threw in the second half because Pittsburgh had such a huge lead. Batch was incredible, and it makes me wonder why Pittsburgh even started Dennis Dixon in those first two games. Batch connected on a pair of long bombs to Mike Wallace (3 catches, 100 yards, 2 TDs), as the Buccaneers were definitely feeling the loss of safety Tanard Jackson. This opened up massive running lanes for Rashard Mendenhall, who had 143 yards and a touchdown on 19 carries. ",
            "2": "Hines Ward scored Batch's other touchdown, finishing with three grabs for 34 yards. ",
            "3": "Josh Freeman got his first taste of Dick LeBeau's defense, and I bet he's glad that he only has to face Pittsburgh's defense once every four years. Freeman was 20-of-31 for 184 yards and an interception. He was sacked four times. ",
            "4": "Stud rookie receiver Mike Williams didn't score for the first time all year, but still managed five catches for 55 yards. ",
            "5": "Cadillac Williams had only six carries for 13 yards. LeGarrette Blount - yes, the same guy who threw that punch in the Boise State game a year ago - led the Buccaneers with 27 yards and six attempts. He also scored. Blount looked very good, showing a nice burst to go along with his impressive power. He's worth picking up in your fantasy leagues this week. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "30"
        },
        "comments": {
            "amount": "6",
            "1": "Well, the good news for the Patriots is that Tom Brady, Randy Moss and Tom Brady's hairdo are clicking on offense. They posted 38 on the Bills, as Brady went 21-of-27 for 252 yards and three touchdowns, two of which went to Moss (2 catches, 42 yards). The bad news is that New England's defense is garbage. The Bills totaled 374 yards of offense. They converted 5-of-10 third downs, including a 3rd-and-18 in the first half. Ryan Fitzpatrick went 20-of-28 for 247 yards, two touchdowns and a pair of interceptions. ",
            "2": "Fitzpatrick's touchdown went to Steve Johnson (3 catches, 66 yards). Roscoe Parrish somehow notched five receptions for 83 yards. Lee Evans also had five grabs for 54 yards. ",
            "3": "C.J. Spiller was once again underutilized; the No. 9 overall pick was given seven touches. Four were carries for 29 yards. The three receptions went for only 10 yards, though one was a touchdown. Spiller also had a kickoff returned for a score in the third quarter. It might be possible that Chan Gailey forgot Spiller was such a high pick. Why isn't he getting more touches? Marshawn Lynch is looking good (13 carries, 79 yards), so Buffalo fans have to be hoping that the front office can trade him so Spiller can be more involved on offense. ",
            "4": "As for the Patriots' running backs, Fred Taylor had just six carries. He left the game early with an injury and gave way to BenJarvus Green-Ellis, who totaled 98 yards and a score on 16 yards. Green-Ellis has to be the New England runner to own now, while Taylor can be dropped. ",
            "5": "Aaron Hernandez paced the Patriots with six catches for 65 yards. He's great in the open field, and has become a huge part of New England's offense. He must be owned in all leagues. ",
            "6": "The Patriots' other rookie tight end, Rob Gronkowski, had six grabs for 43 yards and a touchdown. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "This game was a complete reversal for the Ravens compared to how they played against the Bengals last week. In that contest, it was absolutely no offense and all defense (though the team dropped two easy interceptions). In this victory, Joe Flacco carried a struggling stop unit. Flacco went 22-of-31 for 262 yards and three touchdowns, all of which were to Anquan Boldin (8 catches, 142 yards). It's amazing how much better an offense can work when it's not battling a fierce defense like the Jets or Bengals. All of the concerns regarding Flacco in the wake of last week's loss were clearly overblown. ",
            "2": "Ray Rice had 15 carries for 80 yards, and four catches for 16 receiving yards. However, he suffered a knee injury on the antepenultimate drive of the game. It reportedly isn't too serious, but Rice could miss next week's game. ",
            "3": "As for Baltimore's defense, it simply had no answer for Peyton Hillis. The tough Browns runner rumbled for 144 yards and a touchdown on 22 carries. He also had seven catches for 36 receiving yards. ",
            "4": "Hillis' successful running made things easy for Seneca Wallace, who went 18-of-24 for 141 yards and a score. Despite those numbers, however, only four Browns caught passes, led by Joshua Cribbs (5-58). Mohamed Massaquoi was not one of them. ",
            "5": "Cleveland put forth a great effort in this contest, but fans have to be frustrated with how the game ended. The Browns didn't even give themselves a chance because they jumped offsides on 3rd-and-4 with two minutes and no timeouts remaining, allowing Baltimore to kneel down three times. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "31"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "Talk about putting all of your eggs in one basket. The 49ers focused entirely on that Monday night game against the Saints. They lost in the final seconds, and showed up completely flat in Arrowhead. Despite racking up 417 yards against New Orleans, the 49ers mustered just a field goal until garbage time. They had only four first downs in the first half to Kansas City's 13. They converted just 4-of-17 third downs, and allowed the Chiefs to accumulate five sacks. ",
            "2": "I don't want to take anything away from the Chiefs though. They were very impressive defensively, holding Frank Gore to just 43 yards on 15 carries. Alex Smith (23-of-42, 232 yards, 1 TD, 1 INT) had absolutely no time to throw. Tamba Hali sacked Smith on three occasions. ",
            "3": "Matt Cassel also played well for the first time all year. He went 16-of-27 for 250 yards, three touchdowns and an interception. Cassel's first score was all Dexter McCluster, who led the team with 69 receiving yards off three catches. Cassel's second touchdown was a flea flicker out of the Wildcat to Dwayne Bowe (2 catches, 61 yards). The third was a great throw to Tony Moeaki (4-44), who made an outstanding one-handed grab. ",
            "4": "Jamaal Charles once again had fewer carries than Thomas Jones. Despite this, Charles had more rushing yards - which shouldn't surprise anyone except for Todd Haley. Charles turned 12 rushes into 97 yards, while Jones had 19 attempts go for 95 yards and a score. Charles also had three catches for 57 receiving yards. ",
            "5": "As for San Francisco, Gore was able to save his fantasy day with nine catches for 102 receiving yards. He was the only 49er to have more than three catches, including Michael Crabtree (3-37) and Vernon Davis (3-22). "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "The Cowboys and Vikings needed to win today. Both got the job accomplished, but Dallas easily looked more impressive, as they dominated undefeated Houston on the road. ",
            "2": "Tony Romo was the third quarterback in three weeks to torch Houston's secondary. He didn't get to 400 yards like Peyton Manning and Donovan McNabb, but that's because Dallas led throughout. Romo finished 23-of-30 for 284 yards and two touchdowns. ",
            "3": "Both of Romo's scores sadly went to the useless Roy Williams, who actually put forth some effort today. Williams caught five balls for 117 yards. ",
            "4": "Jason Witten had seven grabs for 56 yards. Miles Austin-Jones didn't do much (2-20), while Dez Bryant (4-50) nearly came up with two touchdowns of his own. Bryant caught a pass in the end zone, but was pushed out of bounds in mid-air by the defender, which ruled the play incomplete. Bryant later had a long run for a touchdown, but that was wiped out by a penalty. ",
            "5": "Tom Jackson won't have an aneurysm this week because the Cowboys actually ran the ball for a change. Dallas gave 26 carries to Marion Barber, Felix Jones and Tashard Choice, most of which went to the former (17 rushes, 55 yards, TD). Felix Jones had seven attempts for 43 yards. ",
            "6": "Matt Schaub struggled, though that's understandable because he didn't have his left tackle against Dallas' superb defense. Schaub went 23-of-32 for 241 yards, one touchdown and two interceptions. DeMarcus Ware fully took advantage of the hole on Schaub's blind side, as he racked up three sacks. ",
            "7": "Andre Johnson led Houston's receivers with four catches for 64 yards despite not being 100 percent. Johnson left the game briefly after re-injuring his ankle. ",
            "8": "Arian Foster was the one bright spot for the Texans' offense; he had 106 yards on 17 carries, along with four catches for 20 receiving yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "As mentioned, the Vikings were easily the least impressive of the two 0-2 squads that had to come away with a victory in Week 3. Minnesota may have won this contest, but it was definitely a lot closer than it should have been. The 14-point spread is misleading; the game was 14-10 at halftime, and the Vikings outgained the Lions by only about 70 yards. Minnesota played a sloppy game. Brett Favre tossed two interceptions, and had a third wiped out by an unrelated penalty. Moreover, the Vikings as a whole had a whopping 12 penalties, including three on one drive in the first quarter. ",
            "2": "Favre finished 23-of-34 for 201 yards, one touchdown and those two picks. His score went to Percy Collard Kector Harvin, who had six grabs for 62 yards. ",
            "3": "The Vikings really leaned on Adrian Peterson to literally carry them to victory. Peterson mustered 160 yards and two touchdowns on 23 attempts. He also had five catches for 30 receiving yards. ",
            "4": "Minnesota did a great job neutralizing Jahvid Best and Calvin Johnson. Best was limited to just 26 yards on seven attempts, as he sat out most of the entire second half with a toe injury. Johnson registered six catches for 56 yards. ",
            "5": "Shaun Hill had a decent performance, going 29-of-43 for 237 yards, one touchdown and two interceptions in the end zone during garbage time. He really utilized his tight ends, as Tony Scheffler (7 catches, 60 yards, TD) and Brandon Pettigrew (6-44) both posted solid numbers. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "When the schedule came out, the Falcons circled this game. They lost two close contests to the Saints last year, so they saw this NFC South clash as a measuring stick to see how good they are. I imagine that everyone in Atlanta is pleased with the result. ",
            "2": "If you're a fan of old-school, pound-the-rock football, you loved what the Falcons did in New Orleans. Atlanta ran the ball 44 times, which allowed them to win the time-of-possession battle by about 18-and-a-half minutes. On one impressive possession, the Falcons held the ball for almost 12 minutes. They converted back-to-back fourth downs on the drive and eventually scored a touchdown. Mike Smith deserves a ton of credit for eschewing a field goal attempt on those two occasions. Michael Turner had 30 of Atlanta's 44 carries, and turned those attempts into 114 yards and a touchdown. Jason Snelling had 62 yards on 14 rushes. ",
            "3": "Matt Ryan had an excellent game, going 19-of-30 for 228 yards and two scores. He also scrambled six times for 26 rushing yards. Ryan's scores went to Tony Gonzalez and Roddy White (5 catches, 69 yards). Gonzalez silenced all critics (including myself) who speculated that he might be done after two poor games. Gonzalez hauled in eight balls for 110 yards. ",
            "4": "Drew Brees went 30-of-38 for 365 yards, three touchdowns and two picks. He did well enough to set the Saints up with a game-winning field goal in overtime, but Garrett Hartley uncharacteristically blew a chip-shot 29-yarder in overtime. Sean Payton actually mentioned Hartley's missed kick in the post-game press conference as a reason for why his team lost. Perhaps Payton forgot the instance where he foolishly gave scrub running back Chris Ivory a fourth-down carry instead of Pierre Thomas (9 carries, 30 yards; 6 catches, 61 rec. yards). Ivory coughed up the football. ",
            "5": "People who watched this game witnessed the rebirth of Lance Moore. As in 2008 when Reggie Bush got hurt, Moore became a huge part of the offense, catching six balls for 149 yards and two touchdowns. ",
            "6": "While Marques Colston did nothing (4-25), Jeremy Shockey notched eight receptions for 78 yards and a score. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Rams",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "16"
        },
        "comments": {
            "amount": "4",
            "1": "With a matchup against his old team next week, Donovan McNabb had every reason to look past the winless Rams. McNabb wasn't the problem in this loss; the defense simply let him down. St. Louis totaled 365 yards of offense. They converted 7-of-16 third downs. The Rams ran the ball at will; Steven Jackson notched 58 yards and a touchdown on 10 carries, while Kenneth Darby registered 49 yards and a score on 14 attempts. Darby entered the game after Jackson left with a groin injury. It does not look good for Jackson, as Adam Schefter reports that the Rams may bring in Larry Johnson as insurance. Jackson simply cannot stay healthy, which is why I recommend passing on him in the first two rounds of fantasy drafts this summer. ",
            "2": "Sam Bradford played extremely well, going 23-of-37 for 235 yards, a touchdown and an interception. He once again looked Mark Clayton's way early and often; Clayton caught five balls for 85 yards. ",
            "3": "As mentioned, McNabb did not cost the Redskins this win. He went 19-of-32 for 236 yards, a touchdown and a pick. It seemed like McNabb was taking deep shots on nearly every throw, which makes his completion percentage rather impressive. One of McNabb's bombs (56 yards) connected with Santana Moss, who had six grabs for 124 yards and a touchdown. Chris Cooley, meanwhile, had five catches for 53 yards. ",
            "4": "I thought Clinton Portis would have a pretty good performance. Well, he managed 44 yards, but only had seven carries because the Redskins trailed throughout. Interestingly, Ryan Torain also had seven rushes. Torain managed 46 yards, but 36 of those had on one attempt. Torain may overtake Portis eventually, so he's worth stashing in deeper fantasy leagues. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "I received an AIM message from my doctor friend Val on late Sunday afternoon: qb dog killer is awesome! QB Dog Killer was indeed as awesome as a deranged psychopath could possibly be. He went 17-of-31 for 291 yards and three touchdowns, and made really impressive throws all afternoon. He also had 30 rushing yards and a fourth touchdown on the ground. Like Detroit, the Jaguars possess an awful secondary, so Kevin Kolb arguably could have done just as well as Andy Reid's pet project. QB Dog Killer will face a much tougher test next weekend against the Redskins. ",
            "2": "With QB Dog Killer commanding attention from Jacksonville's defense, LeSean McCoy had a ton of running room on the rare occasion he was given a carry. McCoy had just 11 rushes, but managed 54 yards in the process. ",
            "3": "QB Dog Killer's touchdowns went to DeSean Jackson and Jeremy Maclin, as Brent Celek, Kolb's BFF, was once again predictably ignored. Jackson hauled in five balls for 153 yards and a score, while Jeremy Maclin managed four receptions for 83 yards and two touchdowns. ",
            "4": "Philadelphia's much-maligned defense silenced some of its critics in this victory. The Eagles limited the Jaguars to just 184 net yards, and sacked David Garrard six times. Garrard really struggled, going 13-of-30 for 105 yards and an interception. ",
            "5": "Mike Sims-Walker led the Jaguars in receiving with 34 yards off two catches. Marcedes Lewis had three grabs for only 15 yards. ",
            "6": "It's been three weeks, and Maurice Jones-Drew still doesn't have a touchdown. He totaled 88 yards on 22 carries in this contest. You have to give Jack Del Rio and offensive coordinator Dirk Koetter credit for sticking with the run despite being down the whole game. If anything, depressed Jones-Drew owners can take solace that Del Rio and Koetter won't completely forget about their RB1 if the Colts establish an early lead next week. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "In the wake of receiver Kenny McKinley's suicide, I had no idea what to expect from the Broncos. Would they give a spirited performance like the Bengals last year (Chris Henry), or understandably be completely flat like Redskins in 2007 (Sean Taylor)? Well, despite the two-touchdown loss, Denver was very solid. But in addition to being overmatched against an elite Colts team, the Broncos had way too many failed trips in the red zone. Laurence Maroney couldn't get into the end zone on 4th-and-goal in the second quarter. At the end of the game, Denver gave the ball up on downs on back-to-back possessions inside the Indianapolis 20. ",
            "2": "Kyle Orton went 37-of-57 for 476 yards, one touchdown and an interception. His score was a beautiful 48-yard bomb to Brandon Lloyd. Lloyd put on a monstrous performance, catching six balls for 169 yards and that score. Jabar Gaffney also posted big numbers (12 catches, 140 yards) despite the presence of Demaryius Thomas. Thomas had two grabs for 43 yards, and almost pulled in a touchdown. However, Thomas suffered a hand injury at the end of the game. ",
            "3": "With Knowshon Moreno out, Laurence Maroney got the start. It wasn't pretty. Maroney had just 24 yards on 12 carries, as well as two catches for 40 receiving yards. Correll Buckhalter had just four rushes. ",
            "4": "Peyton Manning was his usual self, going 27-of-43 for 325 yards and three touchdowns. He shied away from Reggie Wayne (4 catches, 65 yards), who was blanketed by Champ Bailey. Instead, Austin Collie (12-171, 2 TDs) dominated. As for Manning's other targets, Dallas Clark had five grabs for 44 yards. Rookie Blair White stepped in for an injured Pierre Garcon, and recorded three catches for 27 yards and a score. ",
            "5": "Like the Broncos, the Colts struggled to run the ball. Joseph Addai mustered just 29 yards on 13 attempts. Donald Brown didn't get many touches until late in the game when the Colts had a 14-point lead. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "The Raiders had this game won. With four seconds remaining, Bruce Gradkowski led his team down to Arizona's 14-yard line. Sebastian Janikowski was faced with a 32-yard field goal to clinch Oakland's second victory of the season. Janikowski, to the chagrin to the undead, was wide left. The lesson, as always: Don't spend first-round picks on kickers! ",
            "2": "Gradkowski completed only 50 percent of his passes (17-of-34), but threw for 255 yards, a touchdown and an interception. The Polish Point-Shaver showed a great rapport with Louis Murphy (5 catches, 119 yards) and Zach Miller (4-64, TD). Darrius Heyward-Bey, meanwhile, had three grabs for 49 yards, but looked much worse than those numbers indicate. ",
            "3": "Michael Bush returned to action, but saw only three carries. Darren McFadden once again shouldered the load and continued to dominate; he tallied 105 yards and a score on 25 attempts. It's amazing how he's turned his career completely around after two lost seasons. ",
            "4": "The worse quarterback won this matchup; Derek Anderson drunkenly went 12-of-26 for 122 yards, two touchdowns and an interception. One of Anderson's scores went to Larry Fitzgerald, who could only muster two catches for 26 yards. Nnamdi Asomugha completely shut him down. Anderson's other touchdown went to Steve Breaston, who paced Arizona with four grabs for 41 yards. ",
            "5": "Tim Hightower is clearly being phased out of the game plan. He had 11 carries for 40 yards, but played second fiddle to Chris Wells, who notched 75 yards on 14 attempts. Wells looked great, showing a nice burst and even leaping over an Oakland defender on one play. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "In the movie Groundhog Day, Bill Murray woke up and re-lived the same day over and over again. Every time Norv Turner goes on the road, he re-lives the same game over and over again. Let's just hope he doesn't electrocute himself in the bath tub one of these weeks. Every Chargers road game is the same. They suffer untimely fumbles (three lost fumbles, including Mike Tolbert coughing it up in the red zone). They screw up on special teams (Leon Washington scored twice on kickoffs with 101- and 99-yard returns). And their final drive in an attempt to either tie the contest or take the lead ends up badly. ",
            "2": "In a losing effort, Philip Rivers set the single-game passing record for the Chargers, as he went 29-of-53 for 455 yards, two touchdowns and a pair of interceptions. Rivers' scores went to Antonio Gates (7 catches, 109 yards) and Malcom Floyd (6-97). ",
            "3": "Aside from the aforementioned fumble, Mike Tolbert ran the ball well at Seattle. He totaled 73 yards on 17 carries. The Chargers just couldn't keep the ball on the ground as much as they wanted to because they were trailing throughout. ",
            "4": "Matt Hasselbeck was a solid 19-of-32 for 220 yards, one touchdown and an interception. Hasselbeck should have thrown a second score, but Deion Branch (5-60) fumbled at the 1-yard line, and the ball went out of the back of the end zone. ",
            "5": "John Carlson paced the Seahawks with five catches for 61 yards and a touchdown. Golden Tate had four grabs for 33 yards. Mike Williams had just two receptions for 35 yards. ",
            "6": "No running back committee for Pete Carroll against the Chargers. Justin Forsett had 17 carries for 63 yards. Meanwhile, Leon Washington had one rushing attempt, while Julius Jones didn't touch the ball at all. It took only three games, but Carroll has already proved to us that he's a billion times the coach that Jim Mora Jr. was. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Jets",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "Mark Sanchez and Chad Henne tend to struggle more often than not, but for some reason, they play like Pro Bowlers whenever they battle each other. After a rough opener against the Ravens, Sanchez picked up where he left off in a solid performance against the Patriots last week. He went 15-of-28 for 256 yards and three touchdowns at Miami. He made a number of impressive throws, but was inches away from making multiple costly errors. He had two interceptions dropped by Jason Allen and Kendall Langford. The Langford near-pick was terrible in particular; Sanchez just tossed it to the defensive lineman, who wasn't expecting such an easy would-be interception to come his way. Henne went 26-of-44 for 363 yards, two touchdowns and an interception at the very end of the game. Despite the loss, his performance has to be encouraging to Dolphins fans who watched Henne struggle in the first two weeks. ",
            "2": "Brandon Marshall had a monstrous outing, catching 10 balls for 166 yards and a touchdown. The Jets simply had no answer for the massive wideout, and they clearly missed Darrelle Revis. Henne's other receivers stepped up as well; Davone Bess had six grabs for 86 yards, while Brian Hartline snagged five balls for 84 yards. ",
            "3": "The Dolphins were down most of this contest, so they could only run the ball 18 times with Ronnie Brown and Ricky Williams. Brown had 54 yards on 11 carries, while Williams notched 28 yards on seven attempts. ",
            "4": "The Jets, meanwhile, gave 25 carries to LaDainian Tomlinson and Shonn Greene. Greene (10-36) didn't do much, but Tomlinson (15-70, TD) continued to excel as New York's best back. ",
            "5": "Braylon Edwards sat out the entire first quarter. Dustin Keller stepped up in his absence, catching six balls for 98 yards and two touchdowns. Edwards had two receptions, but took one 67 yards for a score. His other catch was for 20 yards. ",
            "6": "This game was frustrating to watch, as the NFL celebrated the agonizing Spanish Heritage Month. I'll have a rant on this in my "
        }
    },
    "numberOfGames": "14"
}