{
    "year": "2010",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Despite the Ravens win, they are still just the No. 5 seed because Pittsburgh destroyed the Browns. Still, this 13-7 victory is at least somewhat significant because Baltimore avenged a strange loss to Cincinnati back in Week 2. Joe Flacco went 14-of-19 for 125 yards and an interception in the two-minute drill. His favorite targets were Todd Heap (3-53) and Derrick Mason (3-34). Anquan Boldin (2-9) once again did absolutely nothing statistically. ",
            "2": "If the Ravens don't win the Super Bowl this season, it might be because of something stupid that offensive coordinator Cam Cameron does. Cameron, who has already taken tons of flack for not running the ball with a lead to keep the clock moving in several games, failed to feature Ray Rice early on. Rice finally got the ball in the second half, but this was when the Steelers were already up big on Cleveland. It's almost as if Cameron thought, We have no chance of getting the bye. Let me use my best player now! ",
            "3": "Pass protection also has to be an issue for Baltimore. Flacco took four sacks. ",
            "4": "Carson Palmer went 32-of-45 for 305 yards and a touchdown, but turned the ball over three times (2 interceptions, 1 fumble), though one pick wasn't his fault because the ball bounced out of Jordan Shipley's hands. Palmer missed a wide-open receiver for a potential touchdown on fourth down to close out the game. Having said that, Palmer performed admirably overall. Battling Baltimore's tough defense with Jerome Simpson as a No. 1 receiver is no easy task. ",
            "5": "Speaking of Simpson, he probably will be taken somewhat highly next year in fantasy drafts. Simpson caught 12 balls for 123 yards and a touchdown, but fumbled twice. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "In the wake of this victory, the Steelers clinched the No. 2 seed. With a plethora of injuries, they desperately needed a week off. ",
            "2": "This game was over in two plays. The Browns were looking good on their opening drive. Unfortunately for Eric Mangini (who will be unemployed soon), Colt McCoy's pass intended for Ben Watson was dropped and picked off by Troy Polamalu. On the next play, Ben Roethlisberger put his team on the board with a 56-yard bomb to Mike Wallace. ",
            "3": "Pittsburgh looked great, but Cleveland really helped them clinch the AFC North by playing stupid football throughout the afternoon. On defense, they constantly left Steelers receivers wide open. On one play, the middle of the field was abandoned, allowing Roethlisberger to move the chains on a third down. Later, two players committed encroachment on a third-and-long, which led to a Pittsburgh touchdown. On offense, the Browns allowed the Steelers to beat McCoy into the ground. I'm not exaggerating when I say that McCoy (20-of-41, 209 yards, 1 TD, 3 INTs) was hit on almost every play. Meanwhile, Mohamed Massaquoi may have set the record for most unfinished routes in a single game. ",
            "4": "Obviously hobbling, Peyton Hillis had just six carries for 13 yards. McCoy sadly led the team with 19 rushing yards. ",
            "5": "As indicated, Roethlisberger had a great afternoon, going 15-of-22 for 280 yards and two scores. Rashard Mendenhall (14-36) also found the end zone twice. ",
            "6": "Speaking of finding the end zone, Wallace (3-105), Heath Miller (4-55) and Hines Ward (5-45) all scored touchdowns. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Lions",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Vikings made history today. They became the first team in NFL history to lose twice in Detroit in the span of just four weeks. Sure, they were struggling on very short rest and essentially playing their fourth road game in a row, but this was completely inexcusable. ",
            "2": "In all seriousness, thank God Brett Favre didn't play in this contest. Otherwise, we'd have to hear ESPN say how heroic he is for battling through a concussion to start his final game. His final game until September 2011, that is, when he'll be starting for the Dolphins, 49ers, Redskins or some other sorry team. ",
            "3": "Favre's replacement, Joe Webb, wasn't as sharp in this game as he was Tuesday night. He went 20-of-32 for 141 yards and a very ugly pick in which he threw late over the middle. ",
            "4": "Detroit outgained Minnesota, 357-211. Adrian Peterson didn't run well (14-31) and was actually out-rushed by Jahvid Best (10-34). Best also caught six passes. ",
            "5": "The Lions' other prominent rookie, Ndamukong Suh, registered his 10th sack of the season. That number is amazing for a defensive tackle; let alone a first-year player. ",
            "6": "Shaun Hill had another decent outing, going 28-of-39 for 258 yards, one touchdown and a pick without Calvin Johnson. This 6-10 season could have been much better for the Lions had Matthew Stafford been healthy, but at least Detroit knows it has a reliable backup signal-caller if Stafford gets hurt yet again next year. Lions fans have a lot to look forward to next season. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "As I've been saying all year, the Chiefs are a farce. They haven't beaten a single playoff team, aside from the Seahawks, who really don't count for obvious reasons. Good teams don't lose by 20 to the four-win Broncos. Good teams don't get blown out at home by 8-8 teams. If only the stupid Chargers showed up at Cincinnati last week, we'd have 11 legitimate teams in the playoffs. ",
            "2": "Matt Cassel was even worse than his numbers indicate. He went 11-of-33 for 115 yards and two picks (one returned for a touchdown). He also had an easy interception dropped by an Oakland linebacker on the first drive. And it's not like Cassel didn't have all his weapons. Jamaal Charles (14-87, TD) played, though Todd Haley inexplicably used Thomas Jones exclusively on the first drive. If that happens in the postseason, Kansas City will definitely be one and done. Cassel was constantly under pressure, as the Chiefs had no answer for the Raiders' pass rush. He was sacked seven times, thrice by Kamerion Wimbley. ",
            "3": "It's amazing that the Raiders sweeped this weak division, yet missed the playoffs. Darren McFadden didn't even play, as Michael Bush took advantage of his absence and had yet another huge Week 17 (25-137, TD). ",
            "4": "Jason Campbell suffered an injury in the first quarter and had to leave the game temporarily. He came back strong to go 15-of-25 for 155 yards and a score to Chaz Schilens, who beat a disappointing Eric Berry in the end zone. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "If you're wondering why Tom Brady played two-and-a-half quarters, it's because Bill Belichick knows that benching your starters with a bye week looming can be disastrous. Yes, it didn't hurt the Saints and Colts last year, but they were the rare exception; not the rule. Brady finished 10-of-16 for 199 yards and two touchdowns despite not having Wes Welker and Deion Branch at his disposal. Brady targeted Rob Gronkowski (6-102, TD) early and often. ",
            "2": "BenJarvus Green-Ellis played far longer than Brady, as he continued to get work in the fourth quarter. Belichick's reasoning? He wanted the Law Firm to eclipse the 1,000-yard rushing barrier. He did so by gaining 80 yards and a touchdown on 20 carries. ",
            "3": "As for the Dolphins, Chad Henne was benched in the first half because he sucked as usual. Henne reentered shortly afterward, but was benched yet again in the third quarter. He went 6-of-16 for 71 yards and an interception in what is sure to be his final game as Miami's starting quarterback. Offensive coordinator Dan Henning will also be gone next year. Henning, easily the worst play-caller in the NFL, used the triple option in this game as a last hurrah. Adios, Henning. ",
            "4": "Ronnie Brown needed 30 rushing yards to reach 750 on the season. Why is this significant? Brown was due $500,000 if he could reach that benchmark. Unfortunately for Brown's wallet, he had just 14 yards on six carries. I'll have more on this in the <a href=/nflpowerrankings.php> NFL Power Rankings</a> tomorrow. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "13"
        },
        "comments": {
            "amount": "3",
            "1": "Look, this game meant absolutely nothing to the Saints as of about 1:30 Eastern time. With the Falcons up big, New Orleans was essentially locked into the No. 5 seed. So, while the Saints were up 7-3, it's understandable why they relented in the middle of the second quarter and sat Drew Brees and company in the final 10 minutes despite it being a one-score game. However, New Orleans fans should be really concerned. For one, Marques Colston just had his knee scoped, so even if he can play next week, he won't be very effective. Second, Chris Ivory suffered an ankle injury in this contest. With Pierre Thomas also nursing an ankle injury, it doesn't look like the Saints will be able to run the ball well this January. The next running back up? Julius Jones. Jones fumbled almost immediately, forcing Sean Payton to ride Reggie Bush. Bush looked good at times, but that's not surprising given how banged up Tampa's defense is. He had 70 yards on just nine carries. ",
            "2": "Brees went 22-of-38 for 196 yards, one touchdown and a pick that wasn't his fault (Lance Moore fell down). ",
            "3": "As for the other quarterback, Josh Freeman was amazing. He went 21-of-26 for 255 yards and two touchdowns. On one of the scores, Freeman faked a quarterback sneak, pulled back into the pocket and launched an 18-yard jump ball to Mike Williams (4-40, TD). Though the Buccaneers didn't make the playoffs, their fans have plenty of reason to be optimistic for 2011. Freeman will be even better in his third season, while the defense will welcome back Gerald McCoy, Aqib Talib and Tanard Jackson, all of whom have been out for a while. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "7"
        },
        "comments": {
            "amount": "2",
            "1": "This was the most pathetic performance I've seen by a team in a long time. The Jets didn't care at all about winning this game, yet they walked all over the Bills. Literally. New York's first drive was comprised of zero passes and 10 runs, yet they still scored. The Jets outgained the Bills, 388-162. Buffalo had no answer for Mark Brunell (6-12, 110 yards, 2 TDs, 1 INT) and Joe McKnight (32-158). And Brian Set Up Us The Brohm was absolutely miserable (10-23, 106 yards, 3 INTs). Remember when he was considered to be a top-10 NFL Draft prospect, and some sun-tanned analyst said he would be better than Aaron Rodgers? Yeeeesh. ",
            "2": "There's no use delving into this game. Even with the victory, the Jets are still the No. 6 seed. The Bills, meanwhile, improved their draft status with this humiliating loss. Unfortunately, they're way to late with this strategy. They've already missed out on Andrew Luck. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "28"
        },
        "comments": {
            "amount": "4",
            "1": "Way to not show up at Cincinnati last week, Chargers. Thanks to that careless defeat, you're going to watch a crappy Chiefs team host a playoff game this postseason. Oh, and congrats on not firing Norv Turner. We all look forward to your horrible September start in nine months. ",
            "2": "The box score says this game was close, but it really wasn't. The Chargers led 33-14 in the fourth quarter and outgained Denver, 257-84, in the first half. ",
            "3": "The Broncos had no answer for Ryan Mathews, who rushed for 120 yards and three touchdowns on 26 carries. Philip Rivers, meanwhile, went 21-of-37 for 313 yards and a pick. ",
            "4": "Tim Tebow had his ups and downs in his third NFL start. He went 16-of-36 for 205 yards, two touchdowns and a pair of interceptions, one of which was carelessly tossed into double coverage. However, Tebow also rushed for 94 yards and a third score, as he nearly led an impressive comeback. Blame interim head coach Eric Studesville for myopically eschewing two-point conversions down 16. Instead of aptly attempting a pair of Hail Marys, Tebow could have set up the Broncos with a potential game-tying field goal had he hit the pair of two-pointers. Still, Tebow gives Denver fans reason for optimism in 2011. One of the CBS announcers predicted that Tebow will be enshrined in the Broncos' ring of honor in 15 years. The other was mildly skeptical, saying that he needs to see more. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Packers",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "Numerous Bears fans complained that I had the Packers way above Chicago in my <a href=/nflpowerrankings.php> NFL Power Rankings</a> last week. This wasn't the convincing win I thought Green Bay would achieve in a win-and-in situation, but the Packers will take it. Despite all the injuries they've incurred this season, they clinched a playoff berth and will battle the Eagles again next weekend. ",
            "2": "The Packers struggled on offense the entire afternoon. Though they outgained the Bears by about 60 yards, they mustered just 284 yards of offense. Aaron Rodgers (19-of-28, 229 yards, TD, INT) actually led the team in rushing with 21 yards on seven scrambles. He was constantly under pressure, as the two sacks he took aren't indicative of the pass rush he endured. ",
            "3": "I feel like I've been saying this every week: I'd like to see James Starks get more carries for the Packers. He rushed for 20 yards on just five carries. Brandon Jackson (7-19) struggled, even dropping an easy pass that would have given his team a first down. ",
            "4": "Speaking of drops, Greg Jennings had two deep balls fall through his hands (not that there's anything wrong with that) that would have at least set up the Packers with a pair of field goals. Jennings caught four balls for 97 yards. ",
            "5": "Like Rodgers, Jay Cutler was constantly under siege. He went 21-of-39 for 168 yards and two interceptions, taking six sacks in the process. Considering the beating that Cutler was taking, you have to wonder why Lovie Smith didn't pull his quarterback in the second half. ",
            "6": "Matt Forte carried Chicago's stagnant offense. He rushed for 91 yards on 15 carries, and also caught six balls for 60 receiving yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "You really had to feel sorry for the Jaguars. With the Colts struggling to pull away from the Titans the entire afternoon, Jack Del Rio stood helpless on the sidelines watching Trent Edwards struggle against the worst defense in football. Edwards had just two completions in the first half (2-of-6). He finished 12-of-25 for 117 yards, one touchdown and an interception. David Garrard, meanwhile, phoned into the CBS broadcasting team in the second quarter. It was really strange hearing him talk on the phone while his team was playing. ",
            "2": "The Jaguars were able to stick around for a while with a strong running game despite not having Maurice Jones-Drew. In the first half alone, Rashad Jennings and Deji Karim combined for 139 yards on 21 carries. However, the two backs concluded this contest with 160 yards on 29 attempts, so credit Houston for clamping down on the rush after intermission. ",
            "3": "As for the Texans, Arian Foster won the rushing title. He ran for 180 yards and two touchdowns on 31 carries, giving him 1,616 rushing yards on the year. ",
            "4": "Another significant number: By going 18-of-22 for 253 yards and a touchdown (without Andre Johnson), Matt Schaub became the sixth player in NFL history to throw for 9,000-plus yards in the span of two seasons. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Colts fans were probably close to suffering a heart attack during this close AFC South battle Sunday afternoon. As it turns out, Indianapolis didn't even need to win this game, securing a playoff berth in the wake of Jacksonville's loss to Houston. ",
            "2": "This is a weird stat, though very explainable: Peyton Manning attempted 41 passes (27-of-41, 264 yards, 2 TDs), but only four Colts caught a pass. Predictably, they were Pierre Garcon (7-78, TD), Reggie Wayne (9-68, TD), Jacob Tamme (7-67) and Blair White (4-51). With no Austin Collie, Anthony Gonzalez or Dallas Clark, Manning just doesn't have anyone else to throw to. ",
            "3": "Indianapolis ran the ball well once again. Both Dominic Rhodes (11-48) and Joseph Addai (11-44) gained at least four yards per carry. ",
            "4": "As mentioned, this was a tight game throughout. The Colts outgained the Titans by only 17 yards (358-341) even though Chris Johnson was ineffective on the ground (20-39). Johnson salvaged his fantasy day - for the 20 people out there who are crazy enough to have a Week 17 championship - with six catches for 51 receiving yards and a touchdown. ",
            "5": "Kerry Collins had his best statistical day as a Titan, going 28-of-39 for 300 yards and a pair of touchdowns (the other to Kenny Britt; 5-85). Collins played like a drunkard last week, so even though this was Tennessee's Super Bowl, Colts fans should be concerned with their pass defense. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "13"
        },
        "comments": {
            "amount": "3",
            "1": "Philadelphia was locked into the No. 3 seed going into the weekend. They just didn't know their opponent. In the wake of Sunday's events, the Eagles will have a rematch with the Packers, who beat them in Week 1. ",
            "2": "Andy Reid has always sat his starters in meaningless games throughout his tenure in Philadelphia. This game was no different. DeSean Jackson, Brent Celek, LeSean McCoy and a hobbled QB Dog Killer all sat out. Instead, Kevin Kolb started. He went 18-of-36 for 162 yards, one touchdown and three interceptions. He had a long pass dropped by backup tight end Clay Harbor and was constantly under pressure. Without his usual play-makers, Kolb had no chance. His leading receiver was Chad Hall (6-84, TD), which is probably the first time I ever mentioned that guy's name on this Web site. ",
            "3": "As for Stephen McGee, he was an unimpressive 11-of-27 for 127 yards and a touchdown with 55 rushing yards on nine scrambles, but once again led a late, fourth-quarter comeback. If, however, McGee played against Philadelphia's starters, there would have been no game-winning touchdown to Jason Witten (4-46, TD). "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "49ers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "The Cardinals are pathetic. I thought the 49ers would be the disoriented and uninterested because Mike Singletary was fired and replaced by some pro wrestler named Tomsula. Instead, Arizona was the team that didn't show up, completely ruining my five-unit pick. As an example of their lack of effort, the Cardinals called a timeout on a 49ers' 3rd-and-6 with 1:30 remaining in the first half. San Francisco was deep in its own territory, so the team was sure to run the ball. Arizona knew this, yet it still surrendered an 8-yard run to the archaic Brian Westbrook. ",
            "2": "The Cardinals couldn't stop the run - Westbrook had 79 yards and two touchdowns on 13 carries - and weren't any better against the pass. Alex Smith finished 15-of-29 for 276 yards and two touchdowns, as the middle of the field was open the entire game. No one was even near Vernon Davis (3-96) on his 59-yard touchdown. ",
            "3": "John Skelton was benched in the second half for Richard Bartel, finishing 14-of-25 for 92 yards, one touchdown and an interception. Skelton had no chance, as he was sacked on nearly every drive. ",
            "4": "Despite the pedestrian quarterbacking, Larry Fitzgerald still finished with 11 grabs for 125 yards and a score. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Giants",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "I'm glad the Packers won, because the Giants have no business going to the playoffs. A week after getting blown out at Green Bay, New York barely escaped with a victory in Washington. The Redskins outgained the Giants by 60 yards, but screwed things up with multiple miscues in the red zone. ",
            "2": "Eli Manning converted just 5-of-16 third downs without his top two receivers out of action. Still, Manning went 17-of-29 for 243 yards, one touchdown and an interception. Manning threw exclusively to Mario Manningham (4-101, TD) and Derek Hagan (6-70); the latter was guilty of some drops, which was predictable given how many dropped passes he dropped in pre-game warmups. How do you drop balls in pre-game warmups? ",
            "3": "Rex Grossman's numbers were pretty (26-of-44, 336 yards, 2 TDs, 1 INT), but he didn't play very well. He lost two fumbles and looked skittish in the pocket. The Redskins will have a new quarterback next season. ",
            "4": "At least Washington may have its running back of the future. Ryan Torain (18-61) outgained both Brandon Jacobs (13-49, TD) and Ahmad Bradshaw (15-22). "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "2",
            "1": "Multiple-choice question: Who is to blame for St. Louis' shocking loss at Seattle? A) The receivers B) Sam Bradford C) Steve Spagnuolo D) The officials Let's examine each possible answer: <b> A) The receivers: </b> Bradford's receivers betrayed him. There were four dropped balls of 20 yards or longer, two by Danario Alexander. St. Louis almost has to draft Julio Jones or Justin Blackmon this April. <b> B) Sam Bradford: </b> Bradford was abysmal and may have lost his Offensive Rookie of the Year award. He went 19-of-36 for 155 yards and a pick, and had numerous balls batted down at the line of scrimmage. Bradford eventually looked rattled and made a terrible read on his costly interception. Immediately afterward, Awesome Kelly in Arizona texted me: Sam Bradford just looked retarded after that pick.. he showed no emotion indicating he had any idea that he did anything wrong. Write that down. When a hot chick who likes football tells you to write something down, you write it down. <b> C) Steve Spagnuolo: </b> Someone must have stolen Spagnuolo's red flags because he should have called for a challenge on a potential catch along the sidelines and a horrific spot that I'll discuss later. Steven Jackson had only 15 touches. There's no reasonable explanation for this. The Rams also looked confused and disoriented as a whole throughout most of the night - especially at the end of the game when Spagnuolo mismanaged his challenges and timeouts. <b> D) The officials: </b> Surprise, surprise. Jerome Boger screwed up yet another game. Check out these blown calls that went in Seattle's favor: 1. A shady holding call which gave the Seahawks a touchdown instead of a field goal on the opening drive. 2. A missed offsides penalty that was so obvious that Aaron Curry was searching for a flag on the ground. 3. No low block called on Seattle on a punt, which had Cris Collinsworth puzzled. 4. Didn't call an obvious pass interference on Kelly Jennings in which the Seattle corner contacted a Rams receiver downfield and never turned around. 5. Gave the Seahawks a very questionable first down that prompted Al Michaels to exclaim, They gave a first down on that play!?!?! <b> My Answer: E) All of the above. </b> ",
            "2": "I'm not giving the Seahawks any credit because they're the worst team to ever qualify for the playoffs, both in terms of record and point differential. It's ridiculous that both the Giants and Buccaneers slaughtered Seattle, yet the Seahawks will be the team playing next weekend. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "15"
}