{
    "year": "2010",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "30"
        },
        "comments": {
            "amount": "5",
            "1": "I called Mike Shanahan the dumbest coach in the NFL for benching Donovan McNabb in favor of Rex Grossman. Yum, yum, crow, NOM NOM NOM NOM. Grossman, known as a turnover machine throughout his career, certainly lived up to that reputation at Dallas almost immediately, lobbing an ugly interception off his back foot in the first quarter. Grossman later fumbled on a strip sack, and the Cowboys eventually established a 30-14 lead through three quarters. I don't know what happened to change things, but Grossman was on fire in the final 15 minutes. He finished 25-of-43 for 322 yards, four touchdowns and two picks, and it's hard to imagine that McNabb could have out-performed him. Shanahan got the most out of a sub-par Jake Plummer in Denver, and he may just be able to work his magic with Grossman in Washington. But let's not get ahead of ourselves just yet. ",
            "2": "Two of Grossman's touchdowns went to Santana Moss (8-72). It's good to know that Moss isn't dead in the fantasy realm just yet. ",
            "3": "The Redskins didn't get a chance to run the ball much because they were down early, but Ryan Torain performed well in his limited action. Torain totaled 53 yards on 11 carries. Torain also caught five balls for 48 receiving yards and a touchdown. ",
            "4": "While Grossman was prolific in the fourth quarter, Jon Kitna was exceptional throughout. Kitna went 25-of-37 for 305 yards and two touchdowns to Jason Witten (10-140) and Miles Austin-Jones (3-38). Kitna also had a third potential touchdown that was dropped by Sam Hurd. ",
            "5": "With Marion Barber out, Felix Jones (12-70) and Tashard Choice (15-53) split successful carries against Washington's anemic defense. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "12"
        },
        "comments": {
            "amount": "4",
            "1": "The Panthers really have to count their blessings. This was nearly a disastrous win for the future of their franchise, as a victory could have pushed them out of the No. 1 overall selection in the ",
            "2": "The Cardinals' effort against the run was pathetic. Jonathan Stewart gained 129 yards on 26 carries. Stewart ripped off double-digit gains at will at the end of the game when Arizona knew Carolina was going to keep it on the ground. ",
            "3": "As for the other rookie quarterback, John Skelton had a rocky start, throwing an interception that set up a Carolina field goal. Skelton spent most of the game checking down, but really opened up and looked better in the fourth quarter. Skelton finished 17-of-33 for 196 yards and a pick. He found Larry Fitzgerald nine times for 125 yards. ",
            "4": "Unlike last week, Skelton didn't have a strong ground attack by his side. Arizona remarkably couldn't run the ball on Carolina's anemic defense, as Tim Hightower and Chris Wells rushed for only 16 and 11 yards, respectively. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "The Bengals haven't had much success since the 1980s. So I find it pretty ironic and hilarious that a meaningless win would be so detrimental to this franchise. In the wake of Carolina beating Arizona, a Bengals loss would have given them the inside track on the No. 1 overall pick in the ",
            "2": "I thought that Cincinnati would be the team that wouldn't show up after a tough loss to the Steelers last week. Instead, it was the Browns, who displayed absolutely no interest in tackling. Cedric Benson notched 150 yards and a touchdown on 31 carries, as Cincinnati compiled 397 total yards. Like the Cardinals, Cleveland was completely inept against the run in the fourth quarter when they knew Carson Palmer would be handing the ball off to Benson or Bernard Scott. ",
            "3": "As for Palmer, he was an economical 14-of-23 for 209 yards. He didn't have the services of Terrell Owens for most of the contest; Owens limped off the field with a left knee injury on a non-contact play. He's out for the year. ",
            "4": "While the Browns couldn't stop the run, Cincinnati completely clamped down on Peyton Hillis, restricting the big back to 59 yards on 14 carries. Meanwhile, Colt McCoy went 19-of-25 for 243 yards and two touchdowns. McCoy started well and led a scoring drive at the end of the contest, but couldn't move the chains in the middle two quarters. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "This was a tough game for the Saints. There's no doubt about that. Playing a road game in December against an elite team is no easy task. But New Orleans really has to be concerned about its defense. The team really struggled to tackle Sunday, as Baltimore players broke big gain, after big gain, after big gain. I'm referring mainly to Ray Rice. Rice rushed for 153 yards on 31 carries, and caught five balls for 80 yards. He also scored twice. The Ravens were criticized for not giving Rice enough touches recently. Now we know what can happen when he's more involved on offense. Unfortunately, Cam Cameron's play-calling is erratic, so this doesn't mean Rice will be heavily featured going forward. ",
            "2": "Joe Flacco went 10-of-20 for 172 yards and two touchdowns. His numbers are low simply because Baltimore led throughout. A third dropped touchdown by LeRon McClain didn't help. ",
            "3": "Speaking of sacks, Drew Brees was also sacked thrice. It was really odd to see Drew Brees constantly under siege. Brees still posted great numbers (29-of-46, 267 yards, 3 TDs, 1 INT), but couldn't finish the comeback from down 21-7 because he constantly had defenders in his face. ",
            "4": "While Marques Colston caught six balls for 80 yards, Brees' two scores went to Jimmy Graham, who hauled in five grabs for 29 yards. Keep Graham in mind next year for fantasy purposes. He's going to be awesome. ",
            "5": "With Chris Ivory out, the Saints' running game was non-existent. Pierre Thomas had just 20 yards on six carries, while a slow Reggie Bush had minus-4 yards on four attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Some of the talking heads on TV referred to this contest as Jacksonville' biggest regular-season game in franchise history. Well, the Jaguars certainly didn't play like it off the bat. The Colts opened up with an impressive touchdown drive, and led pretty much throughout. At halftime, Indianapolis held a 252-84 advantage in total yardage. The only reason it was close at the time was because of a Mike Thomas punt return for a score. However, a key injury turned this game in favor of Jacksonville. Late in the second quarter, Austin Collie took another vicious blow to the head on what was a legal hit. Collie was down for a few minutes, but eventually walked off and was diagnosed with yet another concussion. As this happened, the camera panned to the stands, where several female Colts fans were seen crying. Collie (8-87, 2 TDs) was greeting to a standing ovation when he made his first reception. He's a big part of the offense, and it's no surprise that Indianapolis struggled to move the chains after he left the game. At any rate, this was a three-point battle until late in the fourth quarter. Unfortunately for all Jaguars bettors, an onside kick attempt went the other way for a back-breaking cover. ",
            "2": "As noted, Peyton Manning began hot, but really couldn't move the chains once Collie was knocked out. He finished 29-of-39 for 229 yards and the two scores to Collie. Pierre Garcon (5-44), Jacob Tamme (7-34) and Reggie Wayne (5-34) disappointed their fantasy owners. ",
            "3": "A Colt player who didn't disappoint was Donald Brown, who finally played like a first-round running back. Brown gained 129 yards and a touchdown on 14 carries. His 43-yard score in the third quarter was huge because the Colts' passing game wasn't clicking at all. ",
            "4": "Meanwhile, Maurice Jones-Drew curiously had just 46 yards on 15 carries. What happened to Indianapolis' supposedly porous run defense? This certainly has to be encouraging for the Colts going forward. ",
            "5": "David Garrard played very well, going 24-of-38 for 294 yards, two touchdowns to Mike Sims-Walker (4-42) and an interception. However, an onside kick returned for a touchdown put the game out of reach for Garrard. The Colts now have control of the AFC South. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Bills",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "Unless you're a poor Miami fan, you really have to love the irony. On such an inconsistent team, kicker Dan Carpenter was the only reliable player. However, in a desperate must-win situation against the three-win Bills, Carpenter was the one who sucked, whiffing on all four field goal attempts. You can't blame Carpenter for a 61-yard miss at the end of the first half, but his other errant kicks were from 48, 53 and 48. Just one successful try may have won this game for Miami. Instead, the Dolphins will be watching the playoffs from home this January. ",
            "2": "Carpenter's poor performance ruined a solid statistical performance by Chad Henne, who went 33-of-45 for 276 yards, one touchdown and an interception, though those numbers are a bit deceiving. Henne's score went to Brandon Marshall, who hauled in 11 balls for 106 yards. Davone Bess, meanwhile, registered nine receptions for 78 yards. ",
            "3": "Though the Bills have struggled to stop the run all year, the Dolphins once again failed to establish a consistent ground attack; Ronnie Brown (10-39, TD) and Ricky Williams (7-19) couldn't find any running room. ",
            "4": "This win hurts Buffalo in the long-term, but I'll have to credit Ryan Fitzpatrick for a brilliant performance. Fitzpatrick went 16-of-26 for 223 yards, two touchdowns and an interception, making several great throws against a tough Miami defense. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "31"
        },
        "comments": {
            "amount": "4",
            "1": "Two words can easily summarize what happened in the fourth quarter of this game: Holy crap. I can't believe the Eagles came back from 31-10. I can't believe New York wasn't prepared for an onside kick with about seven minutes left in the fourth quarter. And I can't believe the Giants punted to DeSean Jackson with seconds remaining in regulation. Why the hell didn't they punt it out of bounds? I really don't get it. This is the type of loss that can ruin an entire season. If Aaron Rodgers plays next week, it would not surprise me if the Giants lost the final two games on their schedule. It's a shame too because New York had the perfect game plan against the Eagles. The Giants swarmed the backfield and kept QB Dog Killer contained in the pocket for the first three quarters. QB Dog Killer threw an ugly interception and continuously took vicious hits all afternoon, bogging down the Eagles' scoring attack. But QB Dog Killer took matters into his own hands in an MVP-type final quarter. He finished 21-of-35 for 242 yards, three touchdowns and an interceptions, along with 130 rushing yards and another score on 10 attempts. ",
            "2": "Two of QB Dog Killer's touchdowns went to Jeremy Maclin (7-59). The other was to Brent Celek (2-72), who finally contributed on offense. DeSean Jackson had just three grabs for 52 yards, but had the breath-taking, decisive punt return. Jackson also lost a key fumble that wasn't really a fumble, but Andy Reid inexplicably refused to challenge the easy call. ",
            "3": "Though the Eagles have pretty much clinched the NFC East, they suffered a big loss in this contest. Rookie free safety Nate Allen incurred a season-ending knee injury. Philadelphia's injury situation is getting out of control. ",
            "4": "As for the Giants, you can't fault their offense for this loss. Eli Manning went 23-of-39 for 289 yards, four touchdowns and an interception. Two of Manning's scores went to Mario Manningham (8-113), who could have notched even greater numbers had he not dropped a deep pass in the first quarter. Manning's other touchdowns were to Hakeem Nicks (6-63) and Kevin Boss (3-59). "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "3",
            "1": "There goes my theory that the two Missouri teams are about even. Despite a slow start, the Chiefs outgained the Rams, 383-224, while the defense made Sam Bradford look like, well, a rookie. Bradford played well earlier in the year, but has really regressed in the past few weeks. He went 21-of-43 for 181 yards and two late interceptions in this contest. His throws were all over the place. It's almost as if he and Jimmy Clausen switched jerseys Sunday morning. Of course, Bradford has nothing to work with outside of Steven Jackson (19-67, TD) and Danny Amendola (7-60). The Rams will have to draft Julio Jones, Justin Blackmon or Jonathan Baldwin this April. ",
            "2": "As for Matt Cassel, he wasn't even named the starter until minutes before kickoff. He started poorly, but finished pretty decently (15-29, 184 yards, TD, INT), but you could see that the appendectomy affected him once in a while. Cassel seemed to hesitate to run on several occasions, though he did scramble six times. ",
            "3": "The Chiefs generated 210 rushing yards, thanks to a late 80-yard burst from Jamaal Charles. Charles finished with 126 yards and a score on 11 attempts. Thomas Jones (22-62, TD) vultured the touchdown immediately following Charles' long gain. Congratulations to Jones, by the way, who became the 25th player in league history to rush for 10,000 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Lions",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "It's all over. The Lions have won on the road for the first time since Oct. 28, 2007. Congratulations to Jim Schwartz, Calvin Johnson and Ndamukong Suh. And a special congratulations to Matt Millen, whose foul stench is finally gone from this franchise. Despite Detroit's long losing streak, this is not much of an upset. The Lions have played very well this year, but have shot themselves in the foot seemingly every week. It was nice to see them not beat themselves for once. ",
            "2": "Drew Stanton was awful last week, but rebounded against a Tampa Bay defense missing key personnel (Aqib Talib, Gerald McCoy, etc.) Stanton finished 23-of-37 for 252 yards and a touchdown. ",
            "3": "Detroit's two studs on offense: Maurice Morris had 109 yards and a touchdown on 15 carries. Meanwhile, Calvin Johnson didn't score, but he hauled in 10 balls for 152 yards. ",
            "4": "I want to give the Lions' offensive line some props. For the first time all year, they didn't allow a sack. ",
            "5": "Detroit held the Buccaneers to just 20 points, but didn't tackle particularly well. LeGarrette Blount had his way with Detroit's defense, rumbling for 110 yards and a touchdown on just 15 attempts. In fact, Blount was so impressive that FOX color commentator referred to him as a kangaroo with power. ",
            "6": "That wasn't the only announcing gaff. On one play, Josh Freeman completed a pass to his receiver, Michael Spurlock. Dick Stockton, who was very confused at the moment, said, Josh Freeman, intercepted by Michael Spurlock! Well, at least he got the names right. Freeman, by the way, went 21-of-32 for 251 yards and a touchdown to Mike Williams (6-96, TD). ",
            "7": "This is a tough loss for the Buccaneers. With only one wild card spot up for grabs, Tampa Bay is a long shot to make the playoffs because the Packers and Giants play each other next week. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Titans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The last time these teams met, Andre Johnson and Cortland Finnegan engaged in that fight that controversially did not result in any suspensions. You had to figure that things would be heated in this game. Well, they were - just not between the Texans and Titans. Toward the end of the second quarter, two Houston defenders, Brian Cushing and Antonio Smith, got into a fight. The officials had to break them up, and Cushing drew a 15-yard penalty. You tend to see this kind of stuff in pick-up basketball games; but not in the NFL. The Cushing infraction was just one of nine Texans penalties in the first half. They also struggled to tackle, clearly displaying a lack of effort in the wake of that heart-breaking Monday night loss. ",
            "2": "The Titans did whatever they wanted to against Houston's pathetic defense. Chris Johnson rushed for 130 yards and a touchdown on 24 carries. He probably would have scored a second time, but Tennessee took him out for a one-play breather after a long gain. Javon Ringer vultured the touchdown. ",
            "3": "Kerry Collins, meanwhile, went 14-of-24 for 237 yards, two scores and an interception. Kenny Britt didn't catch any of the touchdowns, but hauled in six grabs for 128 yards. ",
            "4": "Matt Schaub posted great numbers, but for the second week in a row, most of it came in garbage time. Schaub went 35-of-54 for 325 yards, two touchdowns and a pick. ",
            "5": "Arian Foster (11-15) surprisingly couldn't run the ball whatsoever, though he made six receptions for 46 yards. ",
            "6": "Andre Johnson (6-58) saved his fantasy owners with a third-quarter score when the game was out of hand. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "18"
        },
        "comments": {
            "amount": "4",
            "1": "The Seahawks stink, and are only capable of beating horrible quarterbacks like Max Hall and Derek Anderson, but this was still a quality win for the Falcons. It's never easy to travel across the country and play at Qwest Field. Atlanta dominated this contest by converting third and fourth downs (11-of-21) and holding the football as long as possible. The Falcons won the time of possession by about 11 minutes. ",
            "2": "Matt Ryan played very well, going 20-of-35 for 174 yards, three touchdowns and an ugly interception. One of Ryan's scores went to Roddy White, who hauled in seven passes for 65 yards. White's first reception was the 100th of the season; he became the third Falcon in franchise history to go over the century mark in that department. ",
            "3": "Atlanta didn't run the ball very well, which is understandable because Colin Cole is back for Seattle. Michael Turner gained just 82 yards on 25 carries. ",
            "4": "As for Seattle, Matt Hasselbeck was miserable after a decent first drive. He finished 10-of-17 for 71 yards and two interceptions. He was pulled for Charlie Whitehurst, who was only slightly better (8-of-16, 83 yards). When Whitehurst ran in for a touchdown in the fourth quarter, the crowd chanted, CHAR-LIE! CHAR-LIE! CHAR-LIE! Whitehurst isn't good whatsoever, but he can't possibly be worse than Hasselbeck right now. There are no more excuses for Hasselbeck; he had his top two receivers, Mike Williams (8-66) and Ben Obomanu (1-7) at his disposal, yet he played as if he drank five of Derek Anderson's magical flasks. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "23"
        },
        "comments": {
            "amount": "4",
            "1": "The Raiders are still a long shot to make the playoffs - Kansas City shouldn't have any problems with Tennessee at home - so the biggest story of this game is Tim Tebow. I was really impressed with Tebow's performance. The passing numbers aren't overwhelming (8-of-16, 138 yards, TD), but he made numerous great throws, including a perfect 24-yard potential touchdown to Lance Ball that was dropped. Tebow's 33-yard score went to Brandon Lloyd on another terrific pass. Afterward, NFL Red Zone host Scott Hanson joked, I'm sure some expert said, 'Tim Tebow held the ball too low when he hit Brandon Lloyd for that touchdown.' The Broncos didn't ask Tebow to do much aerially though, as you can tell by those 16 attempts. Tebow ran numerous quarterback draws, churning out 78 rushing yards and a touchdown on the ground. Interim head coach Eric Studesville should feel more confident with Tebow going forward, so hopefully the Broncos don't baby him much longer. ",
            "2": "Elsewhere on Denver's offense, Knowshon Moreno was knocked out early with what the Broncos called a side injury. Moreno had just five rushing yards, which was a tough pill to swallow for his potentially eliminated fantasy owners. ",
            "3": "Here's another tough pill - Darren McFadden rushed for 119 yards on 20 attempts, but Michael Bush (12-24) vultured two touchdowns. ",
            "4": "Jason Campbell went 15-of-26 for 238 yards, one touchdown and two interceptions. Campbell had a second score (to Zach Miller) wiped out by a bogus illegal formation penalty. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Jets",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I still can't believe the Jets opened this game as six-point underdogs. Talk about public overreaction. Two weeks ago, the Jets were supposedly the best team in football. After a loss to Miami, everyone thought they had zero chance of going into Pittsburgh and coming out with a win. So much for that. Congrats to the Jets for turning things around and winning their first game ever in the state of Pennsylvania. I still can't believe they've never won here before. ",
            "2": "If you're a degenerate gambler like me, you may have noticed that the line dropped to +4 or +4.5 by kickoff. This was because Troy Polamalu was ruled out. With Polamalu gone, the Jets moved the chains efficiently; they converted nearly half of their third downs (6-of-13), while Mark Sanchez was an efficient 19-of-29 for 170 yards and a rushing touchdown. ",
            "3": "Considering whom they were playing, the Jets ran the ball pretty well. LaDainian Tomlinson (11-49) and Shonn Greene (12-40) were instrumental in keeping drives alive. Yes, Polamalu was out, but New York's ground attack had struggled in the past few weeks. ",
            "4": "Leading up to the week, ex-Steeler Santonio Holmes said he wanted to show his former team what they were missing. Holmes wasn't a big factor (6-40), but Braylon Edwards (8-100) really stepped up. ",
            "5": "Ben Roethlisberger also did a great job of converting third downs (11-of-17). Big Ben finished 23-of-44 for 264 yards and a touchdown. The difference, however, was pass protection. Roethlisberger was sacked three times, so you can imagine how much pressure he was under given his ability to shed tackles. ",
            "6": "The Jets took Hines Ward away (2-34) with Darrelle Revis, so Big Ben threw exclusively to Mike Wallace (7-102) and rookie Emmanuel Sanders (7-78). ",
            "7": "Like New York, Pittsburgh ran the ball well; Rashard Mendenhall notched 100 yards and a touchdown on 17 attempts. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "As the Steelers, Bears and now Packers have shown us this year, good teams can play well without their starting quarterback. Pittsburgh went 3-1 with Dennis Dixon and Charlie Batch; Chicago won with Todd (Tom) Collins; and now Green Bay nearly took down the best team in the NFL with Matt Flynn. Flynn made himself a ton of money tonight. The former LSU champion went 24-of-37 for 251 yards, three touchdowns and an interception. Flynn had a second pick wiped out by a penalty and screwed up the 2-minute drill at the end, but also endured numerous drops by his receivers. I was really impressed with Flynn considering that he was making his first NFL start against Bill Belichick. Teams in dire need of a quarterback should think about trading for Flynn this offseason. ",
            "2": "Give credit to Green Bay's defense for showing up as well. The Packers put forth a valiant effort against Tom Brady. Three of New England's four touchdowns were the result of the following: a dropped Charles Woodson interception, a pick-six, and the longest kickoff return by an offensive lineman (Dan Connolly; 76 yards) in league history. ",
            "3": "Brady, who is still flawless at home since 2006, went 15-of-24 for 163 yards and two touchdowns to Aaron Hernandez (4-31). The Packers did a tremendous job pressuring Brady, recording three sacks (two by B.J. Raji). ",
            "4": "Both Wes Welker (3-42) and Deion Branch (2-33) disappointed their fantasy owners. ",
            "5": "The Packers ran the ball really well; Brandon Jackson somehow totaled 99 yards on 22 carries. John Kuhn scored a touchdown and must have hurdled four New England defenders. For thoughts on Bears-Vikings, check out my updated "
        }
    },
    "numberOfGames": "14"
}