{
    "year": "2010",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "The Bills couldn't win this season. The Lions had dropped 24 consecutive road games going into this contest. This was destined to be a tie. Fortunately for Buffalo fans, that wasn't the case because Shaun Hill lobbed a pass way out of the end zone on a two-point conversion attempt with 14 seconds remaining in regulation. So, congratulations, Bills! You're one win away from ensuring that Andrew Luck won't be your franchise quarterback! ",
            "2": "Ryan Fitzpatrick, Buffalo's beloved signal-caller, went 12-of-24 for 146 yards and a touchdown at a rainy Orchard Park. Lee Evans and Steve Johnson combined for just five catches. ",
            "3": "Fred Jackson did it all. It seemed like every five minutes, NFL.com would have a Big Play Alert highlighting a long Jackson gain. Jackson rushed for 133 yards on 25 carries, and also caught six balls for 37 receiving yards. He scored twice. ",
            "4": "Hill once again posted great fantasy numbers. He went 29-of-50 for 323 yards, one touchdown and an interception. Those stats are a farce, however, as Hill was erratic all afternoon. He had some passes dropped, but should have also tossed a couple more picks. ",
            "5": "Calvin Johnson had 10 grabs for 128 yards and a score. Jahvid Best, meanwhile, struggled despite battling a putrid Buffalo defense. Best gained just 35 yards on 17 attempts. ",
            "6": "Detroit played a really sloppy game and didn't seem interested at all. The Lions committed a whopping six penalties in the first nine minutes of the game, and continuously shot itself in the foot the entire afternoon. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "The clock is ticking on Brad Childress. Last week, reports indicated that Childress would be fired with a loss to Arizona. Now that the Vikings' season is essentially over, you have to wonder when <strike>Alex Trebek</strike> Zygi Wilf will drop the ax on Chilly. Wilf will keep Childress around for next week's game against the Packers. If the Vikings lose that - giving them their seventh defeat - Childress will definitely be gone. ",
            "2": "As well as Brett Favre played last week, he was alarmingly abysmal in the second half at Chicago. He went 18-of-31 for 170 yards, one touchdown, three interceptions and a lost fumble. His score went to Percy Harvin (4-64), who was a game-time decision. Most of Harvin's yardage came on his 53-yard touchdown. ",
            "3": "The Vikings did not use Adrian Peterson enough. He had just 17 carries for 51 rushing yards and four catches for 24 receiving yards. Toby Gerhart had six touches and looked pretty good in his limited work. ",
            "4": "Jay Cutler, meanwhile, was clearly the superior quarterback in this matchup. He went 22-of-35 for 237 yards, three touchdowns and two picks, one of which wasn't his fault (the ball bounced out of Johnny Knox's arms). The second interception was a poor red-zone decision, but it was the only blemish of Cutler's in what was an encouraging performance. ",
            "5": "Knox would eventually redeem himself; he led the Bears with five catches for 90 yards. ",
            "6": "It was really surprising that Mike Martz opted to run the ball as much as he did. Matt Forte and Chester Taylor combined for 32 carries and 102 rushing yards. ",
            "7": "Devin Hester really sparked the Bears. In addition to catching four balls for 38 yards and a touchdown, he had multiple huge returns on special teams, constantly setting Cutler up in Minnesota territory. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jets",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "This was a brutal beat if you had the Browns. In what looked like it could have been a push at the very worst, Santonio Holmes broke free from a weak T.J. ward tackling attempt to score on a 37-yard touchdown reception with 16 seconds remaining in overtime. Had Holmes not evaded Ward, the Jets would have tried a field goal to avoid a possible tie and Cleveland cover. Nick Folk was 2-of-5 on the day, so there's a good chance he would have whiffed again. ",
            "2": "Mark Sanchez was really amazing in this contest, and his numbers - 27-of-44 for 299 yards, three touchdowns (two pass, one rush) and an interception - really aren't indicative of how well he played. On multiple occasions, Sanchez broke free of potential sacks, scrambled around and located his receivers downfield. Sanchez was actually limping around at the beginning of the fourth quarter following a sack, and looked like he shouldn't have been on the field. Despite the fact that Mark Brunell warmed up on the sidelines, Sanchez stayed in and did a great job of leading the Jets to a victory. ",
            "3": "The Jets could not run the ball against the Browns, as neither Shonn Green nor LaDainian Tomlinson was anywhere near four yards per attempt. The notable thing is that Shonn Greene had more carries (20 for 72 yards) than LaDainian Tomlinson (18-57). Tomlinson, however, had six catches for 53 receiving yards. ",
            "4": "If you're a Browns fan, you should be encouraged. Your team battled the tough Jets pretty evenly. Colt McCoy, who went 18-of-31 for 205 yards and a touchdown, was brilliant in the 2-minute drill, firing accurate, downfield passes to his receivers. ",
            "5": "Despite playing New York, Peyton Hillis once again bulldozed his opponent. He rushed for 82 yards and a touchdown on 19 attempts, and also had four receptions for 27 more yards. His only blemish was a lost fumble when he was fighting hard for more yardage. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "17"
        },
        "comments": {
            "amount": "3",
            "1": "This may sound weird because the Bengals had their trademark backdoor touchdown late in the fourth quarter, but Cincinnati should have won this game. No, really. The Bengals, who outgained the Colts by 85 yards, shot themselves in the foot over, and over, and over again. Consider the following: - Carson Palmer (31-of-42, 292 yards, 2 TDs, 3 INTs) tossed a pick-six in the first quarter when he stared down his receiver. - The Colts scored their only other touchdown off a Cedric Benson fumble. - The Bengals had a Chad Ochocinco touchdown nullified by a penalty. - Cincinnati punted on 4th-and-1 on Indianapolis' 42 in the second half. On the next drive, the team suffered a false start on 4th-and-1 on the Colts 43. On the following possession, Palmer took a sack on 3rd-and-2 on Indianapolis' 41. All of that great field position netted nothing. - The Bengals had multiple deep passes that just fell short. Two went off the fingertips of Ochocinco (7-86, TD). Another dropped right in front of Terrell Owens (4-64), who lost the ball in the lights. - On Cincinnati's final drive, Jermaine Gresham (9-85, TD) fumbled in Colts territory. ",
            "2": "You usually don't say Peyton Manning and economical in the same sentence, but that's the proper adjective to describe his play on Sunday, as he went 20-of-36 for 185 yards. With no Austin Collie, Anthony Gonzalez or Blair White, Manning struggled to move the chains, converting just 5-of-14 third downs. ",
            "3": "Jacob Tamme paced the Colts in receptions (7) and receiving yardage (73), though he had multiple drops. Pierre Garcon (5-37) and Reggie Wayne (3-34) disappointed their fantasy owners. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "I've been watching <i> NFL Primetime</i> for years (both the old good version, and the new crappy version). For my entire life, I've heard Chris Berman and Tom Jackson have the following exchange on every single Hail Mary attempt: <b> Berman: </b> It's a Hail Mary! What do you do, Tom!? <b> Jackson: </b> Knock it down!!!! Umm... maybe you want to re-think that strategy, guys. In a tie at the end of regulation, Texans corner Glover Quin knocked David Garrard's Hail Mary down - and right into the arms of Mike Thomas. It was unbelievable. The Texans always seem to find a way to screw themselves. Jacksonville shouldn't have even had the ball; tight end Joel Dresseen fumbled in Jaguars territory to ruin a potential field goal attempt seconds earlier. ",
            "2": "Speaking of Quin, he was responsible for one of the worst tackling attempts I've ever seen on Jaguar tight end Zach Miller's 52-yard touchdown in the second half. Houston sucked at tackling throughout. On one of the most humiliating sequence of events this season, the Jaguars scored on a nine-play, 52-yard drive in the second quarter. Every single play on the possession was a Maurice Jones-Drew or Rashad Jennings rushing attempt. Jones-Drew rushed for 100 yards and two touchdowns on 24 carries. ",
            "3": "Garrard was the hero of the game. In addition to delivering that Hail Mary, he went 24-of-31 for 342 yards and two scores. He also rushed for 35 yards on seven scrambles. It would have been nice to see Garrard trying hard again, but I had four units on Houston. ",
            "4": "Matt Schaub wasn't too shabby himself, going 22-of-32 for 314 yards and a pair of touchdowns. He found Andre Johnson (9-146) and Kevin Walter (6-90) in the end zone. Walter's score was pretty controversial. He caught the pass, rolled to the ground, raised the ball in the air, and then had it knocked out of his hands. It was ruled incomplete, but Gary Kubiak challenged it and saw the play overturned. You won't hear it on the <i> SportsCenter</i> highlights, but as it happened, Gus Johnson went berserk, THAT'S A TOUCHDOWN!!!! THAT... THAT IS A TOUCHDOWN!!! THAT IS A TOUCHDOWN!!! ",
            "5": "Arian Foster had 56 yards and a touchdown on 15 carries. Unfortunately for his fantasy owners, he had an 80-yard score nullified by a penalty. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Dolphins had six different players take the snap in this game - and they won by 12! This is a copycat league, so expect more teams to use half-a-dozen quarterbacks in the future. In all seriousness, Chad Pennington started this game, but threw just two passes (1-2, 19) before injuring his shoulder yet again. Chad Henne stepped in and was his usual erratic self, though he must be given credit for making some nice throws despite not getting much work during the week. However, Henne (19-of-28, 240 yards, TD, INT) suffered what could be a season-ending knee injury at the end of the the third quarter. The Dolphins ran some Wildcat until the beginning of the fourth quarter and then inserted Tyler Thigpen under center. Thigpen actually looked really good, going 4-of-6 for 64 yards and a score. He's worth picking up in fantasy leagues. ",
            "2": "Anthony Fasano had a career performance, catching five balls for 107 yards and a touchdown. Don't rush to pick him up in fantasy leagues, however. He's just way too inconsistent. ",
            "3": "Speaking of fantasy football, Brandon Marshall (3-34) and Davone Bess (4-29) posted lackluster numbers. Brian Hartline led all wideouts with five receptions for 98 yards. ",
            "4": "Ronnie Brown had just 11 yards on 12 carries, but saved his fantasy day with a touchdown. Ricky Williams recorded 64 yards on 11 attempts. ",
            "5": "For all the hoopla of the Randy Moss waiver claim, Moss had just one reception for 26 yards. He also drew a long pass interference flag in the third quarter when Vontae Davis didn't look back for the ball. Better days are expected, but this is yet another reminder that Moss hasn't done crap this year. On the bright side, Moss definitely opened up some running lanes for Chris Johnson, who totaled 117 yards and a touchdown on just 17 carries. ",
            "6": "Like the Dolphins, Tennessee had quarterback problems. Vince Young, a game-time decision, watched Kerry Collins start this contest. Collins was an unspectacular 9-of-20 for 51 yards prior to suffering a calf injury. Young stepped in, and was just 9-of-18 for 92 yards, one touchdown and an interception. Collins will have an MRI on his calf Monday. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "If the Jaguars-Texans bad beat wasn't enough, I had to endure the crap in this game. This contest was much closer than the 31-16 score indicates; Carolina moved the ball pretty well (300 yards of offense) but screwed up too many times in the red zone, including a final trip where they nearly had a backdoor push. ",
            "2": "I don't want to take anything away from the Buccaneers though. They also moved the chains extremely well, compiling 421 yards of offense. Josh Freeman was nearly flawless, going 18-of-24 for 241 yards and two touchdowns. ",
            "3": "LeGarrette Blount continues to dominate. With Carolina linebacker Dan Connor out, Blount punched through (get it, punched?) an anemic Panthers defense for 91 yards and a score on 19 carries. Carolina seemed to have no interest in tackling him. ",
            "4": "Mike Williams led the Buccaneers with 68 receiving yards off four receptions. Kellen Winslow Jr., meanwhile, finally contributed with six receptions, 65 yards and a touchdown. ",
            "5": "Jimmy Clausen was neither Clawesome nor Clawful. He went 16-of-29 for 191 yards. He had some really nice throws, but was pretty inconsistent throughout the entire afternoon. ",
            "6": "The Panthers didn't have DeAngelo Williams or Jonathan Stewart, so Mike Goodson made the start. Goodson had a few quality runs, finishing with 100 yards on 23 carries. Too often though, he tried to make something out of nothing and lost yardage. Goodson also fumbled at midfield to set up Tampa Bay's first touchdown. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "29"
        },
        "comments": {
            "amount": "9",
            "1": "Ladies and gentlemen, the most erratic team in the NFL! Three weeks ago, the Broncos lost to the then-third-place Raiders at home, 59-14. On Sunday, they demolished the first-place Chiefs, 49-29. Thanks for making my handicapping life extremely difficult, Josh McDaniels. ",
            "2": "I don't know what the Broncos did during the bye week, but the Chiefs couldn't figure it out. Kyle Orton went 22-of-34 for 296 yards and four touchdowns. Orton's Pro Bowl-type performance makes you wonder where this was against the 49ers in the London game. ",
            "3": "Orton once again targeted Brandon Lloyd early and often. Lloyd hauled in six balls for 90 yards and two touchdowns. ",
            "4": "Knowshon Moreno, meanwhile, rushed for 106 yards on 22 attempts, and also logged three receptions for 50 more yards and a score. ",
            "5": "Tim Tebow, who was cheered every time he stepped on the field, scored two touchdowns in this contest. He ran one in, and then tossed a score to Spencer Larsen. ",
            "6": "As for the Chiefs, they've lost sole possession of first place, and are only just one game ahead of the Chargers. It's all unraveling for them; despite Matt Cassel's amazing numbers (33-of-53, 469 yards, 4 TDs) his limitations were once again apparent when this contest was close. ",
            "7": "Terrific Kansas City fantasy numbers courtesy of Denver's second-half prevent defense: Jamaal Charles (121 total yards, 1 TD); Dwayne Bowe (13 catches, 186 yards, 2 TDs); Thomas Jones (4 carries, 3 yards) - not so much. ",
            "8": "Cassel's pass protection has been sound for most of the year, but the offensive line surrendered four sacks, including three to Mario Haggan. Cassel has now taken 10 sacks in the past three weeks. ",
            "9": "Something shady that happened in this game - as if the final score doesn't make you scratch your head enough - was an attempted challenge by the Chiefs on a Broncos touchdown in the first quarter. It looked like the play could be overturned (it was pretty close), but the official ruled that the replay equipment was inoperable, which allowed the Broncos score to stand. This contest eventually got out of hand so it didn't matter, but if this weren't a blowout, the Chiefs would definitely have something to complain about. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "18"
        },
        "comments": {
            "amount": "7",
            "1": "If there was any doubt, Matt Hasselbeck is just a bit better than Charlie Whitehurst. I don't know who would have doubted this, but I'm sure there's a misinformed GameCenter poster out there who believed that Whitehurst was better. Making the start after a one-game absence, Matt Hasselbeck went 22-of-34 for 333 yards and a touchdown. He missed some time in this contest with a broken bone in his non-throwing wrist, and while he was out, Charlie Whitehurst tossed an unbelievably horrid near-pick-six. Dominique Rodgers-Cromartie intercepted the weakly thrown sideline pass and almost scored. Fortunately, Hasselbeck returned. ",
            "2": "Mike Williams was amazing, snagging 11 balls for 145 yards. He made several impressive catches, including one where he snatched the football over his defender's head on the sidelines. ",
            "3": "Marshawn Lynch gained 29 yards and a touchdown on 13 carries. On one pathetic play, Lynch had to leave the game right after halftime because he was tired. He fell on the turf and didn't get up for about 15 seconds. It seemed like he was hurt, but the announcers noted that Lynch was just taking a break. Again, this was just right after halftime. What was he doing in the locker room, lifting boulders? ",
            "4": "Justin Forsett was the better runner. He tallied 64 yards and a touchdown on nine attempts. He also had three catches for 31 receiving yards. ",
            "5": "As for Derek Anderson, he posted solid fantasy numbers by going 23-of-45 for 322 yards, one touchdown and an interception. However, Anderson made plenty of errant throws, including an interception. He also fumbled and took five sacks. ",
            "6": "Larry Fitzgerald had seven catches for 91 yards, but couldn't find the end zone. ",
            "7": "Chris Wells was inactive. Tim Hightower started, and rushed for 39 yards and a score on 13 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "This was like a <i> Twilight Zone</i> episode. In the first half, the Cowboys had just one penalty and no turnovers. Their only blemish was a missed extra point. And they led the alleged top team in the NFC, 19-6 at intermission. Actually forget the <i> Twilight Zone</i>; how about <i> Invasion of the Body Snatchers</i>? Seriously, where did this come from? Why couldn't the Cowboys play like this before? Why did it take the firing of Wade Phillips for this team to play as hard as it did on Sunday? And did this unexpected performance have anything to do with the power outage in the second half at New Meadowlands Stadium? ",
            "2": "Dallas mustered 427 total yards of offense, thanks to Jon Kitna's 13-of-22 for 327 yards, three touchdowns and one interception. Kitna and Dez Bryant were clicking, as the stud rookie caught three balls for 104 yards and a touchdown. Bryant also had a long reception ruled out of bounds after a replay. ",
            "3": "Kitna's other touchdowns went to Miles Austin-Jones (2-68) and Felix Jones (14 carries, 51 rush yards; 3 catches, 85 rec. yards). Most of Jones' receiving yardage came on his 71-yard screen touchdown. ",
            "4": "While the Cowboys won by 13, they didn't exactly dominate this game. In fact, the Giants outgained them by 53 yards. Dallas was simply able to establish a huge lead because of a 101-yard pick-six. The interception wasn't Manning's fault; Hakeem Nicks was running a slant, but inexplicably stopped his route. ",
            "5": "Manning went 33-of-48 for 373 yards, two touchdowns and two picks. His scores went to Kevin Boss (5-81) and Mario Manningham (10-91), who started in place of the injured Steve Smith. Nicks had five grabs for 82 yards. ",
            "6": "Ahmad Bradshaw notched 135 total yards (73 rush, 62 rec.) Brandon Jacobs, meanwhile, wasted five carries for 17 yards, including one 4th-and-inches where he was stuffed at the line of scrimmage. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "I'd love to pat myself on the back and say that I made a good call with the Rams for three units, but the reality is that this game shouldn't have been close. The 49ers really outplayed St. Louis; they had 14 penalties, including nine in the first half. A whopping three touchdowns were nullified by infractions, and all were legitimate calls. Two of them were Anthony Davis holds on Chris Long, who was pretty much unblockable in this contest. San Francisco also had a Sam Bradford interception negated by a penalty. In the end though, San Francisco won and kept itself alive in the NFC West race. Unfortunately, left tackle Joe Staley fractured his fibula and could be out 4-6 weeks. ",
            "2": "The encouraging thing for the 49ers is that Troy Smith looked pretty damn good. Smith displayed a great arm and hit his receivers downfield for four passes of 30 yards or more. Smith went 17-of-28 for 356 yards and a touchdown. Pick him up in your fantasy league if he's available. ",
            "3": "Four of Smith's receivers had four catches: Delanie Walker (80 yards), Vernon Davis (79) and Michael Crabtree (61, TD). ",
            "4": "While Smith was brilliant, Frank Gore was the best 49er offensive player on the field. He had 87 yards on 22 carries, and three catches for 67 receiving yards. ",
            "5": "The Rams still can't get over the road hump; they've been undefeated in the Edward Jones Dome since the opener, but they can't win away from home yet. It'll happen eventually, and they certainly had a chance at San Francisco; they couldn't do anything with the opening possession in overtime, and then lost on what was one of the worst pass interference calls I've ever seen (as far as an uncatchable ball is concerned). ",
            "6": "Oh, and Bradford really needs better weapons. He went 30-of-42 for 251 yards and a touchdown despite the fact that his top receivers were Brandon Gibson (8-72) and Danny Amendola (7-51, TD). ",
            "7": "Steven Jackson was awesome; he rushed for 81 yards and a score, and caught a whopping eight passes for 67 receiving yards. ",
            "8": "The Rams tallied five sacks in this game. They now lead the NFL with 28. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "Yay, Pick of the Month, yay! ",
            "2": "Going into this game, Bill Belichick was 12-1 straight up following a double-digit loss. He and Tom Brady really seemed like they were in F-U mode, eagerly out to prove their detractors wrong who doubted them after that Cleveland blowout. Brady went 30-of-43 for 350 yards and four touchdowns (three pass, one rush). He was pretty much flawless all evening, and on one poor drive, he fired everyone up on the sidelines, screaming at the offensive players that they had to be perfect to beat the Steelers. ",
            "3": "Four players caught at least four passes: Wes Welker (8-89), Deion Branch (7-71), Rob Gronkowski (5-72) and BenJarvus Green-Ellis (4-36). Gronkowski snagged all three of Brady's touchdown throws. ",
            "4": "Despite battling the league's No. 1 rush defense, Green-Ellis compiled 87 yards on just 18 carries. ",
            "5": "Ben Roethlisberger went 30-of-49 for 387 yards, three touchdowns and an interception. He was sacked five times. Most of Roethlisberger's yardage came in garbage time. To be fair though, Hines Ward was sidelined with a concussion after a first-quarter helmet-to-helmet hit that will likely draw a fine. Emmanuel Sanders (5-41, TD) made some nice plays in relief, but was guilty of far too many mistakes (poor route running, drops). ",
            "6": "Mike Wallace caught eight balls for 136 yards and two scores. Rashard Mendenhall, meanwhile, rushed for 50 yards on only 11 carries; Mendenhall simply didn't have many opportunities because New England led throughout. ",
            "7": "A couple of things of note: This was the most points the Steelers have ever allowed in a regular-season contest at Heinz Field. Also, this was the first game in 25 years that featured a matchup between quarterbacks with multiple Super Bowl victories. The last occurrence was in 1985 (Jim Plunkett vs. Joe Montana). Montana won, 34-10. "
        }
    },
    "numberOfGames": "12"
}