{
    "year": "2010",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "There really was no doubt that this would be a wild game. I had the Dolphins as my September NFL Pick of the Month; Tony Sparano opted to wear sunglasses indoors; and Brad Childress continuously passed up on field goal opportunities to go for it on fourth down. Childress chose to eschew a 43-yard field goal on the opening drive and instead failed on a 4th-and-2. Had the Vikings made the kick, Childress could have later sent out his field goal unit for a chip shot in the fourth quarter. Instead, Adrian Peterson was stuffed at the goal line. ",
            "2": "Peterson (28 carries, 145 yards, 5 catches, 41 receiving yards, 1 TD) tried to do everything on his own, but it wasn't enough because Brett Favre was too sloppy with the football. Favre went 22-of-36 for 225 yards and three interceptions, one of which wasn't his fault. However, one of his picks occurred inside the Miami 5-yard line, and the other was an underthrown toss into double coverage. Favre also took a fumble in his own end zone, which gave the Dolphins a defensive touchdown. Favre made some nice throws, but the mistakes outweighed the positives. Once again, he looked out of sync with his receivers, especially after Percy Harvin injured his hip at the end of the first half. Harvin (5 catches, 32 yards) was used sparingly after halftime. ",
            "3": "Visanthe Shiancoe led all of Favre's targets with six receptions and 86 yards. ",
            "4": "The Dolphins won this game despite being outgained by 138 yards and receiving just nine completions by Chad Henne. Henne went 9-of-15 for 114 yards and a touchdown to Brian Hartline (3 catches, 28 yards, 1 TD). ",
            "5": "Brandon Marshall paced the Dolphins with four receptions and 71 yards. ",
            "6": "As you can imagine, Miami was able to move the chains via its ground game. Ronnie Brown and Ricky Williams totaled 110 yards on 23 carries. Brown had 80 yards, most of which came on a 51-yard gain. However, both runners fumbled. Williams' fumble set up Minnesota's sole touchdown. ",
            "7": "The Dolphins defense did a great job in this game. Jason Allen picked off two passes. Vontae Davis, on the other hand, injured himself on a celebration in the third quarter. Davis was out for only one play, and coincidentally came back when Favre fumbled in the end zone. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Congratulations to the Chiefs, for winning the battle of reh-TARD coaches who refuse to play their good players! Starting with the Chiefs, who are inexplicably 2-0, Thomas Jones had 23 touches to Jamaal Charles' 12. Jones turned those touches into 88 yards (83 rushing, 5 receiving), while Charles was able to compile 76 yards (49 rushing, 27 receiving). That's correct - Charles nearly had as many yards as Jones despite getting half as many touches. Amazing. ",
            "2": "Kansas City once again won in spite of Matt Cassel. Cassel went 16-of-28 for 176 yards and two interceptions (one was tipped at the line of scrimmage). He (along with Todd Haley's ineptness) is pretty much the reason why the Chiefs are a fraud 0-2. ",
            "3": "Impressive rookie tight end Tony Moeaki led the Chiefs with five receptions for 58 yards. Dwayne Bowe, meanwhile, had four grabs for 45 yards. ",
            "4": "As for the Browns, I'm not sure what Eric Mangini does in practice, but it's apparent that he teaches his quarterbacks to throw pick-sixes when their team has the lead. Wallace's interception returned for a touchdown proved to be the difference in this game. He was 16-of-31 for 229 yards and a score otherwise. Wallace's touchdown was impressive, as it was a 65-yard bomb to Joshua Cribbs. Cribbs finished with three receptions for 74 yards. ",
            "5": "Unlike last week, Jerome Harrison dominated Peyton Hillis in touches, 19-11. Harrison was largely ineffective, gaining 33 rushing yards and 35 receiving yards. Hillis, meanwhile, had 35 rushing yards, 26 receiving yards and a touchdown. ",
            "6": "Mohamed Massaquoi had just one catch for nine yards. He made a really impressive grab on the sidelines in the second half, but could only get one foot inbounds. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Cowboys outgained the Bears by 102 yards and nine first downs, and limited Chicago to just 1-of-11 on third downs. In the end though, Dallas loses yet another game it probably should have won. Starting with Tony Romo, his stats (34-of-51, 374 yards, 1 TD, 2 INTs) indicate that he had a solid performance. That's not the case at all; as the two picks indicate, he was sloppy with the football. He also showed poor leadership, yelling at Tashard Choice despite missing his running back on a pass in the fourth quarter. Other mistakes aside from Romo's two picks, include a Roy Williams fumble that ended the game (why is he still on the field?), two dropped passes from Miles Austin-Jones and a David Buehler missed 44-yard field goal. Dallas also had four more penalties than the Bears committed. ",
            "2": "Romo's top receiver naturally was Austin-Jones, who had another big game with 10 catches for 142 yards. Jason Witten had five grabs for 51 yards. Dez Bryant only had two receptions for 52 yards - seriously, why is Williams getting more playing time than him? - but also had a punt return for a touchdown. ",
            "3": "Witten suffered a concussion in this game, but was lucid enough to beg the coaching staff to let him back into the game. Wade Phillips has more class than Andy Reid, so he did not allow this to happen. ",
            "4": "Like the Lions, the Cowboys had major issues moving the ball on the ground versus Chicago's defense. Marion Barber had 31 yards on 11 carries, while Felix Jones mustered just seven yards on seven attempts. ",
            "5": "Maybe Mike Martz is a genius after all, because Jay Cutler isn't throwing interceptions anymore. Cutler was an impressive 21-of-29 for 277 yards and three scores. Cutler's touchdowns went to Devin Hester (4-77), Greg Olsen (1-39) and Matt Forte (5-37). Forte also had 10 carries for 29 rushing yards. Johnny Knox led the Bears with 86 yards off four catches. ",
            "6": "Cutler's performance is pretty remarkable, considering how much he was knocked around, especially in the beginning of the game. The Cowboys had just one sack, but Cutler took tons of fierce hits from Dallas' pass rush. He deserves a ton of credit for not making any mistakes and leading his team to a victory. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "Throughout his young career, Matt Ryan has been tremendous at home and inconsistent on the road. Ryan lived up to that in a victory over the Cardinals, going 21-of-32 for 225 yards and three touchdowns. Ryan is now 11-2 against the spread in the Georgia Dome. ",
            "2": "Screwing over his fantasy owners, Michael Turner left the game in the second quarter after totaling 75 yards on nine carries. Turner looked like he was going to have a big game, but a minor groin injury knocked him out, and the Falcons didn't bother to bring him back in because this was a blowout. Turner's replacement, Jason Snelling, went on to rush for 129 yards and two scores on 24 attempts, and catch five balls for 57 receiving yards and a third touchdown. ",
            "3": "Ryan's other scores went to Roddy White (7 catches, 78 yards) and Brian Finneran (3-31). ",
            "4": "Derek Anderson must have blown a .15 after this game; he went 17-of-31 for 161 yards and two interceptions. It's only a matter of time before he's benched for Max Hall. Hall played sparingly and threw two passes. One was a 3-yard completion; the other was a pick. ",
            "5": "Larry Fitzgerald had seven grabs for 83 yards. He has to be happier with this result compared to last week's disastrous outing, but remember that it's not going to get much better than this if you're a Fitzgerald owner. ",
            "6": "The Falcons love giving up long touchdown runs. A week after surrendering a 51-yard game-winning score to Rashard Mendenhall, Atlanta allowed an 80-yard touchdown to Tim Hightower. Hightower was ineffective otherwise, gaining 115 yards on 11 attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Less than a year ago, the Buccaneers lost at Carolina. As a confused rookie, Josh Freeman tossed five interceptions. It's remarkable how much things have changed. Freeman didn't make any big errors in this contest; he was 12-of-24 for 178 yards and two touchdowns, and also rushed for 43 yards on four scampers. Freeman played better than those stats indicate, and he did so despite still being hampered by a thumb injury. The Panthers' quarterback, meanwhile, was the one to commit the costly blunders this time. Matt Moore went just 6-of-16 for 125 yards, one touchdown, an interception and a fumble. Moore was benched late in the fourth quarter, and Jimmy Clausen hilariously completed as many passes on his first drive as Matt Moore did in three-and-a-half quarters. Clausen went 7-of-13 for 59 yards and a pick. Considering that he had no reps during the week, nothing should be read into this outside of the fact that the Moore experiment has to conclude immediately. He's not talented to begin with, and he's making too many dumb throws. John Fox has to start Clausen next week. ",
            "2": "Speaking of Fox, I really can't understand what he's doing. Instead of running a dual back platoon between DeAngelo Williams (17 carries, 54 yards) and Jonathan Stewart (8 carries, 43 yards), Fox has included Mike Goodson (5-20) in the mix. Those weren't any ordinary five carries; Fox gave Goodson the touches inside Tampa Bay's 5-yard line. Goodson failed to get in, which could have brought the game to within one score with about five minutes remaining. I really don't understand this. Why shy away from Stewart (or Williams) on the goal line? Did Stewart score too many touchdowns last year? ",
            "3": "Steve Smith had three catches for 66 yards and a score. ",
            "4": "Rounding out the Bucs' numbers, Mike Williams had two catches for 54 yards and a touchdown. Kellen Winslow Jr. led Tampa with 83 receiving yards off four catches. ",
            "5": "Cadillac Williams struggled to run the ball on Carolina, totaling 51 yards on 27 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "32"
        },
        "comments": {
            "amount": "6",
            "1": "I really don't want to discuss this game. What the Eagles are doing is disgusting. Congratulations, Andy Reid. You beat the Detroit Lions. Except you did so using a demented psychopath who belongs in a mental hospital. You've lost thousands of fans and have shown us that you are a classless scumbag. Great job. Reid's pet project went 21-of-34 for 284 yards and two touchdowns. He also rushed 37 yards for seven yards. He looked great against the Lions, showing off the same athleticism he possessed in his Atlanta days. ",
            "2": "It's worth noting that QB Dog Killer had two interceptions that were dropped. He was sacked five times and fumbled twice. Philadelphia's offensive line is a mess. ",
            "3": "At any rate, what really helped QB Dog Killer were the weapons around him. LeSean McCoy was amazing, rushing for 120 yards and three touchdowns on 16 carries. DeSean Jackson also had a big game with four receptions for 135 yards and a score. However, QB Dog Killer's presence compromised the fantasy output of Brent Celek (3 catches, 27 yards) and Jeremy Maclin (3-26, TD). ",
            "4": "While QB Dog Killer shined in his second chance, the player who really stood out in this game was Jahvid Best. Best was amazing, tallying 78 rushing yards, nine receptions for 154 receiving yards and three touchdowns. Best has to be the huge favorite for Offensive Rookie of the Year. He's simply incredible to watch. ",
            "5": "Shaun Hill did a solid job subbiing for Matthew Stafford; he went 25-of-45 for 335 yards, two touchdowns and a pair of interceptions. A lot of his yardage came in junk, back-door time though, and his two picks were poor decisions. Hill is ordinarily safer than that. ",
            "6": "Calvin Johnson salvaged what looked like a poor outing with a late, junk-time touchdown. He finished with four catches for 50 yards and that score. Brandon Pettigrew, meanwhile, had seven catches for 108 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "You have to be able to protect the quarterback in the NFL. The Ravens weren't able to do that against the Bengals, and consequently suffered a frustrating 15-10 loss. With Jared Gaither out of the lineup, Joe Flacco took only one sack, but was seemingly pressured on every play and hard to force too many throws. Flacco consequently tossed four interceptions. He was 17-of-39 for 154 yards and a touchdown otherwise. ",
            "2": "Ray Rice had 87 yards on 16 carries. Baltimore simply didn't get Rice involved enough; at halftime, Rice had just eight carries to Flacco's 17 passes. Perhaps the Ravens will actually utilize their best player next week. Rice also had four grabs for 30 receiving yards. Anquan Boldin (5 catches, 35 yards), Todd Heap (4-35) and Derrick Mason (1-31, TD) saw their numbers limited by Flacco's poor pass protection. ",
            "3": "Carson Palmer won this game, but he honestly didn't look much better than Flacco. Palmer went 16-of-35 for 167 yards. All of his throws were of the short variety, as his arm strength is completely gone. Palmer had Chad Ochocinco wide open in the end zone at one point, but completely missed him. Baltimore also dropped two potential interceptions. Perhaps worst of all, the Bengals were able to kick two field goals because the Ravens were whistled for two bogus roughing-the-passer penalties. I'm sure you've all see Ray Lewis' rant on <i> SportsCenter</i>. ",
            "4": "As with Flacco's receivers, Palmer's wideouts couldn't get much going. Terrell Owens led the team in receiving yards (57) off three catches, while Chad Ochocinco had four receptions for 44 yards. Jordan Shipley was utilized heavily; he caught five balls for 42 yards. ",
            "5": "Cedric Benson ran for 78 yards on 23 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "11"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers had just seven first downs in this game. They converted 2-of-15 third downs, and were outgained by more than 100 yards. Yet, they were leading 19-3 during the latter stages of this contest. So, what happened? Well, quite simply, Tennessee screwed itself over, and over, and over. The Titans had seven turnovers in total. Focusing primarily on the first half, check out the mistakes they made: 1. They allowed a kickoff returned for a touchdown to open the game. 2. They fumbled the ensuing kickoff, giving the Steelers the ball near the red zone. 3. Vince Young tossed an interception in the end zone. 4. Young followed that up with another terrible pick. 5. A hold nullified a Chris Johnson 85-yard rushing touchdown. More fumbles and interceptions ensued in the second half. Young (7-of-10, 66 yards, 2 INTs, 2 fumbles) was benched in favor of Kerry Collins. Collins nearly led an improbable comeback, but ran out of time. ",
            "2": "For the first time since Week 5 in 2009, Chris Johnson failed to rush for 100 yards. Johnson had 34 yards on 16 carries, as he had that aforementioned 85-yard nullified by Eugene Amano's hold. ",
            "3": "Marginal stats for Tennessee's receivers: Justin Gage (4 catches, 74 yards), Kenny Britt (5-41) and Nate Washington (4-34, TD). ",
            "4": "The Steelers had just 127 net yards in this contest. The big news though is that they lost Dennis Dixon to a knee sprain. In his post-game press conference, Tomlin said that he wasn't sure who would start in Week 3. Dixon was 4-of-6 for 18 yards to go along with 28 rushing yards on three attempts. Charlie Batch replaced him, and went 5-of-11 for 25 yards. Batch is just as good (or bad) a passer as Dixon, but he obviously lacks Dixon's mobility. That's huge considering how poor Pittsburgh's offensive line is. ",
            "5": "One thing Tennessee did well was limit Rashard Mendenhall, who rushed for 69 yards on 23 yards despite having a gain of 20 yards. ",
            "6": "No Steeler had more than two receptions. Mike Wallace and Heath Miller each had a pair of grabs for 25 and 3 yards, respectively. Hines Ward had one reception for nine yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "This game was the complete opposite for Seattle compared to what we saw in Week 1. Last Sunday, the 49ers looked good early, but screwed up in the end zone too many times, which eventually sparked the Seahawks. This time, a Justin Forsett touchdown was wiped out by holding. A couple of plays later, Matt Hasselbeck tossed the first of three interceptions. Instead of establishing an early lead, the Seahawks handed over all the momentum to Denver. I don't want to take away anything from the Broncos though. Kyle Orton was great, going 25-of-35 for 307 yards and two touchdowns. He converted a whopping 14-of-20 third downs, which explains how Denver was able to win the time-of-possession battle by just about 15 minutes. ",
            "2": "Orton looked really comfortable going to his new weapon, as rookie Demaryius Thomas caught eight balls for 97 yards and a score. Make sure you pick up Thomas in your fantasy leagues. ",
            "3": "Three other Broncos had three or more receptions: Knowshon Moreno (4 catches, 67 yards), Eddie Royal (5-65) and Brandon Lloyd (3-53). Jabar Gaffney (2-15) was a non-factor. ",
            "4": "In addition to Moreno's 67 receiving yards, he had 51 rushing yards and a touchdown on 24 carries. Seattle's run defense has been incredible thus far, as they've shut down Moreno and Frank Gore in back-to-back weeks. ",
            "5": "As mentioned, Hasselbeck tossed three picks. He was 20-of-35 for 233 yards and a touchdown otherwise. He also scrambled for a 20-yard score. ",
            "6": "Forsett saw as many carries (8) as Leon Washington and Julius Jones combined. Forsett tallied 44 rushing yards to go along with an 8-yard reception. ",
            "7": "Golden Tate had a really impressive 52-yard reception in which he juked about a billion defenders. However, that was all he did. Deon Butler (5 catches, 50 yards), John Carlson (5-48) and Deion Branch (4-31) primarily did all of the damage for Seattle. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "It only lasted a game and a half, but it appears as though the Jason Campbell era is over in Oakland. Campbell was woeful while under center, going 8-of-15 for 87 yards and an interception. He also fumbled twice. Bruce Gradkowski took over after intermission and sparked the Raiders to 13 points. He went 11-of-22 for 162 yards, one touchdown and a pick. Gradkowski was very effective for Oakland last year, and the team never would have traded for Campbell if Gradkowski never would have gotten hurt. Quite simply, the Toledo point-shaver gives the Raiders the best chance to win. ",
            "2": "Despite the quarterback switch, the main reason the Raiders won this game was Darren McFadden, who had yet another terrific performance. He rushed for 145 yards on 30 carries. ",
            "3": "Louis Murphy had six catches for 91 yards and a touchdown against the Rams, and should be owned in all leagues. Darrius Heyward-Bey, meanwhile, had more of a fluky performance, snagging six balls for 80 yards. ",
            "4": "Sam Bradford started hot, hitting his first passes for 98 yards. However, he was just 8-of-19 after that, finishing with 167 yards, two touchdowns and an interception. ",
            "5": "Bradford's favorite target last week was Mark Clayton. The Raiders took notice and put Nnamdi Asomugha on Clayton, limiting the former Raven to two catches, 24 yards and a pair of touchdowns. ",
            "6": "Steven Jackson kept the Rams in the game, totaling 75 rushing yards on 19 carries and 50 receiving yards off four catches. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Texans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "27"
        },
        "comments": {
            "amount": "9",
            "1": "The Texans had every reason to lose this game. They just enjoyed the most important win in franchise history. They were looking ahead to the Dallas game. Their former offensive coordinator, Kyle Shanahan, was now coaching the Redskins. And they were down at one point by the score of 27-10. They could have easily packed it in. But that's why they're now one of the top teams in the NFL. I'm really glad I picked them to go to the AFC Championship in my season previews, but I'm now regretting not having them beat Baltimore to meet Green Bay in the Super Bowl. ",
            "2": "Faced with a deficit the entire game, Matt Schaub had to air the ball out 52 times. He completed 38 passes, finishing with a whopping 497 yards, three touchdowns and an interception. He was sacked five times, which makes his performance that much more remarkable. ",
            "3": "Andre Johnson caught 12 balls for 158 yards and a touchdown. The big news here is that he left the game with an ankle injury. He returned late in the fourth quarter, but is scheduled to have an MRI on Monday. Johnson told the media that the injury isn't a big deal. ",
            "4": "Jacoby Jones owners have to be frustrated now; while their wideout snagged six balls for 53 yards and a touchdown, they watched Kevin Walter notch 11 receptions for 144 yards and a touchdown. Walter is an inconsistent fantasy option and still has to deal with Jones, so don't get too excited about this. ",
            "5": "Arian Foster didn't run for 230 yards this time, but still had a decent outing, rushing for 69 yards and catching three balls for 69 more yards. ",
            "6": "The Redskins actually had this game won. They nailed the decisive 52-yard field goal in overtime, but saw it nullified because of a Gary Kubiak timeout. And how's this for irony? Washington converted a 3rd-and-20 in the final minutes of regulation, but had it called back because of a hold. I guess the holding gods giveth and taketh away. ",
            "7": "After a sub par opener, Donovan McNabb was really incredible, going 28-of-38 for 426 yards and a touchdown. McNabb's score went to Chris Cooley, who had three grabs for 64 yards. ",
            "8": "Santana Moss led the Redskins with 10 grabs and 89 yards. He fell short of scoring a touchdown, so his fantasy performance could have easily been better. ",
            "9": "Clinton Portis scored twice, but was otherwise ineffective, gaining just 33 yards on 13 attempts. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Jets",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "Where the hell did this come from? Seriously. Mark Sanchez was awful against the Ravens and throughout the entire preseason. He looked like he had no confidence in himself, and he was having major problems reading the blitz. The general consensus was that Sanchez is a bust. Oops. Sanchez was brilliant against the Patriots, going 21-of-30 for 220 yards and three touchdowns. He was sharp and confident, and certainly wasn't phased despite the fact that his team didn't convert a first down until three minutes into the second quarter. ",
            "2": "And speaking of surprises, LaDainian Tomlinson is back in MVP form. He's running quickly and powerfully, as if this were 2006 again. He rushed for 76 yards on 11 carries, and chipped in with four receptions for 26 receiving yards. Shonn Greene played second fiddle to Tomlinson, gaining 52 yards on 15 carries. Greene didn't get his second touch until the end of the first half. ",
            "3": "Sanchez's touchdowns went to Dustin Keller (7 catches, 115 yards), Braylon Edwards (5-45) and Jerricho Cotchery (4-26). ",
            "4": "Darrelle Revis was beat for a 34-yard touchdown against Randy Moss at the end of the first half. He pulled up lame and left with a hamstring injury. He'll have an MRI on Monday. As bizarre as this sounds, I really think Revis' injury hurt New England. With Revis out, Tom Brady (20-36, 248 yards, 2 TDs, 2 INTs) began targeting Moss more often, going away from what was working in the first place (throwing short stuff to Wes Welker and Aaron Hernandez). Moss finished with just two grabs for 38 yards and that score. He also dropped a pass that resulted in a Brady interception. Welker and Hernandez, meanwhile, each had six grabs for 38 and 101 yards, respectively. Welker scored once, while Hernandez really shined in his second ever NFL game. ",
            "5": "The Patriots predictably got nothing out of their running game. Kevin Faulk led the backfield with 22 yards on five carries. Fred Taylor had just 11 yards on five attempts. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Chargers led throughout this game and ended up blowing out the sloppy Jaguars, but things looked very bleak at one point. Star running back Ryan Mathews was knocked out in the first half with a nasty-looking ankle injury. Mathews (5 carries, 26 rushing yards; 2 catches, 29 receiving yards) was carted off, but later returned to the sidelines and still had his pads on. According to reports, Mathews is fine. ",
            "2": "Mathews' replacement, Mike Tolbert, rushed for 82 yards and two touchdowns on 16 carries. He would have been the No. 1 waiver-wire pick-up this week had Mathews' injury been serious. ",
            "3": "Aside from two interceptions, Philip Rivers was flawless, going 22-of-29 for 334 yards and three touchdowns. Two of Rivers' scores went to Antonio Gates (5 catches, 57 yards), and the other was passed to Malcom Floyd (3-95). Legedu Naanee had a disappointing afternoon with just one 14-yard reception. ",
            "4": "While Rivers tossed two picks, David Garrard was horrendous, throwing four interceptions. He went 15-of-23 for 173 yards. He was benched in the second half - Luke McCown was a decent 11-of-19 for 120 yards - but later came in to air out a garbage-time touchdown. Earlier this preseason, I predicted that McCown would eventually start for Jacksonville this year. I still stand by that. ",
            "5": "The Maurice Jones-Drew fantasy owners who didn't slit their wrists after this game have to be really depressed right now after watching their RB1 gain just 31 yards on 12 carries. It's not time to panic yet, but Jones-Drew has just 129 yards on 35 carries through two games. ",
            "6": "A week after Champ Bailey shut him out, Mike Sims-Walker notched 10 receptions for 105 yards and a touchdown. Mike Thomas, meanwhile, came up with four grabs for 43 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Colts",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "I'm not sure if Giants offensive coordinator Kevin Gilbride stole the playbooks of Andy Reid, Brad Childress and Mike Martz, but he inexplicably put together one of the worst game plans I've ever seen. The math was simple - Arian Foster ran for 230 yards on the Colts last week, so establishing the run was something the Giants would do early on, right? I guess not. Of the Giants' first 10 plays, only three were runs by Ahmad Bradshaw or Brandon Jacobs. Gilbride opted to repeatedly call pass plays despite the fact that Indianapolis has a great pass rush and a solid secondary. Eli Manning consequently was sacked four times, and was just 13-of-24 for 161 yards, two touchdowns, one interception and three fumbles. Bradshaw, meanwhile, finished the game with 89 yards on 17 attempts. Brandon Jacobs had just four carries for eight yards. He threw his helmet into the crowd in the second half, and never took the field afterward. ",
            "2": "Hakeem Nicks had a really disappointing performance. He salvaged a late 31-yard touchdown in junk time, but had just two grabs for 38 yards. He clearly was hobbled by his ankle injury, and probably should have just sit this one out. ",
            "3": "As for Eli's other receivers, Mario Manningham had four receptions for 75 yards and a score. Steve Smith notched four catches for 35 yards. ",
            "4": "There was no way Peyton Manning was letting his team go 0-2. He was flawless, going 20-of-26 for 255 yards and three touchdowns. ",
            "5": "If trying to contain Peyton wasn't enough, the Giants couldn't stop Indianapolis' running game. Joseph Addai had 92 yards on 20 carries, while Donald Brown had 69 yards and a score on 16 attempts. ",
            "6": "Peyton's touchdowns went to Reggie Wayne (7 catches, 96 yards), Dallas Clark (5-83) and Austin Collie (4-25). Pierre Garcon had just one reception for 11 yards. "
        }
    }
}