{
    "year": "2010",
    "week": "11",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "This may sound odd considering the score, but this outcome could have been a lot uglier. The Ravens outgained the Panthers 258-93 in the first half, but weren't able to put the game away because of their red zone struggles. In their first two trips to the red area, they had to settle for a field goal after an odd play call on 3rd-and-goal on the 5-yard line (a Ray Rice run) and then fumbled the ball away on the ensuing trip. It wasn't better after intermission. On Baltimore's first possession, Derrick Mason tripped on his route on third down, forcing the Ravens into yet another short field goal. Fortunately for the Ravens, they were able to cover the enormous 12-point spread with two fourth-quarter pick-sixes. ",
            "2": "The Panthers were simply overmatched, as they started their fourth-string quarterback and running back. Brian St. Pierre, who was a stay-at-home dad last week, went 13-of-28 for 173 yards, one touchdown and the aforementioned pick-sixes. He also should have thrown several more interceptions (Terrell Suggs missed an easy one.) Most of St. Pierre's yardage came on one 88-yard touchdown to David Gettis. ",
            "3": "Poor Steve Smith had just four catches for 46 yards. He's wasting away on this miserable Carolina team. ",
            "4": "Mike Goodson once again posted great fantasy numbers, rushing for 120 yards on 22 carries. ",
            "5": "Joe Flacco was amazing, going 24-of-33 for 301 yards and a touchdown. At halftime, he was 16-of-18 for 213 yards and the score; it's a shame the Panthers couldn't keep up because Flacco could have posted career numbers. ",
            "6": "Ray Rice didn't have great rushing numbers (19-65), but collected 131 total yards and a score. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "31"
        },
        "comments": {
            "amount": "6",
            "1": "What a crazy game. It was 28-7 Bengals at one point. I actually began writing my recap of this contest at halftime. Of course, I had to change everything, but here are the first few points I wrote before Buffalo took control of this battle (in italics): <i> ",
            "2": "A sentence I posted in the live in-games thread pretty much summed up my feelings about this game: Why the f*** are the Bengals trying? Your season is over, douchebags. After a heart-breaking loss to the Colts, which gave Cincinnati its seventh loss of the year, there was nothing to play for. I have no idea where they summoned this energy from. ",
            "3": "This game was 31-14 Bengals at halftime, but you can't really say that Cincinnati was dominating the contest. The Bengals were outgaining the Bills by only six yards at intermission (220-214), but were so far ahead because <strike> Andrew Luck</strike> Ryan Fitzpatrick tossed two interceptions to Johnathan Joseph, one of which was returned for a touchdown. </i> ",
            "4": "OK... as you can tell by the score, the Bills mounted an improbable comeback and actually blew out the Bengals. Gus Johnson and his broadcasting partner actually questioned whether or not Cincinnati quit in the second half. Meanwhile, Facebook friend Todd K. posted the following: <i> Do you want to apologize to Ryan Fitzpatrick now? I don't think you understand the irascible intangibles of Paddy Power. If Andrew Luck was playing he would be thinking about his cold toes, down 28-7. Anyway, Ryan and I are waiting. He likes fruit baskets. </i> Fitzpatrick was amazing in the second half, going 21-of-34 for 316 yards, four touchdowns and the aforementioned dual interceptions. However, he still has major physical limitations, and it's highly doubtful that he would have been able to accomplish this against a defense that wasn't horrible and hadn't quit. ",
            "5": "Three of Fitzpatrick's touchdowns went to Steve Johnson (8-137). Fred Jackson, meanwhile, had 116 yards and two scores on 21 carries. ",
            "6": "Carson Palmer was on fire early, but finished just 19-of-34 for 230 yards, two touchdowns and a pair of interceptions. Palmer looked exclusively to Terrell Owens (3-63, TD) and Jordan Shipley (5-71). However, he seemed to ignore Chad Ochocinco (3-28, TD), who was open on several occasions, but didn't get many targets thrown his way. He had just one catch after the opening drive. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "In the post-Wade Phillips era, the Cowboys are finally playing smart football. They're no longer committing turnovers or penalties (six). The Lions actually outgained Dallas by 83 yards, which makes the Cowboys' win that much more remarkable considering they lost in that fashion when Tony Romo was under center. If only Jerry Jones made the coaching change earlier... ",
            "2": "Jon Kitna was an economical 18-of-24 for 147 yards and three touchdowns. He also rushed four times for 40 more yards and an additional 29-yard score. ",
            "3": "Dez Bryant had just three catches for eight yards and a score, but the touchdown was a thing of beauty. Kitna lobbed it up for Bryant in the end zone, and the stud rookie just snatched the ball right over the defender's head. ",
            "4": "Felix Jones had a solid performance (11 carries, 51 yards; 3 catches, 35 rec. yards). He left the game with a hip injury, but was able to return shortly afterward. ",
            "5": "Shaun Hill went 32-of-47 for 289 yards, two touchdowns and an interception. Hill's scores went to Nate Burleson (7-97) and Calvin Johnson (6-46). ",
            "6": "Jahvid Best caught four balls for 15 receiving yards, but did nothing on the ground (3-2). Not only is he hurt; Detroit's anemic offensive isn't opening up any holes for him. The Lions absolutely must address the front (as well as the secondary) this offseason. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "In last week's power rankings, I introduced a rock-paper-scissors dynamic with all of the top AFC squads because I couldn't decide on a top team. Well, if we extend it to the players in this game, I think it's safe to say that Abram Elam beats Maurice Jones-Drew. In the first half, Jones-Drew actually threw a weak pass out of the halfback option that was intercepted by Elam. In the third quarter, Jones-Drew fumbled the ball, which was picked up by Elam and returned for a touchdown. ",
            "2": "Jones-Drew's two turnovers were nothing compared to David Garrard. Garrard gave the ball up a whopping four times; he went 20-of-34 for 254 yards, two touchdowns, three interceptions (one was tipped) and a fumble. It's worth noting that he endured five drops. Jones-Drew would end up saving Garrard, however. On the final drive, he took a short pass for 75 yards down to the Cleveland 1-yard line. He scored two plays later. Jones-Drew finished with 133 rushing yards (23 carries) and 87 receiving yards (3 catches) and the decisive score. ",
            "3": "The Jaguars had six sacks in this contest. That's noteworthy because they had just 14 sacks on the year going into the game, and were without Aaron Kampman. Second-year end Jeremy Mincey had two sacks. ",
            "4": "Jacksonville's victory wasted away a brilliant performance by Colt McCoy. The right-handed version of Steve Young continues to impress, going 17-of-28 for 241 yards, one touchdown and an interception. McCoy displayed tremendous elusiveness in the pocket, continuously escaping from pass-rushers and making plays downfield. Unfortunately, he took a hard hit late in the game and was limping around on his final two drives. Afterward, it was revealed that he suffered a sprained ankle. ",
            "5": "Peyton Hillis put together yet another monstrous outing, rushing for 48 yards on 21 carries and catching six balls for 95 receiving yards and a touchdown. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "At the end of the first quarter, the Cardinals were up, 3-0. By the beginning of the third quarter, it was 21-3 Kansas City. What happened to Arizona? As Facebook friend Elliot D. suggested: After the 1st quarter, Derek Anderson drank from his magic flask. That's definitely a possibility. Here's another: Jamaal Charles had ZERO touches in the first quarter. By the time it was 21-3, Charles had 10 touches for 104 total yards (60 rushing, 44 receiving). You really have to wonder what's going through Todd Haley's mind sometimes. Charles finished with 126 total yards (88 rush, 38 rec.) Thomas Jones, however, wasn't a slouch, rushing for 71 yards and two touchdowns on 15 attempts. ",
            "2": "Matt Cassel's numbers weren't pretty (15-24, 193 yards, 2 TDs), but he made enough plays to carry the Chiefs to victory, including a 38-yard touchdown to Dwayne Bowe. Bowe hauled in six grabs for 109 yards and a pair of scores. ",
            "3": "The Cardinals did an OK job to move the chains in their own territory, but seemed to bog down whenever they crossed midfield. They struggled to convert third downs (4-of-15) and committed way too many penalties (11). ",
            "4": "Derek Anderson went 25-of-46 for 295 yards and a touchdown, though most of his yardage (and touchdown) came in junk time. Fitzgerald (6-90) caught the score, which actually happened on the last play of the game. Coincidentally, the touchdown put the game over the total. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "The nail is in the coffin. The Packers have defeated Brett Favre - for good. ",
            "2": "The Packers completely dominated this game. It was 31-3 at the beginning of the fourth quarter, with Green Bay outgaining Minnesota by about 80 yards at the time. The Vikings simply had no answer for Aaron Rodgers, who went 22-of-31 for 301 yards and four touchdowns. Green Bay was down early (3-0 Vikings after the first quarter) because it seemed like Mike McCarthy was trying too hard to establish a running game. He eventually came to his senses after he watched Brandon Jackson (14-28) and Dimitri Nance (12-37) struggle. ",
            "3": "Congrats to anyone who owns Greg Jennings; the stud wideout had seven catches for 152 yards and three touchdowns. Donald Driver played, but didn't do much (4-31). ",
            "4": "Brett Favre, meanwhile, looked like he had nothing left. He went 17-of-38 for 208 yards and an ugly interception. Favre had numerous terrible misfires, including one play where he had a wide-open Sidney Rice downfield and completely overthrew him by about 10 yards. ",
            "5": "Speaking of Rice, he actually led the Vikings in receiving yardage (3-56). Rice is definitely worth picking up in all fantasy leagues. Percy Harvin, meanwhile, had just two grabs for 12 yards. ",
            "6": "I can only guess why Adrian Peterson was given only 14 carries (as mentioned, it was close early). Peterson took those attempts for 72 yards. Toby Gerhart, who had four touches, was guilty of a key fumble. ",
            "7": "In the wake of this defeat, I'm confident that Brad Childress will be fired by Monday afternoon. The Vikings' season is over, and there's no point in continuing with an old, ineffective regime. It also wouldn't surprise me to see Favre retire soon. As in the next couple of weeks. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "27"
        },
        "comments": {
            "amount": "4",
            "1": "I can sum this one up in two short sentences: The Jets find ways to win. The Texans find ways to lose. ",
            "2": "Mark Sanchez is unbelievable and continues to improve every single week. In addition to posting great numbers - 22-of-38 for 315 yards, three touchdowns and an interception - Sanchez took the Jets 72 yards in 33 seconds on a game-winning drive. He went 4-of-5 for 72 yards on that possession, including a 42-yard bomb to Braylon Edwards. His sole incompletion, by the way, was a spike to stop the clock. Edwards (4-86) had a very good game. Santonio Holmes (7-126) was spectacular. Holmes caught two touchdowns, including the clincher. ",
            "3": "Meanwhile, you really have to feel for the Texans. I tweeted the following (<a href=https://twitter.com/walterfootball>@walterfootball</a>) after Houston inexplicably blew a 27-23 lead with 46 seconds remaining: The Texans are cursed. I'm convinced that Bob McNair urinated on an Indian burial ground earlier in his life. ",
            "4": "Some additional notes: - The Jets surprisingly couldn't run the ball against Houston; Shonn Greene (15-42) and LaDainian Tomlinson (12-36) both failed to eclipse three yards per carry. Tomlinson did have seven catches for 71 yards. - Matt Schaub struggled early, but finished strong. He went 19-of-33 for 254 yards and a touchdown to Joel Salad Dreessen (4-106). - Like Peyton Hillis last week, Arian Foster ran well against the Jets. He gained 84 yards and two scores on 22 attempts, and also caught six balls for 59 receiving yards. - The Jets once again took Andre Johnson out of the game; Johnson had just four grabs for 32 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "3"
        },
        "comments": {
            "amount": "4",
            "1": "The NFL is getting really ridiculous. Seriously, they're going to have to turn it into a two-hand touch league. Look, I'm all for fining and suspending players for these helmet-to-helmet hits, but some of the other stuff needs to go. If you haven't seen it, a Jason Campbell pick-six in the third quarter was nullified because of a James Harrison penalty. Harrison tackled Campbell immediately after the throw - it was completely clean - but was whistled for driving Campbell into the turf. Well, at least that play didn't matter for the Steelers; the game was already well in hand, even without the pick-six. Pittsburgh completely dominated Oakland, outgaining them 431-182 (228-52 in the first half). It was so frustrating for the Raiders that Richard Seymour threw a punch at Ben Roethlisberger and was ejected from the game. ",
            "2": "The Raiders just couldn't move the chains at all. They were 3-of-14 on third down. Jason Campbell went 7-of-19 for 70 yards and an interception. He and an equally ineffective Bruce Gradkowski (13-of-24, 98 yards, 1 INT) took a combined six sacks. The running game was also anemic, as Darren McFadden had just 14 yards on 10 carries. ",
            "3": "The Steelers, meanwhile, couldn't be stopped. They were 7-of-14 on third down. Ben Roethlisberger, who was sacked only twice, went 18-of-29 for 275 yards and three touchdowns, one of which was a 52-yard bomb to Mike Wallace (3-116). Big Ben also scrambled thrice for 55 yards and a fourth score. ",
            "4": "The Raiders did a good job shutting down the running game; Rashard Mendenhall tallied 59 yards and a touchdown on 23 attempts. Hines Ward was also ineffective (3-28). "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "Vince Young is no longer the starting quarterback of the Tennessee Titans. If you haven't heard, Young (12-16, 165) suffered a thumb injury during the Washington game, and was replaced by Rusty Smith. After the loss, Young stormed out of the locker room after telling Jeff Fisher, I'm not running out on teammates; I'm running out on you. A frustrated Fisher then took the podium and announced that even if healthy, Young will not be the starter for the Titans going forward. Young will likely never play for Tennessee ever again, considering he's owed $12.75 million in 2011. With Kerry Collins out for several weeks, it'll be Rusty Smith, who looked really awful in relief. Smith went 3-of-9 for 62 yards and an interception that looked more like a punt. He also had another pick dropped by Phillip Buchanon. ",
            "2": "You may wonder how Smith is going to get the ball to Randy Moss, but Young couldn't even do that. Moss didn't have a single reception, though he served as a good diversion by opening up lots of running room for Chris Johnson (21-130). ",
            "3": "The Redskins ended up winning this contest in overtime, but it was more of Tennessee imploding. The Titans committed two 15-yard personal foul penalties on Washington's game-winning drive. They also dropped an interception of Donovan McNabb's. ",
            "4": "McNabb went 30-of-50 for 376 yards, one touchdown and a pick. He hit numerous deep throws, which explains his bloated passing yardage total, but was his usual erratic self all afternoon. ",
            "5": "Santana Moss caught six balls for 106 yards and McNabb's sole touchdown. Chris Cooley (7-91) also had a nice game. ",
            "6": "Leave it to Mike Shanahan to screw with fantasy football owners. Shanahan announced that Clinton Portis would start. Portis, however, had just five carries for 32 yards before suffering a groin injury. Luckily, Keiland Williams didn't do much either (23-68). "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Saints",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "I'll get to the Saints' amazing performance in a second. I just have to address something first. There are numerous bad officials in the NFL, but the most crooked of them all just could be Mike Carey, who was in charge of this contest. It seemed like every time I looked up at the screen, there was a shady penalty being called on the Seahawks. Seattle was actually whistled for nine infractions, but most of them were significant. This includes what Carey called a helmet-to-helmet penalty on Drew Brees that was clearly a chest tackle. There were also mysterious holding and intentional grounding penalties all afternoon. Toward the end, the Seahawks recovered an onsides kick, but Carey whistled Lawyer Milloy for illegal touching, when it appeared as though he established himself inbounds before he recovered the football. Pete Carroll was infuriated, but was denied the opportunity to challenge the call for some strange reason. Midway through the second quarter, it was apparent that Carey was going to do everything in his power to have New Orleans win by 12 points or more. Mission accomplished, Mike. ",
            "2": "I don't want to take anything away from the Saints though. They were magnificent. They punted only once, and more importantly, were nearly flawless in the red zone, which was a big problem for them in the first nine weeks of the season. ",
            "3": "Brees finished 29-of-43 for 382 yards, four touchdowns and two interceptions (one was a late, meaningless pick). His scores went to Marques Colston (8-113) and Robert Meachem (3-50). ",
            "4": "Reggie Bush and Pierre Thomas were still out, but New Orleans didn't miss them. Chris Ivory rushed for 99 yards and a touchdown on 23 carries. ",
            "5": "If there's a silver lining to this loss for Seattle, it's that Matt Hasselbeck played really well. He went 32-of-44 for 366 yards and a touchdown. ",
            "6": "Mike Williams (6-109) was great. The numbers could have even been better, but he suffered a sprained foot and missed some action. ",
            "7": "If Hasselbeck was the silver lining, Marshawn Lynch was the turd in the punch bowl. Lynch absolutely sucked. He had 36 yards on seven carries, but fumbled twice in Saints territory when the Seahawks were putting together quality drives. Perhaps Carey and Lynch teamed up to ensure a New Orleans cover. Is that why they high-fived after the game? <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "Like the Saints and Falcons, Tampa Bay was an NFC South team that beat an NFC West team this week. If there was any doubt - and you never know with those GameCenter degenerates - we can now safely say that the NFC South is the better division. ",
            "2": "A score of 21-0 isn't overly intimidating, but the Buccaneers completely embarrassed San Francisco. They outgained them by 110 yards and limited the 49ers to just 189 net yards of offense (64 in the first half). This was San Francisco's first home shutout since 1977! ",
            "3": "Troy Smith was absolutely horrible. One week after playing well against the Rams, Smith went just 16-of-31 for 148 yards and an interception. He missed open receivers all afternoon. The 49ers absolutely have to obtain a new quarterback this offseason. Give the Buccaneers credit though; they sacked Smith six times, and limited Frank Gore to 23 yards on 12 carries. ",
            "4": "Josh Freeman, meanwhile, didn't make many spectacular throws, but was very efficient. He went 13-of-20 for 136 yards and two touchdowns. ",
            "5": "One of Freeman's scores went to Mike Williams (3-54), who played well despite being arrested on suspicion of a DUI earlier in the week. ",
            "6": "The 49ers were third against the rush entering this contest, yet LeGarrette Blount (26-82) and Cadillac Williams (7-51, TD) had tons of success running the ball. San Francisco's tackling, particularly in the second half, was atrocious. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "This game was much closer than this score indicates. It was 26-17 until a very late Falcons touchdown and 2-point conversion, and prior to that score, Atlanta had outgained St. Louis by only about 60 yards. The Rams simply made way too many mistakes. They committed five penalties in the first half. In the fourth quarter, Sam Bradford tossed a weird shovel pass directly to a Falcons defender inside the 5-yard line. It was odd because there was no Rams receiver in the vicinity. ",
            "2": "Oh, and you'd have to say that Matt Ryan's brilliance played a factor in Atlanta's victory. Ryan was in complete control of this game, going 26-of-39 for 253 yards and two touchdowns. Watching him dissect the Rams was a thing of beauty. I'd love to elevate him to elite quarterback status, but I'd like to see him have several great performances in outdoor games. ",
            "3": "St. Louis had no answer for Roddy White, who caught nine balls for 83 yards. Unfortunately, he didn't catch a touchdown because Ryan found his lesser targets (Brian Finneran, Justin Peelle) in the end zone. ",
            "4": "The Rams contained Michael Turner throughout, but surrendered a 39-yard touchdown at the very end. Turner gained 131 yards on 28 attempts. ",
            "5": "I mentioned Bradford's foolish shovel pass interception, but he played well otherwise. He went 27-of-42 for 233 yards, two scores and the aforementioned pick despite the lack of talent around him. ",
            "6": "Danny Amendola continues to be Bradford's top target. He caught eight balls for 63 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "Even when the Patriots led 14-0, 21-7 and 31-14, I think most people had the feeling that Peyton Manning would do something to either win the game or make it close in the fourth quarter. After all, we've seen it before - these teams always play close. But after drawing to within 31-28, Manning had the opportunity to either tie or win on the final drive. He drove the Colts into field goal position, but tossed an interception as his arm was hit. ",
            "2": "The Patriots won this game because they didn't make any mistakes. They took only one sack, and committed no turnovers and only one penalty. Indianapolis, meanwhile, had three give-aways (three Manning interceptions) and were whistled for six infractions. ",
            "3": "Brady went 19-of-25 for 186 yards and two touchdowns. Box score analysts will assume that he wasn't all that great, but Brady was terrific. The Colts had no answer for him, as Brady dissected their defense to near perfection. ",
            "4": "Brady spread the ball around to three key players: Deion Branch (7-70), Wes Welker (5-58, TD) and Danny Woodhead (7 carries, 69 yards; 4 catches, 21 rec. yards, TD). Indianapolis' run defense was pathetic; BenJarvus Green-Ellis rushed for 96 yards and a touchdown on 21 attempts. ",
            "5": "Manning, meanwhile, had those three picks, but was tremendous otherwise in a near comeback. He went 38-of-52 for 396 yards and four touchdowns. ",
            "6": "Two of Manning's scores went to Blair White (5-42). Austin Collie (5-60) started, but left the game when he was hit in the head. He's clearly not over the concussion he suffered against the Eagles. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "This was a heartbreaking loss for the Giants. They had the perfect plan for defending QB Dog Killer, and did a great job slowing him down. Despite this, they still fell short by 10 points. You could argue that New York could have won this game because it shot itself in the foot with careless turnovers (namely Eli Manning's fumble in Eagles territory in the fourth quarter), but Philadelphia screwed up just as much - if not more. The Eagles outgained New York by 184 yards. They had red zone struggles, an easy dropped touchdown by Jason Avant and fumbles of their own (two lost). QB Dog Killer, meanwhile, barely missed DeSean Jackson on several occasions. Philadelphia could have easily scored way more than 27 points. ",
            "2": "QB Dog Killer went 24-of-38 for 258 yards. He also rushed 11 times for 34 yards and a score, as the Giants did an incredible job bottling him up and limiting his scrambling yardage. ",
            "3": "Jackson caught five balls for 50 yards, but as mentioned, his night should have been much better. Jeremy Maclin (9-120) did the most damage out of the receiving corps. ",
            "4": "With the Giants entirely focused on QB Dog Killer, LeSean McCoy tore it up. He tallied 111 rushing yards and a touchdown on just 14 carries. He also snagged five balls for 29 receiving yards. ",
            "5": "Eli Manning committed four turnovers (three interceptions and a fumble) and finished 20-of-33 for 147 yards and two touchdowns otherwise. One of the picks was made in desperation mode, but the other three give-aways, namely the fumble, proved to be way too costly. "
        }
    },
    "numberOfGames": "14"
}