{
    "year": "2010",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "If the Dolphins had a crappy kicker, they might be winless right now. They once again struggled in the red zone thanks to player ineptness (Ronnie Brown drop) and poor play-calling (short pass on 3rd-and-8; run on 3rd-and-6). However, Carpenter was able to salvage this victory on a 5-of-5 afternoon, including a 54-yard bomb. ",
            "2": "Miami's offense was solid otherwise, generating 354 net yards. Chad Henne went 24-of-37 for 217 yards and an interception. Three of his receivers had five or more catches: Brandon Marshall (5-64), Davone Bess (7-53) and Brian Hartline (5-53). ",
            "3": "The Dolphins ran the ball really well; Brown had 61 yards on 16 carries, while Ricky Williams mustered 47 yards on nine attempts. ",
            "4": "The Bengals' offense was actually really impressive on its opening drive, but fizzled out afterward. In fact, they didn't achieve a first down in between the 2:45 mark of the second quarter and the 11:10 mark of the fourth quarter. As you might guess, this was yet another poor afternoon from Carson Palmer. Palmer went 17-of-38 for only 156 yards, two touchdowns and an interception. Palmer's second score was bogus; Dolphins safety Chris Clemons had a routine interception, but tipped it up twice and into the hands of Terrell Owens. ",
            "5": "Speaking of Owens, he had both of Palmer's scores along with five receptions for 65 yards. Chad Ochocinco, meanwhile, disappointed yet again with three grabs for 34 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "Chiefs fans have been sending me e-mails since the middle of September asking me why I hate their team. I don't dislike them; I just don't think they're any good. So with that in mind, here was my response when Ryan Succop hit the game-winning field goal with five seconds remaining in overtime: <i> Chiefs win! Chiefs win! I love the Chiefs!!!!!!!!!!!!!!!!!!!!!! </i> In case you're wondering, I had Kansas City in survivor. Phew. Of course, the Chiefs would have never been in a position to lose or tie had Todd Haley not gone for it and failed on a 4th-and-2 on Buffalo's 19 early in the second quarter. By my count, Haley has only succeeded twice on these unwise fourth-down gambles this year. ",
            "2": "Kansas City ran all over Buffalo's dreadful run defense. Thomas Jones had 77 yards on 19 carries, but that was nothing compared to Jamaal Charles' 177 yards on 22 attempts. Charles also had four catches for 61 receiving yards. ",
            "3": "The reason the Chiefs managed only 13 points? Matt Cassel just wasn't very good. He went 14-of-26 for 152 yards and a touchdown, but had a horrible interception dropped by Bills safety George Wilson. ",
            "4": "Buffalo's quarterback was only slightly better. Ryan Fitzpatrick went 24-of-48 for 223 yards, one touchdown and an interception. The Bills couldn't really get anything going except for a couple of drives in this contest, as Fitzpatrick had just one completion of longer than 21 yards. On the bright side, Fitzpatrick scrambled six times for 43 rushing yards. ",
            "5": "Another week, another wasted C.J. Spiller game. Fred Jackson saw 20 carries (64 yards) to Spiller's six (17 yards). Spiller also had four receptions for 28 more yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "49ers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The Declaration of Independence. The Boston Tea Party. And now, the first three quarters of the Broncos-49ers game. These are three of the darkest moments in England's history. In front of 84,000 rowdy fans, the 49ers and Broncos played a very ugly contest. The first touchdown wasn't scored until the third quarter, and Denver's only end-zone trip came from Tim Tebow. In fact, all but 10 of the points in this contest didn't come until the fourth quarter. ",
            "2": "Troy Smith didn't exactly prove that he can be a starting quarterback in the NFL, but played somewhat well in his first start since 2007. Smith went 12-of-19 for 196 yards and two touchdowns (one pass, one rush), though 38 of those yards came on a desperation heave that will be interceptioned nine out of 10 times. ",
            "3": "Frank Gore really willed the 49ers to a comeback from down 10-3 and an eventual victory. He rushed for 118 yards and a touchdown on 29 carries. ",
            "4": "Michael Crabtree (3-53) hauled in Smith's aerial score. Vernon Davis and Smith, however, weren't clicking; the All-Pro tight end had just one catch for 12 yards. ",
            "5": "Kyle Orton didn't look good, but once again compiled a ton of yardage in between the 20s. Orton went 28-of-40 for 369 yards, one touchdown and an interception. ",
            "6": "Brandon Lloyd notched seven receptions for 169 yards and Orton's score. ",
            "7": "Knowshon Moreno rushed for 40 yards on just 11 carries, as the Broncos had very poor balance on offense. Considering that the 49ers didn't have a lead of more than three points until the middle of the fourth quarter, you have to wonder why Denver didn't run the ball more often. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "25"
        },
        "comments": {
            "amount": "8",
            "1": "The Redskins have been finding ways to win this year despite being outplayed. In this contest, however, Mike Shanahan willed his team to a loss. Down three points with 2:15 remaining in regulation and two timeouts, Shanahan opted to go for it on a 4th-and-10 on his own 28-yard line. Rather than punting it away and trying to come up with a stop, the Redskins saw Donovan McNabb throw an incompletion. A Jason Hanson field goal later, the Redskins had the ball on their own 30 with 1:50 left on the clock. However, Shanahan opted to go with Rex Grossman, citing afterward that he thought Grossman gave him the best chance to win. Umm, OK? On Grossman's first play, the turnover-prone quarterback predictably fumbled the ball, which was returned for a touchdown by Ndamukong Suh. ",
            "2": "McNabb didn't play particularly well, but shouldn't have been benched. He went 17-of-30 for 210 yards, one touchdown and a really stupid interception that he tossed with the lead late in the fourth quarter. McNabb and Grossman were sacked six times. ",
            "3": "Yet another game where Santana Moss caught six or more passes; Moss had six grabs for 56 yards. Anthony Armstrong paced the Redskins with 92 yards on three catches. ",
            "4": "Ryan Torain really disappointed fantasy owners; he mustered just 10 yards on nine carries. ",
            "5": "Having said all that, the Lions ultimately won this game, and they deserve the credit. It's really a shame because this is what we were supposed to see all year. Finally healthy, Matthew Stafford went 26-of-45 for 212 yards, four touchdowns and an interception. Stafford started slow and appeared rusty early on, but really picked it up in the second half. ",
            "6": "Calvin Johnson is a monster. He caught nine passes for 101 yards and three touchdowns. Brandon Pettigrew hauled in Stafford's other score. ",
            "7": "Jahvid Best rushed for just 48 yards on 12 carries, but also had five receptions for 31 more yards. ",
            "8": "Ndamukong Suh appears as though he'll be running away with the Defensive Rookie of the Year Award. In addition to the aforementioned touchdown, Suh had two sacks, bringing his season total to 6.5. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Rams",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "I had no idea why the Rams were just 3-point favorites over the Panthers. With this shady point spread - St. Louis and Carolina are not equals - Vegas indicated that there might be something strange going on. Well, apparently not. The Rams dominated this contest; it was 20-3 until the final couple of minutes when Carolina scored a garbage touchdown. ",
            "2": "Sam Bradford continues to be very impressive, particularly at home. Bradford went 25-of-32 for 191 yards and two touchdowns. Sure, he was playing a horrible Panthers secondary, but all of his top receivers were out. In fact, Brandon Gibson led St. Louis in receptions (6) and yardage (67). ",
            "3": "Coming off finger surgery, Steven Jackson struggled to find running room, gaining 59 yards on 23 carries. But it's not like Jackson looked terrible or anything; he had a few impressive runs. ",
            "4": "Carolina fans, meanwhile, really have to be depressed. Not because they lost this game; but because owner Jerry Richardson is too cheap to fire John Fox, who has no interest in the team's future. Fox continues to use Matt Moore, who was downright awful in this contest. Moore went 23-of-37 for 194 yards, one touchdown and three ugly interceptions, including one that looked like an ugly punt. ",
            "5": "On the bright side, Steve Smith's fantasy owners were happy. Smith didn't find the end zone, but hauled in nine receptions for 85 yards. Brandon LaFell (4-40) caught Moore's lone score, though it was in junk time. ",
            "6": "As of halftime, Jonathan Stewart was on pace to crack 100 rushing yards if he had 400 carries; Stewart mustered just one yard on only four attempts, which makes you wonder why the Panthers had only four rushes in the first 30 minutes of the game. Stewart finished with 30 yards on 14 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "9"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "This is why handicapping based on matchups is often futile. With the Packers completely bogged down with injuries on the defensive front, it was pretty much a given that the Jets' powerful offensive line would push Green Bay around and run for a billion yards. Instead, New York had LaDainian Tomlinson (16-54) and Shonn Greene (6-22) rush for just 3.5 yards per carry. In fact, the Jets became the first team to be shut out all year. ",
            "2": "With no running game, Mark Sanchez really struggled. He went 16-of-38 for 256 yards and two interceptions, both of which were weird simultaneous possession picks. To be fair, Sanchez endured numerous drops from his receivers, particularly Jerricho Cotchery. Ironically, Cotchery led the team with 89 receiving yards on four catches. Dustin Keller (2-45), Santonio Holmes (3-43) and Braylon Edwards (1-32) didn't do much. ",
            "3": "Rex Ryan made a really dumb decision early in this contest, opting to go for a fake punt on a 4th-and-18 on his own 20-yard line. The Jets initially got it, but Mike McCarthy challenged and got the call overturned. This led to a Packers field goal, which was the only score in this game until very late. ",
            "4": "Aaron Rodgers went 15-of-34 for 170 yards, but played a lot better than those numbers indicate. He had at least four passes dropped by Greg Jennings, who still caught six balls for 81 yards. James Jones also dropped a deep pass. ",
            "5": "Donald Driver, meanwhile, left this contest very early after reaggravating an injury. I'll keep saying it over and over, Driver should just sit out until he's healthy because he's hurting the Packers right now more than helping them. ",
            "6": "Clay Matthews, who led the NFL in sacks coming into this weekend, had yet another sack to bring his total to 9.5. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "25"
        },
        "comments": {
            "amount": "6",
            "1": "Does the streak begin here? Will the Chargers finally reel off tons of victories in a row like they do every year? I think it's a strong possibility, especially if the Texans lose to the Colts on Monday night. A good sign is that the Chargers didn't have any ridiculous unforced errors aside from an opening punt blocked for a safety. Other than that, they played a pretty clean game, which is very promising. ",
            "2": "Philip Rivers did heave an underthrown interception, but played so well otherwise that it can be excused. Rivers went 27-of-36 for 305 yards and two touchdowns despite not having his top three wide receivers. Rivers is now on pace to throw for 5,298 yards, which would break Dan Marino's single-season record (5,084). ",
            "3": "Aside from Antonio Gates (5-123, TD), San Diego's leading receiver was a rookie named Seyi Ajirotutu, which might be an insult in several languages. ",
            "4": "Ryan Mathews continues to struggle. The rookie runner had just 43 yards and a touchdown on 15 carries. Mathews missed some time with a minor injury, allowing Mike Tolbert to showcase himself (11-63, TD). Darren Sproles, meanwhile, had 77 total yards and a score. ",
            "5": "Vince Young suffered an ankle sprain in the middle of the fourth quarter of this contest, which is a shame because he was having a great game. Young completed just 10-of-21 passes, but tallied 253 yards and two touchdowns. Young connected on five passes of 24 yards or longer, including a 71-yard bomb to Nate Washington (4-117, TD). Kenny Britt didn't catch a single ball because he left the game in the first half with a hamstring injury. The good news is that Britt has a bye week to recover. ",
            "6": "Speaking of long gains, Chris Johnson had a 29-yard touchdown. He had just 59 yards on 15 carries, however. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "18"
        },
        "comments": {
            "amount": "9",
            "1": "This one hurts. I went 3-1 with my biggest plays this weekend, but the Vikings +6 lost as a five-unit pick. The Patriots triumphed by 10, but they didn't necessarily outplay Minnesota; in fact, the Vikings outgained New England, 410-362. The Patriots were able to score off a Percy Harvin dropped ball that turned into an interception and a broken play in which Tom Brady ran around and just heaved up a bomb to Brandon Tate. ",
            "2": "Of course, the big news coming out of this game was Brett Favre's status. Favre played and went 22-of-32 for 259 yards and an interception, but left in the fourth quarter with face lacerations. Tarvaris Jackson wasn't bad in limited relief, going 4-of-6 for 36 yards and a touchdown, as well as a 33-yard scramble in garbage time. ",
            "3": "Adrian Peterson ran the ball well, rushing for 92 yards and a touchdown on 25 carries. He also caught five balls for 50 more yards. ",
            "4": "Percy Harvin led the Vikings with six receptions for 104 yards, but had that aforementioned horrible gaff that really cost Minnesota the game. ",
            "5": "Randy Moss notched just one catch for eight yards. After the game, Moss told the media he won't answer anymore questions unless he's the one asking them. Moss is apparently content with being fined $25,000 each week. He'll be paying that in straight cash, homey. ",
            "6": "Before moving on to New England's players, I have to bash Vikings corner Asher Allen. Allen missed a key routine tackle that set up a late Patriots score and was the one torched by Tate on that weird long touchdown. ",
            "7": "Tom Brady went 16-of-27 for 240 yards and that fluky 65-yard score to Tate. Brady's days of putting up monster numbers every week are over, but he's still doing a great job of managing the game. ",
            "8": "BenJarvus Green-Ellis rushed for 112 yards and two touchdowns on 17 carries. I'm not sure where that came from, but Green-Ellis is certainly worth picking up in your fantasy league if he's available. ",
            "9": "A hobbled Deion Branch had just one catch for 12 yards. Tate paced the Patriots with 101 yards and a touchdown. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "35"
        },
        "comments": {
            "amount": "7",
            "1": "This game shouldn't have been close. The Buccaneers were up 31-14 when the Cardinals scored two quick touchdowns (one off a fumble returned for a touchdown) at the end of the third quarter. With Arizona inexplicably establishing a 35-31 lead in the fourth quarter, the best team in the NFC came back with a game-winning score, thanks to an incredible Josh Freeman 53-yard pass to Arrelious Benn down to Arizona's 1-yard line. ",
            "2": "Freeman went 18-of-25 for 278 yards and a touchdown. He played brilliantly and made only one mistake - taking a sack late in the fourth quarter to put his team out of field goal range. ",
            "3": "While Benn had the big catch, Mike Williams led the Buccaneers with four receptions for 105 yards and a touchdown. Williams, however, uncharacteristically dropped two passes. ",
            "4": "I hope you picked up LeGarrette Blount in your fantasy leagues last week! If not, get him immediately. Blount went off at Arizona, rushing for 120 yards and two touchdowns on 22 attempts, though he was responsible for a fumble returned for a score. ",
            "5": "Max Hall started this contest and threw Arizona's first touchdown pass of October. However, Hall (8-16, 71 yards, 1 TD, 2 INTs) was responsible for two pick-sixes, forcing Ken Whisenhunt to yank him out of the game. Derek Anderson was better by default, going 16-of-24 for 234 yards, one touchdown and two interceptions. ",
            "6": "Larry Fitzgerald caught two touchdowns, and also had six grabs for 72 yards. Steve Breaston, meanwhile, logged eight receptions for 147 yards. ",
            "7": "Tim Hightower was nowhere to be found; he had just one carry for zero yards. Chris Wells started, and rushed for 50 yards and a score on 16 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "Wow. One week after putting up 59 points on arch rival Denver, the Raiders whipped the NFC West-leading Seahawks by 30. Is it possible that this team is really good? ",
            "2": "Oakland's defense did a number on Seattle's offense. The Seahawks had five consecutive three-and-outs to open the game, and took eight sacks. They were a pathetic 1-of-16 on third down and totaled 162 total yards. The Raiders outgained Seattle, 545-162. ",
            "3": "Jason Campbell torched Seattle's secondary, going 15-of-27 for 310 yards and two touchdowns. Darrius Heyward-Bey of all people notched five receptions for 150 yards and a score. He also had a 30-yard end-around. ",
            "4": "The new-and-improved Darren McFadden continues to amaze. He rushed for 111 yards on 21 carries, and also caught two balls for 24 more yards. McFadden was easily able to gash Seattle's run defense once the massive Red Bryant left the game with a knee injury. ",
            "5": "The only bad news for the Raiders is that Nnamdi Asomugha suffered an ankle injury late in the game. Asomugha had to be helped off. I have to wonder why Asomugha was even on the field at that point. ",
            "6": "The Seahawks blew some opportunities. Mike Williams, who had only one catch for 27 yards, dropped a possible touchdowns. Olindo Mare, meanwhile, who is usually pretty automatic, whiffed on two kicks. ",
            "7": "Seattle really struggled to run the ball despite the fact that the Raiders were ranked 31st against the rush going into the weekend. Marshawn Lynch had negative rushing yardage at halftime, and finished with only seven yards on nine attempts. ",
            "8": "Matt Hasselbeck went just 13-of-32 for 160 yards and an interception. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Saints",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "Yeah, I think we can safely say that the Saints didn't put much effort into the Browns game last week. New Orleans had a much spirited performance against Pittsburgh, particularly from its defense. The Saints had an incredible goal-line stand on first-and-goal on the 6-inch line. They also sacked Ben Roethlisberger three times and hurried him on countless other occasions. It could have been even better, as New Orleans dropped two possible interceptions. ",
            "2": "Drew Brees, meanwhile, was masterful against Dick LeBeau's defense, going 34-of-44 for 305 yards, two touchdowns and an interception despite enduring a few drops from his receivers. ",
            "3": "Three of Brees' wideouts caught six or more passes: Robert Meachem (6-76), Marques Colston (6-75, TD) and Lance Moore (7-54, TD). ",
            "4": "The Saints didn't bother running the ball against Pittsburgh's stout front. Julius Jones and Chris Ivory each had seven carries for 16 and 7 yards, respectively. ",
            "5": "Despite this win, New Orleans' biggest problem still remains. The team continues to struggle in the red zone, forcing Sean Payton to resort to weird gadget plays that aren't working. The Saints have a bye after an apparent easy contest at Carolina next week, so they'll need to fix this by Week 11. ",
            "6": "Roethlisberger had an OK performance, going 17-of-28 for 195 yards and a desperate late interception. As mentioned, however, Big Ben had two possible interceptions dropped. He also struggled to figure out Gregg Williams' blitz schemes. ",
            "7": "No Steeler had more than three receptions or 43 yards. Mike Wallace (3-43) and Hines Ward (2-39) couldn't do much as Roethlisberger was constantly under siege. ",
            "8": "Rashard Mendenhall was easily Pittsburgh's best offensive player, gaining 71 yards and a touchdown on just 15 carries. "
        }
    },
    "numberOfGames": "11"
}