{
    "year": "2008",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Giants",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "So much for jumping out of my first-floor window. I threatened to do so if the Giants lost to the Rams because I had them as my Survivor Pick. Thankfully, I won't be in danger of twisting my ankle or something anytime soon. ",
            "2": "I found it odd that Joe Buck and Troy Aikman were the announcers of the Rams-Giants game. Didn't the FOX have a better matchup to broadcast? The Panthers and Bears are 1-0; that would have been better. Why televise a predicted blowout? Is Marc Bulger getting sacked a dozen times that amusing? ",
            "3": "Speaking of Bulger, I have some breaking news to report. Bulger got hurt in the first quarter! Oddly enough, he was injured bumping into one of his own teammates. You gotta love the Rams. ",
            "4": "Despite getting blowed... uhh... blewn... uhh... blowed out by the Giants, the Rams were more productive this week than they were against the Eagles. Steven Jackson ran for 53 yards on just 13 carries. And Torry Holt actually showed up, grabbing six balls for 76 yards and a score. Keep in mind, however, that St. Louis was playing at home, where they are much more effective. They can't do anything on the road. ",
            "5": "Bulger was sacked six times, including twice by Justin Tuck. Tuck also had a pick-six. ",
            "6": "Brandon Jacobs failed to get into the end zone again, but he managed 93 yards on only 15 rushes. Eli Manning stole all the scores. He had three to go along with his 20-of-29 for 260 yards. Plaxico Burress led all wideouts with five receptions and 81 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "8"
        },
        "comments": {
            "amount": "7",
            "1": "I think the question here is who was trying to lose more. The Chiefs know they suck and have no chance at the postseason, so maybe they were intentionally trying to sabotage this game. Meanwhile, Lane Kiffin, who could be fired any day now, could have lost at the behest of Al Davis one last time. But now that I think about it, Kiffin knows this team isn't going to the playoffs. So, winning this contest actually screws Crazy Al more in the long run. ",
            "2": "Then again, it looks like it might be pretty tough to win on purpose with JaMarcus Russell at the helm. Russell was 3-of-14 for 30 yards just one minute into the third quarter. The odd thing is, despite those numbers, the Raiders had the lead. Russell finished the game 6-of-17 for 55 yards, giving him a sterling YPA of 3.2. ",
            "3": "The Raiders were able to win with their running game. For the first time in his career, Darren McFadden showed that he could be worth the No. 4 overall selection Al Davis spent on him. McFadden tallied 164 yards and a touchdown on 21 carries. Meanwhile, Justin Fargas left the game with a groin, allowing Michael Bush to collect 90 yards on 16 rushes. ",
            "4": "Speaking of Oakland draft picks, it looks like the first-round selection Al Davis used on Sebastian Janikowski is finally panning out. Janikowski hit a 56-yard field goal in the first half. ",
            "5": "As for the Chiefs, I never thought they'd miss Brodie Croyle, but they had no shot with Tyler Thigpen and Damon Huard. Huard, who went 2-of-4 for 17 yards and a pick, was benched in favor of Thigpen, who completed the game 14-of-33 for 151 yards, one touchdown and an interception. Croyle isn't that good, but there's a shot he could have actually completed more than 50 percent of his passes. ",
            "6": "Larry Johnson continued to struggle, gaining just 22 yards on 12 carries and fumbling once versus a Raiders defense that couldn't stop the Broncos last week. There's a reason I declared I wouldn't take Johnson until the fourth round of any fantasy draft. His offensive line sucks, and he could pretty much be done, as Herm Edwards ruined his career by giving him 416 carries in 2006. ",
            "7": "Huard left the game with what the Chiefs called mild head trauma. Translated out of football terms, this means quarterback suckiness. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "I was pretty confused at the beginning of this game. I looked at the NFL.com Game Center and saw: K.Orton pass deep left to B.Lloyd to CHI 36 for 32 yards (K.Lucas). Deep pass? Deep pass!? How deep is deep for Kyle Orton? For Peyton Manning that might be 40 yards. For Orton? Six? Eight? Perhaps 10? ",
            "2": "All kidding aside, Orton began the game 6-of-6 for 62 yards, which probably had Bears fans excited that they finally found a franchise quarterback. Well, since accumulating those initial figures, Orton finished 13-of-26 and 87 yards. Orton was responsible for an intentional-grounding penalty late in the contest, which forced the Bears into a punt. ",
            "3": "Matt Forte ran all over the defensively challenged Colts, but we knew his real test would come against the Panthers. Forte rushed for 92 yards on 23 carries. He also caught three balls for 21 yards... ",
            "4": "Unfortunately, Forte didn't score a touchdown because Lovie Smith gave Jason McKie the ball on Carolina's 1-yard line. But don't worry, fantasy fans - that decision came back to bite Smith in his conservative rear end, as the ineffective McKie was stuffed on a fourth-and-one at midfield late in the fourth quarter, which ended the game for the Bears. ",
            "5": "Jake Delhomme led another comeback for the Panthers, who looked dead in the first half in the wake of last week's comeback against the Chargers. In fact, Carolina had as many penalty yards as total yards at halftime. ",
            "6": "Delhomme finished 12-of-21 for 128 yards and a pick, though he was missing Steve Smith. The offensive star for the Panthers was Jonathan Stewart, who rushed for 77 yards and two touchdowns. It looks like Stewart will get more than half of the carries from here on out; DeAngelo Williams registered 31 yards on 11 rushes. ",
            "7": "Devin Hester left the game with what could be broken ribs. No word on his status yet. ",
            "8": "The Bottom Line: The Panthers are 2-0 without Smith's services. I wonder what the odds on that were? Taking a stab here, but probably less than the chances of Orton blowing this game. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "When the Saints held a 24-15 lead at the beginning of the fourth quarter, I was ready to talk about Washington's wasted opportunities. Despite completely dominating the first half, the Redskins had just a 9-7 lead going into the break, thanks to an Antwann Randle El fumble inside his own 30 and five field goal attempts in New Orleans territory. Shaun Suisham missed from 49 and 30, and nearly became the first kicker to get cut in the middle of a game. Seriously, the Redskins could have been up 31-0 at halftime, but I guess the fake-baking Jim Zorn didn't have the time to install a red-zone offense. ",
            "2": "Well, give credit to Jason Campbell for leading the Redskins to a comeback. Campbell was 7-of-7, 157 yards and a touchdown in the fourth quarter. And here I was going to make fun of Campbell having more completions in first minute of the game than he had in the first 29 against the Giants last week. Two words: Jason David. ",
            "3": "That said, I wouldn't recommend for Redskins fans to get excited quite yet. Campbell posted excellent numbers, going 24-of-36, 321 yards and a touchdown, but the Saints were missing three starters - Randall Gay, Mike McKenzie and Roman Harper - in their secondary. Plus, I'm pretty sure any quarterback, stoned off crack or not, could throw for 300 yards against David. ",
            "4": "Clinton Portis, Santana Moss and Chris Cooley fantasy owners: Put down your razor blades. Portis gained 96 yards and two touchdowns; Moss caught seven balls for 164 yards and a touchdown; while Cooley registered five receptions and 72 yards. ",
            "5": "Who would have thought Campbell would put up better numbers than Drew Brees? I guess Marques Colston's absence affected him more than we thought it would; Brees went 22-of-33, 216 yards, one touchdown and two picks. ",
            "6": "With Colston gone, Reggie Bush led the squad in receptions (7) and receiving yards (63). However, Bush managed just 28 rushing yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "15"
        },
        "comments": {
            "amount": "7",
            "1": "Tarvaris Jackson sucks so much, I don't know where to start. How about a Dan Dierdorf quote describing one of Jackson's passes? What was that? That ball was thrown a good 10 yards behind Sidney Rice. ",
            "2": "Dierdorf spent the rest of the game criticizing the Minnesota crowd for continuously booing Jackson. I really don't know what to make of this. On one hand, the fans mortgage their houses for those seats, so they can do whatever they want. On the other hand, booing a young quarterback doesn't do anything positive for the team. But on the third hand (third hand?) Jackson sucks so much, maybe he shouldn't even be playing quarterback. But I have to wonder how many of those booing fans were the same people who sent me dozens of I love Tarvariouse Jackson!! e-mails this offseason. ",
            "3": "The bottom line is that Jackson blows. He really blows. Besides being an ineffective 14-of-24 for 130 yards and a fumble, Jackson missed a wide-open Visanthe Shiancoe in the end zone (the ball went through Shiancoe's hands, but the throw was low). Shiancoe sucks too, so I don't know what to make of this either. ",
            "4": "Jackson botched a great effort by Adrian Peterson. Peterson rushed for 160 yards on 29 carries. He also caught four passes. ",
            "5": "Minnesota's defensive effort was also for naught. Holding Indianapolis' offense to 18 points and Joseph Addai to 20 yards on 15 carries was awesome. ",
            "6": "Peyton Manning totaled 311 yards, one touchdown and two picks, but that's a bit misleading. Manning struggled for most of the contest, though he had defenders in his face the entire afternoon. Manning went to Anthony Gonzalez often. Gonzalez caught nine balls for 137 yards. Marvin Harrison caught only one pass. ",
            "7": "Another quote from Dierdorf: This is not your mother's Indianapolis Colts team. Thanks, Dan. I was thinking this was my second cousin's brother-in-law's team, but now I understand what's going on. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Titans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "Good to see the Bengals put forth some effort today. Staying within 20 of the Titans was quite an accomplishment. ",
            "2": "Carson Palmer continued to frustrate his fantasy owners. He finished 16-of-27, 134 yards, two interceptions and a fumble. Chad Ocho Cinco (4 catches, 37 yards) and T.J. Houshmandzadeh (3 catches, 26 yards) aren't helping, though Palmer was really limited by 30-mph winds. ",
            "3": "The one positive Cincinnati can take out of this game is that Chris Perry looked pretty solid against a great run defense. Perry had 64 yards and a touchdown on 21 carries. He'll be a very good RB2 option against mediocre and poor stop units. ",
            "4": "Speaking of great RB2 options, Chris Johnson tallied 109 yards on 19 rushes. He carried the Titans' offense, as Kerry Collins finished just 14-of-21 for 128 yards and a score. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bills",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "Overrated versus underrated. The Jaguars were on the latter list of my page, while the Bills were on the former. So, it shouldn't be a surprise that the Bills won despite being 4.5-point dogs. ",
            "2": "I called Jacksonville an overrated team because they've looked awful in the preseason and in their first contest. Whatever magic David Garrard had last year is gone. Garrard finished 17-of-28 for 165 yards and a pick. He now has as many interceptions (3) as he did all last year. Garrard's favorite target was Booger Candy Man (a.k.a. Matt Jones), who had five receptions and 50 yards. ",
            "3": "I have to question why Fred Taylor had twice as many carries (14) as Maurice Jones-Drew (7). I also have to ask why Jones-Drew didn't carry the ball once in the first half. ",
            "4": "Trent Edwards is evolving into a pretty good quarterback; he was 20-of-25 for 239 yards and a touchdown, and opened the game 10-of-10 for 114 yards. He threw to Lee Evans four times for 77 yards, but used second-string running back Fred Jackson the most. Jackson caught seven balls for 83 yards. James Hardy, meanwhile, caught his first touchdown. ",
            "5": "Quentin Groves registered his first career sack and also forced a fumble. Meanwhile, Derrick Harvey, who missed all of training camp, managed only one tackle. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Packers",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "25"
        },
        "comments": {
            "amount": "8",
            "1": "I don't know what kind of gameplan Rod Marinelli formulates each week, but I'm going to suggest that he should get rid of the Let's get down 21-0 and try to make a comeback strategy. For the second week in a row, Detroit trailed 21-0 in the first half. ",
            "2": "Unlike last Sunday, however, Detroit was able to come all the way back and take the lead in the second half. Detroit grabbed a 25-24 advantage on a Jon Kitna touchdown to Calvin Johnson, but in typical Lions fashion, they watched the Packers score three touchdowns, one on offense and two on defense. ",
            "3": "In addition to those two pick-sixes, Jon Kitna threw a third interception. But because he had Calvin I'm a monstrous beast and no one can stop me Johnson as a target, Kitna was able to total 276 yards and two scores. Johnson caught both of those touchdowns and also registered 129 yards on six receptions. ",
            "4": "Kevin Smith gained four yards per carry, which is decent considering Detroit's inept offensive line, but that comes out as 40 yards on 10 carries. Smith didn't get more opportunities because of Marinelli's Let's get down 21-0 and try to make a comeback strategy. ",
            "5": "Oh, by the way, this Aaron Rodgers character is pretty good - especially when he gets to go against Detroit's secondary. Rodgers finished 24-of-38, 328 yards and three touchdowns. Rodgers found Greg Jennings six times for 167 yards. ",
            "6": "Looks like Ryan Grant's hamstring hamstrung him against Detroit. Get it? Hamstring, hamstrung??? Never mind... Grant totaled 20 yards on 15 carries, while Brandon Jackson managed 61 yards and a touchdown on seven rushes. ",
            "7": "Fun Fact: The last Packers quarterback to start 2-0 in his career was Scott Hunter in 1971. Hunter replaced a legend in Bart Starr. Coincidence? ",
            "8": "Quote of the Game: Can anyone watching the GB-DET game explain this on the box score: <i> 1-10 GB9 (9:38) M.Crosby right tackle to GB 7 for -2 yards (C.Redding).</i> - Forum member JimmyP. I can explain it: The Lions suck so much the Packers believe that they can win even if they use their kicker as a running back. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "Welcome to the NFL, Matt Ryan. I say this now because last week didn't count. As discussed in the Sunday NFL In-Games Thread, the Hamilton Tiger-Cats of the CFL could probably beat the Detroit Lions right now. Seeing a top-notch defense for the first time in his career, Ryan began the game 0-of-9 and two interceptions. He finished 13-of-33 for 158 yards, those two picks and a fumble. ",
            "2": "When Ryan actually completed a pass, he went to Roddy White and Laurent Robinson four times each. White had 59 yards. Meanwhile, Michael Turner, coming off a 220-yard performance, compiled only 42 yards, as Atlanta's offensive line couldn't open up any running lanes. Left tackle Sam Baker left the game prior to halftime. ",
            "3": "Welcome back to the NFL, Brian Griese. Griese, whose arm is an upgrade over Jeff Garcia's, was 18-of-31 for 160 yards and a touchdown versus a pretty soft defense. Griese is known for his mental ineptness, so Buccaneer fans shouldn't get excited because he's bound to make tons of errors when it counts. Jon Gruden, meanwhile, should be excited because Griese's performance means he can kick sworn enemy Jeff Garcia off his roster. ",
            "4": "While Griese's numbers weren't spectacular, Earnest Graham's were. Graham gained 116 yards and a touchdown on 15 carries. Warrick Dunn chipped in with 12 rushes, 49 yards and a score. ",
            "5": "Gaines Adams finally emerged as the potent pass-rusher the Buccaneers drafted No. 4 overall last year. Adams breathed down Matt Ryan's neck the entire game, recording six tackles and two sacks. It didn't help that Baker missed the entire second half. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "30"
        },
        "comments": {
            "amount": "5",
            "1": "On a 41-yard field goal attempt to win the game, Joe Nedney missed, marking the first time he whiffed inside 50 yards since November 2006. Nedney had a chance to redeem himself in overtime, and sank a 40-yarder. ",
            "2": "Speaking of obscure stats from 2006, Isaac Bruce became the first 49ers receiver since Week 2, 2006, to eclipse the 100-yard receiving mark (Antonio Bryant). Bruce had four catches for 153 yards. J.T. O'Sullivan, meanwhile, was a masterful 20-of-32 for 321 yards and a touchdown despite getting sacked eight times. ",
            "3": "When the Seahawks were in the red zone in the third quarter, up 20-13, Patrick Willis picked off a Matt Hasselbeck pass and took it back 86 yards for a score. This turned momentum around for San Francisco, who scored another touchdown two minutes later. ",
            "4": "I'd like to criticize Seattle's defense for allowing 33 points to Mike Martz and O'Sullivan, but the fact remains they sacked O'Sullivan eight times and limited Frank Gore to just 61 yards on 19 carries. Matt Hasselbeck was at fault; he had the aforementioned pick-six and another interception. Hasselbeck, who missed almost all of the preseason with back problems, hasn't been able to get into a groove with his scrub receivers. Hasselbeck was 18-of-36, 189 yards and a pair of picks. ",
            "5": "Speaking of Hasselbeck's wideouts, rookie tight end John Carlson had six receptions and 78 yards. Billy McMullen - yeah, Billy stinkin' McMullen - managed three receptions for 48 yards. Hasselbeck was forced to go to those bums because Logan Payne and Seneca Wallace left the game with injuries. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "The New England squad that won this game looked like the 2001 Patriots. They were underdogs. Everyone doubted them. And they won with defense. It was pretty refreshing to watch them compared to the sloppy team that couldn't stop crappy quarterbacks like Kyle Boller and A.J. Feeley. ",
            "2": "Speaking of this new and improved Patriots team, this is only the second spread New England has covered since Halloween 2007. This includes the playoffs and the preseason. ",
            "3": "That said, I wouldn't get too excited. New England had something to prove, so they brought the kitchen sink as an underdog. The fact remains that their defense is still old and slow. ",
            "4": "Matt Cassel was a pretty economical 16-of-23 for 165 yards. He did a good job of moving the chains, but just couldn't get the Patriots into the end zone. Contrary to some belief, he's a huge downgrade from Tom Brady. ",
            "5": "Perhaps Cassel should look toward Randy Moss more often. Moss had two receptions for 22 yards. Meanwhile, Wes Welker grabbed seven balls for 72 yards. ",
            "6": "What happened to Laurence Maroney? A banged-up Maroney managed just two yards per carry (8 rushes, 16 yards). LaMont Jordan led the team on the ground with 62 yards on 11 attempts. ",
            "7": "Brett Favre threw his first interception as a Jet in the third quarter. He was 18-of-26 for 181 yards, one touchdown and that pick. ",
            "8": "Considering he was going against a tough defensive line, Thomas Jones had a solid performance, accumulating 70 yards on 17 carries. However, his number was called three times inside the five in the second quarter. Jones was stuffed thrice. Brian Schottenheimer? Genius. ",
            "9": "Laveranues Coles caught three passes for 72 yards. That said, he dropped a wide-open first down in the opening quarter. Perhaps his hands were slippery from certain activities involving his Chad Pennington blow-up doll. You can only guess what I'm referring to. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "38"
        },
        "comments": {
            "amount": "5",
            "1": "It's official: Mike Shanahan either has the brain of a psych-ward convict or balls of steel. In case you missed the conclusion to what could end up as the craziest game of the year, Shanahan decided to go for two down 38-37 with half a minute remaining in the game. Jay Cutler converted the try on a pass to Eddie Royal. ",
            "2": "Two plays before the touchdown, however, Cutler fumbled the football on an empty-handed throw, recovered by the Chargers. The play was ruled an incomplete pass, but after a challenge, Ed Hochuli turned it into a fumble, but allowed the Broncos to keep possession because he inadvertently blew his whistle when he thought Cutler tossed an incompletion. Hochuli made an error, but don't tell him that. He'll beat you down with his strong muscles if you do. ",
            "3": "The other thing of note is that Brandon Marshall came within two receptions of tying Terrell Owens' single-game NFL record of 20 catches. Marshall caught 18 balls for 166 yards and a touchdown. At haltime, he had 10 receptions and 117 yards. ",
            "4": "Both Cutler and Philip Rivers lit up the opposing secondary. Cutler was 36-of-50 for 350 yards, four touchdowns and a pick. Rivers finished 21-of-33, 377 yards, three scores and an interception. ",
            "5": "While Rivers put up 377 yards, the star for the Chargers was Darren Sproles, who replaced an ailing LaDainian Tomlinson (toe). Sproles gained 53 yards on the ground, and 72 and a score through the air. Sproles also had a 103-yard kickoff return. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Hmm... I wonder if the Cardinals made the right decision going Kurt Warner over Captain Beer Bong? Kurt Warner torched a horrendous Dolphins secondary, going 19-of-24 for 361 yards and three touchdowns. It's a shame Miami couldn't keep up because Warner could have set some records. Warner began the game 9-of-9 for 221 yards and two scores. All three of Warner's touchdowns went to Anquan Boldin, who collected 140 yards. Larry Fitzgerald, meanwhile, had six grabs for 153 yards. ",
            "2": "I'm still perplexed as to why the Dolphins failed to upgrade their defense this offseason. I can understand Jake Long over Chris Long if they really thought the former could be a legitimate left tackle in this league, but not finding a potent pass-rusher or solid defensive backs was inexcusable. Seems like Bill Parcells was too busy sending Jason Taylor hate mail to fix his stop unit. ",
            "3": "At least Miami's offense is better... and I'm not being facetious. Last year, they would have turned it over five times with John Beck. Chad Pennington was ineffective - 10-of-20 for 112 yards - but he didn't fumble or toss an interception. ",
            "4": "The Ricky Williams-Ronnie Brown battle once again was a wash. Both carried the ball 11 times. Williams had 28 yards, while Brown had 25 yards and a score. I have to wonder why Miami's supposed improved offensive line can't help either back run for more than 2.5 yards per rush. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "The Browns were the only team awarded with two home games to start the season. They also happen to be one of the few teams that are 0-2. Good job, Romeo Crennel. ",
            "2": "Crennel had some curious coaching decisions in this game, including botching the end of the first half with poor clock management, and foolishly kicking a field goal down seven with three minutes remaining on the clock. As I stated last week, it's doubtful the Cookie Monster wants to send any contest into overtime, as he has a post-game snack waiting for him in his office. ",
            "3": "Of course, Cleveland couldn't have won if it tried. Kellen Winslow, the only productive Brown (7 catches, 55 yards), was heard yelling, I was open! I was open! in the first half. Perhaps Winslow should have yelled, My quarterback sucks! My quarterback sucks! Derek Anderson was 18-of-32 for 166 yards and two picks. He began the contest 2-of-9 for 13 yards and an interception. ",
            "4": "That said, Anderson wasn't completely at fault. Braylon Edwards, who dropped four balls last week, dropped a pair against Pittsburgh. Edwards had three receptions and 32 yards. ",
            "5": "Breaking News: Donte' Stallworth missed the game with an injury. I have no idea why the Browns signed this bum. He never plays. Ever! ",
            "6": "Despite facing gusty winds and a bum shoulder, Ben Roethlisberger performed well. He finished 12-of-19 for 186 yards and a touchdown. Santonio Holmes and Hines Ward had five catches each. Willie Parker carried the Steelers to victory, rushing for 105 yards on 28 attempts. "
        }
    },
    "numberOfGames": "14"
}