{
    "year": "2008",
    "week": "07",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "If I were a fancy-shmancy sportswriter working for a dying newspaper, I'd start this write-up with something like, The power may have been out at Ralph Wilson Stadium, but that didn't stop Trent Edwards from lighting up the scoreboard. Man, that's good stuff. Edwards was 25-of-30 for 261 yards and a touchdown. He hit Lee Evans eight times for 89 yards and that score. Even more impressive is that Edwards performed so well amid mass confusion. We didn't know what the play clock was, or what the score was, or anything, Edwards said. ",
            "2": "Viewers who wanted to see the game couldn't do so until there was seven minutes remaining in the first half because some balloons hit a power line. That's not a joke. Power went out again five minutes later, and was up and running again in the third quarter. The poor people who were looking forward to this game were treated to a Bengals-Steelers snooze-fest instead. Not cool. Whoever brought those balloons to the stadium should be banned for life. ",
            "3": "Marshawn Lynch failed to reach the century mark, but managed 70 yards and a touchdown. He out-rushed LaDainian Tomlinson, who collected just 41 yards on 14 carries. Combined with a bum toe and Marcus Stroud clogging the middle, Tomlinson didn't have much of a chance. ",
            "4": "With Tomlinson running in mud, Philip Rivers gave the Chargers a shot to win this game. He was 22-of-29 for 208 yards and two touchdowns. Unfortunately, he fumbled in Buffalo territory and then threw a pick in the end zone. ",
            "5": "Rivers didn't have Chris Chambers at his disposal, so he had to go to Malcolm Floyd, Antonio Gates and Vincent Jackson four times each. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Giants",
            "Points": "29"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Thanks a lot, FOX. I was hoping for Bears-Vikings or Saints-Panthers on that network. Instead, I was befuddled when I saw that FOX was broadcasting the Giants-49ers. I was even more confused when I heard Troy Aikman's voice. Why was this crappy matchup FOX's featured game? They need to fire whoever made that decision; that person was obviously on acid or crack, and needs to be removed. ",
            "2": "The 49ers had a great start in this game. Frank Gore lost two yards. Then, there was an illegal shift. Two plays later, J.T. O'Sullivan was sacked. The following drive, O'Sullivan was once again sacked on third-and-long. Boy, it's a good thing the 49ers have such a great, intelligent offensive coordinator; otherwise, they would have had no chance to win this game. ",
            "3": "O'Sullivan finished with 256 yards and a touchdown, which was nice for fantasy owners, but he also threw two picks and fumbled a whopping four times, one of which led to a safety. O'Sullivan made some nice throws, but had way too many errors. In addition to his four turnovers, O'Sullivan also missed a wide-open Isaac Bruce 25 yards downfield. ",
            "4": "At least we know that O'Sullivan sucks; Frank Gore disappointed, as he gained just 11 yards on 11 carries despite the fact that New York starting middle linebacker Antonio Pierce was out. ",
            "5": "The silver lining for the 49ers is that Josh Morgan finally came to life after missing all of September with the flu. The talented rookie receiver caught five passes for 86 yards and a score. Another positive is that San Francisco returned a blocked field goal for a touchdown for the second week in a row. ",
            "6": "The Giants scored 29 points, but you can't say their offense played particularly well. Eli Manning barely completed 50 percent of his passes, going 16-of-31, 161 yards and a score. Plaxico Burress caught just three passes for 24 yards and a touchdown. Meanwhile, Brandon Jacobs ran for 69 yards and two scores, but didn't get enough carries (17). The Giants should start using him more and stop wasting their time with Ahmad Bradshaw (8 car, 28 yards) and Derrick Ward (4 car, 19 yards). ",
            "7": "Justin Tuck completely debacled San Francisco's offense. He had two sacks and two forced fumbles, and was credited with a safety. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Rams",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The Cowboys are such a spineless team. Look, I wasn't sure if Brad Johnson would play well, but I was very confident Dallas' defense would step up in the wake of Tony Romo's injury. Yeah... not so much. Dallas surrendered 24 points in the first half to the woeful Rams who didn't have Orlando Pace. Great job, losers. The only Dallas defender who doesn't deserve any blame is DeMarcus Ware, who managed seven tackles and three sacks. ",
            "2": "Speaking of Johnson, I didn't think he'd light up the scoreboard or anything, but I thought he would at least be competent. Instead, he played just as poorly as J.T. O'Sullivan, Dan Orlovsky and Ryan Fitzpatrick. Johnson began the game 4-of-12 for 48 yards and an interception. He eventually raised his completion percentage to 50 and his yardage total to 234. He also threw a touchdown. However, he tossed three picks and fumbled once. Johnson should seriously preserve any sort of legacy he has left and retire. Immediately. ",
            "3": "Unhappy Receivers: Roy Williams didn't do anything. Terrell Owens caught two passes for 31 yards. One can only wonder who will complain more this week. ",
            "4": "Dallas' sole bright spots on offense were Marion Barber, who rushed for 100 yards and a touchdown on just 18 carries. Jason Witten caught six balls for 44 yards. ",
            "5": "The Rams scored 34 points, but all Marc Bulger had to do was hand the ball off. Bulger threw for only 173 yards and a 42-yard touchdown to rookie Donnie Avery. Steven Jackson did all the damage, rushing for 160 yards on 25 attempts. Jackson found the end zone three times. ",
            "6": "One last thing: All everyone is going to talk about is how Dallas didn't show up - and I guess I'm guilty of that too - but the Rams are now 2-0 under Jim Haslett. Haslett was abysmal in New Orleans, but he's doing a terrific job with his new team. If this keeps up, St. Louis needs to make him its permanent head coach. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Titans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Down 10-0 in the second quarter with a fourth-and-one deep in opposing territory, any normal coach would have gone for it. Not Conservative Herm! Instead, he tried a field goal, only to see Nick Novak miss an easy 39-yarder. I don't understand how such an inept coach has been in the league for so long. Then again, this is an organization that wouldn't take a third-round pick for an old tight end who won't be around once the team fully rebuilds. ",
            "2": "Check out these late second-quarter stats: Chris Johnson: nine carries, 82 yards. LenDale White: eight carries, 34 yards, two touchdowns. So, Johnson does all the work, while White sits on the bench eating Cheetos. Then, when the Titans are down at the goal line, White comes in and vultures the touchdowns? How is that remotely fair? The yardage equaled out, thanks to an 80-yard touchdown from White. That's right - White ran for 80 yards without taking a break. Jeff Fisher must have promised him a trip to Wendy's after the game. White finished with 149 yards, three touchdowns and a dozen Junior Bacon Cheeseburgers. Johnson, meanwhile, tallied 168 yards and a score. ",
            "3": "With Johnson and White running wild, Kerry Collins threw the ball just 18 times for 123 yards. Bo Scaife was Tennessee's leading receiver with three catches and 48 yards. ",
            "4": "If the fact that Kansas City was a huge underdog wasn't enough, the Chiefs saw their top two quarterbacks, Brodie Croyle and Damon Huard, leave the game with injuries. Croyle was 9-of-10 for 63 yards before suffering a sprained knee. He's out for the year. Huard was 9-of-16 for 96 yards, but hurt his harm. Tyler Thigpen was just 5-of-11 for 76 yards, which sadly happens to be his best performance of the season. ",
            "5": "Despite the injuries to Croyle and Huard, Tony Gonzalez and Dwayne Bowe still put up solid numbers. Gonzalez had 97 yards on six catches, while Bowe managed 86 yards on seven receptions. ",
            "6": "Larry Johnson was suspended for this game, but it really wouldn't have mattered against Tennessee's stalwart run defense. Kolby Smith started in his place, and compiled just 20 yards on 10 rushes. ",
            "7": "Every year, I like to honor (or rather, make fun of) the first defense to surrender 1,000 rushing yards on the season. Thanks to their inability to stop White and Johnson, the award belongs to the Chiefs, who now give up 6.1 yards per carry! Seriously, all you need to do is run against this team. You don't even need a quarterback! "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "I know it sounds silly to say that a 38-10 blowout was a close game, but this contest really was - the Steelers held a 17-10 lead in the fourth quarter and the Bengals had the ball. Unfortunately for the only winless team in the AFC, Pittsburgh exploded for three touchdowns in the fourth quarter. Still, you have to give Cincinnati credit for playing hard and sticking with one of the top squads in the NFL. ",
            "2": "Ryan Fitzpatrick began the game 3-of-8 for 15 yards. I jotted the following down: How are the Bengals supposed to play hard with garbage like that at quarterback? Seriously, if I knew my quarterback had no chance of leading us to victory, I wouldn't prepare for the game at all. Fitzpatrick finished 21-of-35, 164 yards and a touchdown. However, he fumbled twice and was sacked seven times. You can't really blame Fitzpatrick for everything; Cincinnati's offensive line sucks and the running game was non-existent (Cedric Benson had 52 yards on 14 carries). ",
            "3": "Though Fitzpatrick struggled, T.J. Houshmandzadeh and Chad Ocho Cinco each caught eight balls for about 55 yards. Ocho Cinco found the end zone for the second time all year. ",
            "4": "Hines Ward blindsided Keith Rivers in the first quarter, dishing out a nasty (but clean) block. Rivers had to leave the game with a jaw injury, and it was later announced that he would be out for the year. Maybe once Ward slows down, he can move to safety and knock people out of the game. Or he can become an analyst on ESPN and debacle people that way. ",
            "5": "Besides killing people, Ward had 60 yards and a touchdown. Santonio Holmes, meanwhile, registered five catches and 89 yards. Ben Roethlisberger was 17-of-28, 216 yards and two touchdowns. ",
            "6": "Mewelde Moore once again filled in impressively for an injured Willie Parker. Moore tallied 120 yards and two touchdowns on just 20 attempts. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Bears",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "41"
        },
        "comments": {
            "amount": "4",
            "1": "Talk about the Invasion of the Body Snatchers: Gus Frerotte and Kyle Orton combined to go for 7-of-7, 83 yards and a touchdown after two drives. Because of their play on Sunday, the Bears and Vikings combined to score 89 points. Seriously, who are these guys, and what did they do with their crappy look-alikes? ",
            "2": "Orton finished well, going 21-of-32 for 283 yards and two touchdowns. Frerotte, meanwhile, had 298 yards and two scores of his own, but also threw four interceptions against an injury-ravaged Chicago secondary. Remarkably, despite the combined 581 passing yards, no receiver eclipsed the century mark. Bernard Berrian led the Vikings with 81 yards and a touchdown, while Marty Booker paced Chicago with 79 yards and a score. ",
            "3": "Matt Forte didn't manage much on the ground (56 yards, 1 TD). Adrian Peterson, meanwhile, almost made up for it with 121 yards and two scores on only 22 rushes. I have no idea why Peterson touched the ball just 23 times (he also had a catch). Oh wait, yes I do... Brad Clueless has no idea what he's doing. In addition to Peterson's lack of touches, Clueless kept squib kicking it to the Bears, allowing Chicago to start at midfield on its first two drives of the game. ",
            "4": "Anyone following this game on NFL.com was seriously confused on multiple occasions. For starters, NFL.com told us that Vikings punter Chris Kluwe ran 76 yards for a touchdown after his punt was blocked. This was followed by an extra point from Bears kicker Robbie Gould. In reality, Kluwe fumbled the snap, then tried to punt the ball, only to have it blocked. Then, Kluwe tried to kick the ball while it was on the ground, which was one of the most futile and hilarious things I've ever seen. I laughed so hard that some old lady walking by looked at me through my open window and looked at me as I were insane. Going back to NFL.com, did you know Clueless is so inept that he was the first head coach in NFL history to lead his team to a single-point score? Don't believe me? Here's proof: "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "I have no explanation as to how Carolina held New Orleans to seven points. Earlier in the week, forum member Holder_Account asked me how I thought the Panthers would restrict the Saints to 20 points, as predicted on my NFL Picks page. I said, I don't know. I think the game's going Over, but I'm so bad with totals that I just fade myself. Never would I have imagined that New Orleans' offense would have been so debacled. ",
            "2": "For starters, Julius Peppers was a beast and completely disrupted Drew Brees and company. Peppers managed only one sack, but was in the backfield on almost every play. Consequently, Brees was 21-of-39, 231 yards and a pick. ",
            "3": "Marques Colston returned from his injury, but was nowhere to be found. He had no catches. Lance Moore didn't do anything either. The only relevant target of Brees' was Jeremy Shockey, who had five catches and 50 yards. ",
            "4": "Reggie Bush led the team with 55 yards on nine carries. Unfortunately, he suffered a knee injury and will be out for about a month. Deuce McAllister also carried the ball nine times, gaining 47 yards. ",
            "5": "Both of Carolina's running backs out-rushed Bush and McAllister. Jonathan Stewart and DeAngelo Williams gained 68 and 66 yards, respectively, on about the same number of carries. Stewart found the end zone once. ",
            "6": "The star for the Panthers' offense was Steve Smith, who grabbed six balls for 122 yards and a touchdown. Jake Delhomme was 14-of-22 for 195 yards and two scores. '); "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "I know it sounds silly to say that a 38-10 blowout was a close game, but this contest really was - the Steelers held a 17-10 lead in the fourth quarter and the Bengals had the ball. Unfortunately for the only winless team in the AFC, Pittsburgh exploded for three touchdowns in the fourth quarter. Still, you have to give Cincinnati credit for playing hard and sticking with one of the top squads in the NFL. ",
            "2": "Ryan Fitzpatrick began the game 3-of-8 for 15 yards. I jotted the following down: How are the Bengals supposed to play hard with garbage like that at quarterback? Seriously, if I knew my quarterback had no chance of leading us to victory, I wouldn't prepare for the game at all. Fitzpatrick finished 21-of-35, 164 yards and a touchdown. However, he fumbled twice and was sacked seven times. You can't really blame Fitzpatrick for everything; Cincinnati's offensive line sucks and the running game was non-existent (Cedric Benson had 52 yards on 14 carries). ",
            "3": "Though Fitzpatrick struggled, T.J. Houshmandzadeh and Chad Ocho Cinco each caught eight balls for about 55 yards. Ocho Cinco found the end zone for the second time all year. ",
            "4": "Hines Ward blindsided Keith Rivers in the first quarter, dishing out a nasty (but clean) block. Rivers had to leave the game with a jaw injury, and it was later announced that he would be out for the year. Maybe once Ward slows down, he can move to safety and knock people out of the game. Or he can become an analyst on ESPN and debacle people that way. ",
            "5": "Besides killing people, Ward had 60 yards and a touchdown. Santonio Holmes, meanwhile, registered five catches and 89 yards. Ben Roethlisberger was 17-of-28, 216 yards and two touchdowns. ",
            "6": "Mewelde Moore once again filled in impressively for an injured Willie Parker. Moore tallied 120 yards and two touchdowns on just 20 attempts. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bears",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "41"
        },
        "comments": {
            "amount": "4",
            "1": "Talk about the Invasion of the Body Snatchers: Gus Frerotte and Kyle Orton combined to go for 7-of-7, 83 yards and a touchdown after two drives. Because of their play on Sunday, the Bears and Vikings combined to score 89 points. Seriously, who are these guys, and what did they do with their crappy look-alikes? ",
            "2": "Orton finished well, going 21-of-32 for 283 yards and two touchdowns. Frerotte, meanwhile, had 298 yards and two scores of his own, but also threw four interceptions against an injury-ravaged Chicago secondary. Remarkably, despite the combined 581 passing yards, no receiver eclipsed the century mark. Bernard Berrian led the Vikings with 81 yards and a touchdown, while Marty Booker paced Chicago with 79 yards and a score. ",
            "3": "Matt Forte didn't manage much on the ground (56 yards, 1 TD). Adrian Peterson, meanwhile, almost made up for it with 121 yards and two scores on only 22 rushes. I have no idea why Peterson touched the ball just 23 times (he also had a catch). Oh wait, yes I do... Brad Clueless has no idea what he's doing. In addition to Peterson's lack of touches, Clueless kept squib kicking it to the Bears, allowing Chicago to start at midfield on its first two drives of the game. ",
            "4": "Anyone following this game on NFL.com was seriously confused on multiple occasions. For starters, NFL.com told us that Vikings punter Chris Kluwe ran 76 yards for a touchdown after his punt was blocked. This was followed by an extra point from Bears kicker Robbie Gould. In reality, Kluwe fumbled the snap, then tried to punt the ball, only to have it blocked. Then, Kluwe tried to kick the ball while it was on the ground, which was one of the most futile and hilarious things I've ever seen. I laughed so hard that some old lady walking by looked at me through my open window and looked at me as I were insane. Going back to NFL.com, did you know Clueless is so inept that he was the first head coach in NFL history to lead his team to a single-point score? Don't believe me? Here's proof: "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "I have no explanation as to how Carolina held New Orleans to seven points. Earlier in the week, forum member Holder_Account asked me how I thought the Panthers would restrict the Saints to 20 points, as predicted on my NFL Picks page. I said, I don't know. I think the game's going Over, but I'm so bad with totals that I just fade myself. Never would I have imagined that New Orleans' offense would have been so debacled. ",
            "2": "For starters, Julius Peppers was a beast and completely disrupted Drew Brees and company. Peppers managed only one sack, but was in the backfield on almost every play. Consequently, Brees was 21-of-39, 231 yards and a pick. ",
            "3": "Marques Colston returned from his injury, but was nowhere to be found. He had no catches. Lance Moore didn't do anything either. The only relevant target of Brees' was Jeremy Shockey, who had five catches and 50 yards. ",
            "4": "Reggie Bush led the team with 55 yards on nine carries. Unfortunately, he suffered a knee injury and will be out for about a month. Deuce McAllister also carried the ball nine times, gaining 47 yards. ",
            "5": "Both of Carolina's running backs out-rushed Bush and McAllister. Jonathan Stewart and DeAngelo Williams gained 68 and 66 yards, respectively, on about the same number of carries. Stewart found the end zone once. ",
            "6": "The star for the Panthers' offense was Steve Smith, who grabbed six balls for 122 yards and a touchdown. Jake Delhomme was 14-of-22 for 195 yards and two scores. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "So much for Cam Cameron being at fault for Miami's ineptness in 2007. The same coach who led the Dolphins to a 1-15 mark came back to beat them as Baltimore's offensive coordinator. Under Cameron's tutelage, Joe Flacco was 17-of-23 for 232 yards and a touchdown. Willis McGahee, meanwhile, rushed for 105 yards and a touchdown on just 19 carries. Le'Ron McClain wasn't much of a factor (7 carries, 13 yards). ",
            "2": "Flacco went to Derrick Mason more than anyone else; Mason had six catches, 87 yards and a touchdown. Todd Heap actually did something for a change, grabbing three passes. ",
            "3": "With that in mind, Flacco still made a few bone-headed plays. I was perplexed when Flacco took a sack on a third-and-one in the first quarter. How do you take a sack on third-and-short? And why was a rookie quarterback even throwing in that situation? Flacco also fumbled later. ",
            "4": "So much for the Wildcat offense. Baltimore completely shut down the Dolphins' scoring attack. Ronnie Brown was held to just 27 yards on 13 rushes. ",
            "5": "Chad Pennington compiled 295 yards on 24-of-35 passing, but it was all short junk. In fact, Pennington's longest completion was 28 yards (compared to Flacco's 40). Pennington went to Greg Camarillo six times for 74 yards and Ted Ginn four times for 48 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Texans",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "4",
            "1": "Ugh. How did the Lions stay within seven of the Texans after the latter established leads of 21-0 and 28-10? When Houston scored its third touchdown, I said to myself, Wow, this game could finish 63-0. I still have no idea how Detroit came back to cover. ",
            "2": "The 21 points Houston surrendered was the defense's lowest output of the season. Pretty pathetic. How do you allow Dan Orlovsky to throw for 265 yards and a touchdown? Where were Houston's defensive backs on Calvin Johnson's 96-yard reception, the NFL's longest since 1998? How in the world did Kevin Smith gain 6.1 yards per carry (10 car, 61 yards)? What happened to Houston's pass rush? Two sacks against Orlovsky? Really? ",
            "3": "Even more confusing is that the Texans lost their mammoth lead despite the fact that Detroit couldn't stop their offense. Matt Schaub went 26-of-31, 267 yards and two touchdowns. Andre Johnson caught 11 passes for 141 yards. Owen Daniels grabbed six balls for 66 yards and those two scores. Steve Slaton gained 80 yards and a touchdown on just 17 carries. Even Ahman Green compiled 62 yards and a score on 14 rushes. ",
            "4": "I can't go on anymore. There's no explicable reason that the Lions were able to stay within seven points of the Texans with Orlovsky under center. I give up. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "OK... so maybe Peyton Manning and the Colts aren't back. After looking so impressive against the Ravens following a slow start to the season, Indianapolis regressed on so many levels. Let's discuss them all: ",
            "2": "Pass Offense: Peyton Manning completed only 50 percent of his throws (21-of-42). He also tossed two interceptions, both of which were pick-sixes (one returned for 99 yards). Manning threw two touchdowns to Anthony Gonzalez and Dallas Clark, but both were nullified by penalties. Manning had 229 yards. Meanwhile, Marvin Harrison and Reggie Wayne caught two passes each. Harrison had 11 yards, while Wayne tallied 24. ",
            "3": "Rush Offense: No Joseph Addai? Big problem. Dominic Rhodes found the end zone twice, making fantasy owners happy, but managed just 73 yards on 20 carries versus one of the league's worst run defenses. ",
            "4": "Rush Defense: Ryan Grant eclipsed the century mark for the first time all year. He predictably did so against the pathetic Colts, gaining 105 yards and a touchdown on 31 attempts. ",
            "5": "Pass Defense: Aaron Rodgers collected only 186 yards, but completed 75 percent of his throws (21-of-28). No one on the Packers had more than 37 receiving yards, including Donald Driver (35) and Greg Jennings (32). With a huge lead by halftime, Rodgers simply didn't have to do anything but hand the ball off. ",
            "6": "Discipline: Helping the Packers move the chains with ease, Indianapolis committed 12 penalties, the most it has ever had under Tony Dungy. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "I can't remember watching a more frustrating game. It seemed like there was a flag on every play. The two teams actually combined for 21 penalties, with the Raiders responsible for 14 of them. The madness commenced right at the beginning of the contest. The Raiders were whistled for four offside penalties (three of which were enforced) on the first drive alone. On Oakland's initial three possessions, there were four penalties besides the aforementioned offside infractions: two false starts, one holding and an illegal formation that eliminated a JaMarcus Russell-to-Zach Miller touchdown. Later in the game, the Raiders were offside on a Jets' fourth-and-four. Instead of a punt, New York was awarded a new set of downs, prompting an enraged Randy Cross to yell, Don't stop yourself! You tell em, Randy! ",
            "2": "Oh, but that wasn't the only way the Raiders killed themselves. They dropped countless passes, especially in overtime. Tom Cable iced Jets kicker Jay Feeley on a potential game-winner, which didn't work - Feeley missed before the timeout and made the attempt afterward. Meanwhile, Sebastian Janikowski missed a 40-yard field goal. Good thing the Raiders didn't spend an early draft pick on him! ",
            "3": "I'd love to continue to bash these two teams, but I'll have Carpal Tunnel before I'm finished. So, let's move on to the stats: Brett Favre really struggled for the Jets, going 21-of-38, 197 yards, two interceptions and three fumbles. Favre also had a number of passes that were dropped by Oakland's defensive backs. Laveranues Coles and Jerricho Cotchery consequently did nothing; Coles had four grabs for 51 yards, while Cotchery had one reception for no yardage. ",
            "4": "Thomas Jones did the most damage for New York, inexplicably compiling 159 yards on 24 carries. ",
            "5": "Justin Fargas didn't run as well, gaining just 74 yards on 28 carries. Darren McFadden rushed the ball only eight times, but collected 50 receiving yards on three receptions. ",
            "6": "JaMarcus Russell looked really good. His numbers weren't amazing - 17-of-30, 203 yards and a touchdown - but he was decisive in the pocket and move the chains efficiently. Russell went to Javon Walker five times for 75 yards and a touchdown. Zach Miller registered four catches and 57 yards. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "11"
        },
        "comments": {
            "amount": "5",
            "1": "NOTE: This is the final game I'm covering on this page. I'll talk about the Sunday and Monday night games in my NFL Power Rankings. Believe me, I have a lot to say about that disgusting Seahawks-Buccaneers game. ",
            "2": "Eleven points? How does a team score 11 points? I'll tell you how - completely inept coaching. The Browns were down 14-3 late in the fourth quarter. As Bill Simmons would write, any 17-year-old Madden geek could tell you that they needed two scores: a field goal and a touchdown plus two. Well, Cleveland was faced with a fourth-on-three on Washington's 3-yard line with 5:58 remaining in regulation. Instead of going for a field goal and drawing the score to within eight, the Browns went for it. Derek Anderson's pass to Braylon Edwards fell incomplete. Three minutes later, the Browns scored a touchdown and converted the 2-point try, which would explain the 14-11 score. As time was expiring, Cleveland lined up for an improbable 54-yard field goal. If Cleveland tried the aforementioned kick, Phil Dawson's long attempt would have been a potential game-winner; not a tying try. Apparently, Romeo Crennel didn't want to go into overtime; I guess he was late for his Cookie Break. ",
            "3": "Anyway, it should be no surprise that Anderson's pass failed. Anderson reverted to pre-Giants game form; he was 3-of-14 for 17 yards at halftime. Anderson finished a woeful 14-of-37 for 136 yards and a touchdown. Braylon Edwards caught four balls for 58 yards, while Kellen Winslow Jr. managed just two receptions. ",
            "4": "While Cleveland scored 11, it's surprising that Washington didn't tally more than 14 points, given that Clinton Portis registered 175 yards and a touchdown on 27 carries. ",
            "5": "Jason Campbell was somewhat efficient and pretty unspectacular, going 14-of-23 for 164 yards and a touchdown. Santana Moss, Antwaan Randle El and Chris Cooley each caught four passes. "
        }
    },
    "numberOfGames": "15"
}