{
    "year": "2008",
    "week": "18",
    "Game 1": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Matt Ryan opened up his pro career with a 60-yard touchdown strike on his first throw. His first pass in the playoffs, however, was an interception that sailed into the hands of Cardinals defensive back Ralph Brown. That basically epitomized how Ryan would play the entire afternoon. He had three spectacular drives, including one where he converted a third-and-10 and a pair of third-and-sixes, but other than that, he performed as if he were merely a rookie. Ryan was 26-of-40 for 199 yards, two touchdowns and two picks, looking early and often toward Roddy White (11 catches, 84 yards, TD). But for whatever reason, Ryan struggled coming out of the locker room; his combined stats in the first and third quarters were 4-of-11, 28 yards and a pair of interceptions. ",
            "2": "But this game was more about Arizona proving itself to the rest of the league. After all, the franchise hadn't hosted a playoff game since 1947! Though the Cardinals were at home, they were underdogs until Saturday morning. That's because of how poorly they finished the year. Well, the way they played, you wouldn't have known that they tanked against the Vikings and Patriots. Arizona was actually running the ball well and playing solid defense, prompting Cris Collinsworth to suggest that the Cardinals and Falcons switched jerseys before kickoff. Though Ryan would eventually throw for 200 yards and two scores, Arizona was able to restrict Michael Turner to 42 yards on 18 carries. Turner scored a touchdown, but also had a fumble taken back for six. ",
            "3": "Meanwhile, the Cardinals were able to establish Edgerrin James and Tim Hightower. James had 73 yards on 16 attempts, while Hightower compiled 23 yards and a score on six rushes. ",
            "4": "With all that said, it was Kurt Warner who was able to ice the game by converting first downs in the four-minute offense in the final quarter. Warner was 19-of-32 for 271 yards, two touchdowns a pick. Warner went to Larry Fitzgerald six times for 101 yards and a score. Anquan Boldin caught two balls for 72 yards and a touchdown himself, but he had to leave the game with a hamstring (thanks, Al Michaels). ",
            "5": "This is a moot point because the Cardinals won, but it seemed like the zebras seemingly missed every call in Arizona's favor, prompting Wraith to ask So how much money do the refs have on the Falcons? Larry Fitzgerald was mugged twice on what should have been obvious pass interference infractions. Bert Berry was also held in the end zone for a possible safety. It's almost as if the officials were thinking, Wait a second, these Cardinals aren't supposed to be here! That looks like a penalty, but I'm not quite sure what to do! Hopefully for all the new Arizona fans out there, this doesn't carry over to the Carolina/New York game. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "It was almost a game of almosts for the Chargers. If you're confused by that statement, you're not alone. I'm pretty befuddled myself. Fortunately, NBC seems to be collecting confused people on their pre-game show, so I think I'll apply with them. What I think I was supposed to mean was that San Diego nearly screwed itself out of a postseason victory. Darren Sproles, despite an amazing game, fumbled on Indianapolis' 1-yard line in the third quarter, which resulted in a touchback. Three different Charger defensive backs - Steve Gregory, Eric Weddle and Antonio Cromartie - also dropped interceptions. ",
            "2": "However, punter Mike Scifres made life difficult for the Colts, continuously pinning them inside their own 10. In total, Scifres had six punts inside the 20. As a comparison, Indianapolis' Hunter Smith had none on the same amount of attempts. In the fourth quarter, Peyton Manning was sacked on his own 1, giving San Diego the ball on a very short field. The Chargers kicked the tying field goal 90 seconds later, setting up overtime. Manning would never see the ball again. ",
            "3": "Scifres and Sproles were San Diego's MVPs. Sproles had 105 rushing yards, 45 receiving yards, 178 return yards and two touchdowns. Sproles played for an injured LaDainian Tomlinson, who left the game early in the second quarter. Tomlinson finished with five rushes, 25 yards and a score. ",
            "4": "Philip Rivers was responsible for some questionable decisions in this game, including a fourth-quarter interception into double coverage, but he made clutch throws as time was winding down. Rivers was 20-of-36 for 217 yards and that pick. Rivers found Antonio Gates eight times for 87 yards. Curiously, Vincent Jackson had no receptions. ",
            "5": "Peyton Manning has now started 15 playoff games. He's 6-3 versus 4-3 defenses, but only 1-5 against 3-4 formations. That said, Manning doesn't deserve the blame for this loss; he was 25-of-42 for 310 yards and a touchdown. ",
            "6": "Save for Marvin Harrison (3 catches, 20 yards), all of Manning's key weapons put up great numbers. Dallas Clark caught seven balls for 33 yards. Reggie Wayne notched four receptions, 129 yards and a score. Anthony Gonzalez had six catches for 97 yards. ",
            "7": "If you look at the box score, you'll see that the Chargers were whistled for far fewer penalties (3) than the Colts were (9). While I wouldn't dispute any of Indianapolis' infractions in overtime, it seemed like Ron Winter's crew missed a few San Diego penalties. However, it wasn't completely one-sided; the Chargers were whistled for a pass interference where the defensive back barely laid a fingernail on the Indianapolis receiver. I think it's more ineptness than larceny concerning Winter's crew. ",
            "8": "Something else that must be discussed is Norv Turner. Turner was up to his old tricks when he wasted a timeout on a third-and-10 with three minutes remaining in the fourth quarter, with his team down 17-14 on Indianapolis' 44-yard line. Turner was also indecisive on a crucial fourth down earlier, nearly causing his team to have a delay-of-game penalty. I consider it a miracle that Turner has been able to win three playoff games in the past two seasons. Forget some mold that looks like the Virgin Mary; people looking for a sign from God should take a trip down to San Diego. '); "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "Let's use an Emmitt-ism to describe this game: Epic debaclation. Baltimore's defense completely dominated a Miami offense that looked helpless until the Ravens had a big lead in the fourth quarter. The Dolphins' sole offensive score until then, a first-quarter field goal, came off a LeRon McClain fumble. In total, Baltimore's defense racked up four interceptions (one returned for a touchdown), three sacks, one forced fumble and a blocked extra point. ",
            "2": "As mentioned, the Dolphins scored late, which was an impressive fingertip-grab by Ronnie Brown. Brown rushed for just 19 yards on 12 carries, but also had six receptions for 43 receiving yards and a touchdown. ",
            "3": "Meanwhile, Pennington was 25-of-38 for 252 yards, one touchdown and the four picks. Pennington had nothing to work with in the first half because Davone Bess left the game with a hand injury. Bess would later return and finish with two receptions for 54 yards. Ted Ginn managed five receptions for 38 yards. ",
            "4": "At first glance, Joe Flacco's numbers indicate that he didn't have a good game. Flacco was 9-of-23 for 135 yards. However, Flacco didn't turn the ball over, which is unheard of for a rookie signal caller making his first postseason start. Flacco also almost hit a few receivers on long bombs. Flacco also scored a rushing touchdown in the fourth quarter. ",
            "5": "Derrick Mason was the only Baltimore receiver of note. The old warrior grabbed four balls for 71 yards. ",
            "6": "Meanwhile, LeRon McClain and Willis McGahee combined for 137 total yards on 26 attempts. McClain (75 yards) scored a touchdown, while McGahee (62 yards), broke free for a 48-yard gain that set up Flacco's scoring scramble. ",
            "7": "Baltimore travels to Tennessee next week. The Titans are going to have their hands full with the red-hot Ravens, especially after resting their starters in Week 17. The one team playing this weekend that rested its starters (Indianapolis) kissed its Super Bowl dreams goodbye. Tennessee is in serious danger of suffering the same fate, as are the Giants, who only played one half. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "I said it on my ",
            "2": "For all the criticism I've given Clueless over the year, I have to say that he did a good job sticking with the run. Adrian Peterson rushed for 83 yards and two touchdowns on 20 carries, including a 40-yard score. Chester Taylor, meanwhile, compiled 48 yards on 12 attempts. Taylor also caught five balls for 36 yards. ",
            "3": "Both of Minnesota's backs, however, were overshadowed by Brian Westbrook and the screen pass he took 71 yards for the score that put this game out of reach (23-14). Westbrook didn't have much success on the ground though, managing just 38 yards on 20 carries. In the Live In-Games Thread in the forum, I repeatedly called for Andy Reid to involve Westbrook more in the aerial attack. I had the Eagles -3, so I was happy to see Reid's Cheesesteak Telepathy skills come through in the fourth quarter. ",
            "4": "Despite Donovan McNabb's performance (23-of-34, 300 yards, TD, INT), Reid was understandably scared to go for it on fourth-and-short situations. On one instance, Reid punted it away near midfield. On another, he elected to go for a 50-yard field goal. I have to think this will come back to haunt the Eagles sometime in the future, whether that's at New York, Carolina, or in the Super Bowl. "
        }
    },
    "numberOfGames": "4"
}