{
    "year": "2008",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "30"
        },
        "comments": {
            "amount": "4",
            "1": "There really is no point in handicapping games anymore. You can be right on the money, have the right side, and still lose. I'm frustrated. The Browns might be the dumbest team of all time. Seriously. I'm convinced that if Roger Goodell announced in August that he would be spotting Cleveland 14 points in every game this year, the Browns wouldn't make the playoffs. They're really incredible at finding ways to lose. In case you missed this game, the Browns were up 23-10 in the third quarter. Save for Denver's second drive in the first quarter, Cleveland controlled every facet of the game. Brady Quinn (23-of-35, 239 yards, two touchdowns) was sharp. The ground attack was working really well (Jamal Lewis and Jerome Harrison combined for 108 yards on 24 carries). Denver had no answer for Kellen Winslow Jr. (10 catches, 111 yards and a pair of scores). The defense, while surrendering some yardage, was able to get off the field when it mattered most. The secondary even came up with an interception. And it seemed like everyone on the Broncos was leaving the game with injuries, including Ryan Torain (12 carries, 68 yards, one touchdown), who is out for the year with a knee. So, what happened? The Browns played like the Browns. A foolish Winslow pass-interference penalty eliminated a beautiful Quinn-to-Braylon Edwards first-down conversion on third-and-12. This forced a Cleveland punt. On Denver's next possession, Jay Cutler hit Eddie Royal on a 93-yard bomb to Eddie Royal, thanks to completely inept coverage by completely inept corner Brandon McDonald. On Cleveland's next drive, Winslow once again did his best to ruin his team's chances of winning, fumbling on Denver's 38-yard line. Denver took over and scored another touchdown eight plays later to take the lead, despite the fact that the Browns dropped about four would-be interceptions in the final quarter. After the teams exchanged touchdowns, Winslow let a ball sail right through his hands in Denver territory on fourth-and-six. Game over. I really should stop handicapping Cleveland contests and just ask Edwards and Winslow whom they're betting on. Those two clowns have blown so many games this year, it's really disgusting. I'm convinced Winslow had the Browns -2 in the first half and the Broncos +3 for the game. There is no other explanation for his Jekyll-and-Hyde performance. Winslow, McDonald and the other drop-happy defensive backs weren't the only ones trying to blow it for the Browns. Romeo Crennel did some ridiculously stupid things himself, including accepting a 10-yard penalty on the Broncos that brought up third down instead of fourth down. ",
            "2": "At any rate, tons of credit has to be given to Denver. Despite its multiple injuries, the Broncos won to improve to 5-4. Cutler was 24-of-42 for 447 yards, three touchdowns and a pick, though the Browns dropped about half-a-dozen sure-fire interceptions in this contest. Because he didn't have a running game by his side - Torain and Selvin Young both had to leave the game early - Cutler was forced to throw on almost every down. He consequently fired some terrible passes into double coverage. ",
            "3": "Luckily, Eddie Royal, Tony Scheffler and Brandon Marshall bailed him out. Royal had six catches, 164 yards and a score. Marshall also grabbed six balls for 89 yards and a touchdown. Scheffler, playing with an injured groin, had four receptions and 92 yards. ",
            "4": "While Crennel had some curious play-calls and decisions, Mike Shanahan also made some bone-headed moves. Shanahan called a quarterback scramble at the end of the first half with 12 seconds remaining and no timeouts left. Cutler failed to get out of bounds, and all the time ticked off the clock. Shanahan, however, made up for it with a brilliant play. Not even NFL.com could recognize it. Check it out: "
        }
    }
}