{
    "year": "2008",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "The Chiefs are comical. The fact that they were outgained by 315 yards doesn't even tell the whole story. In the third quarter, the Chiefs kept the game alive, intercepting Jake Delhomme in the end zone, down 21-0. Damon Huard tossed a pick on the very next play. ",
            "2": "It's tough to say whether Kansas City's defense was more pathetic than its offense. I'd call it a draw. Check out the Panthers' play-calling on their first touchdown drive: Run 1 yard, run 4 yards, run 4 yards, run 14 yards, run 5 yards, run 10 yards (touchdown). Nice job, Chiefs. On Carolina's third drive, 10 of the Panthers' 11 plays were rushes. The only pass was an incompletion. Oh, and did I mention that Carolina was missing its two starting offensive tackles!? ",
            "3": "I almost forgot! The Panthers' second scoring drive featured a converted third-and-17, which was a 19-yard pass from Jake Delhomme to Mark Jones, whoever that is. The Chiefs can't even stop fake players! ",
            "4": "Delhomme finished with 236 yards and two touchdowns. The thing is, he only had to throw the ball 22 times. DeAngelo Williams and Jonathan Stewart combined for 195 yards and two touchdowns on 39 carries. Steve Smith caught six balls for 96 yards. ",
            "5": "Larry Johnson's comeback? So much for that. Johnson gained two yards on seven carries. Dwayne Bowe was the only Chief who put up solid numbers; he had five grabs for 57 yards. ",
            "6": "One positive for Kansas City: Despite Williams and Stewart going off, Kansas City's rush defense improved! Entering the game, they allowed 5.6 yards per carry. Now it's down to 5.5! "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Titans",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "I was hoping to see Tennessee-Baltimore on my CBS station at 1 p.m. Unfortunately, their featured game was the 4:15 tilt between Dallas and Cincinnati. Yep - CBS chose the largest spread on the board as its main game. I didn't know an addiction to crack was a prerequisite to work for CBS' TV scheduling department. ",
            "2": "Anyway, I was pissed off at the Titans during about 58 minutes for this game. I picked them to cover because I thought Kerry Collins would be less turnover-prone than Joe Flacco. Lo and behold, Collins tossed interceptions on his first two drives. Fortunately, things began to make more sense as the game went on. Joe Flacco coughed up three interceptions (one was nullified by a booth review). Collins eventually became sober enough to lead Tennessee to a game-winning touchdown drive toward the end of the fourth quarter. Of course, the Ravens helped out the Titans a ton. They were whistled for 11 penalties for 91 yards, though one was a BS roughing-the-passer penalty on the decisive drive. ",
            "3": "Nothing of note in the passing department; both signal callers barely completed 50 percent of their passes, and they combined for one touchdown and four picks. Todd Heap caught four passes, eclipsing his season total (3) entering this contest. ",
            "4": "Baltimore's defense did a great job on Chris Johnson, limiting the rookie runner to 44 yards on 18 carries. LenDale White received just three rushes, gaining four yards. He ate a couple of snacks in between the touches. ",
            "5": "Tennessee's stop unit didn't do as good a job on Baltimore's ball-carriers. While Willis McGahee managed just 64 yards on 22 rushes, LeRon McClain totaled 51 yards on only 11 attempts. He also scored a touchdown. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "So... I thought there was a chance the Lions would play hard in the wake of Matt Millen's firing. If Darth William Clay Sidious Ford's ultimate Yes Man was let go, what did that say about everyone else's job status? Apparently not too much. Thanks for showing up, losers. ",
            "2": "The big news here for Detroit was that Jon Kitna was benched in favor of Dan Orlovsky. I can't blame Rod Marnelli for putting Kitna on the sidelines - he was just 8-of-16 for 74 yards - but replacing him with Orlovsky, who wouldn't even be in the NFL if it wasn't for some crappy GM who used to run the Lions? Orlovsky predictably struggled, going 13-of-23 for 97 yards and a pick-six. Because of Kitna's struggles and Orlovsky's ineptness, Calvin Johnson couldn't do anything (2 catches, 16 yards). Roy Williams, meanwhile, actually put up solid numbers, catching seven passes for 96 yards. Were the Detroit quarterbacks ordered to target Williams for to increase his trade value? Keep in mind that Williams' performance is deceiving; he dropped multiple balls and did his usual complaining on the sidelines. ",
            "3": "Who would have thought that Chicago's aerial attack would look much more impressive than Detroit's? And that's an understatement; Kyle Orton went 24-of-34, 334 yards and two touchdowns! And no, the Bears didn't kidnap Peyton Manning, stuff him in an Orton jersey and send him on to the field. That was Kyle freaking Orton throwing for 334 yards! Orton connected with Rashied Davis six times for 97 yards. Devin Hester caught five balls for 66 yards and a score. Tight end Greg Olsen had three grabs for 87 yards. ",
            "4": "Matt Forte didn't have a good game in terms of yardage (36 rushing, 25 receiving) but he scored two touchdowns, redeeming the fact that I predicted he would tally 200 total yards. Oops! "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "For all the talk of whether Aaron Rodgers could play in this game, it really didn't matter. Green Bay's defense was abysmal, and the team as a whole was very sloppy; it was if they relaxed and took this game for granted when it was announced that Rodgers would start. Green Bay was whistled for nine penalties, which totaled for 92 yards. As a comparison, the Falcons had just two infractions for 15 yards. One of the Green Bay penalties was a holding call on rookie Jermichael Finley, which nullified a 43-yard Mason Crosby field goal. Crosby subsequently missed from 53. ",
            "2": "The Packers didn't have a prayer of stopping Michael Turner, who managed 121 yards and a touchdown on 26 carries. This opened up easy passing opportunities for Matt Ryan, who torched a Green Bay secondary that was missing Al Harris and Atari Bigby. Ryan went 16-of-26, 194 yards, two touchdowns and a pick. He was 4-of-4 for 65 yards and a touchdown on the opening drive of the game. ",
            "3": "Roddy White grabbed eight passes for 132 yards and a score. He should be in your starting lineup unless he's playing the Buccaneers. ",
            "4": "I stated Aaron Rodgers was a non-factor because he finished 25-of-37, 313 yards, three touchdowns and a pick, and the Packers still lost. Greg Jennings and Donald Driver each caught a score. ",
            "5": "The silver lining for the Packers' loss is that Ryan Grant finally got back on track. Grant rushed for 83 yards on 18 carries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "And I thought the Vikings blowing a 15-0 lead to ruin a potential cover as a 2-point underdog was bad... Houston coughing up a 27-10 lead with four minutes remaining has me thinking: roof, razor, noose or Hole in the Wall. ",
            "2": "And it's all thanks to Sage Rosenfels! Rosenchoker (I will refer to him as Rosenchoker until further notice), replacing Matt Schaub who went to the hospital with a stomach virus, played extremely well and error-free for the first 56 minutes of this game. Unfortunately for my sanity, Rosenchoker committed three turnovers in the final four minutes. One was a fumble which was returned for a touchdown by Gary Brackett to make the score 27-24. Another fumble came three plays later, as Rosenchoker coughed up the ball instead of running out the clock, giving Peyton Manning a short, 20-yard field to work with. After Manning's decisive score to Reggie Wayne, Rosenchoker threw a pick in Indianapolis territory, icing the game for the four-leaf-clover-carrying Colts. I've been picking games on this Web site since 1999. Rosenchoker's choke job has to be one of the top five worst beats I've had this past decade. Like I said... roof, razor, noose or crappy FOX reality show. I'm not sure which is least painful. ",
            "3": "Andre Johnson had a great game, considering how much of a loser Rosenchoker is. Johnson caught nine balls for 131 yards and a touchdown. Meanwhile, Steve Slaton ran all over the Bob Sanders-less Colts, gaining 93 yards and two touchdowns on 16 carries. I have to wonder why Slaton didn't get the ball late in the fourth quarter. Calling for multiple Rosenchoker carries is one of many gaffs Gary Kubiak has been guilty of this season. ",
            "4": "So, did I mention the Colts were lucky? Peyton Manning and Reggie Wayne put up solid stats, though most of that came once Rosenchoker went into meltdown mode. Manning was 25-of-34, 247 yards, two touchdowns and a pick. Reggie Wayne had seven receptions, 97 yards and the winning score. ",
            "5": "Indianapolis' defense couldn't stop the Texans in the first 56 minutes of the game. I already gave you Slaton and Johnson's numbers; the Colts also were guilty of holding on a third-and-17, which gave Houston a first down. This was pre-Rosenchoker meltdown; otherwise, Rosenchoker would have just handed the ball to Brackett again. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "If the single-wing offense is so unstoppable, why haven't any NFL teams utilized it in the past five million years? Ronnie Brown was once again unstoppable; he gained 125 yards on 24 carries. One has to wonder what the Dolphins will do when (not if) Brown goes down with his annual injury. ",
            "2": "Brown didn't throw any passes this time. Chad Pennington took care of that facet of the offense, going 22-of-29 for 228 yards and a touchdown. Pennington went to Ted Ginn seven times for 55 yards. Greg Camarillo was the wideout who made it into the end zone. He had six grabs for 68 yards. Tight end Anthony Fasano was also a factor with three catches and 47 yards. ",
            "3": "Miami held a lead most of the game, but nearly relinquished it in the fourth quarter. The Chargers had a fourth-and-goal at the one, but Miami came up with a huge stop, stuffing LaDainian Tomlinson just short of the end zone. Tomlinson wasn't a threat the entire afternoon; he managed just 35 yards on 12 rushes. ",
            "4": "After three amazing performances to start the season, Philip Rivers struggled for the second consecutive week, as it's possible his repaired ACL could be a factor. Rivers was just 13-of-28 for 159 yards and a touchdown. Rivers connected with Antonio Gates only one time (12 yards). '); "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "And I thought the Vikings blowing a 15-0 lead to ruin a potential cover as a 2-point underdog was bad... Houston coughing up a 27-10 lead with four minutes remaining has me thinking: roof, razor, noose or Hole in the Wall. ",
            "2": "And it's all thanks to Sage Rosenfels! Rosenchoker (I will refer to him as Rosenchoker until further notice), replacing Matt Schaub who went to the hospital with a stomach virus, played extremely well and error-free for the first 56 minutes of this game. Unfortunately for my sanity, Rosenchoker committed three turnovers in the final four minutes. One was a fumble which was returned for a touchdown by Gary Brackett to make the score 27-24. Another fumble came three plays later, as Rosenchoker coughed up the ball instead of running out the clock, giving Peyton Manning a short, 20-yard field to work with. After Manning's decisive score to Reggie Wayne, Rosenchoker threw a pick in Indianapolis territory, icing the game for the four-leaf-clover-carrying Colts. I've been picking games on this Web site since 1999. Rosenchoker's choke job has to be one of the top five worst beats I've had this past decade. Like I said... roof, razor, noose or crappy FOX reality show. I'm not sure which is least painful. ",
            "3": "Andre Johnson had a great game, considering how much of a loser Rosenchoker is. Johnson caught nine balls for 131 yards and a touchdown. Meanwhile, Steve Slaton ran all over the Bob Sanders-less Colts, gaining 93 yards and two touchdowns on 16 carries. I have to wonder why Slaton didn't get the ball late in the fourth quarter. Calling for multiple Rosenchoker carries is one of many gaffs Gary Kubiak has been guilty of this season. ",
            "4": "So, did I mention the Colts were lucky? Peyton Manning and Reggie Wayne put up solid stats, though most of that came once Rosenchoker went into meltdown mode. Manning was 25-of-34, 247 yards, two touchdowns and a pick. Reggie Wayne had seven receptions, 97 yards and the winning score. ",
            "5": "Indianapolis' defense couldn't stop the Texans in the first 56 minutes of the game. I already gave you Slaton and Johnson's numbers; the Colts also were guilty of holding on a third-and-17, which gave Houston a first down. This was pre-Rosenchoker meltdown; otherwise, Rosenchoker would have just handed the ball to Brackett again. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "If the single-wing offense is so unstoppable, why haven't any NFL teams utilized it in the past five million years? Ronnie Brown was once again unstoppable; he gained 125 yards on 24 carries. One has to wonder what the Dolphins will do when (not if) Brown goes down with his annual injury. ",
            "2": "Brown didn't throw any passes this time. Chad Pennington took care of that facet of the offense, going 22-of-29 for 228 yards and a touchdown. Pennington went to Ted Ginn seven times for 55 yards. Greg Camarillo was the wideout who made it into the end zone. He had six grabs for 68 yards. Tight end Anthony Fasano was also a factor with three catches and 47 yards. ",
            "3": "Miami held a lead most of the game, but nearly relinquished it in the fourth quarter. The Chargers had a fourth-and-goal at the one, but Miami came up with a huge stop, stuffing LaDainian Tomlinson just short of the end zone. Tomlinson wasn't a threat the entire afternoon; he managed just 35 yards on 12 rushes. ",
            "4": "After three amazing performances to start the season, Philip Rivers struggled for the second consecutive week, as it's possible his repaired ACL could be a factor. Rivers was just 13-of-28 for 159 yards and a touchdown. Rivers connected with Antonio Gates only one time (12 yards). "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Giants",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "Well, at least the Seahawks put up a fight for the first few seconds of this game... The Giants completely dominated every aspect of this contest. It was so much of a blowout that David Carr came in - and threw a touchdown! ",
            "2": "In the write-up on my ",
            "3": "The Seahawks had no answer for Eli Manning. In the first quarter, he was 7-of-7 for 145 yards and a touchdown. He finished with 267 yards and two scores. ",
            "4": "With Plaxico Burress out, Domenik Hixon stepped up. Entering the game with just 94 career yards, Hixon grabbed four balls for 102 yards and a touchdown. Sinorice Moss chipped in with 45 yards and two scores of his own. ",
            "5": "Seattle struggled against the pass coming into this contest, but had played the run well. What happened? Brandon Jacobs bulldozed the Seahawks' front seven for 136 yards and two touchdowns on 15 carries. The Seahawks' rush defense average worsened from 3.3 to 4.6. That's almost as ugly as this score. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "I didn't think it was a good sign that Clinton Portis was using an oxygen tank before this game started. How could the Redskins come off a tough victory at Dallas and beat another solid NFC East team that would be desperate for a victory? ",
            "2": "Here's how: Washington dominated Philadelphia in the final three quarters of the game. Portis pummeled the Eagles' No. 1 ranked rush defense, gaining 145 yards and a touchdown on 29 carries. ",
            "3": "Jason Campbell, more impressive every week, went 16-of-29 for 176 yards, going to Chris Cooley early and often (8 catches, 109 yards, TD). Santana Moss didn't catch a single pass. At any rate, Campbell looks like he's a young Donovan McNabb. Now all he needs to do is throw up in the Super Bowl. ",
            "4": "Speaking of McNabb, the Eagles' signal-caller finished 17-of-29, 196 yards. After a pair of efficient drives to open the game, McNabb struggled to move the chains. The Eagles had nine first downs on their first two possessions. They had only five the rest of the game. ",
            "5": "Brian Westbrook's return didn't help. Westbrook caught six passes for 51 yards, but managed just 33 yards on 12 carries on the ground. ",
            "6": "Same players. A running back coming off injury. Same dumb coach. Andy Reid once again ran the ball on every opportunity inside the red zone. Reid called two runs on second-and-one at the two, and Westbrook failed to gain a single yard. Luckily, Westbrook lost a good amount of yardage on third down, forcing Reid to go for a field goal. If Westbrook was held to a minimal loss, Reid would have called yet another hopeless run, and the Eagles wouldn't have even scored three points. ",
            "7": "Speaking of Eagles field goals, David Akers is now three of his previous 14 from 40-plus. Reid foolishly tried a 50-yard kick, which didn't have a chance. That set the Redskins up in great field position, which led to their first of many scores of the game. ",
            "8": "The Redskins are the second-best team in the NFL. They're 4-1 despite playing three divisional road games! That's pretty amazing, considering how awful they looked on opening night. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "The Broncos' defense played surprisingly well against the Buccaneers, though they made a grave mistake in the second half. While sacking Brian Griese, they managed to injure him, forcing Jon Gruden to play Jeff Garcia instead. Because Griese sucks so much more than Garcia, Denver put itself at risk. Garcia eventually scored a touchdown in the fourth quarter, which was another backdoor cover that went against me. Ugh. ",
            "2": "While neither Garcia nor Griese could eclipse 100 yards, Jay Cutler was 23-of-34, 227 yards and a touchdown. Oddly enough, Eddie Royal and Brandon Marshall totaled just six catches and 48 yards. Cutler preferred Scheffler (4 catches, 65 yards) and Brandon Stokley (6 catches, 52 yards, TD). ",
            "3": "Fantasy football fiend Mike Shanahan once again screwed anyone who drafted a Denver running back. Michael Pittman, Selvin Young and Andre Hall received six, 10 and five carries, respectively. ",
            "4": "Warrick Dunn and Earnest Graham also split attempts. Dunn gained 74 yards on 11 carries, while Graham managed 59 yards on 10 rushes. I said Denver's stop unit performed admirably; that was in terms of pass rush (three sacks) and aerial defense (181 yards). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "Nothing went right for the former 4-0 Bills, who were actually underdogs in this game. Trent Edwards suffered a concussion in the first quarterand had to be replaced by J.P. Losman. While the Zohan threw for 220 yards and a beautiful 87-yard touchdown to Lee Evans, he lost two fumbles and tossed an interception. The Cardinals converted all three turnovers into touchdowns. ",
            "2": "Buffalo's defense was uncharacteristically awful, leaving off where they started in the first half against the Rams last week. Arizona converted 9-of-15 third downs and 1-of-2 fourth downs. The Bills couldn't even sack Kurt Warner a single time. But even when Buffalo came up with a stop, it just screwed up again. The Bills held the Cardinals to a field goal in the third quarter, which would have made the score 27-17. Unfortunately, Buffalo was offside, granting Arizona a first down. Warner threw a touchdown to Larry Fitzgerald two plays later, putting the game out of reach at 31-17. ",
            "3": "Warner was sharp all afternoon. After committing seven turnovers against the Jets last week, Warner was completely error-free. He finished 33-of-42, 250 yards and two touchdowns despite not having Anquan Boldin. Warner connected with Larry Fitzgerald seven times for 52 yards and two scores. Steve Breaston also caught seven balls for 77 yards. Rookie Early Doucet chipped in with six grabs and 42 yards. ",
            "4": "Tim Hightower vultured two touchdowns away from Edgerrin James, though the latter still managed a score of his own. James rushed 21 times for 57 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "22"
        },
        "comments": {
            "amount": "7",
            "1": "The Bengals played a competitive game at Dallas, but you wouldn't have known it by the first play of the game - Carson Palmer threw an interception that bounced right off of Reggie Kelly's hands. What I wanted to know was why Kelly was even out on the field. Didn't Cincinnati pay tons of cash for Ben Utecht? Why are you going to your backup tight end on the opening play? ",
            "2": "Sticking with this theme, Carson Palmer played well, but you wouldn't have known it by a pass he threw at the end of the first half. Palmer, running away from tacklers, sailed a throw literally 20 yards over a wide-open Chris Perry's head. Perry would have scored. Instead, the Bengals had to settle for a field goal. Palmer finished 23-of-39, 217 yards, two touchdowns and an interception. ",
            "3": "Going back to Perry, the former No. 1 pick couldn't do anything positive on the ground, as he rushed for 31 yards on 13 carries. Perry fumbled right after the Bengals recovered an onside kick in the fourth quarter. ",
            "4": "To steal a joke from Chris Olbermann, Chad Ocho Cinco didn't get to kiss the star in Dallas, unless you count the semi-awkward hug he gave Terrell Owens following the conclusion of the contest. Ocho Cinco caught just three passes for 43 yards. T.J. Houshmandzadeh saw all the action, grabbing seven balls for 85 yards and two touchdowns. ",
            "5": "Speaking of Owens, he caught just two passes for 67 yards and a touchdown, so expect more complaints and weird private meetings with Tony Romo. Romo was 14-of-23 for 176 yards, three scores and a pick. Jason Witten led all receivers with eight receptions, 79 yards and a touchdown. ",
            "6": "Marion Barber couldn't get into the end zone - he rushed for 84 yards on 23 rushes - but Felix Jones managed to score on a scintillating 33-yard run. Jones tallied 96 yards on just nine rushes. ",
            "7": "Congratulations to the Bengals. No, they didn't get their first win, but they scored their first third-quarter points of the season! In the words of Jim Zorn, hip-hip, hooray! "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "30"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "NOTE: This is the final game I'm covering on this page. I'll talk about the Sunday and Monday night games in my ",
            "2": "",
            "3": "How in the world did New England manage just one sack? How about the fact that the 49ers didn't even have the ball all that much? Thanks to J.T. O'Sullivan's lack of talent and Mike Martz's infatuation with throwing on every down, San Francisco converted just 1-of-9 third downs. As a comparison, New England was 9-of-18 when trying to move the chains. ",
            "4": "Speaking of Martz, the self-proclaimed genius called just 12 runs for Frank Gore. O'Sullivan passed 29 times. The 49ers either had the lead or trailed by only three until midway through the third quarter, so it's not like San Francisco was so far behind it couldn't pound the rock with its best player. And it's not like Gore wasn't effective; he gained 54 yards on those 12 attempts, which is an average of 4.5. ",
            "5": "Oh, and in case you didn't know, O'Sullivan sucks, and is far from the Super Awesome Quarterback No. 1 Martz described him as a few weeks ago. O'Sullivan somehow threw three touchdowns, but he also tossed three picks and failed to complete 50 percent of his passes. His YPA was a minuscule 4.5. On San Francisco's final offensive play, O'Sullivan needed to convert a fourth-and-long. Instead of firing the ball downfield, he attempted some sort of weird, Kareem Abdul-Jabbar-like hook shot. I can't describe it better than that. I would have laughed if I wasn't too busy crying, as my five-unit play on the 49ers went down the drain. ",
            "6": "Matt Cassel proved all doubters wrong who said that he couldn't go deep. Cassel connected on a 66-yard bomb to Moss in the first quarter. I put proved in quotes because Cassel's next-longest completion was just 20 yards. He was also intercepted on his next deep attempt to Moss. Still, he did a great job moving the chains against San Francisco's pathetic defense. Moss caught five balls for 111 yards and that score, while Wes Welker grabbed eigth balls for 73 yards. ",
            "7": "Vernon Davis didn't catch a single pass. He was targeted once. He has just five grabs on the year. Oh, and he's also responsible for poverty and world hunger. Cut him now. "
        }
    },
    "numberOfGames": "14"
}