{
    "year": "2008",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "Browns",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "It's a shame Carson Palmer didn't play in this game. And not because Ryan Fitzpatrick was horrendous, and not because Cincinnati could have dodged an 0-4 start. If Derek Anderson would have defeated Palmer, that would have meant that an Oregon State alumnus would have knocked off a USC product as an underdog. The symmetry would have been awesome - though the Browns weren't a 25-point underdog that lost to crappy Stanford and was blowed out at Penn State. ",
            "2": "Anyway, where did this Palmer injury come from? There was nothing during the week. He wasn't limited in practice. If it wasn't for Chris Mortensen, we wouldn't have found out Palmer was a scratch until kickoff. ",
            "3": "Speaking of kickoff, I turned on CBS, expecting to see a good game. Unfortunately, the two announcers were previewing the Browns-Bengals. Seriously, whose brilliant idea was it to broadcast the Toilet Bowl, a battle between two 0-3 squads? Someone needs to be fired for this. ",
            "4": "I was also shocked that Romeo Crennel didn't bench Anderson after he tossed a pick in the red zone on the opening drive of the third quarter. Crennel didn't even trust Anderson enough to throw the ball on the opening possession of the game, which culminated in a field goal. Seven runs, no passes. If the Browns weren't playing the sorry Bungles, they would be 0-4 right now. ",
            "5": "Anderson finished 15-of-24, 138 yards, one touchdown and an interception. He went to Kellen Winslow Jr. five times for 54 yards. Braylon Edwards caught three balls for 22 yards and a touchdown. Edwards also had a senseless unnecessary roughness penalty after a Browns first down in the third quarter. ",
            "6": "With all that offensive ineptness how did the Browns come away with a 20-12 victory? You can thank the Bengals for turning it over five times. Ryan Fitzpatrick gave Cincinnati no chance to win, as he threw three picks and fumbled once. Chris Perry also lost a fumble. With Fitzpatrick struggling, Cleveland focused on stopping Chris Perry, who totaled just 28 yards on 12 carries. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "Matt Ryan has now played two road games against divisional opponents. The scores of those contests: Buccaneers 24, Falcons 9; Panthers 24, Falcons 9. Atlanta's 24-9 loss could have been a lot worse. A Matt Ryan pick-six was nullified by a roughing-the-passer penalty in the first quarter. ",
            "2": "Speaking of back-breaking penalties, Atlanta defensive tackle Kindal Moorehead was whistled for a personal foul on a failed third-and-12 by the Panthers on their opening possession. With new life, Carolina scored a touchdown a few minutes later - a Jonathan Stewart 8-yard run. ",
            "3": "Jake Delhomme threw for two touchdowns himself. He was 20-of-29 for 294 yards, locating Muhsin Muhammad eight times for 147 yards and a score. Steve Smith caught the other touchdown. He had six receptions and 96 yards. ",
            "4": "As for Ryan, the rookie signal caller put up a career-high 41 pass attempts, but completed only 21 of them for 158 yards. Roddy White was the only receiver of note; he had seven catches and 90 yards. Meanwhile, Michael Turner managed only 56 yards on 18 rushes. ",
            "5": "Gotta love it when NFL.com's Game Center screws up. Check out this puzzling play: 2-37 CAR30 (1:46) (Shotgun) M.Ryan right end pushed ob at ATL 30 for -40 yards (K.Lucas). Did Ryan spin around and run the wrong way? Did he steal Matt Jones' magic powder? I wish something like this would happen in real life. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "Poor Matt Schaub. He finally plays a defense not considered to be among the NFL's elite, and his valiant effort was wasted because Houston's defense couldn't force Jacksonville into a punt in the second half. The Texans managed just one sack on David Garrard. Good job solidifying your pass rush this offseason, Houston. ",
            "2": "I've been on Garrard's case for not being able to produce a solid performance this year, which includes the preseason. Well, Jaguar fans should be thrilled with how he played on Sunday. Garrard was 23-of-32, 236 yards and a touchdown. He also rushed seven times for 41 yards and a score. ",
            "3": "Coke-Free Matt Jones continues to impress. Jones was Jacksonville's top statistical wideout, catching five balls for 71 yards and a score. Mike Walker also caught five passes for 46 yards. Marcedes Lewis, meanwhile, dropped four passes. ",
            "4": "While Houston couldn't stop the pass to save its life, it actually somehow stopped the run pretty well, limiting Maurice Jones-Drew and Fred Taylor to 57 combined yards on 17 rushes. ",
            "5": "I mentioned Schaub earlier. He was 29-of-40 for 307 yards and three touchdowns, and probably could have led Houston to a victory if the team won the overtime coin flip. ",
            "6": "Despite Schaub's brilliant performance, Andre Johnson caught just three balls for 38 yards. Schaub's main targets were Owen Daniels (7 rec, 87 yards); Kevin Walter (8 rec, 76 yards, 2 TDs); and Steve Slaton (8 rec, 83 yards, 1 TD). Slaton was ineffective on the ground, rushing for just 33 yards on 10 carries. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Titans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "For those of you who didn't see this game, the officials completely blew a call in the second quarter. Minnesota stopped Justin Gage on a fourth-and-two on its own 3-yard line. It was extremely obvious, to the announcers, everyone recapping this contest on various highlight shows and anyone watching it live, that Gage didn't get the first down. However, the officials awarded Tennessee with a first-and-goal at the one. Brad Childress challenged the ruling, yet the referee didn't overturn it. If Ed Hochuli was downgraded for the call in the Denver-San Diego shootout, the official in this contest should be arrested for larceny. It wouldn't shocked me at all if we found out a few years down the road that this game was fixed. ",
            "2": "Of course, Minnesota made it pretty easy for the officiating crew. The Titans scored three touchdowns against the Vikings. All three were scored off Minnesota turnovers. Now, I can understand a desperate interception late in the fourth quarter, but I don't quite understand how the first turnover occurred. The initial turnover was the result of a Naufahu Tahi fumble. Who!? Exactly. Gus Frerotte threw twice to Tahi on the opening possession. Fahi fumbled on his second reception. What the hell is Brad Childress doing? If you have Adrian Peterson, Chester Taylor, Bernard Berrian and Sidney Rice, why in the world are you calling plays for some sort of Japanese sushi dish? ",
            "3": "It shouldn't be surprising that after Childress' genius plan blew up in his face, Tahi didn't catch a single pass the rest of the game. Bernard Berrian led the squad in yardage with 78, while Bobby Wade had the reception lead with seven (75 yards). Gus Frerotte was 25-of-43 for 266 yards and an interception. That pick occurred late in the game and deep in Tennessee territory. I wouldn't put that on Frerotte; he was just trying to make a play in an unlikely comeback. ",
            "4": "Adrian Peterson scored both of Minnesota's touchdowns. He had 80 yards on just 18 carries. Chester Taylor touched the ball only one time. ",
            "5": "Meanwhile, Chris Johnson matched Peterson's scoring total, but had a bit less yardage (61). LenDale White also scored, but he managed a pathetic 13 yards on 11 carries. One has to wonder why White is even getting the ball anymore. ",
            "6": "Kerry Collins managed the game well once again. Collins finished 18-of-35 for 199 yards. More importantly, he didn't turn it over. Justin Gage led all wideouts with 92 yards. ",
            "7": "A bit of good news for Viking fans: The Packers also lost, Aaron Rodgers looks like he's hurt and Bryant McKinnie will return from his four-game suspension next week. Oh, and Tarvaris Jackson completed all of his passes Sunday (1-of-1). He's definitely improving! "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "Hats off to Matt Bryant. If you haven't heard, he had to bury his 3-month-old son this week. The Buccaneers gave him the option to play or sit, and he chose to suit up. Bryant hit all three of his field-goal attempts, including the game-winner in the fourth quarter. ",
            "2": "With that said, the Buccaneers really had no business winning this game, so don't be fooled by the score. An Aaron Rodgers pass to Brandon Jackson bounced off of Jackson's hands and into Derrick Brooks', setting up an easy Tampa Bay touchdown. Later, a Ryan Grant fumble was returned for a score. In the second half, Rodgers suffered a shoulder injury. He sat out two drives, and was ineffective when he came back in. His replacement, rookie Matt Flynn, nearly threw a pick on his first throw. Flynn finished 2-of-5 for six yards. ",
            "3": "With that in mind, we have to ask why the Packers didn't have a veteran backup quarterback in this situation. Flynn was completely shellshocked and unprepared to take the field. A veteran signal caller could have at least moved the chains and put Green Bay in favorable field position. Instead, the Packers were forced to punt after a three-and-out, setting up Bryant's decisive kick. ",
            "4": "Aaron Rodgers finished 14-of-27 for 165 yards, two touchdowns and three picks. One of the interceptions was the aforementioned Jackson gaff. Another came after Rodgers returned off his shoulder injury. Most of Rodgers' yardage went to Greg Jennings, who notched six catches, 109 yards and two scores. ",
            "5": "Grant managed only 20 yards on 15 carries. He also fumbled and missed a wide-open cutback lane on a third-and-one on the opening drive of the third quarter. However, Grant actually looked healthy for the first time all year. I'd expect more from him against inferior defenses. ",
            "6": "One guy who sucks against almost every defense is Brian Griese, who was a woeful 15-of-30, 149 yards, one touchdown and three interceptions. One of Griese's throw-aways was a pick-six that was tossed when his team was up 20-14 late in the game. I know Griese didn't have Joey Galloway, making Antonio Bryant (4 rec, 39 yards) his top target, but there's still no excuse for carelessly throwing the ball away like that. ",
            "7": "Earnest Graham and Warrick Dunn literally carried the Buccaneers' offense. Graham had 111 yards and a touchdown on 20 carries. Dunn, meanwhile, finished with 63 yards on 16 rushes. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "56"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "35"
        },
        "comments": {
            "amount": "4",
            "1": "The box score says that Kurt Warner finished 40-of-57, 472 yards and two touchdowns, leading the Cardinals to 35 points. However, he tossed three interceptions and fumbled four times, completely ruining Arizona's chances of winning. Warner fumbled away the ball in the red zone on the opening drive of the game. Two possessions later, Warner tossed a pick-six. In between, a Cardinals field goal was blocked. That's three blown opportunities. ",
            "2": "Three Arizona receivers eclipsed the century mark. Larry Fitzgerald and Anquan Boldin notched 122 and 119 yards, respectively. The third was Steve Breaston (9 rec, 122 yards). The Cardinals couldn't run the ball, however, as Edgerrin James and Tim Hightower tallied a combined 42 yards, though they scored three touchdowns. ",
            "3": "While the Cardinals were throwing the game away with careless turnovers, Brett Favre capitalized on every opportunity, tossing a career-high six touchdowns amid going 24-of-34 for 289 yards. Three scores went to Laveranues Coles, two to Jerricho Cotchery and the other to Dustin Keller. Coles paced all wideouts with eight receptions and 105 yards. ",
            "4": "Arizona's defense was so porous, Dan Patrick was able to joke, The guys in the Wrangler commercial played better defense. Never has a sports anchor spoken words that were so true. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "The Mike Martz Black-Market Organ Sack Watch: J.T. O'Sullivan was sacked six times against the Saints. O'Sullivan has now been sacked 19 times, putting him on pace for 76, which would tie him with David Carr for the all-time record. ",
            "2": "Let's keep going with O'Sullivan. Mike Martz's alleged Super Awesome Quarterback was 18-of-36 for 257 yards, one touchdown, two picks and a fumble. ",
            "3": "A banged-up Bryant Johnson didn't catch any passes. Arnaz Battle led all 49er receivers with seven receptions and 120 yards. Isaac Bruce put up five catches, 54 yards and a touchdown. ",
            "4": "The real signal caller in this game, Drew Brees, was 23-of-35, 363 yards, three touchdowns and a pick. After a slow start - no points in the first quarter - Brees was completely unstoppable, going to Lance Moore seven times for 101 yards and two touchdowns. Robert Meachem totaled two receptions of 52 and 47 yards. ",
            "5": "Deuce McAllister took a week off from wasting space on New Orleans' roster, and actually rushed for 73 yards and a touchdown on 20 carries. He was much more effective on the ground than Reggie Bush, who recorded only 31 yards on 10 rushes. Bush caught five passes but only managed seven receiving yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "When the Chiefs began kicking field goals in the first quarter, I thought we were going to see a replay of Week 2's Indianapolis-Minnesota disaster. It looked like the Chiefs were leaving way too many points off the board. ",
            "2": "But that didn't matter in the end because Jay Cutler and the Broncos' offense committed way too many turnovers. Cutler threw two picks and fumbled. Brandon Marshall and Eddie Royal also fumbled once each. All three guys were able to put up solid numbers, however. Cutler was still able to finish 29-of-49, 361 yards and one touchdown. Eddie Royal caught nine balls for 104 yards. Brandon Marshall registered seven receptions for 77 yards and a score. ",
            "3": "Meanwhile, Damon Huard's numbers looked less asthetic - 21-of-28, 160 yards and a touchdown - but unlike Cutler, he didn't give the ball up. Huard proved that he was far superior to Tyler Thigpen, constantly moving the chains against Denver's pathetic defense. Unlike Thigpen, Huard is a functional NFL quarterback. With Thigpen, the Chiefs had a legitimate shot to go 0-16. With Huard, the sky's the limit - five victories might just be possible. ",
            "4": "Of course, it helped that Huard had Larry Johnson by his side. Johnson had a monstrous performance, tallying 198 yards and two touchdowns on 28 carries. ",
            "5": "Dwayne Bowe led the squad with seven receptions and 85 yards. Tony Gonzalez, who grabbed three balls for 47 yards and a score, now needs just three yards to break Shannon Sharpe's all-time receiving yards record (10,060) for tight ends. ",
            "6": "Some terrible news for the Chiefs: Branden Albert could be out for a while. The Broncos, who didn't have any sacks before Albert's injury, managed to get to Huard the first play after the rookie left tackle was forced out of the game. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "18"
        },
        "comments": {
            "amount": "6",
            "1": "Ever since the Broncos debacled the Raiders on Monday Night Football on Kickoff Weekend, Oakland has played extremely well. Sure, they've blown leads in their past two contests, but they were huge underdogs in both games. They have a young offense, led by a first-year starting quarterback who has no quality receivers to throw to, unless you want to count Ronald Curry, who caught his first pass since Week 1 on Sunday. Lane Kiffin deserves to stay with this organization until the end of the 2009 season, as the Raiders have a good shot to be a solid team next year. ",
            "2": "Here's something unusual: Oakland called a 76-yard field goal attempt at the end of the first half rather than going for a Hail Mary. Sebastian Janikowski wasn't even close. Whoever made that decision should be fired!!!! (Just kidding). ",
            "3": "JaMarcus Russell actually put up solid numbers after three weeks of mediocre statistics. Russell was 22-of-37, 277 yards, one touchdown and a pick. However, Russell's pick and fumble really helped the Chargers get back into the game, though the former wasn't his fault (the ball tipped off of Darren McFadden's hands). ",
            "4": "Oakland couldn't run the ball - Michael Bush led the squad with 48 yards on 14 carries, while Darren McFadden managed just 20 yards on seven rushes - but Bush was able to lead the squad with seven receptions for 80 yards. Tight end Zach Miller had five grabs for 95 yards and a touchdown. Oakland's top statistical wideout, Johnnie Lee Higgins, couldn't really do much (four catches, 35 yards). ",
            "5": "While the Raiders couldn't run the ball, LaDainian Tomlinson continued his ground dominance at Oakland. Tomlinson gained 106 yards and two touchdowns on 20 carries, including a 41-yard score that iced the game (and more importantly, the cover) with a minute remaining in the fourth quarter. ",
            "6": "Despite Tomlinson's solid performance, the Chargers struggled offensively because Philip Rivers was atrocious. Perhaps spending too much time thinking of insults for Raider fans, Rivers was just 14-of-25 for 180 yards, one touchdown, two interceptions and a fumble. His only noteworthy target was Antonio Gates (5 rec, 58 yards, TD). "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Bills",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "If you were to tell me the Bills sacked Trent Green twice and only picked him off once, I would have asked, In just the first quarter, right? I have no idea how Buffalo didn't manage to get more pressure on Green. I don't think anyone will ever know. So, let's just look at the predictable 31-14 score and move on. ",
            "2": "Steven Jackson kept St. Louis in the game until the beginning of the fourth quarter. Jackson rushed for 110 yards and a touchdown on 24 carries. He also had five receptions for 78 yards. Give credit to Buffalo's defense though. After gaining 99 yards on 16 carries in the first half, Jackson managed only 11 yards on eight attempts in the final 30 minutes. That allowed the Bills to overcome an odd 14-6 deficit and establish control of the game. ",
            "3": "It also shocked me that Marshawn Lynch wasn't able to run all over St. Louis' stop unit. Lynch compiled just 57 yards on 19 carries. Meanwhile, Trent Edwards (15-of-25 for 197 yards, 1 TD, 1 INT) was also pretty mediocre. Lee Evans had two grabs for 88 yards and a touchdown. ",
            "4": "One more thing of note: Chris Long registered the second sack of his NFL career. Leonard Little recorded two sacks himself. What happened to Buffalo's pass protection? "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "And I thought the officiating in the Vikings-Titans game was shady. The officials in this contest missed a very obvious face mask on the Redskins that nearly took Pacman Jones' helmet off. This was just minutes after Jason Campbell wasn't whistled for a blatant intentional grounding penalty. I really don't know what to say anymore about the officiating this year. I'd say it's been the worst I've ever seen, but I don't want to be fined by Roger Goodell. ",
            "2": "That said, Campbell needs to be complimented for improving every week and learning Jim Zorn's West Coast offense very quickly. Campbell, who was 20-of-31 for 231 yards and two touchdowns, was a huge thorn in Dallas' side, as he kept moving the chains on third downs, and did a great job evading Dallas' pass rushers. The Cowboys had him dead to rights a couple of times, but he maneuvered his way out of sacks and located his receivers downfield. ",
            "3": "And by receivers, I mean Santana Moss in large part. Moss led all targets with eight receptions and 145 yards. ",
            "4": "As for the Cowboys, three of Tony Romo's receivers - Jason Witten, Patrick Crayton and Terrell Owens - managed seven catches. Witten and Owens found the end zone. Romo himself was 28-of-47, 300 yards, three touchdowns and a pick. That said, Washington's secondary did an outstanding job blanketing Owens and Witten. Those guys are going to put up numbers regardless, but they weren't exactly dominant. ",
            "5": "One player who was far from dominant was Marion Barber. Don't blame him though. Barber carried the ball only eight times (26 yards). This game was never out of reach for the Cowboys. I don't get why he didn't get the ball more often. ",
            "6": "I also don't understand what happened to Felix Jones. No carries. No catches. Did the Cowboys forget about him, or did they just not want to waste their two running backs because they knew the referees would make sure Washington won this game no matter what? Ah crap, I think I'm going to have to write a $15,000 check to Goodell. "
        }
    },
    "numberOfGames": "11"
}