{
    "year": "2008",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "It's the little things. Marvin Lewis told Cris Collinsworth that the little things are preventing his team from succeeding. That was extremely apparent on Thursday night, as the Bengals seemed to do everything in their power to thwart their own chances of pulling the upset as massive underdogs. Here are some examples: 1. The Bengals dropped three routine interceptions. One of the picks allowed the Steelers to convert third-and-long on the next play, which eventually led to a touchdown. 2. Glenn Holt, taking the place of Chad Ocho Cinco, who was deactivated for this game for sleeping during a team meeting, dropped a pair of passes on third down, which would have moved the chains on both instances. 3. Cincinnati, perhaps learning from Andy Reid, failed to convert two third-and-one situations. 4. The Bengals picked up a third-and-five in the fourth quarter, but were penalized for illegal motion. 5. Two Cincinnati players had Ben Roethlisberger wrapped up, but couldn't get him down, allowing the Steeler quarterback to scramble away and convert a third-and-long on Pittsburgh's final drive of the game. ",
            "2": "It looked like the Bengals were going to pull the upset early on. Cincinnati converted three third downs on their second drive, eventually giving them a 7-0 lead on the Steelers, who looked like they were sleepwalking. At that point, Cincinnati was 3-of-4 on third downs. The team converted just one of its final 11 third-down opportunities. The Steelers, meanwhile, began the contest 0-of-3 on third-down conversions. They finished 6-of-14. ",
            "3": "With Ocho Cinco out, the Bengals had no fire power. T.J. Houshmandzadeh led the team with four receptions, but managed only 20 yards. Cedric Benson rushed for 35 yards on 16 carries. ",
            "4": "Cincinnati played the run pretty well, limiting Mewelde Moore and Willie Parker to 93 combined rushing yards on 29 carries. ",
            "5": "Roethlisberger finished the game 17-of-30 for 243 yards and a touchdown. He found Santonio Holmes five times for 84 yards. Hines Ward had a 37-yard reception, but didn't do anything else. Ward dropped two easy catches. ",
            "6": "This contest marked the second time all year Roethlisberger hasn't been sacked. The first instance occurred against these same Bengals. Cincinnati has 11 sacks all season. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "12"
        },
        "comments": {
            "amount": "5",
            "1": "To say that the Vikings got off to a quick start in this game wouldn't even begin to describe what happened in the first minute of this contest. Minnesota recovered a botched snap and returned it for a touchdown. On the ensuing kickoff, Brian Witherspoon (who's not in NFL.com's player database, by the way) fumbled. The Vikings scored 90 seconds later. Minnesota had just three offensive plays and were up 14-0! ",
            "2": "Minnesota's quick start skewed the numbers in this game. For instance, Adrian Peterson had just six carries by halftime. That was surprising, as a great coach like Brad Clueless always makes sure he gets the ball into the hands of his best players! Peterson finished with 80 rushing yards and a touchdown on 17 carries. Unfortunately for Peterson's fantasy owners, Chester Taylor vultured a score away. ",
            "3": "Gus Frerotte made only one mistake, which wasn't enough to cost the Vikings the game. Frerotte went 12-of-20 for 120 yards. His pick came when Minnesota was up 17-10. I have no idea why, but Frerotte just loves tossing careless picks when his team has the lead. ",
            "4": "Speaking of interceptions, Garrard had two of them. He compiled 317 yards and a touchdown, but his mistakes were too much for the Jaguars to overcome. ",
            "5": "Maurice Jones-Drew couldn't get anything on the ground - three carries, four yards - but he caught nine balls for 113 yards. Matt Jones led all wideouts with four receptions for 37 yards. Marcedes Lewis also caught four passes. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bills",
            "Points": "54"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "Fifty-four points? Where did this come from? Trent Edwards supposedly had no confidence anymore. Marshawn Lynch had a single 100-yard rushing performance all year. Lee Evans had no catches last week. The offensive line couldn't block. Yet, the Chiefs surrendered 54 points? Nice job with all of those draft picks you accumulated by trading Jared Allen! It's too bad the NFL isn't like college football in terms of being able to schedule your non-divisional foes; otherwise, I'd recommend every non-AFC West team to pencil in Kansas City in the middle of the season. They're the ultimate cure for any offensive woes! ",
            "2": "While Buffalo's offense was unstoppable - the Bills punted only twice - Kansas City helped the opposition score as well. Tyler Thigpen, who had been playing brilliantly until Sunday, threw two picks and fumbled once. Still, Thigpen was able to lead the Chiefs to 24 points (the final seven came from Quinn Gray). Thigpen was 17-of-31 for 240 yards and three touchdowns. Thigpen located Tony Gonzalez a whopping 10 times for 113 yards and a score. Dwayne Bowe managed three grabs for 58 yards and a touchdown. Mark Bradley chipped in with 52 yards and a score. ",
            "3": "Larry Johnson rushed for 81 yards on just seven carries. Sounds insane, but 63 of those yards came on one attempt. ",
            "4": "As indicated earlier, Edwards' struggles were cured against Kansas City's pathetic defense. Edwards finished 24-of-32 for 273 yards and two touchdowns. ",
            "5": "Lee Evans and Josh Reed caught five passes each. Evans had 110 yards, while Reed had 50 yards and a touchdown. ",
            "6": "Marshawn Lynch, who also managed five receptions, gained 114 total yards and found the end zone once. ",
            "7": "The 54 points Kansas City allowed represents the largest point total ever scored against this once-proud franchise. That's what happens when you commit five turnovers and fail to obtain one yourself. That's also what happens when your defense is still stuck on six total sacks on the year! "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "28"
        },
        "comments": {
            "amount": "8",
            "1": "I guess I didn't catch the memo that said that Matt Cassel is the best quarterback of all time. For the second consecutive week, Cassel threw for 400-plus yards, becoming the first quarterback to notch that figure in back-to-back weeks since Billy Volek in 2004. He was 30-of-43 for 415 yards, three touchdowns and a pick. He also ran in for an additional score. Then again, maybe Miami's defense just sucks. You can only get so far with scrub corners like Will Allen and Andre Goodman, and terrible safety play. Miami needs to go defensive backs early and often in the 2009 NFL Draft. ",
            "2": "Cassel located Randy Moss and Wes Welker eight times each; Moss had 125 yards, while Welker totaled 120. Moss had all three of Cassel's touchdowns. ",
            "3": "Kevin Faulk was the only New England running back who managed to do anything. He rushed for 53 yards, caught six balls for 52 additional yards and scored once. ",
            "4": "The story going into this game, however, was how well New England could contain Miami's patented Wildcat offense. The Dolphins ran out of that formation eight times. New England held Miami to just 25 yards on those plays. ",
            "5": "As you may expect by that figure, Ronnie Brown and Ricky Williams didn't manage much on the ground. They gained 37 and 21 rushing yards, respectively. ",
            "6": "Miami was able to move the chains, however, aerially with Chad Pennington. Pennington torched New England's archaic back eight, going 24-of-41 for 341 yards, three touchdowns and a pick. ",
            "7": "Greg Camarillo led the Dolphins with six receptions for 75 yards and a touchdown. He left the game with a knee injury, but should be OK. Ted Ginn paced the wideouts in yardage, gaining 88 yards on five catches. ",
            "8": "One funny note: Tony Sparano tried to benched Joey Porter after he committed a personal foul. Porter refused to come off the field, yelling at his replacement to get back on to the sidelines. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "Just writing this score infuriates me. I had the Lions giving eight as my November NFL Pick of the Month. I was confident the offensively and road-challenged Buccaneers, who were expected to look ahead to three consecutive divisional contests, would overlook winless Detroit. Rod Marinelli, meanwhie, used to coach the Buccaneers, so I thought he could devise a perfect game plan against his former squad. After a surprising 17-0 lead by the Lions, I was confident my selection would cash. After all, the Buccaneers, who had trouble in the red zone going into this contest, would need to score 26 points to cover. No chance! Well, let's fast forward three hours and look at an exchange I had with forum member Phil Elliott: Phil Elliott: Haven't heard from Walter since the final in the Lions game. Somebody check to see if he's hanging in the garage. Me: The rope broke. Some hot chick with electrical powers came in and saved me. How do you fail to cover as an 8-point underdog despite leading 17-0!? It takes a completely inept franchise with no postseason success in 50 years. It's almost as if the Lions have an owner who doesn't care about winning. It's like Detroit has an idiot coach who wants to play a crappy, has-been,journeyman quarterback with chronic fumbling and turnover problems over a second-round player who has never been given a chance. ",
            "2": "So, how did the Bucs mount their epic comeback? While Tampa Bay's offense played well, the surge was sparked by a punt returned by a touchdown and a pick-six thrown by Daunte Culpepper. ",
            "3": "Culpepper finished 8-of-20 for 121 yards, one touchdown, two picks and a fumble. Culpepper should consider himself fortunate; if it weren't for the moronic Lions, he wouldn't even be in the NFL right now. Instead, he's stealing money from a nonchalant fossil who should be thrown in jail for running this franchise into the ground. ",
            "4": "Stanton played briefly, going 2-of-6 for 13 yards. He left the game early with a concussion. Hopefully for the sake of Lions fans, Stanton is healthy and gets a chance so the team knows whether or not to draft a bust quarterback come April. ",
            "5": "Poor Calvin Johnson, who deserves much better, caught three passes for 66 yards and a touchdown. Kevin Smith rushed for 86 yards on 16 carries. ",
            "6": "Jeff Garcia, meanwhile, misfired on only five pass attempts, throwing for 165 yards and two scores. Antonio Bryant led all wideouts with four catches for 48 yards. ",
            "7": "Warrick Dunn completely debacled Detroit's pathetic defense, running for 90 yards and a touchdown on only 14 carries. Dunn also had 37 receiving yards. ",
            "8": "The Good News: Cadillac Williams played. The Bad News: He gained just 27 rushing yards on 16 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "I know some people thought the Jets would win, but 34-13!? How does that happen? It all started with the struggles of everyone's so-called MVP candidate. Kerry Collins began the game 4-of-14 for 24 yards. He eventually finished with 243 yards and a touchdown, but most of that production was in garbage time. Collins played as if he were a college drunk who shows up to frat parties and chugs endless cans of beer. But those days are long behind him, right? I'm not so sure anymore. ",
            "2": "In hindsight, Collins' struggles should have been predictable. Unlike the Jaguars last week, the Jets had the personnel to contain the run without committing eight men in the box. Chris Johnson was consequently restricted to 46 yards. He also lost a fumble. LenDale White had just one carry, which gave him a lot of time to eat one of his many pre-Thanksgiving Day feasts on the sideline. ",
            "3": "You can't blame everything on Collins, however. Tennessee's so-called top-ranked defense couldn't get off the field, allowing the Jets to win the time-of-possession battle, 40:30 to 19:30. New York was 7-of-13 on third down. ",
            "4": "I thought Brett Favre would be responsible for a few turnovers, and I was right. It's just that the Titans couldn't capitalize off of them. Favre had a pick and a fumble, but managed to go 25-of-32 for 224 yards and two touchdowns. ",
            "5": "Favre went to Laveranues Coles seven times for 88 yards and a score. Jerricho Cotchery and Dustin Keller had six grabs each, registering 55 and 42 yards, respectively. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "Because I lost my NFL Pick of the Month, I want to feel better about myself, so I'd like to point out that I called the exact score of this game on my NFL Picks page. Go me! ",
            "2": "Oh, and go Bears. They dominated the Rams with ease. It wasn't even close in any aspect of the game. Matt Forte ran all over St. Louis, gaining 132 rushing yards and two touchdowns on just 20 carries. ",
            "3": "With Forte running strong, Kyle Orton (139 yards and a touchdown) didn't really need to do anything. Devin Hester and Desmond Clark led everyone with five receptions, gaining 57 and 40 yards, respectively. ",
            "4": "If you combine the rushing totals of Antonio Pittman and Kenneth Darby, and multiply that figure by seven, you'd still come up short of Forte's total. The two pedestrian backs combined for 18 yards on 16 carries. ",
            "5": "But at least they didn't throw four interceptions! That was Trent Green's job. Marc Bulger left the game after taking a shot to the head. Shocked? Thought not. ",
            "6": "I questioned the Green signing this offseason. Green hasn't been an NFL-caliber quarterback for three years. Only the inept Rams were interested in him. St. Louis needs to go with Brock Berlin, who at least has some physical talent. Green is basically a vegetable at this point. ",
            "7": "Perhaps the sequence that epitomized this game for St. Louis was when the team, down 14-0, finally get into Bears territory because of a good kickoff return. However, Green was sacked, putting Josh Brown into a longer attempt. He missed the 40-yarder. ",
            "8": "In the wake of this loss, the Rams have now been outscored 99-10 in the first half the last three weeks. '); "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Jets",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "I know some people thought the Jets would win, but 34-13!? How does that happen? It all started with the struggles of everyone's so-called MVP candidate. Kerry Collins began the game 4-of-14 for 24 yards. He eventually finished with 243 yards and a touchdown, but most of that production was in garbage time. Collins played as if he were a college drunk who shows up to frat parties and chugs endless cans of beer. But those days are long behind him, right? I'm not so sure anymore. ",
            "2": "In hindsight, Collins' struggles should have been predictable. Unlike the Jaguars last week, the Jets had the personnel to contain the run without committing eight men in the box. Chris Johnson was consequently restricted to 46 yards. He also lost a fumble. LenDale White had just one carry, which gave him a lot of time to eat one of his many pre-Thanksgiving Day feasts on the sideline. ",
            "3": "You can't blame everything on Collins, however. Tennessee's so-called top-ranked defense couldn't get off the field, allowing the Jets to win the time-of-possession battle, 40:30 to 19:30. New York was 7-of-13 on third down. ",
            "4": "I thought Brett Favre would be responsible for a few turnovers, and I was right. It's just that the Titans couldn't capitalize off of them. Favre had a pick and a fumble, but managed to go 25-of-32 for 224 yards and two touchdowns. ",
            "5": "Favre went to Laveranues Coles seven times for 88 yards and a score. Jerricho Cotchery and Dustin Keller had six grabs each, registering 55 and 42 yards, respectively. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "Because I lost my NFL Pick of the Month, I want to feel better about myself, so I'd like to point out that I called the exact score of this game on my NFL Picks page. Go me! ",
            "2": "Oh, and go Bears. They dominated the Rams with ease. It wasn't even close in any aspect of the game. Matt Forte ran all over St. Louis, gaining 132 rushing yards and two touchdowns on just 20 carries. ",
            "3": "With Forte running strong, Kyle Orton (139 yards and a touchdown) didn't really need to do anything. Devin Hester and Desmond Clark led everyone with five receptions, gaining 57 and 40 yards, respectively. ",
            "4": "If you combine the rushing totals of Antonio Pittman and Kenneth Darby, and multiply that figure by seven, you'd still come up short of Forte's total. The two pedestrian backs combined for 18 yards on 16 carries. ",
            "5": "But at least they didn't throw four interceptions! That was Trent Green's job. Marc Bulger left the game after taking a shot to the head. Shocked? Thought not. ",
            "6": "I questioned the Green signing this offseason. Green hasn't been an NFL-caliber quarterback for three years. Only the inept Rams were interested in him. St. Louis needs to go with Brock Berlin, who at least has some physical talent. Green is basically a vegetable at this point. ",
            "7": "Perhaps the sequence that epitomized this game for St. Louis was when the team, down 14-0, finally get into Bears territory because of a good kickoff return. However, Green was sacked, putting Josh Brown into a longer attempt. He missed the 40-yarder. ",
            "8": "In the wake of this loss, the Rams have now been outscored 99-10 in the first half the last three weeks. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "In case you missed it, it appears as though the Donovan McNabb era has come to an end in Philadelphia. After watching him carelessly toss three interceptions at Cincinnati last week, I wrote that McNabb played like a crack addict. If that's true, McNabb continued to snort Chunky Soup, going 8-of-18 for 59 yards and two picks. McNabb, who lost a fumble for the second week in a row, was benched in favor of Kevin Kolb, despite the fact that the Eagles were losing by just three points at the time. Personally, I didn't have a problem with the benching in general. What I did have a problem with is that Reid didn't have the guts to approach McNabb and tell him that he was going with Kolb. McNabb had to find out from one of the assistants as he was preparing to warm up. ",
            "2": "Unfortunately, Kolb played like... well... a rookie quarterback going against a tough defense. Kolb was 10-of-23 for 73 yards and two interceptions, one of which was an Ed Reed pick-six. Don't get down on Kolb just yet. He had no reps during practice, so he wasn't prepared to battle a stout Baltimore defense. We'll get a better idea of Kolb's career prospects based on next week's performance, though Kolb will never have a real chance as long as Reid is calling nonsensical plays for him. The aforementioned Reed pick-six was a 108-yard return - the longest interception touchdown in NFL history. That play came on second-and-goal at the one-inch line. So, instead of trying to sneak it in, Reid asked his rookie signal caller to drop back seven yards in the pocket. The Eagles have been inept in short-yardage situations, but this is a completely different story. Earlier in the game, the Eagles launched a pair of Hail Marys instead of trying to run the ball or sneak to move the chains. On the first drive, the Eagles had a delay of game in the no-huddle. I repeat: They had a delay of game in the no-huddle! How does that happen!? Reid's grandchildren will live in shame in the wake of his play-calling in this game. ",
            "3": "The other young quarterback in this game, Joe Flacco, struggled early, but eventually picked things up in the second half. Flacco was 12-of-26 for 183 yards and a pair of scores. Derrick Mason led all Baltimore wideouts with three catches for 40 yards. Mark Clayton had two receptions and a 53-yard touchdown. ",
            "4": "The winner of this week's running back lottery was LeRon McClain, who rushed for 88 yards and a touchdown on 18 carries. Ray Rice managed just seven yards on the ground, but had three catches for 42 yards. Willis McGahee did nothing, collecting a meager eight yards on seven attempts. ",
            "5": "Andy Reid declared that Correll Buckhalter would get more of the workload in this contest. Buckhalter touched the ball only twice and gained 16 rushing yards, but left the game with a sprained knee ligament. Brian Westbrook had 14 carries for 39 yards. He also had two catches, but lost five yards. ",
            "6": "DeSean Jackson led the Eagles with five receptions and 47 yards. Kevin Curtis caught two balls. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Texans",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "If you were to tell me that one of the two quarterbacks in this game would fail to complete 50 percent of his passes, maintain a meager YPA around five, and toss two interceptions to no touchdowns, I would have bet the farm on Sage Rosenfels (also known as Sage Rosenchoker on this site). Instead, Brady Quinn was the culprit. Quinn completed just 8-of-18 attempts for 94 yards and the two picks. He was benched in favor of Derek Anderson, who went 5-of-14 for 51 yards, one interception and a fumble. Way to kill your young quarterback's confidence, Romeo. I saw no purpose in going back to Anderson. It's not like the Browns had a shot at the postseason. They're building for the future. They should have allowed Quinn to engineer an attempted comeback. It's not like this was a blowout. It was just 16-6! ",
            "2": "At any rate, the only skill-position player to do anything of significance on the Browns was Braylon Edwards, who caught five balls for 85 yards. That said, Edwards dropped a whopping five passes! Kellen Winslow Jr. had one grab for 11 yards. ",
            "3": "The sloth-like Jamal Lewis managed 58 rushing yards against Houston's beleaguered defense. To be fair, he ran the ball just 10 times. However, Lewis has struggled mightily almost every week this year. I see no reason why he should have more carries than Jerome Harrison (7) at this point of the season. ",
            "4": "As for Rosenchoker, the Texans signal caller was 24-of-32 for 275 yards and a touchdown, but it should be noted that he played far from mistake-free football; Rosenchoker launched a pair of picks and lost a fumble. ",
            "5": "Andre Johnson was beast-like once again. Arguably the top receiver in the league, Johnson caught 10 passes for 116 yards. Kevin Walter, meanwhile, notched seven receptions, 93 yards and a touchdown. Rosenchoker continued to ignore Owen Daniels, who had just three grabs for 28 yards. ",
            "6": "I was expecting a big game out of Steve Slaton. He didn't play terribly - he rushed for 73 yards on 21 carries - but I thought he'd have much more than just seven fantasy points against Cleveland's woeful defense. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "35"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "22"
        },
        "comments": {
            "amount": "6",
            "1": "Though the 49ers lost by 13, they looked like they would be able to pull the upset as a double-digit underdog early on, as they led 6-0 in the first quarter. At the time, I jotted down the following, Scoring field goals; not touchdowns, will kill the 49ers. Indeed it did. San Francisco drove down to Dallas' 5- and 4-yard lines on separate first-quarter possessions, and had to settle for chip-shot field goals. The 49ers also missed a 53-yard kick on their opening drive. ",
            "2": "Without a huge deficit to overcome, Tony Romo didn't have to force anything. Romo consequently finished 23-of-39 for 341 yards and three touchdowns. ",
            "3": "Terrell Owens was the headliner, however, as the manic depressant receiver caught seven passes for 213 yards and a score. ",
            "4": "Marion Barber managed just 59 yards on the ground, but he also caught seven balls for 50 receiving yards. Roy Williams, meanwhile, grabbed three balls for 36 yards. ",
            "5": "With Frank Gore completely ineffective - he gained only 26 yards on 14 carries - it was all Shaun Hill for the 49ers. Hill recorded the first 300-yard outing of his career, going 21-of-33 for 303 yards, two touchdowns and a pick. ",
            "6": "Hill went to Isaac Bruce eight times for 125 yards and a touchdown. Bryant Johnson had four receptions for 56 yards. Vernon Davis caught only one pass. Josh Morgan was out with a groin injury. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "Congratulations to the Raiders! No, I'm not talking about their shocking blowout victory over their arch rival; thanks to Johnnie Lee Higgins' kick return for a touchdown in the second quarter, they were able to score their first first-half touchdown since Week 4! And thanks to the first of Darren McFadden's touchdowns, Oakland's offense found the end zone for the first time all month! ",
            "2": "I liked the fact that the Raiders covered this game, but I'm pissed because I called for Justin Fargas to have a big game. Fargas ran for 107 yards, but McFadden vultured two touchdowns away. McFadden had 38 yards on 10 rushes. ",
            "3": "Though JaMarcus Russell had just 152 yards, he played exceptionally well, completing 10-of-11 attempts and throwing a touchdown. ",
            "4": "Ashley Lelie was Russell's leading receiver, catching four balls for 92 yards and a score. Zach Miller had three grabs for 41 yards. ",
            "5": "What was up with Jay Cutler today? Cutler was horrendous, going 16-of-37 for 204 yards and a pick. He also lost a fumble. I hate to say it because it's unfortunate, but we'll never know how much his diabetes is affecting him. I wouldn't be shocked in the slightest if that hindered his performance in this contest. ",
            "6": "Despite Cutler's struggles, Brandon Marshall still managed four receptions for 84 yards. Eddie Royal caught just two passes. ",
            "7": "Peyton Hillis, dubbed by many as the next Mike Alstott, rushed for 74 yards and a touchdown on 17 carries. Hillis is worth starting in lucrative matchups, though he should be on your bench next week, as the Broncos battle the Jets. ",
            "8": "Despite Higgins' kick return, the play of the game belongs to Tom Cable. In the middle of the contest, Cutler fired a ball out of bounds that looked like it was homing in on Cable's family jewels. At the last second, Cable was able to karate kick the ball out of the way, sparing himself some excruciating pain. ",
            "9": "Oh, and I almost forgot... Congratulations to the Raiders for being the first team to score four points in a very long time. Here's proof: "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "I hate to harp on this, but the Panthers have played like absolute garbage since coming off their bye. Jake Delhomme was awful in the two contests going into this matchup. At Atlanta, the defense was to blame. ",
            "2": "Matt Ryan led the Falcons on multiple scoring drives, helping the team convert 5-of-14 third-down situations. Ryan finished 17-of-27 for 259 yards. ",
            "3": "Ryan didn't throw any touchdowns; those belonged to Michael Turner, who found the end zone four times. Turner rushed for 117 yards. ",
            "4": "While Roddy White accumulated 70 receiving yards, the star in Atlanta's receiving corps was Harry Douglas. Douglas caught four balls for 92 yards and also scored a rushing touchdown. He had a punt return for a score as well. ",
            "5": "Delhomme played well compared to his efforts against the Raiders and Lions, going 21-of-35 for 295 yards and a touchdown. Steve Smith managed eight receptions for 168 yards. ",
            "6": "As predicted, DeAngelo Williams trampled Atlanta's 26th-ranked rush defense, tallying 101 yards and a score on just 19 carries. Jonathan Stewart touched the ball only five times (15 yards). "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Giants",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "29"
        },
        "comments": {
            "amount": "7",
            "1": "As this score indicates, neither defense had much luck stopping the opposing offense. The Giants converted 8-of-16 third or fourth downs, while the Cardinals were 8-of-14 in similar situations. Arizona moved the chains on consecutive third-and-nines on their opening drive, but eventually had to settle for a field goal. ",
            "2": "The difference were Arizona's two turnovers. Kurt Warner was responsible for both of them (interception, fumble). ",
            "3": "Warner had a great game otherwise, finishing 32-of-52 for 351 yards and a score. Tim Hightower had the team's other two touchdowns, though he managed only 21 rushing yards on 11 carries. ",
            "4": "Warner went to Anquan Boldin 11 times for 87 yards and a touchdown. Larry Fitzgerald had five grabs for 71 yards, while Steve Breaston collected six receptions for 86 yards. ",
            "5": "New York's victory over the Cardinals is pretty remarkable. First of all, Arizona had been undefeated at home going into this contest. Second, the Giants didn't have the services of Brandon Jacobs or Plaxico Burress (Burress lasted only one series). ",
            "6": "Without Jacobs to rely on, Manning took matters into his own hands, going 26-of-33 for 240 yards and three touchdowns. Manning spread the ball around to Domenik Hixon (6 catches, 57 yards), Kevin Boss (4 catches, 48 yards, TD), Steve Smith (4 catches, 45 yards), Amani Toomer (4 catches, 30 yards, TD) and Derrick Ward (4 catches, 30 yards). Ward also had 69 rushing yards and a score on 20 carries. Surprisingly, Ahmad Bradshaw touched the ball only four times for nine yards. ",
            "7": "Some notable things: 1) Arizona attempted a 68-yard field goal at the end of the half. Credit Ken Whisenhunt for calling an old rule, the fair catch for a free kick. Neil Rackers had the opportunity to try the field goal without any sort of rush. Unfortunately, he hit the ball off the side of his foot. The kick wouldn't have been good from one yard out. 2) Giants corner Aaron Ross was whistled for four penalties. 3) Larry Fitzgerald caught his 400th career pass in this game, becoming the second-fastest player in NFL history to reach that mark (71 games). The fastest? Anquan Boldin, 67 games. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Frustrated the Redskins didn't cover? Yeah, join the club. Washington had a second down deep in Seattle territory with less than two minutes left. Unfortunately, Ladell Betts lost a fumble, negating any sort of field goal that would have covered the three-point spread. ",
            "2": "The shame of it is, Washington dominated this game, save for two Seattle drives. The Redskins won the time-of-possession battle, 38:27 to 21:33. As of a matter of fact, the Seahawks were so brutal early on, that excluding a fluke 44-yard Maurice Morris run, their longest play was a 6-yard gain midway through the second quarter. Matt Hasselbeck began the game 1-of-7 for six yards. ",
            "3": "Hasselbeck finished the contest 12-of-24 for 103 yards, two scores and a pair of picks. Excluding Morris, no one on the team had more than two receptions or 34 receiving yards. ",
            "4": "For whatever reason, Washington couldn't contain Morris, who ran for 103 yards on 14 carries. He also caught three balls for 10 yards and a touchdown. ",
            "5": "Speaking of the inability to stop the rush, Clinton Portis gained 143 yards on 29 attempts. Unfortunately, he was banged up on the team's final drive, which allowed the aptly named Betts to fumble the cover away. Betts unjustly vultured a touchdown earlier in the contest. ",
            "6": "Capitalizing off Portis' running ability, Jason Campbell finished 20-of-33 for 206 yards and a score. Campbell found Santana Moss four times for 72 yards. Chris Cooley registered five receptions for 54 yards. ",
            "7": "For thoughts on San Diego-Indianapolis and New Orleans-Green Bay, check out my "
        }
    },
    "numberOfGames": "16"
}