{
    "year": "2008",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "10",
            "1": "Rest in peace, 2008 Saints. With a seventh loss, they're officially done. They still had a pulse at 7-6, but 7-7 has spelled the end for the preseason NFC South favorites. ",
            "2": "Sean Payton said the following before the game: We can't go three-and-out. We can't give the Bears a short field. Oops. Chicago started off with a kickoff return for a touchdown. On the ensuing drive, Drew Brees tossed an interception. The Saints then went three-and-out on their second possession. ",
            "3": "Despite Payton's debacled game plan and a 21-7 deficit at halftime, the Saints were able to stay in this contest because of Chicago's anemic offense. Save for Devin Hester and Greg Olsen, the Bears receivers couldn't catch anything. In fact, Rashied Davis dropped a pass that deflected into the arms of a Saints defensive back. Orton was also horrific, going 24-of-40 for 172 yards, including a telegraphed pass to New Orleans linebacker Scott Fujita. Worst of all, the Bears couldn't get the running game going. It didn't even look like they wanted to. I know Matt Forte left the game in the first quarter with a toe injury, which must have scared all of his fantasy owners half to death, but he came back in the beginning of the second quarter. At the end of regulation, Forte (34 rushing yards, TD) and Peterson (15 yards) combined for only 13 carries, while Orton threw 39 times! It's almost as if offensive coordinator Ron Turner forgot the running portion of the playbook at home. ",
            "4": "I mentioned Hester and Olsen; they had four catches for 46 yards and eight grabs for 45 yards, respectively. Hester also drew 77 yards in penalty yardage. It should be noted that Forte had five receptions for 29 receiving yards in addition to his rushing yardage. ",
            "5": "As for the Saints offense, Drew Brees' road woes continued. He was 24-of-43 for 232 yards, two touchdowns and a pair of picks. As a visitor this season, Brees has 12 interceptions to just nine scores. That's a stark contrast compared to his home figures (19 TDs, 4 INTs). ",
            "6": "To move the chains against Chicago, New Orleans utilized Pierre Thomas constantly, which is something they should have done at the beginning of the season. The Frenchman rushed for 87 yards, caught seven balls for 59 more yards and scored twice. ",
            "7": "Reggie Bush, meanwhile, frustrated his owners by compiling just 48 total yards. Lance Moore also disappointed with five grabs for 28 yards. ",
            "8": "It was all Marques Colston downfield for New Orleans; Colston had six receptions for 84 yards and a touchdown. ",
            "9": "I like Mike Carey as an official. OK, liked. He made a horrific call of Ed Hocchulian proportions on a Chicago fake punt in the fourth quarter. Brad Maynard hooked up on a long pass to Adrian Peterson. Peterson caught the ball. After bobbling it initially, he established complete control. His knee, elbow and back were on the ground when the ball was knocked out by a Saints defender. It was ruled incomplete and challenged by Chicago. Carey reviewed it and inexplicably let the call stand. Even the Saints radio announcers said Carey made a mistake. The only reasonable explanation for this is that Carey had action on the Saints +3. It was an injustice that play was rule incomplete. At the end of regulation, Carey's crew missed an extremely obvious pass interference on Jason David. David put both arms around Olsen's stomach, smacked him in the head and then tackled him - all before the ball got to the tight end! This is further evidence that the officiating crew wanted the Saints to cover. I know, sounds absurd, but in the wake of the Tim Donaghy scandal, you would naive to think this wasn't possible. ",
            "10": "<b> Dan Marino Record Watch: </b> Drew Brees now has 4,323 passing yards on the season. He's on pace for 4,941 yards. Dan Marino had 5,084 yards in 1984. Brees still has a shot because his last two remaining games will be played indoors against two shaky pass defenses (Lions, Panthers). However, he needs to average 381 yards per contest to eclipse Boomer Esiason's sworn enemy. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jets",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "If the Jets make the playoffs, they should buy J.P. Zohan something nice like a new car or a hair salon. Zohan saved New York's season with a fumble in the final two minutes, which was returned for a touchdown. One has to question why the Bills were throwing in the first place. It was a second-and-five, and they were up 27-24 with two minutes remaining. They were grinding it out on the ground extremely well, so they probably could have run out the clock by keeping the ball in the hands of Marshawn Lynch and Fred Jackson. In total, Zohan had four turnovers (three picks, three fumbles). Otherwise, Zohan was 24-of-39 for 148 yards and a touchdown. He remains one of the worst anti-terrorist/quarterback hybrids in the NFL. ",
            "2": "As mentioned, Lynch and Jackson ran well. Lynch totaled 127 yards on 21 carries. Jackson rushed for 31 yards and caught six balls for 24 more yards. He scored once on a very tough run in which he carried half a dozen defenders into the end zone. ",
            "3": "Nothing from Lee Evans, which I would attribute to Zohan's futility. Don't send Evans (4 catches, 22 yards) any hate mail this week if you own him in fantasy. ",
            "4": "Zohan wasn't the only turnover-prone signal-caller in this contest. Brett Favre tossed two picks, weighing down his other numbers (17-of-30 for 207 yards and a score). ",
            "5": "Favre found Laveranues Coles five times for 82 yards. His lone touchdown went to Jerricho Cotchery (4 catches, 34 yards). Dustin Keller grabbed three balls for 35 yards. ",
            "6": "Thomas Jones ran the ball just 20 times. Seriously, what is it with these teams and not running it enough? Jones tallied 78 yards and a touchdown. ",
            "7": "The following two notes are from Wraith: <i> - I would like to say that if I ever have to see a Bills two-minute drill ever again, I am going to vomit. The Bills, with 55 seconds remaining in the first half, were trying to drive as they were down 21-17, by throwing 4-6 yard patterns. It was the most conservative play-calling ever. - I must say I was confused about one thing. How was Adam Sandler watching the game from the stands AND playing quarterback for the Bills? Did he clone himself, or is he able to do two things at once? </i> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "I guess it's tougher to score when you don't have Frank Gore in your backfield, huh? With Gore out, the 49ers struggled mightily in the red zone. San Francisco reached the Miami 28 five times in this game, but came away with just nine points. Of course, Miami's defense had something to do with it. Amazingly, the Dolphins haven't allowed a touchdown the last three weeks. They kept the Rams and Bills out of the end zone in the previous two contests. ",
            "2": "Without Gore, the 49ers had to stick to the aerial attack. Shaun Hill was an economical 30-of-46 for 233 yards. More importantly, he refrained from turning the ball over and converted third downs (8-of-17). For that reason, San Francisco won the time-of-possession battle, 38:13 to 21:47. ",
            "3": "Gore's replacement, DeShaun Foster, rushed for 76 yards on 18 carries. He also had five catches for 25 more yards. That's not bad, but Foster obviously isn't even close to as talented as Gore. The team's red zone woes would indicate that. ",
            "4": "The Dolphins didn't have the ball all that much, so their numbers were pretty limited. For instance, Chad Pennington was 12-of-19 for 156 yards, though he threw two touchdowns. Davone Bess was Pennington's most-utilized receiver, and he had only three catches for 25 yards. ",
            "5": "Ronnie Brown and Ricky Williams pretty much split carries, for some reason. Brown gained 67 yards on just 10 rushes. Williams had 23 yards on seven attempts. ",
            "6": "The game ended when Joey Porter sacked Shaun Hill on a fourth-and-10 on Miami's 21 with about a minute left in regulation. The sack pushed Porter's yearly total to 17.5. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "For the second time this season, San Diego's playoff hopes nearly went down the drain against the Chiefs in the final few seconds. The Chargers had to mount a monstrous comeback in the fourth quarter; at one point, Kansas City led 21-3. ",
            "2": "It's really amazing the Chiefs blew this game. They completely dominated both sides of the ball until the fourth quarter. In fact, forum member Coop27 asked if LaDainian Tomlinson suffered an injury because he wasn't putting up any fantasy points for him. Any Tomlinson owner was probably wondering the same thing. Tomlinson was fine; the Chiefs simply were controlling the clock on offense and stacking the line of scrimmage on defense. Of the first 25 minutes of the game, Kansas City held the ball for about 18. ",
            "3": "Kansas City was able to convert 6-of-12 third downs, thanks to Tyler Thigpen, who continued to play well. Thigpen was 19-of-28 for 171 yards, one touchdown and a pick. Thigpen also had 40 rushing yards and a score on the ground. The Chiefs would look foolish if they drafted a quarterback in April and ignored their other numerous needs. ",
            "4": "Thigpen found Tony Gonzalez and Dwayne Bowe six times each. Gonzalez had 62 yards, while Bowe managed 44. Both reached the end zone. ",
            "5": "Larry Johnson rushed for just 55 yards on 17 carries, but he actually saved his fantasy owners with a 4-yard touchdown pass on a trick play to Gonzalez. ",
            "6": "As for Tomlinson, he continued to disappoint for the most part, save for a rushing touchdown. Tomlinson totaled 74 yards (39 rushing, 35 receiving). ",
            "7": "Philip Rivers deserves major credit for leading San Diego to an inexplicable come-from-behind victory. Rivers had two fumbles and a pick early on, but finished 34-of-48 for 346 yards and two touchdowns, both of which came in the final 80 seconds of the game. ",
            "8": "Vincent Jackson paced the Chargers with 89 yards and a touchdown. Antonio Gates, meanwhile, caught seven balls for 78 yards. Chris Chambers didn't do much. ",
            "9": "Believe it or not, San Diego has a great shot at the postseason. Along with winning out, all they need is a Denver loss to Buffalo. The Bills nearly knocked off the Jets today, while the Broncos have proven that they're capable of losing to anyone this year. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "When the Packers scored a go-ahead field goal with five minutes left, giving them a 16-14 lead, I figured it pretty much made sense that a crappy game between two crappy, disappointing teams finished with a push. Well, I spoke too soon. The Jaguars managed a final, 80-yard drive to win this meaningless, depressing contest. ",
            "2": "The Packers, now officially eliminated from the Doggone Playoff, epitomized their season when they allowed a struggling David Garrard to complete a 30-yard touchdown to crappy Dennis Northcutt on a third-and-19 in the first quarter. Despite all of the Aaron Rodgers-Brett Favre talk before this year began, it's been Green Bay's defense that has debacled the team's postseason hopes. ",
            "3": "Garrard somehow went 21-of-33 for 238 yards and two touchdowns, despite not having Matt Coke Zero Jones at his disposal. An interesting note is that Garrard is now 8-of-8 when running on third-and-one this season. ",
            "4": "Northcutt somehow caught five passes for 127 yards and a score. I guess that's what happens when you put two crappy teams together. ",
            "5": "Maurice Jones-Drew pleased fantasy owners with two touchdowns, but didn't do much otherwise (48 rushing yards, 22 receiving yards). ",
            "6": "Meanwhile, Rodgers once again put together a solid performance, going 20-of-32 for 278 yards, one touchdown and a pick. The interception came late when he was trying to mount a desperate, last-second score. ",
            "7": "While Greg Jennings had a touchdown (but only 22 yards) and Donald Driver caught five passes for 65 yards, Green Bay's leading receiver was James Jones, who notched four receptions for 132 yards. Ryan Grant, meanwhile, compiled 56 yards on 21 carries. ",
            "8": "Let's make fun of NFL.com's GameCenter. Did you know that Aaron Rodgers threw a pass for minus-40 yards in this contest? It's true! He must have been drunk and tossed the ball the wrong way, or something. That said, it was a good thing the officials decided to review it! Don't believe me? Here's proof (thanks Holder): "
        }
    }
}