{
    "year": "2008",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "Bravo, Mike Tomlin. Unlike the Buccaneers, Colts and Jaguars last year, the Steelers won't be flat in the postseason. All the starters played the majority of the contest. Steelers fans had a collective heart attack when Ben Roethlisberger was carried off the field in a stretcher, but it turns out that he merely had a mild concussion. ",
            "2": "Meanwhile, Pittsburgh's defensive starters wreaked havoc upon Cleveland's offense. The Browns actually haven't even scored an offensive touchdown in 24 quarters, which is an NFL record. The last time they got into the end zone, save for a pick-six against the Eagles, was the Monday night game against the Bills in November. ",
            "3": "Bruce Gradkowski, starting for Ken Dorsey, who was out with a bad case of ineptness, was 5-of-16 for 18 yards and two picks. No Browns receiver caught more than a single pass. Braylon Edwards had just five receiving yards. ",
            "4": "Believe it or not, Jamal Lewis had his best rushing performance of the season, gaining 94 yards on 23 attempts. ",
            "5": "Willie Parker predictably out-classed Lewis, garnering 116 yards and a touchdown on 23 carries. ",
            "6": "Roethlisberger was 9-of-14 for 110 yards and a pick before he was carried off the field. In relief, Byron Sandwich was 7-of-12 for 80 yards. ",
            "7": "Hines Ward paced Pittsburgh with six receptions and 70 yards. Heath Miller had five grabs for 55 yards. Santonio Holmes caught three balls for 31 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "If you didn't see any of the pre-game shots of the uprights tilted over at Orchard Park, this contest was played in a gale, with winds gusting up to 55 mph. To give you an idea of how bad it was, check these out: 1. Buffalo's first punt went for a grand total of 13 yards. 2. The first 12 plays of this game were runs. 3. Matt Cassel threw just eight passes (6-of-8, 78 yards). Randy Moss caught one pass, while Wes Welker grabbed a pair of balls for 26 yards. 4. The Patriots ran a quick punt with Cassel. Cassel punted the ball, which landed at the 15. The wind subsequently rolled the ball all the way down to the Buffalo 1-yard line. 5. The following play from NFL.com: <i> 4-4 BUF8 (4:21) Temporary delay to re-align goalposts (shifted in wind). S.Gostkowski 26 yard field goal is No Good, Wide Right. </i> ",
            "2": "New England had less net yardage than the Bills, but dominated on the ground. Cassel, Sammy Morris and LaMont Jordan combined for 168 rushing yards on 47 carries. Jordan scored the game's only touchdown. ",
            "3": "Fred Jackson, getting all of the work because Marshawn Lynch was out, had a great game. He rushed for 136 yards on 27 attempts. ",
            "4": "Having to throw as a result of trailing for 48 minutes, Trent Edwards struggled, going 14-of-25 for 128 yards. Lee Evans had five receptions for 63 yards. ",
            "5": "The Bills screwed up one too many times in this contest. What was Dick Jauron doing when he ordered a 47-yard field goal attempt in this wind? Center Melvin Fowler started a fight as time was ticking down at the end of the first half, negating a kick attempt. And Edwards fumbled the ball at midfield in the third quarter when the score was just 3-0. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "The Bengals may have screwed themselves in terms of draft positioning, but at least they gave themselves hope for 2009 with a strong finish. The team concluded the year with a 4-3-1 record in its final eight games. Not bad for having Ryan Fitzpatrick at quarterback! ",
            "2": "Cincinnati dominated the time-of-possession battle, 37:39 to 22:21, running the ball effectively with Cedric Benson, who managed 111 yards and a touchdown on 25 carries. ",
            "3": "Capitalizing off Benson's running, Ryan Fitzpatrick moved the chains efficiently, going 18-of-30 for 129 yards, despite not having T.J. Houshmandzadeh or Chad Ocho Cinco at receiver. Andre Caldwell led all Bengal wideouts with five receptions and 34 yards. ",
            "4": "Meanwhile, Tyler Thigpen had one of his worst games, though he wasn't terrible. Thigpen was 19-of-36 for 191 yards and a touchdown. He also fumbled once. Considering that the Chiefs barely had the ball, and Larry Johnson was completely ineffective (10 rush, 18 yards), Thigpen's performance couldn't have hurt his chances of keeping the starting gig in 2009. ",
            "5": "Dwayne Bowe had a monstrous performance, snagging 10 balls for 103 yards. Tony Gonzalez (5 catches, 53 yards) had Kansas City's sole touchdown. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "4",
            "1": "Wahh, wahhhh, wahhhhhhh... Look, I'd like to feel sorry for the Lions for becoming the first 0-16 team in NFL history. Rod Marinelli seems like a really nice guy (although some believe his wife has bad taste in men), and the players will never be able to live this down. But I'm very glad that owner William Clay Ford has been embarrassed. Ford doesn't care about the fans one bit. As long as he's running the organization, the Lions will never win. Also, I'm still pretty pissed off Detroit ruined my November NFL Pick of the Month. How do you fail to cover as 9-point underdogs when you have a 17-0 lead!?!?!?!?!?!? ",
            "2": "But at least the Lions played very well on Sunday. No, I'm serious. The last time Detroit were this close against the Packers was on Dec. 17, 2006. However, the stats didn't show it. The Lions surrendered a pair of 100-yard rushers (Ryan Grant: 19-106; DeShawn Wynn: 7-106, TD) and a pair of 100-yard receivers (Donald Driver: 6-111, TD; Greg Jennings: 5-101). Aaron Rodgers, meanwhile, was 21-of-31 for 308 yards and three scores. ",
            "3": "The Lions were able to keep up with the Packers - this game was tied at halftime at 14 - thanks to Calvin Johnson. Megatron registered nine receptions, 102 yards and two scores. ",
            "4": "Kevin Smith ran well against Green Bay's putrid run defense, gaining 92 yards and a touchdown on 28 attempts. In the worst campaign in NFL history, it's nice to know that the Lions at least have some talented, young weapons to build around. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Buccaneer fans can blame Jeff Garcia and Jon Gruden all they want for their late-season collapse, but I'd like to point the finger at Monte Kiffin. Kiffin has been a Hall of Fame-caliber defensive coordinator for years, but ever since he announced that he'll be joining his son at the University of Tennessee, essentially mentally resigning from the team, Tampa Bay's defense has been abysmal. Case in point: Michael Bush bulldozed the Buccaneers for 177 yards and two touchdowns on 27 rushes. JaMarcus Russell, meanwhile, actually played really well for a change, going 14-of-21 for 148 yards, two touchdowns and a pick. Russell played like the great player Al Davis billed him as a few months ago. Eventually, Monte Kiffin, like Lane, will have to get over it. ",
            "2": "Russell went to Johnnie Lee Higgins six times for 52 yards and a score. As for Justin Fargas and Darren McFadden, the two runners left the game with injuries. ",
            "3": "I brought up Garcia earlier; the skittish signal caller was 17-of-33 for 257 yards, one touchdown and a pick. Those numbers aren't that bad, but they don't show that Garcia missed a number of wide-open targets downfield. One of those targets, Antonio Bryant, registered just three receptions for 77 yards, even though Nnamdi Asomugha didn't play. ",
            "4": "Cadillac Williams had an outstanding performance, rushing for 78 yards and catching five balls for 37 more yards. He also scored twice. Unfortunately, Cadillac left the game with a knee injury. ",
            "5": "This was a high-scoring game even though there were no penalty-related first downs by either team until the 1:14 mark of the first quarter. Then again, a 13-point favorite that needed a win to get into the playoffs just lost, so nothing can be a surprise at this point. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "An exciting game featuring Jim Sorgi and Vince Young. I have so much to write about this contest, I don't even know where to start. OK, maybe not... ",
            "2": "Peyton Manning played one drive and completed all of his passes. He was 7-of-7 for 95 yards and a touchdown. The yardage gave Manning his ninth consecutive 4,000-yard season - an NFL record. ",
            "3": "Meanwhile, with his seven receptions, Marvin Harrison moved past Cris Carter for second place on the all-time receptions list (Jerry Rice). ",
            "4": "Dallas Clark was the only other Colts offensive player of note; he caught six passes for 59 yards. Reggie Wayne had one reception. Lance Ball led the team in rushing with 83 yards. Jim Sorgi was 22-of-30 but for just 178 yards. ",
            "5": "As for the Titans, Kerry Collins tossed just two passes. Vince Young got the bulk of the action, but went just 9-of-13 for 55 yards. He also rushed five times for 25 yards. <div class=dfpAdSlots> '); "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "An exciting game featuring Jim Sorgi and Vince Young. I have so much to write about this contest, I don't even know where to start. OK, maybe not... ",
            "2": "Peyton Manning played one drive and completed all of his passes. He was 7-of-7 for 95 yards and a touchdown. The yardage gave Manning his ninth consecutive 4,000-yard season - an NFL record. ",
            "3": "Meanwhile, with his seven receptions, Marvin Harrison moved past Cris Carter for second place on the all-time receptions list (Jerry Rice). ",
            "4": "Dallas Clark was the only other Colts offensive player of note; he caught six passes for 59 yards. Reggie Wayne had one reception. Lance Ball led the team in rushing with 83 yards. Jim Sorgi was 22-of-30 but for just 178 yards. ",
            "5": "As for the Titans, Kerry Collins tossed just two passes. Vince Young got the bulk of the action, but went just 9-of-13 for 55 yards. He also rushed five times for 25 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "So much for breaking Dan Marino's passing record. Drew Brees needed 402 yards to eclipse Marino's mark. After one quarter, he had a grand total of eight! That said, Brees actually came pretty close. He needed 16 yards with one play to go. Unfortunately, his last pass was an ugly duck that looked like it came from a 12-year-old girl. On the bright side, Brees became the second quarterback in NFL history to eclipse the 5,000-yard barrier. Brees was 30-of-49 for 386 yards, four touchdowns and a pick. ",
            "2": "Lance Moore (8 catches, 91 yards) caught two of Brees' touchdowns. Marques Colston (7 catches, 123 yards) also had one. The fourth went to Robert Meachem. ",
            "3": "The Saints predictably stayed away from the run. Deuce McAllister rushed eight times for 40 yards. Mike Bell had the three other carries. ",
            "4": "While Brees was on fire in the final three quarters, New Orleans' defense was an epic failure the entire game. DeAngelo Williams had 143 rushing yards at halftime (on just 15 carries). The Saints also failed to force a punt until 11 minutes remained in the fourth quarter. ",
            "5": "Williams finished with 178 yards on 25 attempts. Jonathan Stewart gained 56 yards and a touchdown on 17 carries. ",
            "6": "Jake Delhomme was 14-of-20 for 250 yards and a score. Remarkably, only three Panthers registered a pass: Steve Smith (5-134), Muhsin Muhammad (7-79, TD) and D.J. Hackett (2-37). ",
            "7": "Stupid Vegas. This line opened Panthers -3, but fell to -1.5. The Panthers won by two, screwing many bettors. If you had -1.5, sorry. I feel your pain. If you had -2 (the line at Skybook and CRIS), I hate you. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "19"
        },
        "comments": {
            "amount": "5",
            "1": "It's amazing that almost every team that needed to win on Sunday found some way to lose. I'm including the Vikings in that pantheon; they trailed in the fourth quarter, and were only able to come back because the Giants had their second-stringers on the field. ",
            "2": "Tarvaris Jackson, who didn't really start playing well until Tom Coughlin unleashed his bench players, went 16-of-26 for 239 yards, one touchdown and a pick. Jackson found Bobby Wade and Bernard Berrian four times each for 98 yards, and 81 yards and a score, respectively. ",
            "3": "Meanwhile, Adrian Peterson bounced back after fumbling early, finishing with 103 yards including a 67-yard touchdown burst. ",
            "4": "Eli Manning, who played just the first half, was 11-of-19 for 119 yards. His replacement, David Carr, performed extremely well (relatively speaking, of course), going 8-of-11 for 110 yards and a touchdown. ",
            "5": "Congratulations to Derrick Ward. With 77 yards, he and Brandon Jacobs became just the fifth 1,000-yard rushing duo in NFL history. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "27"
        },
        "comments": {
            "amount": "4",
            "1": "Statistically, it's amazing that the Falcons won this game. They lost the time-of-possession battle, 35:13 to 24:47. They had three turnovers, while the Rams didn't have any. Steven Jackson rushed for 161 yards and two touchdowns. And Marc Bulger was 19-of-32 for 230 yards and a touchdown. ",
            "2": "So, how did Atlanta come out on top? Honestly, I have no idea. I guess we could start by looking at Michael Turner's 208 rushing yards and a touchdown on 25 carries. Jerious Norwood (3 rush, 56 yards, 2 TDs) also broke free for a 45-yard score. ",
            "3": "As for Matt Ryan, the hot rookie signal caller actually had one of the worst games of his young career, finishing just 10-of-21 for 160 yards, one touchdown and two picks. ",
            "4": "Here's a microcosm of St. Louis' horrific 2008 campaign: The Rams recovered a surprise onside kick in the first quarter, but it was wiped out because a player was lined up offsides. OK, fine... maybe St. Louis' 2-14 record is more than just a result of stupid mistakes. Some talent on offense, defense and special teams would really help. A real coach and competent front-office personnel would also be a plus. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "Of all the teams needing a victory today, I thought the Bears would come through. They're a veteran team that is just two years removed from playing in the Super Bowl. Besides, Chicago already had its game it should have lost (Monday against the Packers). ",
            "2": "So much for that. Chicago's defense didn't show up at all, as Houston tallied 455 total net yards in this contest. ",
            "3": "The Bears had no answer for Matt Schaub, who was 27-of-36 for 328 yards and two touchdowns. They couldn't even register a sack on him. Schaub located Andre Johnson 10 times for 148 yards and two touchdowns. ",
            "4": "Meanwhile, Owen Daniels had three grabs for 37 yards. Kevin Walter registered just one reception for 23 yards. Steve Slaton was second on the team in catches (five for 36 yards). ",
            "5": "In addition to his receiving yardage, Steve Slaton carried the ball 20 times for 92 more yards and a score. ",
            "6": "As for the Bears, who actually led this game 10-0, Kyle Orton was surprisingly effective, going 22-of-37 for 244 yards and a pair of touchdowns. Orton went to Devin Hester six times for 85 yards. ",
            "7": "Chicago's problem in this contest was not getting Matt Forte involved enough. Forte touched the ball only 16 times. He had 13 carries, three catches and 75 total yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "7"
        },
        "comments": {
            "amount": "3",
            "1": "Instead of recapping this game - it was pretty much over when it started - let's look at some cool stats Baltimore's defense is responsible for: 1. With two picks, Ed Reed's interception total stands at nine, which is good for the league lead. Reed also had nine picks in 2004. 2. The Ravens restricted every visiting opponent to less than 14 points this year. The last time any team did that was in 1962 (Packers). 3. Baltimore had 26 picks on the year, which led the league. 4. With Maurice Jones-Drew gaining 78 yards on 23 carries, Baltimore hasn't given up 100 rushing yards to a single back in 35 games. 5. As for today, the Ravens restricted David Garrard to 14-of-25 passing for 127 yards, one touchdown and two picks. In total, Jacksonville had four turnovers in this contest. ",
            "2": "Meanwhile, Joe Flacco was prolific, going 17-of-23 for 297 yards. Flacco went to Mark Clayton four times for 128 yards, and Derrick Mason six times for 77 yards. ",
            "3": "Two of the Ravens' three touchdowns came from LeRon McClain. McClain totaled 70 yards on 25 rushes. Willis McGahee (4-24) had the other end-zone trip. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "6"
        },
        "comments": {
            "amount": "4",
            "1": "I actually laughed hysterically throughout this game. Watching Aurora Snowmo and Wade Phillips melt down, all while Jerry Jones looked like he was contemplating how to make his coaching staff disappear was highly amusing. I found this funny for three reasons. First, Phillips looks like a goofy mother hen. Second, I (along with five billion other people) called this Aurora Snowmo collapse. Third, I found it ridiculous that Jerry Jones vehemently defended such a terrible coaching staff. ",
            "2": "As for the Eagles, you can't really say enough about them. They looked great in every facet of the game, save for a couple of botched third-and-short opportunities. Donovan McNabb was just 12-of-21 for 175 yards and two touchdowns, but he didn't really have to throw often because Correll Buckhalter and Brian Westbrook combined for 113 rushing yards on 23 carries. The defense also helped with five turnovers, two of which were returned for scores. ",
            "3": "As for Snowmo, he was 21-of-39 for 183 yards, one pick and two lost fumbles. ",
            "4": "At least Terrell Owens was happy; he caught six balls for 103 yards. Jason Witten had seven grabs for 50 yards. Roy Williams, who will go down as one of the worst mid-season trade acquisitions in NFL history, had two receptions for four yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "49ers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "Mike Singletary secured the full-time 49ers head coaching job with this victory, as the 49ers announced the move after the game. The 49ers finished 7-9, and as I've been saying, it's a shame they didn't go with Shaun Hill the entire year. ",
            "2": "Hill finished 21-of-30 for 245 yards, one touchdown and a pick, but more importantly, he was 12-of-16 for 163 yards and a score in the fourth quarter alone. ",
            "3": "Frank Gore carried the ball just 11 times for 58 yards. He left the game early with an ankle injury. ",
            "4": "Josh Morgan led the 49ers with three receptions and 50 receiving yards. Target him as a late-round sleeper in fantasy football next year. ",
            "5": "Someone you won't be drafting is Jason Campbell, who still hasn't thrown a pass longer than 30 yards since beating the Lions on Oct. 26. Oddly enough, his greatest physical strength is his arm power. Campbell was 18-of-30 for 156 yards and a score on Sunday. ",
            "6": "Clinton Portis rushed for 80 yards and a touchdown on 29 carries. Meanwhile, Santana Moss and Chris Cooley each caught six balls for 68 and 57 yards, respectively. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "It figures that when I take the Seahawks, and expect a backdoor cover from Seneca The Backdoor Bandit Wallace, he doesn't come through despite two backdoor opportunities. If you don't know what I'm talking about, The Backdoor Bandit ruined nine total units of mine, thanks to a pair of backdoor covers earlier in the year. ",
            "2": "Of course, it's not all the Bandit's fault. Seattle's defense had no answer for Kurt Warner, who was 19-of-30 for 263 yards, four touchdowns and a pick. Even Matt Leinart (5-of-8, 83 yards) proved difficult to contain. ",
            "3": "Two of Warner's touchdowns went to Larry Fitzgerald, who had five catches for 130 yards. ",
            "4": "With Anquan Boldin out, Steve Breaston saw all of his targets. Breaston had five receptions for 91 yards and a score. ",
            "5": "Perhaps the most remarkable thing about this game was Edgerrin James' 100 rushing yards. If that doesn't knock your socks off, James accomplished that feat on just 14 carries. ",
            "6": "Notables for the Seahawks: Backdoor Bandit (24-of-43, 250 yards, 2 TDs, 2 INTs); Maurice Morris (15 rush, 45 yards), Deion Branch (6 rec, 90 yards, 2 TDs), Bobby Engram (6 rec, 50 yards) and John Carlson (2 rec, 14 yards). "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "Make it 3-for-3. Three weeks ago, I repeatedly wrote that the Jets would barely defeat Buffalo, and then lose to Seattle and Miami. My reasoning? New York ruined its season by beating undefeated Tennessee right after an emotional victory at New England. The Titans win was unnatural, and the Jets would have been better served conserving their energy for the final portion of the season. ",
            "2": "Saying that Chad Pennington out-played Brett Favre is an understatement. While Pennington was a very economical 22-of-30 for 200 yards and two touchdowns, Brett Favre was abysmal; the old warrior finished 20-of-40 for 233 yards, one score and three picks, giving him two touchdowns and nine interceptions in the final five weeks of the year. ",
            "3": "I also predicted that the Jets wouldn't run the ball as often as they should this week. Thomas Jones had just 10 carries for 23 yards. My reasoning? Vastly overrated offensive coordinator Brian Schottenheimer absolutely has no idea what he's doing. How he kept his job after screwing up so many times last year is beyond me. ",
            "4": "Despite his quarterback's struggles, Laveranues Coles accumulated 88 yards and a touchdown. Jerricho Cotchery managed just two receptions for 41 yards. Dustin Keller had two grabs for 24 yards. ",
            "5": "Unlike the Jets, the Dolphins actually stuck with the run. Ricky Williams and Ronnie Brown combined for 107 yards on 21 carries. ",
            "6": "Meanwhile, Davone Bess led the squad in receptions with six for 39 yards. Ted Ginn (2-71) and Anthony Fasano (3-39) scored both of Pennington's touchdowns. ",
            "7": "Not only did Miami secure the AFC East title with this victory, the team also managed to tie the 1999 Colts for the greatest turnaround in NFL history (10 wins). ",
            "8": "Read more about what could be <a href=https://walterfootball.com/forum/showthread.php?t=7355 target=blank> Brett Favre's final game</a> in the forum (thanks, Wraith). "
        }
    },
    "Game 17": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "52"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "21"
        },
        "comments": {
            "amount": "1",
            "1": "I'll post my thoughts on this game in my <b> <a href=/nflpowerrankings.php> NFL Power Rankings</a></b>, which will be posted on Tuesday morning. Believe me, I have a lot to say about the Broncos. But congratulations to the Chargers, who came all the way back from oblivion to make the Doggone Playoff. "
        }
    },
    "numberOfGames": "17"
}