{
    "year": "2008",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "They're growing up before our very eyes. This was an obvious trap game for the Bills, as they had every reason to have a letdown after beating two 2007 postseason participants. The Raiders had a 24-13 lead with five minutes remaining in regulation, but Trent Edwards was able to go 6-of-8 for 92 yards and a touchdown on his team's final two drives, leading the Bills to a 24-23 comeback victory. ",
            "2": "As a whole, Edwards was 24-of-39 for 279 yards, one score and a pick. Lee Evans caught four balls for 65 yards, but he wasn't Edwards' primary target. Josh Reed registered six catches and 72 yards. Marshawn Lynch chipped in with 83 rushing yards and two touchdowns. ",
            "3": "The offseason acquisition of the year has to be Marcus Stroud. For the third consecutive game, Buffalo hasn't allowed 100 rushing yards to their opponent. That's not just to a running back - that's the entire team I'm talking about. ",
            "4": "Darren McFadden and Michael Bush each carried the ball 14 times. McFadden had 42 yards, while Bush had 55. ",
            "5": "JaMarcus Russell threw just three passes in the second half. Way to be aggressive, Raiders. Russell finished 9-of-19 for 156 yards and a touchdown. If Al Davis remembers who Lane Kiffin actually is, there will probably be a coaching change this week. ",
            "6": "The Bills, now in full control of the AFC East, are 3-0 for the first time since 1992 - one of the four years they lost the Super Bowl. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "For a while, I was wondering if either team would get a first down in this game. The Falcons and the Chiefs combined for six three-and-outs to begin the contest. Atlanta finally moved the chains on a 38-yard Michael Turner run with 6:44 remaining in the first quarter. ",
            "2": "While Atlana broke out of its slump, Kansas City never did. In fact, Tyler Thigpen completed his first pass one minute into the second quarter. The pass was for minus-one yard. Thigpen began the game 1-of-11 for -1 yards and an interception. Seriously, were Doug Pederson, Vinny Testaverde and Akili Smith unavailable? ",
            "3": "The one bright spot for Kansas City's offense was Larry Johnson's 121-yard performance on 24 carries. Looks like he won't have to be taken out to pasture just yet. ",
            "4": "Michael Turner had less yardage than Johnson (104) but he scored three touchdowns against Kansas City's Cottonelle defense. Roddy White, meanwhile, hauled in five receptions for 119 yards and a touchdown. Matt Ryan was actually able to get White the ball this week. Guess there's a huge difference between the Buccaneers and Chiefs stop units, huh? Ryan was 12-of-18 for 192 yards and a score. ",
            "5": "So, how pathetic are the Chiefs? Well, we can talk about their errant 32-yard field goal, but let's get some quotes from the forum members: McWatt: Bahahahahaha....it's too bad we can't play the Chiefs 16 times. Eagles4Life: C'mon Chris Houston, Thigpen's passing out the picks like candy! Grab one and make us Arkansans proud! Interestingly enough, Houston had a pick-six at the end of the game. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Titans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "12"
        },
        "comments": {
            "amount": "4",
            "1": "The Texans could be the dumbest team in the NFL. Seriously. If the NFL issued a grade for coaches making fourth-down decisions, Gary Kubiak would get the dreaded Z-. Just read about this decision-making: Houston passed up a field goal down 24-12 with five minutes left in the third quarter. They were down 12, so they needed two touchdowns, right? Yes, but you don't think like that so early! The Texans failed on fourth-and-three and had to surrender possession. Later, they had a similar situation on a fourth-and-two near the goal line. If they would have kicked a field goal on both occasions, it would have been a 6-point game with 7:45 left on the clock. Instead, Houston failed again. Making matters worse, they wasted a pair of timeouts deciding on what to do/call on those fourth downs! How stupid can you get!? ",
            "2": "It's not like Matt Schaub's decision-making was any better. Schaub completed his first pass one minute into the second quarter. He had a fumble and an interception before then. Schaub finished 17-of-37 for 188 yards, three interceptions and two fumbles. Andre Johnson deserves some blame too; he had only two receptions for 29 yards because he had a pair of key drops - one, a touchdown, and another, what would have been a 50-yard gain. ",
            "3": "Steve Slaton was the one bright spot for Houston's offense. Slaton rushed for 116 yards and a touchdown on 18 carries. Slaton broke a 50-yard gain. ",
            "4": "Speaking of rookie runners, Chris Johnson totaled 74 yards on just 16 carries. Unfortunately, he didn't get into the end zone, as LenDale White ate both of his goal-line opportunities. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "Sometimes the NFL does things that have me completely mystified. I'm sure most of you were watching FOX's bonus coverage of the Buccaneers-Bears game that went into overtime. Unfortunately, we didn't get to see the entire fifth quarter because FOX wasn't allowed to show live coverage of games past 4:15, as this was a CBS double-header weekend. In the words of Dennis Green, That's bulls**t, bulls**t! If one station has the early games, it should be able to televise all the early games. Once again, we're reminded that Roger Goodell is pure evil. ",
            "2": "Anyway, if you told me that Brian Griese and Kyle Orton would combine for 675 passing yards in the Buccaneers-Bears game, I would've had you institutionalized. I wouldn't have even thought about that twice. How Chicago and Tampa Bay totaled 51 points is beyond me. ",
            "3": "Griese came four pass attempts and eight completions short of breaking Drew Bledsoe's single-game records. On Nov. 13, 1994, Bledsoe was 45-of-70 for 426 yards and three touchdowns against the Vikings in a 26-20 overtime win. Griese also won in overtime, but his stats weren't as pretty. Griese was 38-of-67, 407 yards with two touchdowns and three picks. However, Griese didn't make his patented bone-headed play in the clutch, leading the Buccaneers to victory. ",
            "4": "What's most impressive about Griese's performance was that he didn't have Joey Galloway at his disposal. He also didn't possess an effective running game (Earnest Graham gained just 16 yards on 12 carries). Griese went to Antonio Bryant 10 times for 138 yards. Jerramy Stevens grabbed five balls for 61 yards and a touchdown. Stevens undoubtedly covered his hands in glue before the game. ",
            "5": "I was pretty disappointed in Tampa Bay's inability to contain Orton. The weak-armed signal caller went 22-of-34, 268 yards, two touchdowns and two picks. Orton somehow found Brandon Lloyd six times for 124 yards and a touchdown. Good to see Lloyd is trying hard in his contract year. Never thought that would happen (rolls eyes). ",
            "6": "Matt Forte is a stud. Seriously, start him against whomever. Forte rushed for 89 yards on 27 carries, and also caught seven balls for 66 receiving yards and a touchdown. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "Only seven points in the first half from Arizona's offense? As the captain in <i> Zero Wing</i> would say, What happen! Well, the Cardinals had a touchdown called back by a shady delay-of-game penalty that came out of nowhere. I really had no idea Tim Donaghy was officiating this game. ",
            "2": "Arizona was plagued by poor officiating and dumb mistakes the entire afternoon. Edgerrin James fumbled and Kurt Warner threw a pick deep in their own territory. Larry Fitzgerald also dropped a touchdown (though LaRon Landry hit him hard, which knocked the ball loose - it was still catchable though). Fitzgerald caught seven passes for 109 yards and a score. Warner, meanwhile was 16-of-30 for 192 yards, two touchdowns and an interception. ",
            "3": "Jason Campbell continues to make strides against porous secondaries in the West Coast offense. Campbell finished 22-of-30 for 193 yards and two touchdowns. Santana Moss and Chris Cooley each had seven of those receptions. Santana Moss for 75 yards and a score; Chris Cooley for 72 yards. ",
            "4": "The Cardinals will not be returning West; they'll remain on the East Coast for their next game against the Jets. Ken Whisenhunt will spend the week gathering money he can use to pay off the officials so that he actually gets some calls to go his way. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Giants",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "The Giants came out flat. They allowed Carson Palmer to convert 10-of-17 third downs, which basically was the only reason this game was close. New York managed to sack Palmer six times, so the secondary deserves most of the blame. Palmer's nose was actually gushing blood at one point. ",
            "2": "Palmer finally put together a good fantasy performance, finishing 27-of-39 for 286 yards and a touchdown. T.J. Houshmandzadeh registered 12 receptions, 146 yards and that score. Chad Ocho Cinco managed just three catches for 29 yards. ",
            "3": "As I said last week, Chris Perry will be a decent fantasy option once he plays a poor defense. I just didn't think that would be this week. Perry gained 74 yards and a touchdown on 20 carries. ",
            "4": "Eli Manning was the better of the former No. 1 overall quarterbacks. Manning was 26-of-43 for 289 yards and a touchdown, and was big down the stretch, leading his team to a comeback and an overtime victory. ",
            "5": "Manning and Plaxico Burress connected only three times for 45 yards. Amani Toomer led the team in yardage with 64 (five catches), while Steve Smith garnered the most receptions (7 for 60 yards). ",
            "6": "When you're one of the worst, dumbest and most legally troubled teams in the league, you find different ways to lose. When the Bengals were driving down the field for a potential game-winning or tying score, they had a third-and-one on New York's 14 with 26 seconds left on a running clock. Instead of hurrying up to get a first down and a touchdown, the Bengals took their time and finally snapped the ball with 12 seconds remaining. They got the first down, but there were only six seconds remaining. Thus, they were forced into the field goal. They consequently went into overtime and lost. ",
            "7": "Congratulations to the Bengals though. They played hard for the first time all year and were nearly awarded a victory. Good job, guys. Maybe your second legitimate tough effort in three weeks will actually pan out to something more lucrative. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Dolphins 38, Patriots 13??? How did that happen? Well, as I've been saying since Halloween 2007, New England's defense sucks. They couldn't stop A.J. Feeley and Kyle Boller last year. They couldn't get off the field in the Super Bowl, as Eli Manning set the Super Bowl record for third-down conversions to open a championship. In the preseason, Boller, Brian Griese and David Carr looked like the reincarnates of Johnny Unitas because New England couldn't stop them. The Patriots threw everything they had against the Jets last week, but because they ran out of energy, they were helpless against the lowly Dolphins at home. ",
            "2": "So, what now? It doesn't matter who the quarterback is. Neither Matt Cassel, Kevin O'Connell nor Doug Flutie can help the Patriots score in the 30s every week - because that's what it's going to take to overcome the slow defense's ineptness. The Patriots may be 2-1, but they don't have much hope of making the playoffs. ",
            "3": "Speaking of that poor stop unit, Ronnie Brown and Ricky Williams combined for 211 yards and four rushing touchdowns. Brown, who worked out of the archaic single wing formation, also tossed a score to Anthony Fasano. Meanwhile, Chad Pennington misfired on only three passes. Fasano caught three balls for 66 yards and that score. Ted Ginn, meanwhile, had five receptions for 49 yards. ",
            "4": "I wouldn't blame Matt Cassel for the loss too much. He did what he could; he moved the chains efficiently at times, but took too many sacks, namely from Joey Porter, who had three. Cassel was 19-of-31 for a touchdown and a pick. He went to Wes Welker and Jabar Gaffney six times each. ",
            "5": "Randy Moss had four catches for 25 yards. He short-armed some balls and was seen sitting by himself on the bench late in the game. Oh boy. There was a great chance Moss would quit on the team if the Patriots were ever eliminated from the playoffs, but at 2-1? Unreal. ",
            "6": "Streaks Snapped: New England's 21-game regular-season winning streak. Miami's 11-game road losing streak. Also, the Patriots are not in first place in the AFC East for the first time since Week 6, 2003! "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Is Brad Childress auditioning to become Mike Martz's new lovely assistant? Despite having Adrian Peterson, the Vikings threw their first six plays of the game. At the end of the first quarter, Frerotte passed 10 times, while Peterson had only three carries. No wonder they trailed 10-0 early on. ",
            "2": "Things eventually evened out, which would explain how Minnesota managed to rally. Frerotte finished with 28 pass attempts - the same amount of carries that Peterson and Chester Taylor combined for. Frerotte was pretty economical, going 16-of-28 for 204 yards, one touchdown and a pick. Peterson, meanwhile, gained 77 yards on 17 carries. ",
            "3": "The Panthers seemed unprepared for the noise in the Homer Dome. They committed six false starts and a delay of game. A blocked field goal of their defense's was also negated because John Fox used a timeout. ",
            "4": "Carolina couldn't run the ball - DeAngelo Williams and Jonathan Stewart combined for 42 yards on 17 rushes. Jake Delhomme was just 17-of-29 for 191 yards. He also fumbled while getting sacked, allowing Antoine Winfield to score a touchdown on the recovery. ",
            "5": "Steve Smith opened the game with a 16-yard reception, but managed just three more catches the rest of the game. He finished with 70 yards, but didn't break anyone's nose in the process. ",
            "6": "Sunday was only the fifth time that Jake Delhomme failed to cover as an underdog in his career. Trend bettors everywhere are pissed off. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "49ers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "Great job by the Lions on Sunday. Last week, I said Rod Marinelli had to change his Get Down 21-0 so We Can Try to Make an Impossible Comeback strategy. I'm pleased to report that he did. Instead, Marinelli decided that trailing 21-3 was a better move. ",
            "2": "I don't really feel like talking about the pathetic Lions right now. But here are two things of note: Kevin Smith was benched in favor of Rudi Johnson. Johnson totaled 83 rushing yards on 14 carries, and 48 receiving yards and a score on three receptions. Don't be fooled, however. Most of Rudi's yardage came when the game was out of reach and the 49ers were no longer focused on stopping the run. Rudi also fumbled. Calvin Johnson managed four receptions for 40 yards. Jon Kitna apparently thought that throwing to bums like Michael Gaines and Casey Fitzsimmons was a more lucrative option. Roy Williams had only two receptions for 18 yards. The Lions should prepare to trade him to the Eagles, Buccaneers, Cowboys or Seahawks. ",
            "3": "Believe it or not, Frank Gore ran more times than J.T. O'Sullivan threw. Yeah, I know... I figure Mike Martz read that I uncovered his black-market organ plan (read about this on the <b></b> page). That, or Martz and Brad Childress somehow swapped brains. Don't expect anything like this to happen ever again. ",
            "4": "Gore had a great game, gaining 130 yards and a touchdown on 27 carries. He also caught four balls for 32 receiving yards. ",
            "5": "O'Sullivan tossed two touchdowns, but neither Bryant Johnson nor Isaac Bruce saw much action. Johnson had one grab for 25 yards, while Bruce caught two passes for 19 yards and one of the scores. ",
            "6": "Meanwhile, Vernon Davis caught one ball for 17 yards. He now has four receptions on the year. Feel free to drop him off your fantasy team if you still have him. ",
            "7": "Some good news for Detroit: Despite Gore's great performance, they managed to decrease their defensive YPC from 7.0 to 6.1. Happy time! "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "32"
        },
        "comments": {
            "amount": "5",
            "1": "No one should be surprised that Martin Gramatica missed two field goals, including a 43-yard game-winner. Somewhere on this site, I said before the season that foolishly choosing Gramatica over Taylor Mehlhaff would cost the Saints a couple of games. That's one! ",
            "2": "The botched Gramatica field goal nullified a brilliant performance by Drew Brees, who was 39-of-48 for 421 yards and a touchdown. Reggie Bush predictably caught most of Brees' completions. He had 11 receptions for 75 receiving yards to go along with his 73 rushing yards and two total touchdowns. ",
            "3": "Brees' other key targets include: Jeremy Shockey (8 catches, 75 yards), Lance Moore (7 catches, 78 yards) and Robert Meachem (2 catches, 86 yards). ",
            "4": "Jay Cutler was also exceptional. But because his team had the lead for the whole game, he didn't have to throw as much as Brees. Cutler went 21-of-34 for 264 yards, two touchdowns and a pick. ",
            "5": "Brandon Marshall continued his beast-mode performance, as he caught six balls for 155 yards and a score. Despite the fact that he missed one game for a suspension, there's a great chance he could finish the year as the league leader in receptions and receiving yardage. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "The Rams have now been outscored 116-29 on the year. If all the people in St. Louis' front office haven't begun updating their resumes, they should get on it immediately. Everyone must go. ",
            "2": "That includes Scott Linehan, who was once again overmatched. Though the game concluded in a blowout, the Rams trailed by just 14 points in the third quarter. Linehan gave the team no chance to make a comeback, as he wasted two timeouts early in the second half. One was used five minutes into the third, while the other was taken five minutes later. ",
            "3": "The Rams were so bad that they made T.J. Duckett and Billy McMullen look like stars. Duckett gained 79 yards and two touchdowns, while McMullen caught four balls for 76 yards. However, it was Julius Jones who was shined for the Seahawks. Jones tallied 140 yards and a score on 22 rushes. ",
            "4": "I found it odd that St. Louis surrendered only one sack to a defense that accumulated eight last week. That didn't stop Marc Bulger from throwing a pick and fumbling though. ",
            "5": "Steven Jackson had a decent game. He didn't get into the end zone, but he had 128 total yards (66 rushing, 62 receiving). Torry Holt didn't do much, catching four passes for 37 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "21"
        },
        "comments": {
            "amount": "5",
            "1": "The Colts were ranked 24th against the run and had allowed two 100-yard rushers on the year going into the Jaguars game - and that was with Bob Sanders. As you can imagine, the Jaguars, who run the ball better than anything, were licking their chops. Fred Taylor and Maurice Jones-Drew each eclipsed the century plateau, totaling 228 total yards and a touchdown. ",
            "2": "In addition to his 107 ground yards and touchdown, Jones-Drew had four receptions and 59 receiving yards. ",
            "3": "Unfortunately, David Garrard once again failed to put together a solid performance, giving him a grand total of zero quality games this year, including the preseason. Garrard was 16-of-22 for 167 yards and a pick. ",
            "4": "Peyton Manning also continued to struggle. In fact, he barely completed 50 percent of his passes, going 15-of-29 for 216 yards, one touchdown and two interceptions. Reggie Wayne (3 catches, 74 yards), Dallas Clark (4 catches, 47 yards), Marvin Harrison (4 catches, 40 yards, TD) and Anthony Gonzalez (2 catches, 37 yards) all put up similar numbers. ",
            "5": "Joseph Addai scored the other two touchdowns for Indianapolis. Addai rushed for 78 yards on only 16 carries. I have to wonder why Addai didn't get the ball more when the Colts led for at least half the game. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "Going into the offseason, it was clear the Steelers had to upgrade their offensive line, as Ben Roethlisberger took a beating against Jacksonville in the playoffs. Pittsburgh failed to address the front, and it seemed like they were fine going into this contest. But of course, the Texans and Browns have pretty sorry defenses... Philadelphia's front seven completely dominated Pittsburgh's offensive line. It actually looked like grown men were attacking helpless young children. The Eagles sacked Roethlisberger nine times (six times in the second quarter alone), and registered tons of pressures and knockdowns. As NFL.com pointed out, If Roethlisberger was less elusive, the Eagles very easily could have tallied 15 sacks or more. ",
            "2": "With that in mind, no Eagles fan has the right to complain about the missed Brian Westbrook face mask penalties in the Cowboys game (though they had a right to do so before this contest). The officials missed tons of penalties on Philadelphia, including some late hits, face masks and throat grabs. There was also a blown call on a Roethlisberger safety. ",
            "3": "Though the Steelers managed only three sacks of their own, both quarterbacks had to leave the game with injuries. Roethlisberger's shoulder exploded on one of his 50,000 sacks, while McNabb hurt his chest on a first-quarter tackle. Neither signal caller threw for more than 200 yards, though McNabb completed his first 15 passes for 145 yards and a touchdown. ",
            "4": "Brian Westbrook also had to leave the Broken Bone Bowl. He'll have an MRI on his ankle on Monday. Awful news for Philadelphia's offense. Westbrook couldn't really do anything versus Pittsburgh's stout front while he was in the game; he carried the ball five times for 12 yards. ",
            "5": "Like Westbrook, Willie Parker didn't have much luck on the ground. Parker tallied only 20 yards on 13 rushes. ",
            "6": "Neither quarterback had much of a pocket to work with, so as you can imagine, no receiver really did much. Heath Miller led the Steelers with 63 receiving yards. Hines Ward (4 catches, 34 yards) and Santonio Holmes (3 catches, 32 yards) disappointed fantasy owners. Meanwhile, Hank Baskett paced the Eagles with eight grabs and 85 yards. DeSean Jackson registered 40 yards on five receptions. ",
            "7": "Kevin Kolb, who replaced McNabb right after halftime, had his first throw picked off, though to be fair, Troy Polamalu made a spectacular diving play to get it. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "I like John Harbaugh's aggression. On a fourth-and-two at midfield with 3:51 on the first-quarter clock, Baltimore moved the chains on a 2-yard run by Joe Flacco... ...Unfortunately, Flacco threw an interception on the next play. Before that pick, Flacco opened the game 7-of-7 for 73 yards. He finished 13-of-19 for 129 yards and two interceptions. ",
            "2": "Nevertheless, I like that Harbaugh was trying to inspire confidence in his offense. Brian Billick never would have gone for it. Harbaugh later went for it and converted again in the fourth quarter on a fourth-and-one Cleveland's 29. ",
            "3": "Not much else of note from Baltimore's offense. LeRon McClain and Willis McGahee combined for 130 yards and three touchdowns on pretty equal numbers. McGahee had all the early carries, but sat out with a cut eyelid late in the game. Derrick Mason caught four balls for 42 yards, while Todd Heap registered two catches for 32 yards. ",
            "4": "So, how did the Ravens score? Well, you can ask Derek Anderson about that. Anderson, who was 14-of-37 for 125 yards, one touchdown and three interceptions, tossed one of those picks deep in his own territory with the lead. The next interception was a pick-six despite trailing by just four points. ",
            "5": "Braylon Edwards led the team with three catches and only 27 yards. Kellen Winslow Jr. was nowhere to be found; he had two grabs for 14 yards. ",
            "6": "Quote of the Game: Everyone on the Browns is hurt. Steinbach isn't even playing and Braylon Edwards may not. Walter, if we lose this game, I will never complain again about you putting us in the bottom 3 of your power rankings. <i> - Forum member Puppy Puncher.</i> Son of a... if I didn't have two units on the Ravens, I'd be pretty pissed off that I just lost immunity. "
        }
    },
    "numberOfGames": "14"
}