{
    "year": "2008",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "I had a mini-argument this week on the forums with Wraith about Raiders coach Tom Cable. Wraith said he was the worst thing since sliced bread. I opined that Cable was doing a fine job. Whoops! Can we count all of Cable's gaffs on one hand? Let's give it a try: 1. JaMarcus registered zero - ZERO!!! - pass attempts on his first three drives. The Raiders called seven runs and two passes. The two passes were on second- and third-and-long, and both resulted in sacks. Now, I know Oakland's strength is pounding the rock, but three starters in Baltimore's secondary - Chris McAlister, Samari Rolle and Dawan Landry - were out. And besides, Baltimore is ranked first against the run. Giving Russell some throws on first-and-10 would have been much more lucrative. 2. Down 19 with a minute left in regulation, Oakland finally found the end zone, making the score 22-9. Going for two would have resulted in a 22-11 deficit, allowing Oakland to tie with a touchdown plus two and a field goal. Instead, Cable foolishly signaled for an extra point, forcing his squad to hunt for two improbable touchdowns against a great defense. 3. With seven minutes remaining and the score stuck at 22-10, Cable used a timeout on a fourth-and-21. Way to waste your second-half timeouts, Cable. Why would you call timeout? Who cares if you get a delay-of-game? It's a freaking punt, Cable! I'm losing it here! 4. It turns out that Cable used a timeout because he wanted to go for it... on a fourth-and-21. The Raiders were down two scores with seven minutes remaining. There was enough time to punt, force a three-and-out and get the ball back in good field position. Instead, Russell's fourth-and-21 fell incomplete to Ashley Lelie. The Ravens went three-and-out, but Oakland consequently was stuck in poor field position. 5. OK, I don't have any more, but I'd like to once again point out that Cable was 11-35 at Idaho. Maybe he would have been 12-34 if he knew how to manage timeouts, down-and-distance situations and conversion opportunities! ",
            "2": "It turns out Baltimore was able to maintain its top-ranked rush defense all afternoon. Justin Fargas gained just 24 yards on 12 carries. Michael Bush, in relief of Darren McFadden, gained only eight yards on just five attempts. ",
            "3": "Russell, meanwhile, finished with 228 yards, but completed just 15-of-33 attempts and threw an interception. No Raiders receiver caught more than three passes. ",
            "4": "Another unspectacular but efficient performance from Joe Flacco, who was 12-of-24 for 140 yards and a touchdown. Flacco converted a third-and-five, third-and-12, third-and-eight, third-and-20 and another third-and-12. Flacco was also a recipient of a 43-yard pass from Troy Smith. Glad to see that the Raiders' defense showed up. ",
            "5": "The only positive thing Oakland did on Sunday was contain Willis McGahee, who managed only 58 yards and a touchdown on 23 rushes. Unfortunately for the Silver and Black, Ray Rice compiled 101 yards on only 11 touches. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "I picked the Dolphins to win on my NFL Picks page because I thought this was a terrible spot for the Bills. Buffalo was coming off a huge, statement victory against the Chargers. Following this easy victory against the Dolphins, who just were just debacled by the Ravens, the Bills had consecutive meetings against the Jets and Patriots. That said, Buffalo still had a good shot to win this game in the fourth quarter; after three periods, the Dolphins led by a single point. However, Trent Edwards made three crucial errors in the final 15 minutes. He threw an interception, fumbled the ball away on a fourth-and-short opportunity and took a sack in the end zone, which resulted in a safety. ",
            "2": "Edwards still managed to throw for 227 yards on 21-of-35 passing. He located Lee Evans seven times for 116 yards. ",
            "3": "Marshawn Lynch scored Buffalo's lone touchdown. He gained 61 yards on just 13 rushes and caught five balls for 34 yards. ",
            "4": "Meanwhile, Chad Pennington was more impressive of the two quarterbacks - and I'm not saying that by default. Pennington was 22-of-30, 314 yards and a touchdown. Pennington finally established a rapport with Ted Ginn, finding the former No. 1 selection seven times for 175 yards. Pennington's score went to Anthony Fasano. ",
            "5": "Despite its victory, Miami had trouble establishing the run versus big Marcus Stroud and Buffalo's defensive line. Ronnie Brown managed 43 yards on 14 carries. Ricky Williams smoked his way for 16 yards on seven attempts. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jets",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "In my analysis of this game on my NFL Picks page, I called Tyler Thigpen the worst quarterback in the NFL. So, does that mean that the Jets have the worst defense in the league? How did Tyler Thigpen begin this game 10-of-10 for 121 yards and a touchdown? How did he finish 25-of-36 for 280 yards and a pair of scores? Prior to this game, Thigpen couldn't throw the ball longer than 10 yards. Seriously, Arthur Petrelli could have launched the ball deeper from his deathbed at Pinehurst headquarters. ",
            "2": "Thigpen connected with Dwayne Bowe and Tony Gonzalez six times each. Bowe had 102 yards, while Gonzalez collected 79 yards and a touchdown. The newly acquired Mark Bradley grabbed five balls for 42 yards and a score. ",
            "3": "Thigpen's performance is really inexplicable when you consider the fact that he didn't have a solid ground game by his side. With Larry Johnson out, Kolby Smith received the bulk of the carries (11) and gained just 15 yards. Jamaal Charles broke a 30-yard scamper, but managed 15 yards on his other four attempts. ",
            "4": "One more thing on Thigpen... I think we could have gotten 56 billion-to-one odds in Vegas that he would out-perform Brett Favre in this matchup. But that's exactly what happened. Favre was 28-of-40 for 290 yards and two scores, but he also three interceptions, one of which was returned 91 yards for a touchdown. There were rumors during the week that Favre is hiding an arm injury. Of course, he'll never admit that he's hurt so his consecutive-starts streak doesn't fall in jeopardy. But Favre now leads the league in picks (11) after having just 15 all last year. ",
            "5": "Jerricho Cotchery finally came to life for Favre; the wideout caught nine balls for 102 yards. Laveranues Coles, meanwhile, tallied seven receptions, 64 yards and a score. ",
            "6": "Thomas Jones also found the end zone once. He totaled 54 yards on only 14 carries. The Jets fell behind by a bit early and didn't run the ball as much as they should have. Credit inept offensive coordinator Brian Schottenheimer for the brain fart. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "It's been an awful year for NFL officials, and it only got worse in this game. The play everyone will be talking about was a phantom muffed punt on Falcons return specialist Adam Jennings. Jennings appeared to graze the ball late in the fourth quarter, but TV replays showed that he didn't touch it. Unfortunately, Mike Smith couldn't challenge the call because he used all of his timeouts to stop the clock when the Eagles had possession. I'd like to see the NFL allow a team to challenge without timeouts to avoid a situation like this in the future. If the challenge fails, maybe you can penalize them 15 yards or something. But the Falcons were essentially screwed by that horrendous call. ",
            "2": "Atlanta wasn't the only team to get the shaft by the officials in this contest. Eagles defensive end Trent Cole was called for a BS roughing-the-passer penalty on what looked like a textbook tackle. If FOX announcer Sam Rosen wore a hairpiece, it would have flown off when he continuously bashed the official for the poor call. ",
            "3": "So, who was the culprit behind this? The official in this game was Jerome Boger, known as the worst referee in the NFL (at least he's known that way on this Web site). ",
            "4": "Matt Ryan looked like he injured his lower back on that play, but still performed exceptionally well, going 23-of-44 for 277 yards, two touchdowns and two picks. Those two interceptions hurt, but Ryan was playing on the road against a team in a must-win situation with a very tough defense. Plus, Ryan didn't have the benefit of a strong ground game, as Michael Turner had just 58 yards on 17 carries. Ryan was also missing starting left tackle Sam Baker. ",
            "5": "Almost half of Ryan's yardage went to Roddy White, who caught eight balls for 113 yards and two scores. I'll be shocked if White doesn't get voted into the Pro Bowl. ",
            "6": "As for the veteran quarterback, Donovan McNabb began the game very poorly, terribly overthrowing four receivers and nearly throwing a pick to Chris Houston in the first 22 minutes. McNabb settled down and finished 19-of-34 for 253 yards. ",
            "7": "While DeSean Jackson and Kevin Curtis caught three balls each, the star of show was Brian Westbrook, who torched the Falcons for 167 rushing yards, 42 receiving yards and two touchdowns. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "9"
        },
        "comments": {
            "amount": "4",
            "1": "Jeff Garcia's numbers will tell you that he moved the chains effectively throughout the game (27-of-43 for 227 yards) but couldn't get the job done in the red zone (no touchdowns). As Matt McGuire will tell you, the Buccaneers' greatest problem is that they can't finish drives. Tampa Bay took three drives deep into Dallas territory in the first half. They had to settle for three field goal attempts. The Buccaneers barely have any play-makers on offense, so you can blame that for their red-zone ineptness. This problem killed the Buccaneers at the end of the game. Garcia took Tampa Bay 56 yards down the field, but stalled on fourth-and-five at Dallas' 18. ",
            "2": "Why are the Buccaneers trying 51-yard field goals with Matt Bryant? I know Bryant is a nice, selfless guy who just went through a tragedy, and I'll probably burn for my entire afterlife for criticizing him, but he has absolutely no leg strength. Eagles fans may remember his game-winning 63-yard field goal, but Bryant hasn't made another 50-yarder since 2005. ",
            "3": "Save for Marion Barber (100 total yards), no skill-position player really did much in this game. Antonio Bryant led the Buccaneers in receiving with six catches for 45 yards. Earnest Graham rushed for only 42 yards on 17 carries. Meanwhile, Terrell Owens led all Dallas wideouts with five grabs for 33 yards. Jason Witten caught only one pass because he hurt his ribs and had to leave the game early. ",
            "4": "Brad Johnson commanded the team to victory. Barely. Johnson was 19-of-33 for 122 yards and a score, giving him a brutal, Ryan Fitzpatrick-like YPA of 3.7. He missed wide-open receivers and nearly threw some picks. Dallas benefited from numerous Tampa Bay penalties; they were whistled for four of them on the Cowboys' sole touchdown drive. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "How did the Cardinals lose this game? More importantly, how did they not cover? They had leads of 10-0, 17-3 and 23-17. I'm disgusted. Here's how: 1. Edgerrin James fumbled the ball in the third quarter. Carolina scored a touchdown on the next play (Ugh, why is James still starting? Where is Tim Hightower?) 2. Kurt Warner threw a pick in the red zone, which was J.J. Arrington's fault, as he couldn't hold on to Warner's pass (Paging Mr. Hightower! Paging Mr. Hightower!) 3. Arizona missed an extra point (thanks to a botched hold), which would have made the score 27-24 - much better than 27-23 - if you know what I mean (Can Hightower hold too?) ",
            "2": "Speaking of Hightower, he gained just three yards on six carries, but most of his rushes were in short-yardage situations. He also scored a touchdown. As for James, the old man tallied only 17 yards on seven rushes. ",
            "3": "Taking away Kurt Warner's interception (wasn't his fault), the veteran quarterback was nearly perfect. He was 35-of-49, 381 yards and two touchdowns. His only mistake was a fumble. ",
            "4": "Warner made good use of his three dynamic receivers; Steve Breaston (91 yards) and Anquan Boldin (63 yards and two touchdowns) each caught nine passes. It was amazing that Boldin was able to be so productive, as he was playing with about 50,000 plates in his head. Larry Fitzgerald chipped in with seven catches and 115 yards. ",
            "5": "Jake Delhomme was also impressive, torching Arizona's secondary on 20-of-28 passing, 248 yards and two scores. The Cardinals couldn't solve Steve Smith, who grabbed five balls for 117 yards and a pair of touchdowns. ",
            "6": "To the chagrin of his fantasy owners, Jonathan Stewart took a backseat to DeAngelo Williams this week. Stewart totaled a mere 10 yards on eight rushes, while Williams collected 108 yards and a touchdown on 17 attempts. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Saints",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "32"
        },
        "comments": {
            "amount": "5",
            "1": "I'm glad the local blokes across the pond were treated to a good game for a change. They had to sit through a 13-10 Giants-Dolphins slop-fest, but the NFL did a great job ensuring that a British crowd of 83,226 got to see a pair of explosive offenses. ",
            "2": "Delving into the numbers, the two quarterbacks combined for 680 passing yards and six touchdowns. Neither was sacked. Each had three scores. Philip Rivers was 25-of-40 for 341 yards and a tipped interception, while Brees was 30-of-41 for 339 yards. Brees also sprayed shaving cream all over Rivers' locker for taking his job with the Chargers. Hey, playing for the Saints is nice, but you can't beat living in San Diego. ",
            "3": "Despite those gaudy numbers, no receiver had more than 96 yards. Lance Moore, Devery Henderson, Mark Campbell, Vincent Jackson, Antonio Gates and LaDainian Tomlinson each caught a touchdown. ",
            "4": "Speaking of Tomlinson, the All-Pro runner gained 105 rushing yards, 65 receiving yards and the aforementioned score. Guess he's not over-the-hill just yet, huh? ",
            "5": "Without Reggie Bush, Deuce McAllister received all the work. McAllister compiled 55 yards and a touchdown on 18 carries. Don't get excited, Saints fans. McAllister is due for another injury or a steroids-related suspension any day now. I'm not sure which one will come first. '); "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "9"
        },
        "comments": {
            "amount": "4",
            "1": "Jeff Garcia's numbers will tell you that he moved the chains effectively throughout the game (27-of-43 for 227 yards) but couldn't get the job done in the red zone (no touchdowns). As Matt McGuire will tell you, the Buccaneers' greatest problem is that they can't finish drives. Tampa Bay took three drives deep into Dallas territory in the first half. They had to settle for three field goal attempts. The Buccaneers barely have any play-makers on offense, so you can blame that for their red-zone ineptness. This problem killed the Buccaneers at the end of the game. Garcia took Tampa Bay 56 yards down the field, but stalled on fourth-and-five at Dallas' 18. ",
            "2": "Why are the Buccaneers trying 51-yard field goals with Matt Bryant? I know Bryant is a nice, selfless guy who just went through a tragedy, and I'll probably burn for my entire afterlife for criticizing him, but he has absolutely no leg strength. Eagles fans may remember his game-winning 63-yard field goal, but Bryant hasn't made another 50-yarder since 2005. ",
            "3": "Save for Marion Barber (100 total yards), no skill-position player really did much in this game. Antonio Bryant led the Buccaneers in receiving with six catches for 45 yards. Earnest Graham rushed for only 42 yards on 17 carries. Meanwhile, Terrell Owens led all Dallas wideouts with five grabs for 33 yards. Jason Witten caught only one pass because he hurt his ribs and had to leave the game early. ",
            "4": "Brad Johnson commanded the team to victory. Barely. Johnson was 19-of-33 for 122 yards and a score, giving him a brutal, Ryan Fitzpatrick-like YPA of 3.7. He missed wide-open receivers and nearly threw some picks. Dallas benefited from numerous Tampa Bay penalties; they were whistled for four of them on the Cowboys' sole touchdown drive. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "How did the Cardinals lose this game? More importantly, how did they not cover? They had leads of 10-0, 17-3 and 23-17. I'm disgusted. Here's how: 1. Edgerrin James fumbled the ball in the third quarter. Carolina scored a touchdown on the next play (Ugh, why is James still starting? Where is Tim Hightower?) 2. Kurt Warner threw a pick in the red zone, which was J.J. Arrington's fault, as he couldn't hold on to Warner's pass (Paging Mr. Hightower! Paging Mr. Hightower!) 3. Arizona missed an extra point (thanks to a botched hold), which would have made the score 27-24 - much better than 27-23 - if you know what I mean (Can Hightower hold too?) ",
            "2": "Speaking of Hightower, he gained just three yards on six carries, but most of his rushes were in short-yardage situations. He also scored a touchdown. As for James, the old man tallied only 17 yards on seven rushes. ",
            "3": "Taking away Kurt Warner's interception (wasn't his fault), the veteran quarterback was nearly perfect. He was 35-of-49, 381 yards and two touchdowns. His only mistake was a fumble. ",
            "4": "Warner made good use of his three dynamic receivers; Steve Breaston (91 yards) and Anquan Boldin (63 yards and two touchdowns) each caught nine passes. It was amazing that Boldin was able to be so productive, as he was playing with about 50,000 plates in his head. Larry Fitzgerald chipped in with seven catches and 115 yards. ",
            "5": "Jake Delhomme was also impressive, torching Arizona's secondary on 20-of-28 passing, 248 yards and two scores. The Cardinals couldn't solve Steve Smith, who grabbed five balls for 117 yards and a pair of touchdowns. ",
            "6": "To the chagrin of his fantasy owners, Jonathan Stewart took a backseat to DeAngelo Williams this week. Stewart totaled a mere 10 yards on eight rushes, while Williams collected 108 yards and a touchdown on 17 attempts. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Saints",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "32"
        },
        "comments": {
            "amount": "5",
            "1": "I'm glad the local blokes across the pond were treated to a good game for a change. They had to sit through a 13-10 Giants-Dolphins slop-fest, but the NFL did a great job ensuring that a British crowd of 83,226 got to see a pair of explosive offenses. ",
            "2": "Delving into the numbers, the two quarterbacks combined for 680 passing yards and six touchdowns. Neither was sacked. Each had three scores. Philip Rivers was 25-of-40 for 341 yards and a tipped interception, while Brees was 30-of-41 for 339 yards. Brees also sprayed shaving cream all over Rivers' locker for taking his job with the Chargers. Hey, playing for the Saints is nice, but you can't beat living in San Diego. ",
            "3": "Despite those gaudy numbers, no receiver had more than 96 yards. Lance Moore, Devery Henderson, Mark Campbell, Vincent Jackson, Antonio Gates and LaDainian Tomlinson each caught a touchdown. ",
            "4": "Speaking of Tomlinson, the All-Pro runner gained 105 rushing yards, 65 receiving yards and the aforementioned score. Guess he's not over-the-hill just yet, huh? ",
            "5": "Without Reggie Bush, Deuce McAllister received all the work. McAllister compiled 55 yards and a touchdown on 18 carries. Don't get excited, Saints fans. McAllister is due for another injury or a steroids-related suspension any day now. I'm not sure which one will come first. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "So, how bad is New England's defense? If allowing 301 yards and a touchdown to Marc Bulger wasn't enough (on 18-of-34 passing), the secondary couldn't contain rookie Donnie Avery, who caught six passes for 163 yards. The 69-yard Bulger-to-Avery touchdown was Bulger's longest score of his career. ",
            "2": "Oh, but the Patriots can't stop the run either. No Steven Jackson? Still a huge problem. Antonio Pittman tallied 83 yards on just 19 rushes. ",
            "3": "Two bright spots for New England's old, decrepit defense: They got to Bulger four times (not a hard thing, as St. Louis has an abysmal offensive line) and Deltha O'Neal came up with a key interception deep in his own territory at the end of the game. ",
            "4": "While New England's stop unit continues to be mediocre, it was the same old, same old for Matt Cassel, who failed to throw a pass longer than 30 yards. The noodle-armed Cassel went 21-of-33, 267 yards, one touchdown and two picks. ",
            "5": "Cassel located Randy Moss and Wes Welker seven times each. The two gained 102 and 79 yards, respectively. Moss became the 19th player in NFL history to eclipse the 800-reception mark. ",
            "6": "I discussed New England's putrid defense; the Rams couldn't come up big when it counted most, but on the bright side, Chris Long registered two sacks, bringing his total to four. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "When Rudi Johnson scored the opening touchdown of the game, it marked the first time the Lions have scored in the first quarter this season! It was also Detroit's first lead of the year! Hooray! ",
            "2": "When the Lions kicked a field goal to extend their lead to 10-3, I wondered if I could say that they were running up the score. As Chris Berman would declare on the old NFL Primetime, Frisky Lions! Courageous Lions! I want courage! I want courrrrage! ",
            "3": "Unfortunately, Detroit never made it to the Wizard. They eventually relinquished their lead - they held a 10-9 advantage late in the third quarter - and lost by eight. Of course, Washington had to kick that last field goal to screw me. Thanks a lot, jerks! ",
            "4": "But hey... I can't blame the Redskins for being too good for the crappy Lions. Detroit converted just 2-of-12 third-down opportunities and punted on every single possession in the third quarter. ",
            "5": "I don't know why Dan Orlovsky didn't go to Calvin Johnson more. Actually, I do know why - terrible arm strength and accuracy - but let's pretend that I'm clueless so I can keep complaining. Megatron caught four balls for 57 yards and a touchdown. Johnson also hurt his back from carrying the team. ",
            "6": "Rudi Johnson had twice as many carries (8) as Kevin Smith did (4). Neither did much. Johnson tallied 21 yards in addition to his aforementioned touchdown. Smith had just 12 yards. ",
            "7": "Washington's numbers were obviously much more impressive. Jason Campbell was 23-of-28 for 328 yards and a score. Campbell still has no interceptions on the year, which is a remarkable feat. ",
            "8": "Making Campbell's life easier, Santana Moss, whom Keyshawn Johnson called the best receiver in the NFL, caught nine passes for 140 yards and Campbell's only score. Chris Cooley chipped in with six grabs and 74 yards. ",
            "9": "Meanwhile, Clinton Portis abused yet another front seven; the NFL's leading rusher gained 126 yards on 24 carries. He left the game early with what looked like a minor injury. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Texans",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "If the Colts lose to the Titans on Monday night, the Texans, now 3-4, will be tied for second place (or last place, if your glass is half-debacled.) It's a shame because Houston would be 4-3 right now if Sage Rosenchoker didn't ruin a possible victory against Indianapolis. ",
            "2": "Speaking of debacled, how bad are the Bengals? They've been terrible in the pre-Marvin Lewis era this decade, but the last time they were 0-8 was in 1994. I know Carson Palmer is out, but they should have a win, right? ",
            "3": "The sorry Bengals had no answer for Houston's dynamic aerial attack. Matt Schaub was nearly perfect, going 24-of-28 for 280 yards and three touchdowns. Two of Schaub's scores went to Kevin Walter, who grabbed five balls for 70 yards. ",
            "4": "Andre Johnson didn't score a touchdown, but he collected 11 receptions for 143 yards. In the month of October, Johnson totaled 41 catches, 593 yards and two scores. ",
            "5": "As you would expect, nothing but mediocrity and futility from Cincinnati's offense. Ryan Fitzpatrick tossed two picks and fumbled once. Cedric Benson gained 49 yards on 13 carries. Chris Perry didn't rush the ball at all. T.J. Houshmandzadeh led all Bengals receivers with eight receptions and 54 yards. Chad Ocho Cinco grabbed five passes for 44 yards. Ocho Cinco now has at least one reception in 100 straight games. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Browns",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Like the Lions, the Browns broke a futile first-quarter streak of their own. When Derek Anderson found Donte' Stallworth in the end zone 12 minutes into the game, it marked the first time Cleveland scored a first-quarter touchdown all year. ",
            "2": "Anderson finished 14-of-27 for 246 yards and that touchdown. Stallworth (13 yards) and Steve Heiden (73) were the only Browns targets who had more than two receptions. Braylon Edwards had two grabs for 64 yards. ",
            "3": "Jamal Lewis gained more than four yards per carry, totaling 81 yards and a score on 20 rushes. However, Lewis still hasn't eclipsed the century mark in any game this season. ",
            "4": "Still, Lewis vastly out-gained the combined efforts of Maurice Jones-Drew and Fred Taylor. They gained 29 and 24 yards, respectively. Neither found the end zone. ",
            "5": "David Garrard made up for his non-existent running game, going 25-of-42, 283 yards and two touchdowns. Matt Jones had an impressive performance, registering eight receptions, 117 yards and one of those scores. ",
            "6": "If you're looking for a hero for the Browns, check out this sequence from Shaun Rogers. The nose tackle had a huge stuff on Jones-Drew on a third-and-three in the fourth quarter. On the next play, he blocked a Josh Scobee 38-yard field goal that would have tied the game at the time. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Giants",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Not exactly Ben Roethlisberger's best performance. Roethlisberger completed less than 50 percent of his passes (13-of-29), threw for just 189 yards, fumbled once, and tossed way more picks (four) than touchdowns (one). ",
            "2": "Don't blame Roethlisberger though; his offensive line was completely destroyed by New York's dynamic pass rush. The Giants registered only five sacks (Mathias Kiwanuka had three) but Roethlisberger was pressured on almost every single play. ",
            "3": "Because of Roethlisberger's struggles, no Steeler receiver had more than three catches. Hines Ward (30 yards), Heath Miller (52) and Limas Sweed (28) all matched that figure. Santonio Holmes did not play. ",
            "4": "Mewelde Moore looked more impressive than anyone else on Pittsburgh's offense; Moore collected 84 yards and a touchdown on 19 carries versus New York's imposing front seven. ",
            "5": "Eli Manning had just 10 more passing yards and just as many touchdowns as Roethlisberger, but completed 19-of-32 attempts. Manning also refrained from fumbling and throwing picks. No skill-position player on the Giants had more than 50 yards, including Plaxico Burress (three catches, 15 yards) and Brandon Jacobs (18 carries, 47 yards). Jacobs was stuffed twice on the goal line. ",
            "6": "A bizarre sequence of events: The Giants, down 14-9, decided to go for it on fourth-and-one in Pittsburgh territory with 10 minutes remaining in regulation. New York, coming off a timeout, had confusion at the line of scrimmage. Because you can't call two consecutive timeouts, the Giants were whistled for a delay-of-game. Instead of punting it away on fourth-and-six at Pittsburgh's 34, Manning found Amani Toomer 30 yards downfield. New York eventually kicked a field goal. Following Pittsburgh's ensuing three-and-out, backup long-snapper James Harrison, replacing injured starter Greg Warren, snapped the ball over the punter's head, resulting in a safety. The Giants scored the decisive touchdown on the next drive. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "34"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "I loved the Seahawks this week. I had five units on them on my NFL Picks page. The reason: YOU DON'T MAKE A COACHING CHANGE SIX DAYS BEFORE A GAME!!! Can I make that any more clear? How was Mike Singletary supposed to game plan for this contest when he was busy trying to figure out who would assume all the responsibilities? Firing a coach works only during the bye week. Not six days prior to a game! The 49ers are so inept they can't even fire someone correctly! ",
            "2": "That said, I liked what I saw out of Singletary, even though he made a bone-headed decision late in the first half. Down 13-3, the 49ers had a fourth-and-four on Seattle's 29 with 40 seconds remaining. A field goal would have made sense. Nope. Singletary went for it, only to see J.T. O'Sullivan throw a pick-six. That pretty much iced the game for Seattle. ",
            "3": "Speaking of ESPN's Super Duper Fantasy Sleeper, O'Sullivan went 13-of-21, 131 yards, two fumbles and the aforementioned pick-six. He was benched in the second half in favor of Shaun Hill, who was 15-of-23, 173 yards and a touchdown. ",
            "4": "That wasn't the only change Singletary made. When first-round bust extraordinaire Vernon Davis walked off the field nonchalantly after commiting a senseless personal foul, Singletary chewed him out and then ordered him off the field and into the locker room. Singletary said that Davis would be more of use to him in the shower than on the field. I have to agree, though Davis' hands are so bad he's a candidate to bobble his bar of soap in the shower, resulting in a pretty awkward situation. ",
            "5": "A great quote from Singletary, speaking of Davis' attitude: I would rather play with 10 people ... rather than play with 11 when that person is not sold out to be part of this team. Bravo. If Davis doesn't turn his attitude around quickly, the 49ers should cut their losses so that he can go ruin another organization. ",
            "6": "Moving on, Seneca Wallace was predictably much better than he played last Sunday night at Tampa Bay, going 15-of-25, 222 yards and two scores. Wallace was sharp without much of a running game; Maurice Morris gained 16 yards on 11 carries, while Julius Jones managed only nine yards on six rushes. T.J. Duckett found the end zone, but totaled a laughable one yard on eight attempts. ",
            "7": "At the beginning of the year... Odds on first Seattle player to top 100 receiving yards in a single game: 2:1 - Bobby Engram 3:1 - Nate Burleson 8:1 - Ben Obomanu 20:1 - Courtney Taylor 30:1 - John Carlson Eleventy billion:1 - Leonard Weaver. Weaver somehow scored two receiving touchdowns (62, 43), totaling 116 yards on four grabs. For those of you who just won eleventy billion, congratulations. Once that number actually exists, you'll be rich. "
        }
    },
    "numberOfGames": "16"
}