{
    "year": "2008",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "When you handicap a game perfectly and watch the unbelievable happen, it can be tough. When it happens a few times a season, it's sickening. And when it happens as much as it has occurred to me this year, it's time to keep the car running in the garage. You're not supposed to lose picks when your 6-point dog has a 14-0 lead and a fourth-quarter advantage. Then again, I took a 9-point dog and watched them blow a cover despite leading 17-0... ",
            "2": "Things began perfectly for the Jaguars. They drove down the field on their opening possession, forced Indianapolis to punt after six downs, and then engineered a dominant, 17-play, 93-yard drive spanning nine minutes and 30 seconds. The look on the Colts' faces was priceless. It was pretty much, Who are these guys? I thought they were supposed to suck! The Jaguars do suck... It's just that they hate the Colts with a passion, so they decided to try for the first time in weeks. Well, it showed. Indianapolis controlled the ball for 4:47 of the first 18:23, running only those six plays compared to Jacksonville's 25. ",
            "3": "Well, it's a good thing the Colts have one of the best quarterbacks in NFL history under center. Peyton Manning was masterful, completing all 13 of his passes in the first half. In fact, he began the contest 17-of-17, finally misfiring because his receiver ran the wrong route. Manning finished 29-of-34 for 364 yards and three touchdowns. ",
            "4": "David Garrard put up great numbers (28-of-41, 329 yards, 1 pass TD, 1 rush TD, 1 INT), but made way too many critical errors down the stretch. The obvious one is the pick-six he launched when the game was tied at 24, which was part of the horrifying events that transpired in this week's bad beat. The others include: taking two crucial sacks instead of throwing the ball away on the final drives; not being set when the official started the clock following a 10-second run-off after Maurice Jones-Drew injured his knee; and missing a wide-open Troy Williamson in the end zone on what would have been the tying score. ",
            "5": "As for Jones-Drew, all indications are that he'll be OK. MJD rushed for 91 yards and caught seven balls for 71 more yards. He didn't reach the end zone to the chagrin of his fantasy owners. ",
            "6": "Dennis Northcutt debacled the opposing secondary for the second game in a row. Northcutt caught eight balls for 101 yards and a score. ",
            "7": "Meanwhile, solid stats all around for the Colts, save for Anthony Gonzalez (four catches, 38 yards). Reggie Wayne led the squad in yardage with 108 and a touchdown on seven catches. Dallas Clark paced the team in grabs with eight for 105 and a score. ",
            "8": "Dominic Rhodes couldn't do much on the ground (14 carries, 27 yards), but he chipped in with six receptions for 62 receiving yards and an aerial score. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "It looked like everything was going to go Dallas' way after Joe Flacco fumbled the ball away on his first possession, giving the Cowboys a touchdown a few plays later. Dallas took a 7-0 lead, and it appeared as though Flacco was going to melt down in a big road game. Apparently not. Tony Romo was the one who choked, living up to his nickname of Aurora Snowmo. ",
            "2": "Snowmo finished the contest 24-of-45 for 252 yards and two touchdowns, but those numbers were pretty artificial; Snowmo compiled that yardage and the two scores in a pair of futile drives in the fourth quarter. At one point in this contest, Snowmo was 13-of-25 for 90 yards, two picks and a fumble. This was yet another instance of Snowmo coming up small in December. I still don't understand how he beat the Giants. I know the defense stepped up, but Snowmo actually looked decent in that contest. He was dreadful on Saturday night until it was clear that the game was out of hand, enabling Snowmo to exit out of choke mode. ",
            "3": "Excluding Snowmo's follies, the biggest difference in this contest was the coaching mismatch. If you couldn't tell that by the penalty difference (Baltimore three for 19 yards; Dallas 10 for 86 yards), how about the fake field goal Baltimore ran in the second half? John Harbugh caught the feeble Wade Phillips completely off guard. Later, when Phillips should have kicked onside, Harbaugh called a timeout prior to the kickoff, but not before Nick Folk sailed the attempt deep. This gave the Ravens an idea of what Phillips was planning to do. And despite the extra chance to call for an onside attempt, Phillips elected to relinquish possession, which epically failed because LeRon McClain broke free for an 82-yard touchdown run on Baltimore's first play. This eclipsed the Ravens' previous offensive play - a 77-yard Willis McGahee scamper. ",
            "4": "McClain (22 carries, 139 yards, TD) and McGahee (8 carries, 108 yards, TD) weren't the whole story on offense. Joe Flacco's numbers weren't spectacular - 17-of-25 for 149 yards and a touchdown - but made clutch throws, allowing the Ravens to keep drives alive. Romo had nearly double the yardage, but Flacco was infinitely better. ",
            "5": "Flacco found Derrick Mason six times for 66 yards and a touchdown. Mason was heroic, leaving the game thrice because of a shoulder injury. ",
            "6": "Meanwhile, Terrell Owens and Jason Witten each caught five balls. Owens for 63 yards and a touchdown; Witten for 87 yards and a score. ",
            "7": "It seemed like the only player who showed up for the Cowboys was Tashard Choice, who rushed for 90 yards and caught seven passes for 25 more yards. He also scored the team's opening touchdown. One can only speculate that Snowmo's choking tactics haven't rubbed off on the rookie runner. At least not yet. ",
            "8": "<b> Playoff Implications: </b> The Ravens are pretty much set. All they need is a victory over lowly Jacksonville at home next week, and they'll have the No. 6 seed locked up. The Cowboys, meanwhile, are in trouble. They need to beat the Eagles, and also have to hope the Falcons and Buccaneers each lose once. ",
            "9": "<b> Chasing Michael Strahan: </b> DeMarcus Ware now has 20 sacks on the year, putting him 2.5 short of Michael Strahan's single-season record. Ware sacked next week's opponent, Donovan McNabb, once in a Week 2 battle. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "31"
        },
        "comments": {
            "amount": "6",
            "1": "Another day, another bad beat. This wasn't as brutal as Indianapolis-Jacksonville, but as four-point underdogs, the Chiefs led 31-24 in the middle of the third quarter. However, the Chiefs, a very young team, always find a way to screw up. I was just hoping it wouldn't be by more than four points. So much for that. Thanks to a Tyler Thigpen interception on the Miami 6-yard line and an ensuing 13-play, 85-yard touchdown drive spanning 8:33, the Dolphins were allowed to cover. Maybe I should try to drown myself instead of running the car in the garage. I would imagine that would be more painful. ",
            "2": "Thigpen put together a great fantasy day, but tossed three picks. Otherwise, Thigpen was 20-of-41 for 320 yards, two passing touchdowns and a rushing score. ",
            "3": "To the chagrin of Dwayne Bowe fantasy owners, including myself, Thigpen hooked up with his No. 1 wideout just three times for 28 yards. Tony Gonzalez, meanwhile, caught seven balls for 64 yards and a touchdown. Running back Jamaal Charles paced the team in receiving yards with 102, thanks to a 75-yard burst. ",
            "4": "Larry Johnson, meanwhile, rushed for 108 yards and a touchdown on 12 carries, which is surprising because Miami is decent versus the run. ",
            "5": "As for the Dolphins backs, both Ricky Williams and Ronnie Brown failed to eclipse the 35-yard rushing barrier. Patrick Cobbs actually led the team with 44 yards on the ground, though all of that came on one play. ",
            "6": "Despite not having a potent rushing attack by his side, Chad Pennington was very efficient, going 26-of-34 for 235 yards, three touchdowns and a pick. Pennington found Davone Bess (57 yards) and Williams (50 yards) six times each. Anthony Fasano caught two of his scores. David Martin had the third. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Saints",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "I thought it was pretty classless of the Saints to completely debacle the Lions in this contest. New Orleans was eliminated from the playoffs last week, so it had nothing to play for. The honorable thing to do would have been to allow their colleagues to win their first game of the year to avoid eternal embarrassment and humiliation. Instead, Sean Payton had his troops ready to destroy the pitiful, flu-stricken Lions. Payton even challenged a Lions takeaway in the second quarter. Have fun with your eighth win, Sean. ",
            "2": "With that in mind, the Lions didn't really give themselves a chance. They allowed the Saints to convert an amazing 11-of-12 third downs (the only one they didn't get was on a kneel down). And a 43-yard Calvin Johnson touchdown in the first quarter was nullified by a Gosder Cherilus illegal motion. The next play was an interception. ",
            "3": "Aside from not allowing the Lions to win, Payton refused to bench Drew Brees, even when the score was 42-7 late in the fourth quarter. Payton continued to call pass plays, embarrassing a team facing the worst type of humiliation possible. Brees consequently was 30-of-40 for 351 yards and two touchdowns. ",
            "4": "Brees found Colston nine times for 99 yards and two touchdowns. Jeremy Shockey (5 catches, 37 yards) and Lance Moore (4 catches, 36 yards) disappointed. ",
            "5": "Pierre Thomas owners had to be pretty pissed off that Deuce McAllister robbed them of nine rushes and a score. However, the Frenchman was still able to tally 93 total yards and a touchdown. ",
            "6": "The leading rusher in this contest was Kevin Smith, who compiled 111 yards and a score on 24 carries. Meanwhile, Calvin Johnson had just four grabs for 64 yards. ",
            "7": "The Lions have become the first 0-15 team in NFL history. They have a chance to make history when they travel to Lambeau Field next week. ",
            "8": "Brees, meanwhile, needs 402 yards to eclipse Dan Marino's single-season record for passing yards. Brees has thrown for at least that amount twice this season. He'll have to do so against the Panthers, unfortunately. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "0"
        },
        "comments": {
            "amount": "4",
            "1": "What a thrilling game. The excitement kicked off with a Leon Hall pick-six in the first quarter. In the second quarter, Ryan Fitzpatrick tossed a 20-yard strike to Chris Henry. And... uhh... that was it for the scoring. ",
            "2": "When I say that Cedric Benson was the entire offense for the Bengals, I'm not exaggerating. Benson rushed for 171 yards. The rest of Cincinnati's scoring attack managed just 75 total yards. Chad Ocho Cinco was inactive, while T.J. Houshmandzadeh didn't catch any passes. You can't blame him because Fitzpatrick completed only five passes on just nine attempts. ",
            "3": "As for the Browns, Jamal Lewis actually wasn't terrible for a change; he rushed for 76 yards on 16 attempts. The problem was the quarterback situation. Ken Dorsey was 10-of-17 for 68 yards and three interceptions, including the aforementioned pick-six. Once the Browns coaching staff figured out that Dorsey was drunk, Bruce Gradkowski tossed another pick in the fourth quarter. ",
            "4": "Despite the 14-0 loss, the Browns were the real winners here. Their draft positioning has improved, so they'll be in even better shape once Brady Quinn returns. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "R.I.P. 2008 Tampa Bay Buccaneers. At 9-3, the Bucs were considered a lock to make the postseason. Three losses later, they need a miracle to make the Doggone Playoff. But wait! Tampa Bay still has life because the terrible Eagles choked their opportunity away with a loss to the Redskins. With a win and a Dallas loss, the Buccaneers will make the postseason. ",
            "2": "The Buccaneers run defense was pretty much responsible for their losses to Carolina and Atlanta, so it was surprising to see the secondary get shredded by Philip Rivers. Rivers was on fire, finishing 21-of-31 for 287 yards and four touchdowns. Thanks to Rivers' heroics, San Diego put up more points against Tampa Bay than any other team since 1999, though seven of the 41 came on a pick-six. The Chargers' victory gave the Buccaneers their first home loss of the year. ",
            "3": "Vincent Jackson torched Tampa Bay, catching seven balls for 111 yards. Antonio Gates, meanwhile, caught four passes for 43 yards and two touchdowns. ",
            "4": "LaDainian Tomlinson wasn't as impressive, rushing for 90 yards on 21 carries. ",
            "5": "Meanwhile, Jeff Garcia led the Buccaneers in rushing with 45 yards, which is never a good sign. Garcia had two touchdowns (one rushing, one passing) along with 232 passing yards, but he was responsible for two interceptions. ",
            "6": "As you would guess, neither Cadillac Williams (27 yards) nor Warrick Dunn (20 yards) performed well. In fact, the only Tampa Bay skill player to do anything was Antonio Bryant, who grabbed six balls for 127 yards and a touchdown. Unfortunately, Bryant committed the squad's third turnover. San Diego didn't give the ball away. ",
            "7": "There's a good chance that this pretty much spells the end for Tampa Bay. That's probably not a terrible thing, as the team didn't have much of a playoff ceiling because of Garcia's noodle arm. ",
            "8": "As for the Chargers, they'll win the AFC West if they can beat Denver at home next week. <div class=dfpAdSlots> '); "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "R.I.P. 2008 Tampa Bay Buccaneers. At 9-3, the Bucs were considered a lock to make the postseason. Three losses later, they need a miracle to make the Doggone Playoff. But wait! Tampa Bay still has life because the terrible Eagles choked their opportunity away with a loss to the Redskins. With a win and a Dallas loss, the Buccaneers will make the postseason. ",
            "2": "The Buccaneers run defense was pretty much responsible for their losses to Carolina and Atlanta, so it was surprising to see the secondary get shredded by Philip Rivers. Rivers was on fire, finishing 21-of-31 for 287 yards and four touchdowns. Thanks to Rivers' heroics, San Diego put up more points against Tampa Bay than any other team since 1999, though seven of the 41 came on a pick-six. The Chargers' victory gave the Buccaneers their first home loss of the year. ",
            "3": "Vincent Jackson torched Tampa Bay, catching seven balls for 111 yards. Antonio Gates, meanwhile, caught four passes for 43 yards and two touchdowns. ",
            "4": "LaDainian Tomlinson wasn't as impressive, rushing for 90 yards on 21 carries. ",
            "5": "Meanwhile, Jeff Garcia led the Buccaneers in rushing with 45 yards, which is never a good sign. Garcia had two touchdowns (one rushing, one passing) along with 232 passing yards, but he was responsible for two interceptions. ",
            "6": "As you would guess, neither Cadillac Williams (27 yards) nor Warrick Dunn (20 yards) performed well. In fact, the only Tampa Bay skill player to do anything was Antonio Bryant, who grabbed six balls for 127 yards and a touchdown. Unfortunately, Bryant committed the squad's third turnover. San Diego didn't give the ball away. ",
            "7": "There's a good chance that this pretty much spells the end for Tampa Bay. That's probably not a terrible thing, as the team didn't have much of a playoff ceiling because of Garcia's noodle arm. ",
            "8": "As for the Chargers, they'll win the AFC West if they can beat Denver at home next week. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "49ers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "Though the 49ers won this game, they should be ashamed of themselves. Until there was 4:08 left in regulation, the Rams led 16-3. How San Francisco let this happen is beyond me. Isaac Bruce helped spark a predictable 4-minute comeback by catching one of Shaun Hill's two touchdown passes. In this game, Bruce caught his 1,000th career reception, becoming the fifth player to do so. Bruce also passed Tim Brown for second on the NFL's career receiving yards list. Bruce led the 49ers with seven receptions, 61 yards and the score. Josh Morgan, who caught Hill's other touchdown, managed two receptions and 55 yards. ",
            "2": "As for Hill, he threw for 216 yards and the pair of aforementioned scores, but tossed three picks and fumbled once. Apparently, J.T. O'Sullivan kidnapped Hill and put on his uniform. ",
            "3": "DeShaun Foster, playing for the injured Frank Gore, rushed for 36 yards on 12 carries. He also caught two passes, disappointing all the fantasy players who inserted him into their lineup. ",
            "4": "Steven Jackson rushed for 108 yards on 32 carries. ",
            "5": "Marc Bulger, meanwhile, inexplicably had just one turnover. He was 19-of-36 for 227 yards, one touchdown and a pick. Bulger went to Donnie Avery five times for 56 yards. Torry Holt, meanwhile, grabbed four balls for 55 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Titans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Albert Haynesworth? Kyle Vanden Bosch? Who needs 'em? Rookie defensive tackle Jason Jones stepped in for Haynesworth despite weighing just 275 pounds, and accumulated five tackles, 3.5 sacks and three forced fumbles. Jones helped the Titans beat the Steelers, and secure homefield advantage throughout the playoffs. ",
            "2": "While the final score would say otherwise, this contest could have gone either way. Until a late pick-six, the Titans held a 24-14 advantage. Back in the first quarter, Ben Roethlisberger fumbled on Tennessee's 1-yard line. And in the second quarter, he fumbled again in Titans territory. In total, Pittsburgh had four turnovers, all by Roethlisberger. Tennessee had none. ",
            "3": "That said, Big Ben had a solid fantasy performance. He was 26-of-40 for 331 yards and two touchdowns, along with two picks and the aforementioned fumbles. Hines Ward (7 catches, 109 yards) and Santonio Holmes (5 catches, 93 yards) were the recipients of Roethlisberger's scores. ",
            "4": "Despite not having Haynesworth in the middle, Willie Parker couldn't do anything, rushing for 29 yards on 18 carries. ",
            "5": "Meanwhile, Tennessee had plenty of success versus Pittsburgh's No. 1 ground defense. Chris Johnson had 69 yards and a touchdown on 16 carries. LenDale White devoured 48 yards and a score on 15 rushes. ",
            "6": "The one bright spot for the Steelers on this day was that James Harrison registered his 16th sack, setting a Steelers franchise record. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Because the Cardinals didn't show up, I'm almost tempted to mail this in and not compile a write-up for this game. But those guys are losers, and I'm not going to stoop down to their level. ",
            "2": "Some glaring numbers to tell you how this game went: - After the first quarter, LaMont Jordan had more touchdowns (2) than Kurt Warner had completions (0). - Arizona's initial first down came three minutes into the second quarter. - New England had three players with at least as many rushing yards as Arizona's top rusher. - Kurt Warner was 6-of-18 for 30 yards. Matt Cassel had more pass attempts (36) than Warner had yards! - The Patriots won the time-of-possession battle, 38:35 to 21:25. - New England was 8-of-16 on third down. Arizona was 3-of-13. - Arizona had minus-5 net yards in the first quarter. ",
            "3": "With Anquan Boldin out, Larry Fitzgerald was the only productive Cardinal. He caught three balls for 101 yards and a touchdown. ",
            "4": "As for the Patriot wideouts, Wes Welker (7 catches, 68 yards, TD), Randy Moss (2 catches, 87 yards, TD) and Jabar Gaffney (5 catches, 90 yards) were all solid. ",
            "5": "As you would imagine, Cassel's numbers were prolific - 20-of-36, 345 yards and three touchdowns - though most of that was off of short throws. Arizona just showed no interest in tackling. One has to wonder why the Cardinals didn't just concede the game to save themselves the effort of making the flight. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "Pop quiz, hot shot. You're down 11 with nine minutes left. You're stuck with fourth down inside opposing territory. What do you do? What do you do!? Unless you happen to be the worst coach in America, you know that a field goal would reduce the deficit to eight, which would make it a one-score game. I guess Gary Kubiak didn't get the memo. Not only did Kubiak go for it and fail, he also used a precious timeout beforehand. Kubiak has done a good job improving this Texans franchise, but he has also been responsible for a few questionable decisions like this all year. ",
            "2": "But Kubiak wasn't the only reason the Texans lost. Houston's defense was pathetic, allowing the Raiders to move the chains at will. Oakland converted 7-of-14 third downs, thanks to JaMarcus Russell, who was 18-of-25 for 236 yards and two touchdowns. ",
            "3": "Oakland's ground attack was also unstoppable; Justin Fargas and Darren McFadden combined for 139 rushing yards on 34 carries. ",
            "4": "McFadden led the Raiders in receptions with five (41 yards). Meanwhile, Zach Miller grabbed four balls for 70 yards. ",
            "5": "As for the Texans, Owen Daniels out-classed Miller as the premier tight end in this contest, catching seven passes for 111 yards. ",
            "6": "However, neither Andre Johnson (2 catches, 19 yards) nor Kevin Walter (2 catches, 17 yards) managed to do anything. Apparently, Nnamdi Asomugha cloned himself and covered both wideouts. ",
            "7": "Despite Johnson and Walter's struggles, Matt Schaub threw for 255 yards. Unfortunately for his fantasy owners, he failed to throw a touchdown. He launched a pick instead. ",
            "8": "Steve Slaton rushed for 66 yards, but also registered five receptions for 36 more yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "Despite all of Eric Mangini's research, the Jets couldn't find a way to win on the West Coast. Mangenius is now 0-4 out there. Every single team he lost to has a losing record. ",
            "2": "Speaking of which, Brett Favre now has three touchdowns, seven interceptions and three fumbles near the Pacific Ocean. He has also taken 13 of his 30 sacks on the West Coast. In total, Favre now has more picks (15) than touchdowns (9) since the Jets' Week 5 bye. ",
            "3": "As you can tell, Favre struggled in this contest. He was 18-of-31 for 187 yards and a pair of picks versus the defensively challenged Seahawks. You can't blame Favre for everything, however. Laveranues Coles had a ball fall out of his hands on fourth down of New York's penultimate drive. ",
            "4": "Coles caught five passes for 60 yards. Jerricho Cotchery paced the Jets with six receptions and 81 yards. Dustin Keller disappointed, grabbing just one ball for two yards. ",
            "5": "One has to wonder why Thomas Jones didn't get many opportunities. He rushed just 17 times for 67 yards, even though this was a one-score contest until the two-minute warning in the fourth quarter. ",
            "6": "The Seahawks, meanwhile, shot themselves in the foot repeatedly in the first half. They could have opened up an even larger lead, and they were fortunate that Brett Favre was an epic failure. Will Heller fumbled the ball away on a first-down conversion near the Jets' 35 in the second quarter. On the subsequent drive, Leonard Weaver fumbled at the Jets 5-yard line. Question: With John Carlson, Deion Branch, Bobby Engram and Maurice Morris, why the heck were the Seahawks utilizing bums like Heller and Weaver? Did they read the Brad Childress Coaching for Dummies book? ",
            "7": "Carlson (2 catches, 12 yards) caught the sole touchdown in this contest. Branch didn't do much (2 catches, 6 yards), while Engram made up for it with six receptions and 65 yards. ",
            "8": "While Seneca Wallace was 18-of-25 for 175 yards and a score, Maurice Morris was most impressive, rushing for 116 yards on 29 attempts versus one of the top run defenses in the league. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bills",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Epic fail. Choking. Complete debaclation. Capsizing. I don't know what word you want to use for Denver's uncanny collapse, but the Broncos will be playing for their playoff lives at San Diego next week. Th ",
            "2": "What's remarkable is that despite losing, the Broncos out-gained the Bills in net yardage, 532-275. Like I've been saying, the Broncos' offense is good enough to beat anyone, but their terrible defense is bad enough to lose to anyone. This was most apparent when the Bills had no receivers in their formation. Fred Jackson moved out of the backfield and ran past everyone downfield. Jackson did everything for the Bills, gaining 43 rushing yards and 70 receiving yards. He also had a touchdown. Marshawn Lynch, meanwhile, compiled 34 yards and a score. ",
            "3": "As for Trent Edwards, he finished 17-of-25 for 193 yards and a touchdown. Those aren't great numbers, but the most important figure was zero, as in zero turnovers. J.P. Zohan probably would have given the ball away three or four times. ",
            "4": "Edwards' top target was Josh Reed, who caught nine balls for 79 yards. Lee Evans, on the other hand, did nothing (2 catches, 19 yards). ",
            "5": "As the net yardage disparity would indicate, Jay Cutler had a monstrous performance. He was 25-of-45, 359 yards and a pick. He also scored two rushing touchdowns. ",
            "6": "Cutler connected with Brandon Marshall 10 times for 129 yards. Eddie Royal made five grabs for 57 yards. Tony Scheffler caught just two passes, but managed 56 yards. ",
            "7": "Unfortunately, Cutler came up small when it mattered most. He had Brandon Stokley wide open in the end zone on what would have been the tying score, but Cutler overshot him. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "If you've been reading this site for a while, you know that I refer to Brad Childress and Brad Clueless. Well, the Vikings offense appeared clueless when it came to handling the football. Perhaps using this as a metaphor for the what is happening to their season, Minnesota fumbled seven times and lost four of them. ",
            "2": "The ring leader, as you would imagine, was Tarvaris Jackson, who coughed it up three times. Jackson was solid otherwise, going 22-of-36 for 233 yards and two touchdowns. Jackson also rushed for 76 yards on eight attempts. ",
            "3": "Meanwhile, Adrian Peterson lost the ball twice. He was pretty disappointing, gaining just 76 yards on 22 carries versus one of the worst rush defenses in the NFL. ",
            "4": "Visanthe Shiancoe was the only brilliant Vikings skill position player, as he caught seven balls for 136 yards and two touchdowns. Bernard Berrian had just two grabs for 18 yards. ",
            "5": "As for the Falcons, nothing really of note from a fantasy perspective. Matt Ryan was 13-of-24 for 134 yards and a score. Roddy White had just three receptions for 24 yards. Michael Turner rushed for 70 yards and a score on 19 carries. ",
            "6": "With the win and Tampa Bay's loss, the Falcons clinched playoff berth. It's amazing that not one, but two rookie head coach-rookie quarterback combinations will be in the postseason (Baltimore). "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "3"
        },
        "comments": {
            "amount": "9",
            "1": "Jim Zorn called himself the worst coach in America last week. Zorn lived up to his self-deprecation, as he tried a 54-yard field goal in the second quarter into moderate winds. The kick was way short, and was returned 55 yards by Quintin Demps. ",
            "2": "That happened to be one of the few instances where the Eagles had good field position. It felt as though the Redskins pinned Philadelphia's offense inside the 10-yard line on almost every punt. In reality, punter Ryan Plackemeier placed the Redskins within the 20-yard line on five occasions. ",
            "3": "Whether the Eagles had the ball deep in their own territory or at midfield, their offense was completely stale. Donovan McNabb was 26-of-46 for 230 yards, giving him a depressing YPA of 5.0. McNabb also lost a fumble, and once again wasted way too much time on the final drive with his lethargic demeanor. That ended up costing the Eagles, as Reggie Brown was tackled at Washington's 1-yard line as time expired. The play was reviewed, much like the Santonio Holmes catch last week, but it was clear Brown wasn't in. Even Walt Coleman couldn't have overturned it. ",
            "4": "Once again, without Brian Westbrook, the Eagles would have been completely loss. Westbrook totaled 116 yards (45 rushing, 71 receiving). ",
            "5": "L.J. Smith paced the Eagles with seven receptions for 49 yards, but dropped two key passes. DeSean Jackson (2 catches, 14 yards) also had a pair of major drops that would have been long touchdowns. ",
            "6": "Meanwhile, Clinton Portis rushed for 70 yards and the game's only touchdown on 22 carries. ",
            "7": "Jason Campbell was his usual, mediocre, turnover-free self. Campbell finished 18-of-33 for 144 yards. His top targets - Santana Moss (5 catches, 28 yards) and Chris Cooley (4 catches, 28 yards) - continued to frustrate fantasy owners. ",
            "8": "R.I.P. 2008 Philadelphia Eagles. With the loss, the Eagles have lost control of their playoff destiny. Even if they beat Dallas, they need the Buccaneers to lose next week. They also need either Chicago or Minnesota to lose as well. The problem? Tampa Bay hosts the Raiders. ",
            "9": "For thoughts on Carolina-New York and Chicago-Green Bay, check out my <b> <a href=/nflpowerrankings.php> 2008 NFL Power Rankings</a></b>, which will be posted on Tuesday morning. "
        }
    },
    "numberOfGames": "15"
}