{
    "year": "2008",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "10",
            "1": "Rest in peace, 2008 Saints. With a seventh loss, they're officially done. They still had a pulse at 7-6, but 7-7 has spelled the end for the preseason NFC South favorites. ",
            "2": "Sean Payton said the following before the game: We can't go three-and-out. We can't give the Bears a short field. Oops. Chicago started off with a kickoff return for a touchdown. On the ensuing drive, Drew Brees tossed an interception. The Saints then went three-and-out on their second possession. ",
            "3": "Despite Payton's debacled game plan and a 21-7 deficit at halftime, the Saints were able to stay in this contest because of Chicago's anemic offense. Save for Devin Hester and Greg Olsen, the Bears receivers couldn't catch anything. In fact, Rashied Davis dropped a pass that deflected into the arms of a Saints defensive back. Orton was also horrific, going 24-of-40 for 172 yards, including a telegraphed pass to New Orleans linebacker Scott Fujita. Worst of all, the Bears couldn't get the running game going. It didn't even look like they wanted to. I know Matt Forte left the game in the first quarter with a toe injury, which must have scared all of his fantasy owners half to death, but he came back in the beginning of the second quarter. At the end of regulation, Forte (34 rushing yards, TD) and Peterson (15 yards) combined for only 13 carries, while Orton threw 39 times! It's almost as if offensive coordinator Ron Turner forgot the running portion of the playbook at home. ",
            "4": "I mentioned Hester and Olsen; they had four catches for 46 yards and eight grabs for 45 yards, respectively. Hester also drew 77 yards in penalty yardage. It should be noted that Forte had five receptions for 29 receiving yards in addition to his rushing yardage. ",
            "5": "As for the Saints offense, Drew Brees' road woes continued. He was 24-of-43 for 232 yards, two touchdowns and a pair of picks. As a visitor this season, Brees has 12 interceptions to just nine scores. That's a stark contrast compared to his home figures (19 TDs, 4 INTs). ",
            "6": "To move the chains against Chicago, New Orleans utilized Pierre Thomas constantly, which is something they should have done at the beginning of the season. The Frenchman rushed for 87 yards, caught seven balls for 59 more yards and scored twice. ",
            "7": "Reggie Bush, meanwhile, frustrated his owners by compiling just 48 total yards. Lance Moore also disappointed with five grabs for 28 yards. ",
            "8": "It was all Marques Colston downfield for New Orleans; Colston had six receptions for 84 yards and a touchdown. ",
            "9": "I like Mike Carey as an official. OK, liked. He made a horrific call of Ed Hocchulian proportions on a Chicago fake punt in the fourth quarter. Brad Maynard hooked up on a long pass to Adrian Peterson. Peterson caught the ball. After bobbling it initially, he established complete control. His knee, elbow and back were on the ground when the ball was knocked out by a Saints defender. It was ruled incomplete and challenged by Chicago. Carey reviewed it and inexplicably let the call stand. Even the Saints radio announcers said Carey made a mistake. The only reasonable explanation for this is that Carey had action on the Saints +3. It was an injustice that play was rule incomplete. At the end of regulation, Carey's crew missed an extremely obvious pass interference on Jason David. David put both arms around Olsen's stomach, smacked him in the head and then tackled him - all before the ball got to the tight end! This is further evidence that the officiating crew wanted the Saints to cover. I know, sounds absurd, but in the wake of the Tim Donaghy scandal, you would naive to think this wasn't possible. ",
            "10": ""
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jets",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "If the Jets make the playoffs, they should buy J.P. Zohan something nice like a new car or a hair salon. Zohan saved New York's season with a fumble in the final two minutes, which was returned for a touchdown. One has to question why the Bills were throwing in the first place. It was a second-and-five, and they were up 27-24 with two minutes remaining. They were grinding it out on the ground extremely well, so they probably could have run out the clock by keeping the ball in the hands of Marshawn Lynch and Fred Jackson. In total, Zohan had four turnovers (three picks, three fumbles). Otherwise, Zohan was 24-of-39 for 148 yards and a touchdown. He remains one of the worst anti-terrorist/quarterback hybrids in the NFL. ",
            "2": "As mentioned, Lynch and Jackson ran well. Lynch totaled 127 yards on 21 carries. Jackson rushed for 31 yards and caught six balls for 24 more yards. He scored once on a very tough run in which he carried half a dozen defenders into the end zone. ",
            "3": "Nothing from Lee Evans, which I would attribute to Zohan's futility. Don't send Evans (4 catches, 22 yards) any hate mail this week if you own him in fantasy. ",
            "4": "Zohan wasn't the only turnover-prone signal-caller in this contest. Brett Favre tossed two picks, weighing down his other numbers (17-of-30 for 207 yards and a score). ",
            "5": "Favre found Laveranues Coles five times for 82 yards. His lone touchdown went to Jerricho Cotchery (4 catches, 34 yards). Dustin Keller grabbed three balls for 35 yards. ",
            "6": "Thomas Jones ran the ball just 20 times. Seriously, what is it with these teams and not running it enough? Jones tallied 78 yards and a touchdown. ",
            "7": "The following two notes are from Wraith: - I would like to say that if I ever have to see a Bills two-minute drill ever again, I am going to vomit. The Bills, with 55 seconds remaining in the first half, were trying to drive as they were down 21-17, by throwing 4-6 yard patterns. It was the most conservative play-calling ever. - I must say I was confused about one thing. How was Adam Sandler watching the game from the stands AND playing quarterback for the Bills? Did he clone himself, or is he able to do two things at once? "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "I guess it's tougher to score when you don't have Frank Gore in your backfield, huh? With Gore out, the 49ers struggled mightily in the red zone. San Francisco reached the Miami 28 five times in this game, but came away with just nine points. Of course, Miami's defense had something to do with it. Amazingly, the Dolphins haven't allowed a touchdown the last three weeks. They kept the Rams and Bills out of the end zone in the previous two contests. ",
            "2": "Without Gore, the 49ers had to stick to the aerial attack. Shaun Hill was an economical 30-of-46 for 233 yards. More importantly, he refrained from turning the ball over and converted third downs (8-of-17). For that reason, San Francisco won the time-of-possession battle, 38:13 to 21:47. ",
            "3": "Gore's replacement, DeShaun Foster, rushed for 76 yards on 18 carries. He also had five catches for 25 more yards. That's not bad, but Foster obviously isn't even close to as talented as Gore. The team's red zone woes would indicate that. ",
            "4": "The Dolphins didn't have the ball all that much, so their numbers were pretty limited. For instance, Chad Pennington was 12-of-19 for 156 yards, though he threw two touchdowns. Davone Bess was Pennington's most-utilized receiver, and he had only three catches for 25 yards. ",
            "5": "Ronnie Brown and Ricky Williams pretty much split carries, for some reason. Brown gained 67 yards on just 10 rushes. Williams had 23 yards on seven attempts. ",
            "6": "The game ended when Joey Porter sacked Shaun Hill on a fourth-and-10 on Miami's 21 with about a minute left in regulation. The sack pushed Porter's yearly total to 17.5. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "For the second time this season, San Diego's playoff hopes nearly went down the drain against the Chiefs in the final few seconds. The Chargers had to mount a monstrous comeback in the fourth quarter; at one point, Kansas City led 21-3. ",
            "2": "It's really amazing the Chiefs blew this game. They completely dominated both sides of the ball until the fourth quarter. In fact, forum member Coop27 asked if LaDainian Tomlinson suffered an injury because he wasn't putting up any fantasy points for him. Any Tomlinson owner was probably wondering the same thing. Tomlinson was fine; the Chiefs simply were controlling the clock on offense and stacking the line of scrimmage on defense. Of the first 25 minutes of the game, Kansas City held the ball for about 18. ",
            "3": "Kansas City was able to convert 6-of-12 third downs, thanks to Tyler Thigpen, who continued to play well. Thigpen was 19-of-28 for 171 yards, one touchdown and a pick. Thigpen also had 40 rushing yards and a score on the ground. The Chiefs would look foolish if they drafted a quarterback in April and ignored their other numerous needs. ",
            "4": "Thigpen found Tony Gonzalez and Dwayne Bowe six times each. Gonzalez had 62 yards, while Bowe managed 44. Both reached the end zone. ",
            "5": "Larry Johnson rushed for just 55 yards on 17 carries, but he actually saved his fantasy owners with a 4-yard touchdown pass on a trick play to Gonzalez. ",
            "6": "As for Tomlinson, he continued to disappoint for the most part, save for a rushing touchdown. Tomlinson totaled 74 yards (39 rushing, 35 receiving). ",
            "7": "Philip Rivers deserves major credit for leading San Diego to an inexplicable come-from-behind victory. Rivers had two fumbles and a pick early on, but finished 34-of-48 for 346 yards and two touchdowns, both of which came in the final 80 seconds of the game. ",
            "8": "Vincent Jackson paced the Chargers with 89 yards and a touchdown. Antonio Gates, meanwhile, caught seven balls for 78 yards. Chris Chambers didn't do much. ",
            "9": "Believe it or not, San Diego has a great shot at the postseason. Along with winning out, all they need is a Denver loss to Buffalo. The Bills nearly knocked off the Jets today, while the Broncos have proven that they're capable of losing to anyone this year. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "When the Packers scored a go-ahead field goal with five minutes left, giving them a 16-14 lead, I figured it pretty much made sense that a crappy game between two crappy, disappointing teams finished with a push. Well, I spoke too soon. The Jaguars managed a final, 80-yard drive to win this meaningless, depressing contest. ",
            "2": "The Packers, now officially eliminated from the Doggone Playoff, epitomized their season when they allowed a struggling David Garrard to complete a 30-yard touchdown to crappy Dennis Northcutt on a third-and-19 in the first quarter. Despite all of the Aaron Rodgers-Brett Favre talk before this year began, it's been Green Bay's defense that has debacled the team's postseason hopes. ",
            "3": "Garrard somehow went 21-of-33 for 238 yards and two touchdowns, despite not having Matt Coke Zero Jones at his disposal. An interesting note is that Garrard is now 8-of-8 when running on third-and-one this season. ",
            "4": "Northcutt somehow caught five passes for 127 yards and a score. I guess that's what happens when you put two crappy teams together. ",
            "5": "Maurice Jones-Drew pleased fantasy owners with two touchdowns, but didn't do much otherwise (48 rushing yards, 22 receiving yards). ",
            "6": "Meanwhile, Rodgers once again put together a solid performance, going 20-of-32 for 278 yards, one touchdown and a pick. The interception came late when he was trying to mount a desperate, last-second score. ",
            "7": "While Greg Jennings had a touchdown (but only 22 yards) and Donald Driver caught five passes for 65 yards, Green Bay's leading receiver was James Jones, who notched four receptions for 132 yards. Ryan Grant, meanwhile, compiled 56 yards on 21 carries. ",
            "8": "Let's make fun of NFL.com's GameCenter. Did you know that Aaron Rodgers threw a pass for minus-40 yards in this contest? It's true! He must have been drunk and tossed the ball the wrong way, or something. That said, it was a good thing the officials decided to review it! Don't believe me? Here's proof (thanks Holder): "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "It almost seems like the Lions don't even want to win. They just give too many games away with stupid, unforced errors. For example, Detroit ventured all the way down to Indianapolis' 24 on its second drive. Unfortunately, Kevin Smith fumbled the ball away on first-and-10. Later in the game, the Lions forced the Colts into a fourth-and-three near midfield. A personal foul on Dewayne White gave the Colts a first down, however, which ultimately led to a touchdown. If you would have told me that the Lions would have made all of these errors after I watched the Colts open up the game with a 14-play, 78-yard drive in 7:22, culminating with a 1-yard Dominic Rhodes touchdown, I wouldn't have given Detroit a chance to cover. Anyone who played the Lions +17 can thank Bob Sanders for sitting out and return man Keiwan Ratliff, who lost three fumbles in the first two-and-a-half quarters. I had the Lions +17, and it looks like Ratliff did as well. It's always good to have a return specialist on your side. ",
            "2": "Looking at the box score, the stat that jumps out at you is Dallas Clark's 12 receptions for 142 yards and a touchdown. Reggie Wayne had seven catches for 104 yards himself. Marvin Harrison, meanwhile, hauled in just two grabs. ",
            "3": "Peyton Manning was dominant, as you would expect. He finished 28-of-37 for 318 yards and one touchdown. Dominic Rhodes, meanwhile, playing for the injured Joseph Addai, rushed for 86 yards and two touchdowns on 20 carries. ",
            "4": "Despite having a dimensionally challenged quarterback with an injured thumb throwing to him, Calvin Johnson was able to grab nine balls for 110 yards and a score. One can only wonder what Megatron could do with a legitimate NFL signal caller. ",
            "5": "Kevin Smith chipped in with 88 rushing yards, 31 receiving yards and a touchdown. Why the Lions even bothered with Rudi Johnson earlier in the year? Wait, never mind. We all know the answer to that. ",
            "6": "Congrats, by the way, to Lions kicker Jason Hanson, who broke the NFL record for most career 50-yard field goals with 41. It's amazing that at 38 years old, Hanson is still getting it done. No one thinks of Hanson as a great kicker because he's been stuck in Detroit for so long. '); "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "It almost seems like the Lions don't even want to win. They just give too many games away with stupid, unforced errors. For example, Detroit ventured all the way down to Indianapolis' 24 on its second drive. Unfortunately, Kevin Smith fumbled the ball away on first-and-10. Later in the game, the Lions forced the Colts into a fourth-and-three near midfield. A personal foul on Dewayne White gave the Colts a first down, however, which ultimately led to a touchdown. If you would have told me that the Lions would have made all of these errors after I watched the Colts open up the game with a 14-play, 78-yard drive in 7:22, culminating with a 1-yard Dominic Rhodes touchdown, I wouldn't have given Detroit a chance to cover. Anyone who played the Lions +17 can thank Bob Sanders for sitting out and return man Keiwan Ratliff, who lost three fumbles in the first two-and-a-half quarters. I had the Lions +17, and it looks like Ratliff did as well. It's always good to have a return specialist on your side. ",
            "2": "Looking at the box score, the stat that jumps out at you is Dallas Clark's 12 receptions for 142 yards and a touchdown. Reggie Wayne had seven catches for 104 yards himself. Marvin Harrison, meanwhile, hauled in just two grabs. ",
            "3": "Peyton Manning was dominant, as you would expect. He finished 28-of-37 for 318 yards and one touchdown. Dominic Rhodes, meanwhile, playing for the injured Joseph Addai, rushed for 86 yards and two touchdowns on 20 carries. ",
            "4": "Despite having a dimensionally challenged quarterback with an injured thumb throwing to him, Calvin Johnson was able to grab nine balls for 110 yards and a score. One can only wonder what Megatron could do with a legitimate NFL signal caller. ",
            "5": "Kevin Smith chipped in with 88 rushing yards, 31 receiving yards and a touchdown. Why the Lions even bothered with Rudi Johnson earlier in the year? Wait, never mind. We all know the answer to that. ",
            "6": "Congrats, by the way, to Lions kicker Jason Hanson, who broke the NFL record for most career 50-yard field goals with 41. It's amazing that at 38 years old, Hanson is still getting it done. No one thinks of Hanson as a great kicker because he's been stuck in Detroit for so long. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "Last week, I asked if the bloom was off the Jim Zorn rose. Well, the Zorn rose is now completely rotten. Down 17-10 in the third quarter, Washington had the ball at the Cincinnati 1-yard line on second down. Instead of just giving the ball to Clinton Portis, Zorn ran with Mike Sellers. Sellers scored, but the call was overturned, as the officials said Sellers stalled just short of the end zone. On the next play, Zorn ran Sellers again, who fumbled into the end zone. Congratulations, Zorn! You're now in a class with Brad Clueless as coaches who refuse to give the ball to your best player. At 7-7, Washington is pretty much done after such a promising start. ",
            "2": "Speaking of Portis, he rushed for 77 yards on 25 carries. One has to wonder if he didn't get those all-important goal-line carries because of his feud with Zorn during the week. If Zorn wanted to penalize Portis by not giving him a touchdown as revenge for his comments, Zorn is a complete idiot. ",
            "3": "Jason Campbell, meanwhile, was hopelessly mediocre, going 17-of-28 for 167 yards and a touchdown. He found Santana Moss seven times (72 yards, TD) and Chris Cooley six times (51 yards). ",
            "4": "As for the defense, Washington couldn't contain Cedric Benson. Seriously. Benson compiled 161 total yards, setting up play-action for Ryan Fitzpatrick (16-of-29, 209 yards, 2 total TDs). ",
            "5": "Chad Ocho Cinco and T.J. Houshmandzadeh each caught three passes. Unfortunately, neither had more than 33 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "When St. Louis led 20-13 in the fourth quarter, I jotted down the following: I can't believe the Seahawks lost this game. No, wait. Scratch that. I can't believe the Rams won this game. I really didn't think Marc Bulger was capable of such a feat anymore. Well, I was glad to see that the universe course-corrected itself. Seneca Wallace engineered two fourth quarter drives of 80 and 60 yards to score the final 10 points of this contest. ",
            "2": "This was a must-lose game for both teams in terms of NFL Draft consideration, so Seahawks fans have to be disappointed. They can blame Seneca Wallace (15-of-25 for 226 yards), Maurice Morris (15 carries, 86 yards), and Deion Branch and John Carlson (5 catches, 76 yards each). ",
            "3": "As for the Rams, Marc Bulger finished 19-of-32 for 207 yards and a score. Bulger located Torry Holt four times (64 yards, TD) and Donnie Avery on six instances (61 yards). ",
            "4": "Steven Jackson was the man who put the Rams in danger of winning this game. Jackson rushed for 91 yards and a touchdown. He also had four grabs for 36 more yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Texans",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "12"
        },
        "comments": {
            "amount": "10",
            "1": "I was happy to see this one come in. I chose the Texans +3 as my December NFL Pick of the Month. I predicted Houston to get the out-right upset. Thanks to some uncharacteristicly questionable decision-making by Jeff Fisher late in the game, the Texans were able to come away with their fourth consecutive victory, the first time this franchise has ever accomplished that feat. ",
            "2": "The decision-making I'm referring to was Jeff Fisher's choice to eschew a potential, game-winning 49-yard Rob Bironas field goal, instead going for it on fourth-and-three. Kerry Collins missed Justin McCareins deep, essentially ending the contest. Fisher admitted that he passed up on the kick because the roof was open and there was a chance that Bironas' attempt could have been blown off course. However, Bironas was 4-of-4 on the day and earlier nailed a 51-yarder. Fisher should have put his faith in Bironas. ",
            "3": "Speaking of field goals, Kris Brown missed a 20-yarder, causing me to spaz out multiple times in the Live In-Games Thread in the forum. Check it out if you missed it. ",
            "4": "Congratulations to the Texans, though. It seems like this franchise has finally turned the corner. It looks like they'll finish with a winning record for the first time ever. They have the Raiders and Bears (home) to close out the season. ",
            "5": "Matt Schaub, undefeated at home this season (4-0), was 23-of-39 for 284 yards and a touchdown. But the big story was Andre Johnson, who hauled in 11 grabs for a franchise-record 207 yards and a score. ",
            "6": "Steve Slaton helped open things up for Johnson, rushing for 100 yards on 24 carries versus one of the league's top run defenses. ",
            "7": "Unfortunately for Owen Daniels and Kevin Walter's fantasy owners, neither Texan did much. Daniels had four catches for 41 yards, while Walter had two grabs for eight yards. ",
            "8": "Chris Johnson was the only Titan of note from a fantasy perspective. He rushed for 65 yards on 13 carries. Justin Gage paced the squad with 76 receiving yards, but it's unlikely that anyone in the semifinals of their league started him. ",
            "9": "Kerry Collins struggled, failing to complete 50 percent of his passes. Collins was 15-of-33 for 181 yards and a pick. ",
            "10": "The Titans are now in serious jeopardy of losing their grasp on homefield advantage. If the Steelers win out, they'll have it. And making matters worse, Albert Haynesworth suffered a knee injury at the end of this game. He'll have an MRI on Monday. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "I don't know how these NFC South teams do it, but they continue to be flawless at home. They're 26-2 as hosts, including 11-0 in divisional matchups. ",
            "2": "For one of the few times since September, Matt Ryan struggled a bit, going 15-of-23 for 206 yards, two picks and a pair of fumbles. Luckily, Atlanta was able to capitalize on Tampa Bay's weakness against the run, which Carolina exposed by rushing for 301 yards last week. Turner pummeled the Buccaneers' banged-up defensive front for 152 yards and a touchdown on 32 carries. ",
            "3": "Roddy White entered this game with no career touchdowns against the Buccaneers. That held up, though White still had four grabs for 61 yards. ",
            "4": "Brian Griese, making the start for an injured Jeff Garcia, was 26-of-37 for 269 yards and a touchdown. Of course, Griese had his trademark back-breaking interception. I thought it was a mistake for Gruden to start the error-prone Griese over Luke McCown. ",
            "5": "Despite Griese being under center, Antonio Bryant was still as dominant as ever, catching eight passes for 108 yards and a score. As projected, Bryant is having yet another fabulous season in a contract year. He'll likely regress back into sloth mode once he gets a cushy signing bonus from his next victim. ",
            "6": "Cadillac Williams actually led the team in carries with 14 for 59 yards. Warrick Dunn had just 40 yards on 12 attempts, but also caught seven passes for 50 more yards. ",
            "7": "A doubting Buccaneer fan may snicker at the Falcons for barely winning this contest despite Garcia being hurt. I think that's a bit naive, seeing as how Tampa Bay lost to the Brad Johnson-led Cowboys, who fell to the Rams. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "This game meant very little to the Cardinals, who clinched the NFC West last week, and they certainly played that way. I wouldn't get excited about my offense if I were a Viking fan. Minnesota won this game based on Arizona's careless errors. The first touchdown was a punt return. The second touchdown came off a Kurt Warner interception. The third occurred after a Cardinals fumble. ",
            "2": "Still, Tarvaris Jackson's four touchdowns look impressive. But I think it's more important that Jackson did what he had to do - refrain from committing turnovers and convert third downs. He was 11-of-17 for 163 yards. ",
            "3": "Jackson's four scores went to Bobby Wade, Bernard Berrian, Chester Taylor and Sidney Rice. However, no Viking wideout had more than two receptions. ",
            "4": "Adrian Peterson didn't get into the end zone, but he was still able to compile 165 yards on 28 rushes. ",
            "5": "Speaking of rushes, Arizona running backs carried the ball just seven times, as the Cardinals simply didn't bother challenging the Williams Wall. Instead, Kurt Warner aired it out 45 times, completed 29 of those passes for 270 yards, one touchdown and a pick. ",
            "6": "A disappointing day for Larry Fitzgerald and Anquan Boldin. The former had five catches for 52 yards, while the latter had six grabs for 34 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "I figured this would be a high-scoring affair. I thought both teams would put up a lot of points. Well, Carolina held up its end of the bargain. The Broncos, meanwhile, played like a team willing to choke away their stronghold on the AFC West. ",
            "2": "After Jeff Garcia torched Carolina's secondary for 320 yards and two scores, Jay Cutler was an epically disappointing 21-of-33 for 172 yards, one touchdown and a pick. It may be unfair, but every time Cutler inexplicably struggles like this, you have to wonder if his Type-1 Diabetes is the culprit. ",
            "3": "Because of Cutler's poor play, no Bronco wideout had more than 50 receiving yards. Brandon Marshall and Eddie Royal had five and six grabs, respectively. Tony Scheffler did nothing. ",
            "4": "Denver's ground attack was divided into three: P.J Pope (7 carries, 51 yards), Tatum Bell (7 carries, 43 yards) and Selvin Young (6 carries, 19 yards) pretty much had an equal timeshare. ",
            "5": "It's really amazing that both Carolina backs had more yardage than any Denver runner. DeAngelo Williams and Jonathan Stewart had 88 and 52 yards, respectively. Both scored touchdowns. ",
            "6": "However, the player Denver had immense problems containing was Steve Smith. Smith compiled nine receptions for 165 yards and a touchdown. Jake Delhomme was 17-of-26 for 253 yards, one score and a pick. ",
            "7": "The Broncos, despite their recent struggles, can still clinch the AFC West with a win or a San Diego loss. They host the Bills next week, while the Chargers visit Tampa Bay. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "Oh boy... if you were checking the listings for Eating Cereal With the Stars and missed the controversial call in this game, Santonio Holmes caught a pass from Ben Roethlisberger on third down with 45 seconds remaining in regulation. His feet were in the end zone, but the ball never crossed the end line. It was ruled fourth down. The replay booth called for a review. After looking at por... I mean the replay for two minutes, official Walt Coleman ruled that it was a touchdown. Now, there's no question that the ball never crossed the plane. The disturbing thing is that Coleman never mentioned that. He simply said that both of Holmes' feet were in the end zone, making it a touchdown. If you're missing the point here, Coleman clearly didn't know the rules! Maybe he should go hang out with Donovan McNabb. This is really embarrassing for the league. ",
            "2": "Moving on, I picked the Steelers to win this game for a grand total of zero units because they just seem to pull victories out of their rear end. Well, chalk another one up. This was an evenly matched contest, but Pittsburgh came out on top once again. ",
            "3": "Credit Roethlisberger for engineering the decisive, 12-play, 92-yard drive in 2:53. Big Ben finished 22-of-40 for 246 yards and a touchdown. ",
            "4": "Though Holmes caught the game-winning touchdown, Hines Ward was Roethlisberger's preferred target on Sunday evening. Ward had eight receptions for 107 yards. Holmes had three grabs for 21 yards. ",
            "5": "Willie Parker shouldered two-thirds of the team's carries, but managed just 47 yards. Mewelde Moore tallied 16 yards. ",
            "6": "As for the Ravens, Joe Flacco was 11-of-28 for 115 yards. Unfortunately, he threw two picks and fumbled once, though one interception was a desperation Hail Mary at the end of the game. No Baltimore wideout had more than three receptions or 38 yards. ",
            "7": "LeRon McClain was primarily responsible for moving the chains; the power runner bulldozed for 87 yards on 23 attempts. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "Note to self: Bet your entire life savings on quarterbacks who have to play the Raiders after having their father pass away. Brett Favre debacled Oakland back in 2003, and Matt Cassel did the same thing this week. Cassel was 18-of-30 for 218 yards, four touchdowns and a pick. ",
            "2": "Despite those figures, only four Patriots caught passes. Wes Welker had six grabs of 69 yards and a touchdown. Randy Moss, meanwhile, embarrassed his old team for five grabs, 67 yards and two scores. Oakland's plan to have Nnamdi Asomugha cover Jabar Gaffney worked to perfection; Gaffney was held reception-less. ",
            "3": "LaMont Jordan, another former Raider, also thrived, accumulating 97 yards and a touchdown on 12 carries. Sammy Morris paced the Patriots backfield for 14 rushes, 117 yards and an end-zone trip. ",
            "4": "JaMarcus Russell put up impressive numbers for a change, but those came in garbage time when New England had established a gargantuan lead. Russell was 17-of-31 for 242 yards, two touchdowns and a pick. ",
            "5": "Russell hooked up with Zach Miller five times for 60 yards. Meanwhile, Darren McFadden tallied 114 total yards (46 rush, 68 rec) and two touchdowns. Justin Fargas led the team in rushing with 70 yards on 15 touches. ",
            "6": "To wrap things up, it seemed like every time I checked in on the score of this game, there was a touchdown on the board. Three minutes into the second quarter, it was already 35-14. I almost forgot that the Raiders spent tons of money on crappy receivers and offensive linemen. ",
            "7": "For thoughts on Dallas-New York and Cleveland-Philadelphia, check out my "
        }
    },
    "numberOfGames": "15"
}