{
    "year": "2014",
    "week": "07",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "25"
        },
        "comments": {
            "amount": "6",
            "1": "It's amazing how many opportunities the Jets blew in what could have been a victory to turn around their season. They outgained the Patriots by 100 yards (423-323), achieved 12 more first downs (28-16) and held the ball for 40:54 in this contest, but still managed to lose in the final seconds, thanks to a blocked Nick Folk 58-yard field goal. The thing is, it should've never gotten down to that kick. The Jets would have been way ahead if they hadn't made so many costly errors. For instance, a Geno Smith touchdown to Jeremy Kerley on their opening drive was wiped out by holding penalty. Another holding infraction negated a Chris Ivory 9-yard run in the red zone on the ensuing possession, and this was immediately followed by a Jace Amaro drop on what would've set up a manageable third-down situation near the goal line. Amaro, who saw the ball hit him right in the chest, was responsible for Geno Smith's first incompletion. More errors were prevalent throughout the evening. The Jets bobbled a handoff on second-and-1 in the red zone, which ultimately led to one of many field goals in the red zone. Rex Ryan also burned two timeouts in the third quarter. He needed those stoppages at the end of the game, as he was forced to try an onside kick. The Jets consequently had to march down from inside their own 20. Smith did a good job of at least putting the team into the edge of field-goal range, but the attempt was blocked. ",
            "2": "Smith had a great outing. He made some mistakes, as he held on to the ball too long on a few occasions, and he sailed a pass over Amaro's head during a two-point try that would've tied the game, but he was mostly sharp. He went 20-of-34 for 226 yards and a touchdown. As mentioned, he should've had a second score, but it was wiped out by a hold. Smith also scrambled seven times for 37 rushing yards, as he had a pair of a clutch runs to move the chains. Smith, who has been much better this season when he's been able to target an Eric Decker, was not afraid to throw Darrelle Revis' way. Decker, as a consequence, secured four of his seven targets for a team-high 65 yards. Jeff Cumberland (3-50) snagged Smith's sole touchdown, though he saw fewer targets than Amaro (3-22), who absolutely killed his team with that aforementioned drop. ",
            "3": "Though Smith played well, the Jets' season is over. The team is now 1-6, and it lost both of its Super Bowls against the Broncos and Patriots. They'll be flat next week and will likely drop to 1-7. Ryan will be seen as a lame-duck coach, and thanks to the bad-character guys in the locker room like Chris Johnson and the backup quarterback, the team will quit. They will be a great fade to close out the season. ",
            "4": "As for the Patriots, it has to be very discouraging that they couldn't stop the run and consequently get off the field. Chris Ivory pummeled his way for 107 rushing yards and a touchdown on 21 carries. Even Johnson ran well, gaining 61 yards on 13 attempts. New England won't have any sort of chance to win the Super Bowl if this area of its defense doesn't improve. Unfortunately for them, Jerod Mayo is not returning anytime soon, so odds are that the Patriots will continue to struggle to contain ground attacks. Tom Brady will have to carry the team, and it'll be difficult for him to do so considering his lacking supporting cast. His only productive teammates in this game were Rob Gronkowski (5-68) and Shane Vereen, who led the team with 71 receiving yards (off five catches), scoring twice aerially as a result. Vereen also led the team in rushing (11-43). Meanwhile, Julian Edelman (4-44) nearly cost New England a victory with a pair of drops in the second half. Brandon LaFell (4-55) continued to be mediocre. Brady went 20-of-37 for 261 yards and three touchdowns, but his completion percentage should've been much higher. As mentioned, two of his scores went to Vereen - one was a 49-yard bomb on the opening drive, thanks to a blown coverage - while the third was thrown to Danny Amendola (1-19). Brady once again saw a ton of pressure in his face, and he even had some Eli Manning-type throws in which he released the ball while twisting around and falling to the ground. Most of them were conversions, so that's not a criticism of any sort. It's more of a warning that the offensive line must improve because Brady will be battling secondaries that can actually cover in the future. ",
            "5": "As discussed, Vereen handled most of the workload in Stevan Ridley's absence. Brandon Bolden was expected to take on the early-down carries, but Jonas Gray (3-12) was used to give Vereen a breather instead. Gray was trending on Twitter prior to kickoff, but he was never a realistic fantasy option. He's worth picking up if you're desperate and have a spot available, but I wouldn't have very high hopes for him considering Bill Belichick's unpredictability regarding the running back position. ",
            "6": "Here's a cool note: Chris Jones, who blocked Folk's field goal to win the game, was the player responsible for a strange penalty that allowed the Jets to pull through in a matchup last year. It's great that he was able to redeem himself like that. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "Poor Matt Ryan. He just has no chance. His offensive line couldn't block Baltimore's pass rush whatsoever. Of course, Ryan should be used to this, as his front hasn't been able to shield him at all ever since half of his linemen went down with injuries in the Minnesota game. Making matters worse, center Peter Konz was lost with a knee issue. To give you an idea of the amount of pressure Ryan faced, the five sacks he took aren't even close to being indicative of the amount of heat Baltimore brought. Ryan's poor blocking is the primary reason why the Falcons achieved only four first downs and 61 net yards in the opening half. Ryan also lost a fumble in the red zone early on when he was under siege. Later, one of the sacks was taken in Ryan's own end zone, resulting in a safety. It was a 20-7 contest at that point, so the Falcons still had a chance, albeit a very slim one. That safety iced this victory for the Ravens, who continue to play impressive football. ",
            "2": "Joe Flacco, taken several selections after Ryan in the 2008 NFL Draft, had a much better afternoon, though it helped that he was actually protected well. Flacco went 16-of-25 for 258 yards, two touchdowns and a pair of interceptions. He made it a point to target cornerback Robert Alford as much as possible. It paid off at times, as Torrey Smith drew a long pass interference in the first quarter and made a couple of deep catches (3-81, TD) throughout the afternoon. However, it also ended up costing Flacco, as both of picks were snatched by Alford. The corner had great coverage on a deep shot to Smith on the first interception. Flacco carelessly lofted the second one up for grabs. ",
            "3": "Both Smiths secured three of five targets in this contest. Steve Smith (3-67) had most of his yardage come on a short slip screen, which turned into a 49-yard gain. Owen Daniels (6-58), meanwhile, hauled in Flacco's other touchdown. ",
            "4": "Justin Forsett continued to handle most of the workload. He out-carried Bernard Pierce, 23-8. Forsett tallied 95 yards, but Pierce (21 yards) vultured a touchdown. ",
            "5": "As for the Falcons' running game, Mike Smith continued to stubbornly feed Steven Jackson the ball, and the veteran running back once again wasted those downs. Jackson's eight attempts went for just 22 yards, and he didn't have a gain longer than four. What Smith should be doing is getting Devonta Freeman and Antone Smith more involved. Jackson is finished, and everyone but him and his coaching staff knows it. ",
            "6": "Ryan ended up going 29-of-44 for 228 yards and a touchdown. He didn't play poorly, considering the pressure, but as I said, he didn't have much of a chance. Ryan got away with an interception in the second half, as a Baltimore defensive back was only able to get one foot inbounds. It didn't matter for the Ravens, as Ryan was sacked on fourth down during the following play. Ryan's sole score was a semi-garbage time throw to Roddy White, who led the team with a whopping 15 targets. White had struggled to produce in recent weeks, so it was nice to see him reel in nine passes for 100 yards and the touchdown. Julio Jones, meanwhile, snagged five balls for just 56 yards. Ryan just had no time to find him downfield. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bills",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "A one-point victory over a team like the Vikings isn't normally something teams should be proud of, but it was somewhat impressive considering that the Bills did not play very well for most of the contest. Coming off a Super Bowl loss to the Patriots, they had every reason to be flat, and they definitely were. They made numerous mistakes throughout the afternoon. It began early when Sammy Watkins dropped a pass near the goal line on a nice, back-shoulder throw. Later on the possession, Chris Hogan lost a fumble, negating at least three points. Robert Woods also lost a fumble later in the firt half. This turnover occurred in his own territory, and it helped set up a Minnesota field goal. Another Viking three-pointer came via a Kyle Orton interception that was overthrown. All of this happened in the first half alone. The errors continued following intermission. Orton lost a fumble because he was careless with the football. Everson Griffen, who had a huge outing with three sacks, managed to strip it. Orton then took a bad sack on a third down, as Buffalo's predictable run-run-pass play-calling didn't have the Vikings fooled at all. Meanwhile, some injuries didn't help. Fred Jackson (3-12) left early with a groin injury. I thought this might be a blessing in disguise because it would force Buffalo's coaching staff to utilize C.J. Spiller much more. Sure enough, Spiller burst for a 53-yard gain on his first carry, but had to be carted off after the play. Unfortunately, he's out for the year with a broken collarbone. This forced Anthony Dixon to rush the ball exclusively, as the Bills didn't have any other active halfbacks on the roster. Dixon responded by gaining 51 yards on 13 attempts. ",
            "2": "Orton ultimately won the game during the final drive. It looked like the Bills would be dead on a couple of occasions; they were stuck on a fourth-and-20, while Orton was flagged for intentional grounding at another point. However, Orton converted the former situation with a 24-yard completion to Scott Chandler. Orton then launched a 29-yard bomb to Chris Hogan, who was tackled at the 1-yard line with just five seconds remaining. He found Sammy Watkins in the end zone on the next play for the decisive score. Orton finished 31-of-43 for 283 yards, two touchdowns, one interception and the lost fumble. Aside from the turnovers, Orton did a solid job of moving the chains throughout the afternoon despite not having his top two running backs, as the Bills achieved 22 first downs. ",
            "3": "Watkins had a huge outing. He hurt his team early with a drop in the red zone, but more than made up for it by securing nine of his 14 targets for 122 yards and two touchdowns. Hogan (5-63) was the only other Bill with more than 40 receiving yards. ",
            "4": "As for the Vikings, Teddy Bridgewater had a roller coaster of an afternoon. He struggled early on, completing just three of his first 10 passes. One incompletion was actually caught by Buffalo corner Leodis McKelvin on a horrible forced throw. His second pick, also to McKelvin, was even worse. Bridgewater caught fire after that, leading a five-play, 60-yard touchdown drive that culminated with a four-yard score to Cordarrelle Patterson, though Greg Jennings was the main receiver on the drive. Bridgewater, who finished 15-of-26 for 157 yards, with one touchdown and two interceptions, managed to complete just four passes after halftime, however. Pass protection was a huge issue, as Matt Kalil was once again anemic. It looked like he just stopped blocking Buffalo linemen in some instances. He surrendered multiple sacks, which disrupted a couple of promising drives. He also negated a Bridgewater 15-yard completion to Chase Ford with an illegal-hands-to-the-face infraction, and he followed that up by surrendering a sack to Jerry Hughes. It's amazing how terrible Kalil has gotten. He needs to be benched. ",
            "5": "Bridgewater's sole score, as mentioned, went to Patterson, who managed to catch just two passes for nine yards. Jennings was the team's leading receiver with six grabs for 77 yards. ",
            "6": "Jerick McKinnon had another strong performance, gaining 103 yards on just 19 carries. Matt Asiata (6-24) wasn't much of a factor, but the Vikings curiously gave him an attempt on an early third-and-5, which he had no chance to convert. ",
            "7": "Several Minnesota defenders stood out despite the loss. I already mentioned Griffen, who was incredible. Rookie Anthony Barr also played well, registering 10 tackles and breaking up a pass in the red zone. ",
            "8": "Minnesota's offensive line sustained two injuries. Both John Sullivan and Vlad Ducasse were knocked out. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "If the Bears' defense is at fault for the team's loss, that's to be expected. If the offense is to blame, however, then something is definitely wrong. The latter was prevalent in this contest, as the Bears barely did anything offensively. They mustered just 54 net yards and two first downs in the opening half and were ultimately outained by about 150 total yards. Chicago averaged a shameful 4.4 yards per play - the Jets averaged 4.65 yards per play going into Week 7, which ranked them dead last in the NFL - and made plenty of mistakes throughout the afternoon. Jay Cutler, for instance, threw an interception and fumbled three times. His pick was a miscommunication with his target, while a strip-sack that he was responsible for led to a Miami field goal. Other players committed errors as well. Matt Forte was inexplicably given just two carries in the opening half. Alshon Jeffery had a drop, while Dante Rosario lost a fumble. Perhaps the worst thing Chicago did was show absolutely no sense of urgency despite being in a position to mount a comeback in the fourth quarter. Down 17 and in Miami territory with eight minutes left, Cutler lackadaisically ran the offense, letting the clock tick down. It's almost as if he was resigned to losing at that point. ",
            "2": "Meanwhile, Chicago's defense struggled once again. Jay Ratliff was a monster with 3.5 sacks - one took the Dolphins out of field-goal range at the end of the first half - but barely anyone else performed well. The Bears allowed Ryan Tannehill to fire just seven incompletions, as the Miami quarterback went 25-of-32 for 277 yards and two touchdowns. He also scrambled six times for 48 rushing yards, which included a 30-yard scamper on a fourth-down read-option play. Tannehill's only real mistake on the afternoon was holding the ball too long on one of his sacks that, as mentioned, put his team out of kicking range prior to intermission. Tannehill's scores went to Mike Wallace (5-46) and Charles Clay (4-58). Rookie Jarvis Landry, who had an impressive showing last week, was the only other Dolphin with more than three receptions (4-46). ",
            "3": "Lamar Miller couldn't break any long gains, but he had some consistent runs, picking up 61 yards and a touchdown on 18 carries. He also caught two balls for 22 receiving yards. He had a second score negated by a hold. ",
            "4": "Some stats for the Bears: - Cutler went 21-of-34 for 190 yards, one touchdown and the aforementioned pick and lost fumble. - Forte, as discussed, wasn't given much of an opportunity in the opening half. However, he still scored twice (once rushing, once receiving), gaining 49 yards on the ground (12 carries) and 60 yards through the air (6 catches). The Dolphins have a strong ground defense, but there's no excuse for Forte not rushing the ball more than twice. - Both Jeffery (2-9) and Brandon Marshall (6-48) both had disappointing afternoons. Martellus Bennett (5-58) actually outgained both of them, combined. Marshall reportedly called out Cutler after the loss. ",
            "5": "The Bears sustained a key injury early on, as standout rookie Kyle Fuller exited with a hip issue. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Lions",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "I wondered how the Saints would respond following their bye. They entered their week off with a 2-3 record, but all but one of their games had been decided at the very end. However, there were multiple things wrong with them, and I had confidence in Sean Payton to resolve some of those problems. However, I did think there was a better chance the offense would be fixed rather than the defense. Based on this contest, it appears as though the opposite is the case. The Saints' scoring attack actually lost this game. Drew Brees was most responsible, to be more specific. Holding a 23-17 lead, Brees threw a horrific interception when he forced a pass for no reason, up six points. Sure, he wanted to put the game away and didn't want his defense to try to hold the Lions for the victory, but this was a huge error in judgment on his part because the stop unit had actually performed well for the most part. The Lions were limited to just 101 net yards in the opening half and just 5.1 yards per play overall, which is a mediocre figure. More importantly. the defense forced a pair of turnovers, so it could have easily secured a third, as Matthew Stafford wasn't having his best game without Calvin Johnson at his disposal. Brees had another chance to move his team into field goal range with 1:48 remaining. However, outside of a scramble on fourth-and-10 to move the chains, Brees just couldn't get anything going. He also wasted too much time, trying to run plays instead of spiking the ball. Granted, he was battling one of the NFL's top defenses, but Brees was just so uncharacteristically sloppy in the final few minutes of regulation. Brees finished 28-of-45 for 342 yards, two touchdowns and the pick. He hit some impressive throws, but also missed some routine ones. He was just 3-of-14 and the pick in the fourth quarter. Brees probably would've done better if Jimmy Graham had actually contributed instead of served as a mere decoy. Graham saw action - he was even on the field during the first drive - but he didn't log a single reception. He was targeted twice. ",
            "2": "Brees' big receivers were Marques Colston (6-111), who finally produced after doing nothing this season, and Kenny Stills (5-103, TD). Brandin Cooks had a disappointing outing, catching just two passes for 23 yards. ",
            "3": "The Saints didn't run the ball very well. The Lions have a monstrous ground defense, so that's part of the reason. The other is that Mark Ingram did nothing outside of a 14-yard burst, gaining just 16 yards on 10 attempts. Khiry Robinson (3-26) lost a fumble near midfield and barely did anything after that. ",
            "4": "Before moving on to the Lions, I need to mention that the Saints sustained numerous injuries. Pierre Thomas (6-13) left the game with a shoulder. Center Jonathan Goodwin was gone with a leg issue. Brodrick Bunkley was knocked out with a concussion. Glenn Foster exited with a knee. ",
            "5": "As for Detroit, Stafford had to once again perform without his top weapon. He had some issues early on when he telegraphed an interception, which led to a New Orleans touchdown. Stafford threw a second pick later, but that was a pass that popped out of his receiver's hands. Stafford missed some other passes that he should have converted, but ultimately led his team into the end zone with a game-winning score to Corey Fuller, thanks to the aforementioned Brees pick. Stafford went 27-of-40 for 299 yards, two touchdowns and the pair of picks. His scores went to Fuller and Golden Tate, who had a huge afternoon with 10 catches for 154 yards. All but 22 of Tate's receiving yards came after halftime. ",
            "6": "Both Joique Bell and Reggie Bush were in the lineup, but the former handled most of the workload. Bell tallied 48 yards and a touchdown on 18 attempts, while Bush, despite being named a game captain because he was battling his former team, mustered only 10 yards on four attempts. Bush was a bigger factor as a receiver, catching five balls for 22 receiving yards. He also drew a pass interference on Rafael Bush on the final offensive drive, setting up Stafford's victory-clinching touchdown to Fuller. However, Bush didn't appear to be completely healthy, as he hobbled around throughout the afternoon. ",
            "7": "It wouldn't be a Detroit game recap if I didn't mention the team's kicker. Matt Prater converted on his only attempt, a 21-yarder, but it was an eventful attempt, as it doinked off the upright. Still, it was good, so perhaps this is a positive sign for Detroit's most-troubled position. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Remember when the Packers were 1-2, coming off a brutal loss at Detroit? That seems like so long ago. Ever since Aaron Rodgers told everyone to relax, Green Bay has become an unstoppable force. Both the offense and defense overwhelmed the Panthers, and by the time the Packers established a 35-3 lead in the middle of the third quarter, they were outgaining the Panthers, 329-135. The opening drive epitomized how long of a day this was going to be for Carolina. The Panthers lucked into a sack when Rodgers slipped. Green Bay was forced into a long-yardage situation, but the team got out of it because of some Carolina penalties. One infraction negated an interception. In fact, Rodgers just stood there because he knew it wasn't going to stand. He ultimately threw a touchdown to Jordy Nelson, who impressively eluded a pair of defenders when running toward the end zone. Rodgers made so many impressive throws throughout the afternoon. In fact, he only had one poor attempt, as he missed Randall Cobb too high in the red zone. However, Rodgers more than made up for it, misfiring just three times in total. He went 19-of-22 for 255 yards and three touchdowns. Had the Panthers been remotely competitive, he could have put together one of the season's best fantasy performances. ",
            "2": "Rodgers' scores went to three different receivers: Randall Cobb (6-121), Jordy Nelson (4-80) and Davante Adams (1-21). The Adams performance was disappointing because he appeared to be gaining momentum prior to this contest, but it's not as if Jarrett Boykin stole any targets because he didn't have any balls thrown his way. ",
            "3": "Both Packer running backs found the end zone. Eddie Lacy registered 63 yards on 12 carries, while James Starks (7-36) limped off the field in the second half and didn't return. ",
            "4": "The Panthers also had a miserable afternoon from an offensive perspective, which you may have inferred from the 135-yardage figure that the Panthers possessed in the third quarter. Cam Newton finished 17-of-31 for 205 yards, one touchdown and an interception (along with 41 rushing yards on seven scrambles), but those numbers are misleading. Newton was just 8-of-16 for 86 yards in the opening half. He struggled with pressure all afternoon; his offensive line didn't stand much of a chance against Green Bay's improving defense, especially with left tackle Byron Bell and guard Trai Turner exiting with injuries. Newton, as a result, was nearly picked on a couple of occasions. ",
            "5": "Carolina's offensive line didn't do anything in terms of opening up running lanes either. Jonathan Stewart gained 55 yards on 14 carries, but his first-half stats (6-11) are more indicative of how poorly he ran. The line failed to open up any room for him on a third-and-1 try, as Letroy Guion stuffed him. The Packers swarmed Newton on his sneak attempt on the following play, tackling him behind the line to gain. ",
            "6": "Newton's sole score went to Kelvin Benjamin (3-61), which came in garbage time. Greg Olsen (8-105) led the team in receiving, as he secured all eight of his targets. ",
            "7": "It's worth noting that Luke Kuechly was ejected from the game for touching an official. It was a stupid call, as Kuechly attempted to shrug off a ref, who was grabbing him behind (not that there's anything wrong with that). "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "The final score of this game would indicate that this was an obvious blowout, but it could have been much worse for the Bengals. The Colts lost an early scoring opportunity because of a fumble in the red zone by Ahmad Bradshaw, who was running around like a chicken with its head cut off. Another lost fumble for the Colts was charged to Andrew Luck, but that was really a botched handoff. Luck later missed a wide-open Coby Fleener on what would've been a long touchdown. I mention these Indianapolis blunders just to illustrate that this could've easily been a 48-0 result. If you don't believe me, consider this: By the time this game was 24-0 with 12 minutes remaining in regulation, the Colts had outgained the Bengals, 443-42. That's right - Indianapolis had Cincinnati outgained by 401 net yards! ",
            "2": "Despite some of the mistakes, Luck had a strong showing. He went 27-of-42 for 344 yards and two touchdowns. He had issues generating first downs early - especially on third down, where both teams were a combined 0-of-14 in the opening half - but Luck eventually got into a groove and finished on a strong note. He was 13-of-17 for 152 yards and two scores following intermission. ",
            "3": "Luck's leading receiver was T.Y. Hilton (7-107), while Reggie Wayne managed four receptions for only 15 yards. His scores went to Dwayne Allen (3-52) and Bradshaw (3 catches, 36 yards), who redeemed himself after that early fumble. It was nice to see the Colts' coaching staff continue to use Bradshaw after that initial mistake, whereas some coaches, like Bill Belichick and Tom Coughlin, would've made Bradshaw completely disappear. Bradshaw and Trent Richardson split carries for the most part, with Richardson (14-77) outgaining Bradshaw (10-52, TD). However, the former injured his hamstring in the second half. Both runners found plenty of room against a Cincinnati front that has been a disappointment this season. Of course, it hurt the Bengals that Vontaze Burfict was knocked out early with a neck injury. Leon Hall, who dropped an interception, also exited during the first half with a back problem. ",
            "4": "Speaking of disappointments, Dalton had a dreadful outing. He was missing A.J. Green, but Dalton had performed well the previous week. The difference was that Dalton was battling an elite defense this time. Yes, an elite defense. The Colts ranked ninth in defensive efficiency entering the weekend, and they'll be even higher following this result. Dalton finished 18-of-38 for 126 yards, but those numbers are misleading. He compiled some of that yardage in garbage time. With 12 minutes remaining in regulation, Dalton was 12-of-28 for only 55 yards. The Bengals couldn't block Indianapolis' improved pass rush, but that was just part of the issue. Dalton's supporting cast was just so lackluster. He was able to rely on just Mohamed Sanu (3-54) and Jermaine Gresham (10-48). ",
            "5": "Cincinnati also couldn't run the ball at all. Giovani Bernard was given only seven carries, but it's not like he did anything with them, churning out just 17 yards. Bernard also caught only two passes, losing one yard in the process. ",
            "6": "As with the Packers-Panthers game, a linebacker was ejected for contacting an official. This one was even less egregious, as Erik Walden barely tapped a ref during Cincinnati's drive in the 2-minute drill. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "Jacksonville has been competitive in every game since Blake Bortles took over as the starting quarterback, so this victory isn't coming out of nowhere. Still, it was a bit surprising to see the Jaguars achieve their first victory against a Cleveland team that had been playing well when they lost to inferior squads like Tennessee and Pittsburgh beforehand. Despite winning, Blake Bortles did not play well. He went 17-of-31 for 159 yards, one touchdown and three interceptions (along with five scrambles, 37 rushing yards). The first pick wasn't his fault because he was hit as he released the ball. The most egregious interception occurred in the red zone, which disrupted a great drive. Bortles could've run and picked up a first down on the play, but he instead forced the pass late over the middle of the field, which was a terrible decision. Bortles also had some ugly throws throughout the afternoon. ",
            "2": "The Jaguars were able to move the ball on the ground. Denard Robinson, taking the reins from the ineffective Storm Johnson, rushed for 127 yards and a touchdown on 22 carries. Johnson (6-16, TD) barely was a factor. Robinson gave Jacksonville a potent threat coming out of the backfield for the first time all year. The Jaguars would be foolish to go back to Toby Gerhart as their starting running back. ",
            "3": "Jacksonville's leading receiver was the same player who caught Bortles' sole touchdown. That would be Allen Robinson, who snatched four passes for 60 yards. Cecil Shorts (3-12) was a big disappointment from a fantasy perspective. He was horribly inefficient, reeling in just three of his nine targets. ",
            "4": "The primary reason the Jaguars were able to prevail was the play of the defense, which forced the Browns - mainly Brian Hoyer - into a multitude of mistakes. Hoyer was atrocious, going 16-of-41 for 215 yards, an interception and a lost fumble. He was nearly picked several other times and missed many open targets. He threw behind Miles Austin in the red zone. He overshot Jordan Cameron for a potential touchdown. He backpedaled unnecessarily in pocket on a fourth-and-1 failed attempt. He didn't look like an NFL-caliber quarterback after playing so well in the first six weeks of the season. ",
            "5": "Perhaps the reason for Hoyer's struggle - outside of center Alex Mack's absence - was that the Browns, for the first time, couldn't establish a ground attack. Jacksonville's defensive line put on an impressive showing, limiting Ben Tate to just 36 yards on 16 carries. Isaiah Crowell (7-18) couldn't do anything. Then again, Mack not being in the lineup had something to do with that too. ",
            "6": "Only three Cleveland players had more than one reception: Andrew Hawkins (5-112), Austin (3-53) and Taylor Gabriel (3-39). Cameron, expected to have a big outing against a defense that couldn't contain tight ends all year, snatched just one of his six targets for only five yards. As mentioned, Hoyer had Cameron open for a touchdown, but sailed the ball way over his head. ",
            "7": "The Browns' special teams also contributed to this loss. It was just a 10-6 contest when Jordan Poyer fielded a punt in the fourth quarter. He muffed it, and the Jaguars scored via a Robinson run following the recovery. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "So much for the Kirk Cousins era. Despite getting off to a hot start with a victory over the Jaguars and an impressive showing in a loss at Philadelphia, Cousins is done with the starter, as he was benched in favor of Colt McCoy in this contest. Robert Griffin is likely coming back next week anyway, but even if that weren't the case, Washington would likely to continue to roll with McCoy instead of Cousins. Cousins was atrocious. He misfired on just six first-half attempts, going 10-of-16 for 139 yards. However, he committed two turnovers prior to intermission. The first was a strip sack that Derrick Morgan forced, while the second was an awful interception that was underthrown by about 10 yards. Cousins displayed awful body language while he was in the game, which he has sported ever since that ugly Thursday night loss to the Giants. He has lost all confidence, while Washington lost all opportunity to trade him while his value was at its highest. McCoy was better, but only by default. His first pass was a 70-yard touchdown, but it was a short throw in which Pierre Garcon (5-87, TD) eluded the inept Blidi Wreh-Wilson and Michael Griffin. McCoy misfired only once throughout the second half, going 11-of-12 for 128 yards and the touchdown. However, he threw nothing but checkdowns, managing the game. Again, this is better than anything Cousins did, but McCoy is not anywhere close to being a starting-caliber quarterback. The Redskins need Griffin to return, but he'll probably just get hurt again anyway. ",
            "2": "Like Cousins, Alfred Morris had a disappointing showing. He was expected to have a big outing versus an inept run defense, but he managed just 54 yards on 18 carries. He got banged up early on, injuring his ankle, but remained in the game, so perhaps that's why he was so ineffective. ",
            "3": "DeSean Jackson also remained in the game despite getting hurt. He injured his knee in the second quarter, but didn't miss much action. He caught three passes for 49 yards, one of which was a great grab along the sideline to set up a red-zone opportunity. Jackson also lost a 36-yard grab because of a hold and drew a long pass interference to set up the game-winning chip-shot field goal. Meanwhile, Jordan Reed tied Garcon for the team lead in receptions (5), registering 54 yards in the process. ",
            "4": "The Redskins ultimately prevailed with a field goal as time was ticking down, but this was a Pyrrhic victory because they may have lost Brian Orakpo for the season with a torn chest. ",
            "5": "As for the Titans, well, they were at least competitive. Charlie Whitehurst's numbers - 17-of-26, 160 yards, two touchdowns and an interception - weren't bad, but he once again performed like a pedestrian signal-caller. Whitehurst often looked like he was lost in the pocket, struggling to convert third downs (3-of-11). I'd say Tennessee desperately needs Jake Locker to return, but its season is over now at 2-5. ",
            "6": "Whitehurst's two touchdowns went to Kendall Wright (6-68), who did well with his nine targets, and Derek Hagan. Justin Hunter was strangely invisible, reeling in just one of two targets for six yards. ",
            "7": "The silver lining in Tenessee's loss was that Bishop Sankey looked half-decent. Sankey gained 56 yards on 16 carries, looking much better than Shonn Greene ever did. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Rams",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "26"
        },
        "comments": {
            "amount": "6",
            "1": "<i> Editor's Note: </i> I have to wonder if the replay people were given a call and told not to review that fumble at the end of the game in which Seattle appeared to recover the ball. Jeff Fisher even told the media afterward that he was preparing for his defense to take the field. Vegas lost a ton of money last week, and St. Louis pulling this one out helped a lot because so many public bettors had the Seahawks on a teaser. ",
            "2": "The Seahawks' offense didn't miss Percy Harvin, as Russell Wilson played some great football in the second half, but the Rams outplayed Seattle at the line of scrimmage and were led by some amazing special teams plays. St. Louis special teams coordinator John Fassel had a legendary game with one of the best fakes on a punt return you'll ever see, a long kick return, and a huge fake punt conversion in the fourth quarter. The Seahawks fell to 3-3, and the defending champions aren't playing complete football, as perhaps a Super Bowl hangover is setting in. ",
            "3": "Seattle got the scoring started in the first quarter when Doug Baldwin bolted down the field for a gain of 49 yards. The Seahawks had to settle for a field goal, but the Rams answered with Benny Cunningham returning the kickoff 75 yards to the Seattle 31. Tre Mason took over on a few runs and scored from six yards out. After the Rams got the ball back, Mason ripped off a run of 28 yards. St. Louis expanded its lead on a shovel pass from Austin Davis to Cunningham. The Rams entered the game with an NFL record for ineffective pass rush as they had only sack on the season, but that changed in the second quarter, as Aaron Donald and Eugene Sims recorded sacks on back-to-back plays. That forced a punt, and the Rams set up an amazing trick play. Tavon Austin went back to receive on the opposite side of the field from where the ball was going. Stedman Bailey was blocking a gunner on the other side. Bailey peeled off the gunner and tracked down the punt with an over-the-shoulder catch. However, all of the Rams' blockers had rand toward Austin, who acted like he was catching the ball. That drew the Seattle coverage. After Bailey caught the ball, he was untouched on a 90-yard touchdown return. It was one of the greatest special teams plays I've ever seen and an ingenious trick play by Fassel. After the Rams missed a 52-yard field goal, the Seahawks got going in the 2-minute drill as they moved the ball down the field by getting Wilson out of the pocket. Just before the half, the Seahawks tacked on a field goal. In the third quarter, Seattle had a good drive and Wilson ran in a 19-yard touchdown run on a read option, as linebacker ,Alec Ogletree blew containment. The Rams didn't make adjustments, as Ogletree blew contain again, and Wilson took off on a 52-yard run, the longest of his career. Wilson finished the drive by throwing a pass up to tight end Cooper Helfet (3-61), who made a fabulous hands catch with getting his toes in bounds before falling out of bounds for a 25-yard score. The two-point conversion fell incomplete. St. Louis answered with a pretty 30-yard pass from Davis to Chris Givens (1-30). Davis finished the drive with a short scoring throw to Lance Kendricks (2-17). Wilson picked up where he left off by moving the ball down the field, including a 29-yarder to Jermaine Kearse (3-50). Wilson threw a bullet to Baldwin (7-123) for a nine-yard score. With 3 minutes remaining, the Rams' possession fizzled. Wilson was unstoppable, so Jeff Fisher made a great call to go with a fake punt. St. Louis executed it perfectly with a pass from punter Johnny Hekker to Cunningham (5-46). Mason (18-85) ran out the clock, but he fumbled the ball during that task, and it was recovered by Cory Harkey - amid controversy (see the editor's note) - to save the day for St. Louis. ",
            "4": "Wilson completed 23-of-36 passes for 313 yards with two touchdowns. He also led the Seahawks on the ground with 106 yards on seven carries. Marshawn Lynch (18-53) was held in check. ",
            "5": "Davis completed 18-of-21 for 152 yards with two touchdowns and zero turnovers. Aside from Mason and Cunningham, the Rams' skill position players didn't help Davis much. Kenny Britt (2-4), Brian Quick (2-33), Tavon Austin (3-6) and Jared Cook (3-25) were ineffective against Seattle's defense. ",
            "6": "Finally, Aaron Donald had an excellent game for the Rams with a sack, four tackles, and a lot of disruption. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "The public is going to look at this result and think the Chiefs are back to performing on a postseason level, while San Diego isn't as good as everyone made them out to be. However, sometimes schedule dynamics impact results. The Chiefs were in a much better position to prevail; they were coming off a bye - Andy Reid has always thrived following a week off - while the Chargers were looking ahead to a battle against the Broncos in just four days. Preparing for Denver, San Diego simply took a 2-3 squad that it swept last year lightly. That's exactly why the professional bettors were heavily wagering on Kansas City prior to kickoff. Having said that, the Chiefs still deserve credit for this win because they played an excellent game. Alex Smith was sharp for the most part, going 19-of-28 for 221 yards and a touchdown. He only made one poor throw when he missed A.J. Jenkins on a long connection, but a roughing-the-passer penalty on Reggie Walker kept the drive alive. Smith, who also picked up 29 rushing yards on six scrambles, was victimized by several drops; otherwise, he would've had a much better statistical performance. Two of Smith's drops prevented the team from putting more points on the scoreboard. Junior Hemingway let the ball slip through his hands on what would've been a big play prior to intermission, and then Dwayne Bowe (5-84) dropped a pass that would've moved the chains in the red zone. This forced Kansas City to settle for a field goal. ",
            "2": "Smith's sole touchdown went to Anthony Sherman. Travis Kelce (4-33) tied for second on the team with four targets with Jamaal Charles. ",
            "3": "Speaking of Charles, he eclipsed Priest Holmes as Kansas City's all-time leading rusher in this contest with 95 yards and a touchdown on 22 carries. He scored on the same drive in which he broke the record, which was pretty cool. ",
            "4": "As for the Chargers, Philip Rivers had the worst performance of his season. He wasn't terrible - he went 17-of-31 for 205 yards, two touchdowns and late interception in desperation time - but he just couldn't keep most of his drives going (3-of-10 on third downs) because he was constantly under siege. The Chiefs sacked him just twice - one being a strip-sack, which San Diego recovered - but that's not indicative of how much pressure he faced. As a result, Kansas City won the time of possession by 18 minutes. Rivers' sole score went to Antonio Gates (3-61), who also led his team in receiving yardage. Keenan Allen (6-58) saw a San Diego-high 10 targets. Eddie Royal, who had been hot entering this contest, caught just one pass for 20 yards. ",
            "5": "Branden Oliver looked good again, but had limited opportunities, given that Kansas City controlled the clock. Oliver gained 67 yards on 15 carries. He added two catches and 11 receiving yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "The Giants actually tried in this game. A week after completely dogging it against the Eagles, they came out fired up. They started a scuffle to begin the game and were hyped up upon sacking Tony Romo. It was refreshing to actually see them put forth some energy. It didn't matter, however, as the Cowboys proved to be just too good. With the Giants fully focused on containing DeMarco Murray, they let Prince Amukamara have single coverage on Dez Bryant. Amukamara played well, but Tony Romo continuously found Bryant, who made fantastic catch after fantastic catch. Meanwhile, Romo's other targets were constantly wide open, including Gavin Escobar, who secured two gift touchdowns. ",
            "2": "Romo had an amazing afternoon, misfiring on just six attempts. He finished 17-of-23 for 279 yards, three touchdowns and an interception. The pick wasn't even his fault, as Bryant fell down, allowing Amukamara to have a big return. This led to an Eli Manning touchdown. Credit must be give to his offensive line, as Romo had all afternoon to throw for the most part. Bryant, meanwhile, reeled in nine of the 12 targets thrown his way. As mentioned, he made so many circus catches throughout the contest despite being covered well. He nearly scored a touchdown, getting tackled at the 1-yard line in the fourth quarter. ",
            "3": "Two of Romo's touchdowns went to Gavin Escobar (3-65), while the other was thrown to Terrance Williams (1-18), who curiously saw just three targets go his way. ",
            "4": "Murray, meanwhile, continued to dominate, as he broke Jim Brown's record for most consecutive 100-yard rushing performances (7) to begin the season. There was a scare, however, as Murray rolled his ankle in the first half and limped off the field. He didn't miss much action, however, and he ultimately gained 128 yards and a touchdown on 28 carries despite the Giants selling out against the run. ",
            "5": "The Giants, on the other hand, failed to run the ball against the league's worst rush defense. Andre Williams' poor ability had something to do with that. Looking like a typical Big Ten plodder - though he's not from the Big Ten - Williams managed 51 yards on 18 carries, with 22 of his yards coming on one play. Peyton Hillis also saw some action (6-29), even getting a carry on the third down of the opening drive for some reason. It goes without saying that the Giants desperately need Rashad Jennings to return to action. ",
            "6": "The Giants didn't lose this game because of their inability to run, however. They simply made too many mistakes. It began early when Will Beatty false started on a fourth-and-inches attempt. Justin Pugh also had some crucial infractions. Rueben Randle's hold wiped out a long gain. Larry Donnell was most responsible though, as he lost two fumbles in his own territory. The first led to a Dallas touchdown, while the second ended the game. New York's errors ruined a quality performance by Eli Manning, who went 21-of-33 for 248 yards and three touchdowns. He did not appear to miss Victor Cruz at all. Two of his scores went to Odell Beckham (4-34), while the other was passed to Daniel Fells. ",
            "7": "The Giants' leader in receiving yards was actually Donnell, who snagged seven balls for 90 yards. He actually secured all seven of the targets thrown to him, and he made a great, leaping grab, but he absolutely killed his team with the two fumbles. ",
            "8": "The Giants lost a couple of key defenders throughout the contest. Both Cullen Jenkins and Jon Beason exited the game with various injuries. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "<i> Editor's Note: </i> Derek Car... ugh. That's the last time he costs me a unit this year. ",
            "2": "With Seattle losing, the Cardinals remain in firm control of their destiny in the rugged NFC West, while the Raiders have lost their 12th-straight game. Arizona improves to 5-1, and the last time the franchise had that record to start a season, it was located in St. Louis. Oakland fought hard, but clearly isn't talented enough to beat a good squad like Arizona. ",
            "3": "The Cardinals took the lead in the first quarter and never looked back. Their first scoring drive ended with a short touchdown pass from Carson Palmer to Stepfan Taylor (12-40 rushing, 2-19 receiving). In the second quarter, Michael Floyd (3-47) beat Tarell Brown for a jump ball and coasted into the end zone for a 33-yard score. The Raiders answered, as Derek Carr hit Brice Butler for a 55-yard reception inside Arizona's 10-yard line. A few plays later, Darren McFadden (14-48) plunged into the end zone. The Raiders had a chance to tie it up quickly as a few plays after McFadden's score when Cardinals tight end John Carlson deflected an inaccurate Palmer pass up in the air and Charles Woodson picked it off. He returned it 27 yards to the Arizona 13-yard line. That was the first Cardinals interception this season, but Oakland settled for a field goal. In the third quarter, the Raiders narrowed the lead to one point with a field goal drive, led by runs to McFadden and a few passes. The Cardinals answered with a drive featuring Andre Ellington, and Taylor finished the possession with another short touchdown run. The Raiders had some decent drives that fizzled because of penalties, receivers not getting open and poor execution by the offensive line. Late in the fourth quarter, Arizona tacked on another field goal to ice the win. ",
            "4": "Palmer completed 22-of-31 for 253 yards with two scores and an interception. Larry Fitzgerald caught four passes for 21 yards. ",
            "5": "The workhorse for the Arizona offense was Ellington as he ran for 88 yards on 24 carries with six receptions for 72 yards. He is really playing at a high level and allowing Palmer to serve as a game-manager. ",
            "6": "Carr completed 16-of-28 passes for 173 yards with no touchdowns or interceptions. He had some good plays called back on penalties and was better than the numbers indicate. ",
            "7": "Khalil Mack played well for Oakland with 11 tackles and some near sacks. He had Jared Veldheer beaten for a sack, but drew a holding penalty after being taken to the ground. Mack is going to be a tough player for the Raiders for many years to come. Conversley, the Cardinals had only one sack from veteran Larry Foote. Arizona needs to improve its pass rush. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "42"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "The most prominent storyline to come out of this game was obvious. It's that Blaine Gabbert threw a touchdown pass. OK, maybe not. A quarterback much better than Gabbert just set an NFL record, in case you didn't hear. There was never any doubt that Peyton Manning was going to break Brett Favre's career touchdown mark in this contest. Manning needed two to tie Favre's 508 and three to eclipse it. Manning finished with four, and it appears as though there will be many more to come. Touchdown No. 507 was to Emmanuel Sanders, who had help from an official who picked a San Francisco defensive back. No. 508 was a 39-yard bomb to Wes Welker, who was originally ruled down at the half-yard line. No. 509 was a bit of a journey. Manning threw behind Julius Thomas in the end zone and then tripped over Orlando Franklin's leg and took a sack. However, on third down, Manning found Demaryius Thomas, who tapped both feet in before falling out of bounds. Thomas, for good measure, also reeled in 510, which was a 40-yard rainbow. Manning's final stat line looked like this: 22-of-26, 318 yards and the four touchdowns. He was on fire, and one of his four incompletions was dropped. It's impressive that he did this against a strong defense (albeit one that was missing Patrick Willis), and if he continues to play this way, no one will be able to beat him. ",
            "2": "Demaryius Thomas, who found the end zone twice, logged eight yards for 171 yards. He vastly outgained everyone else, including Welker (3-50, TD), Sanders (3-41, TD), who drew a pass-interference flag, and Julius Thomas (4-27). ",
            "3": "Despite Manning throwing touchdowns left and right, there was still room for Ronnie Hillman to reach the end zone. Hillman scored twice, all while rushing for 74 yards on only 14 carries. Hillman also secured all four of his targets for 27 receiving yards. ",
            "4": "Although this final score says that this game was a blowout, the 49ers played evenly with the Broncos, yardage-wise, until midway through the third quarter. That may surprise you, but it's true. Denver outgained San Francisco by only six yards in the opening half. The difference was that while the Broncos converted in the red zone, the 49ers sputtered there in addition to making other mistakes. Many of these errors occurred because the receivers had the ball fall through their hands, as Michael Crabtree and Vernon Davis both had multiple, back-breaking drops in the first half. Even the sure-handed Anquan Boldin (7-50) was guilty of a drop, which happened to occur in the end zone. It ruined a great-looking drive in which Boldin made a fantastic catch of a ball thrown behind him deep in Denver territory. This game ultimately got out of control in the middle of the third quarter. Down 21-10, the 49ers had a chance to draw to within one score. However, Colin Kaepernick made a terrible read, eschewing an open target for a first down, instead launching it deep into double coverage. The pass was picked off, and Manning launched a touchdown to Demaryius Thomas on the very next play. Game, set, match. ",
            "5": "Kaepernick went 24-of-39 for 263 yards, one touchdown and the killer interception. As mentioned, many of Kaepernick's incompletions were dropped, so this loss definitely wasn't his fault, though he did miss an open Brandon Lloyd for a long score. That said, I was disappointed that he scrambled just three times (18 rushing yards). His legs are his best weapons, so he should use them more. ",
            "6": "Kaepernick's sole touchdown went to Stevie Johnson, who actually led the team with 79 receiving yards off five catches. Boldin (7-50) was solid outside of the dropped score, but Crabtree (4-27) and Davis (2-21) both had awful outings. ",
            "7": "The Broncos did a great job of shutting down the run. Frank Gore was limited to just 20 yards on nine carries. He had absolutely no running room. ",
            "8": "The 49ers, who have been extremely banged up this season, lost another key player in center Daniel Kilgore, who was carted off in the second half with a knee injury. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "The Texans dominated this game for nearly one half of action. In fact, Ryan Fitzpatrick was even able to do his best impression of Ben Roethlisberger, somehow getting out of a sack deep in his own territory and finding DeAndre Hopkins for a long completion. This was part of a 94-yard opening-touchdown drive in which Houston marched down the field effortlessly. Following a J.J. Watt fumble recovery, forced by Whitney Mercilus, who had a big game (2 sacks), the Texans were able to kick a field goal and go up 13-0. The Steelers, looking like a decaying team, didn't appear as though they were going to be competitive whatsoever. And then Pittsburgh scored three touchdowns in 73 seconds, going up 24-13 at the break. Mike Tirico appropriately called it a Steelers avalanche, and it began when Le'Veon Bell broke free for two long receptions. This was followed by a Roethlisberger 35-yard touchdown bomb to Martavis Bryant, who was active for the first time in his career. The Texans then helped Pittsburgh's cause by committing a pair of turnovers. Arian Foster had a strange fumble inside his own 5-yard line where the Steelers didn't even realize that they recovered the ball (they were awarded possession following a replay). Fitzpatrick also threw an interception deflected and caught by Brett Kiesel, which Pittsburgh returned into the red zone. The Steelers capitalized on both opportunities. Antonio Brown threw a left-handed touchdown pass to Lance Moore, while Roethlisberger fired a quick scoring strike to Le'Veon Bell just two plays after the Kiesel pick. Houston struggled to move the chains in the second half, often failing to come up with the line to gain on second- and third-and-short. In fact, Arian Foster was stuffed four times in short-yardage situations. The Texans even had to call a fake punt out of frustration, which they converted with Alfred Blue. Foster gained 102 yards on 20 carries, and he also caught four passes for 13 receiving yards and a touchdown, so it was strange to see him come up short in all of those instances. ",
            "2": "Ryan Fitzpatrick, meanwhile, couldn't get anything going either following that strong start. The Steelers began blitzing, and Fitzpatrick couldn't handle it for the most part. He picked up some garbage yardage late to post respectable stats (21-of-32, 262 yards, 2 TDs, 1 INT). That said, Fitzpatrick wasn't the primary reason the Texans lost this game. That would be the turnovers. In addition to his pick and the Foster fumble, DeAndre Hopkins also coughed up the ball past midfield on what looked like a promising drive in the fourth quarter. The turnover allowed the Steelers to ice the game. Hopkins led the Texans with six catches for 108 yards. Andre Johnson (5-77) also had a decent statistical outing, but failed to do much in non-garbage time. ",
            "3": "As for the Steelers' stats, Roethlisberger went 23-of-33 of 265 yards and two touchdowns. He struggled with protection early, though he held on to the ball too long, allowing Watt and Mercilus to make quality plays. Roethlisberger became very aggressive when Watt was briefly knocked out with what appeared to be a chest injury. He launched a 30-yard bomb to Brown, and then he appeared to connect with Brown on another long pass for a touchdown, but official Walt Coleman curiously overturned the call when there was no evidence to support a reversal. It just appeared to be too close to change the ruling, so I'm wondering what Coleman saw - outside, of course, of the senile visions he often experiences. ",
            "4": "Only a pair of Steelers caught more than two passes. Those would be Antonio Brown (9-90), and Le'Veon Bell, who snatched all eight of his targets for 88 receiving yards and a touchdown. He didn't have as much success on the ground outside of a 20-yard burst, gaining 57 rushing yards on 12 carries. ",
            "5": "Roethlisberger's first score, as mentioned, went to Bryant (2-40), who saw five targets come his way. Perhaps the athletic Bryant will finally be the replacement for Santana Holmes that the Steelers have been looking for. Well, that's what Jon Gruden believes, anyway. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    }
}