{
    "year": "2012",
    "week": "19",
    "Game 1": {
        "Team 1": {
            "Name": "49ers",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "31"
        },
        "comments": {
            "amount": "4",
            "1": "So, I think it's time for the NFL to be a bit concerned about what's going on in San Francisco. Last year, and most of this season, the 49ers had been a team with a stout defense and a solid running game, but limited offensively because of Alex Smith's physical inadequacies. Smith did a good job of managing most games, but didn't offer a vertical dynamic to the offense. That has changed. Colin Kaepernick was brilliant in San Francisco's second divisional-round victory in as many years, outplaying Aaron Rodgers by a wide margin - which is saying a lot because Rodgers performed well. Kaepernick came out of the tunnel with a pick-six, but was unstoppable after that. He finished 17-of-31 for 263 yards, two aerial touchdowns and the interception, as well as 183 rushing yards and two scores on the ground on 16 scrambles. Kaepernick had 80 rushing yards after 28 minutes of action. This is significant because he broke the record for most rushing yards in a playoff game by a quarterback at that point - and he went on to more than double that total! The Packers were just so incredibly befuddled by what they saw. Dom Capers kept the defense in man too long and consequently paid the price. All of the defenders, including Clay Matthews, were constantly fooled by the read option, which Kaepernick orchestrated to perfection. Many people on Twitter compared Kaepernick's performance to that of QB Dog Killer in Madden 2004. It was just that dominant, and quite frankly, it wasn't fair for the Packers. They just stood no chance. ",
            "2": "Aaron Rodgers was able to match the 49ers point for point for slightly more than one half of action, but he couldn't keep up the pace. His team was just exhausted beginning in the middle of the third quarter because the game was too late. I discussed this on my NFL Picks page - San Francisco had a tremendous advantage in this contest because of the 8 p.m. start time. Circadian rhythms set in, and many Packer bodies shut down just after halftime. I don't think Green Bay would have won either way, but it turned into a blowout because of the NFL's irresponsible scheduling. This should have been a much tighter battle. At any rate, Rodgers finished 26-of-39 for 257 yards, two touchdowns and an interception that was pretty much like a punt on third-and-long. Rodgers didn't misfire on many attempts, but his big incompletion was a slight overthrow of Greg Jennings in the beginning of the fourth quarter when this contest was still in question. Mike McCarthy then opted to punt on the ensuing 4th-and-5 despite being at midfield, which I thought was a huge mistake because the Packers hadn't been close to Kaepernick all evening. Green Bay pinned the 49ers deep, but as expected, Kaepernick drove the team down 93 yards for the game-sealing score. ",
            "3": "Both running backs looked good. Green Bay had to abandon the run because of its deficit, but DuJuan Harris managed 53 yards and a touchdown on only 11 carries. Frank Gore, meanwhile, was the beneficiary of the read-option, gaining 119 yards and a score on 23 attempts. ",
            "4": "Gore was great, but San Francisco's top skill-position player was Michael Crabtree, who hauled in nine receptions for 119 yards and two touchdowns. Meanwhile, Rodgers' two scores went to Greg Jennings (6-54) and James Jones (4-87). "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "28"
        },
        "comments": {
            "amount": "8",
            "1": "No one can say that Matty Ice melts down in crunch time anymore. It appeared as though the Falcons would blow yet another playoff game after they squandered two separate 20-point leads, but Matt Ryan led the team down the field in just half a minute to set up Matt Bryant's game-winning field goal. Atlanta finally got the monkey off its back. Things looked bleak for a while. When Russell Wilson converted a crucial third down with 44 seconds left, it appeared as though the Falcons were destined to lose yet again. And when official Walt Coleman ruled that Marshawn Lynch broke the plane of the goal line, which gave Seattle a 28-27 lead, it was assumed that Atlanta would once again would be one-and-done in the playoffs. But Ryan stepped up when it counted most - as he's done for most of this season. Ryan finished 24-of-35 for 250 yards, three touchdowns and two interceptions. He had some shaky moments, particularly in the middle of the fourth quarter when he failed to advance the chains, but his final completions of 22 and 19 yards to Harry Douglas and Tony Gonzalez, respectively, were absolutely huge for this franchise. ",
            "2": "Speaking of Gonzalez, it was cool to see him crying after the game was over. Gonzalez, who tied Julio Jones with a team-high six receptions for 51 yards and a touchdown, just won his first playoff contest in his Hall-of-Fame career. Roddy White (5-76) and Jason Snelling caught Ryan's other scores. ",
            "3": "As for the Seahawks, they probably would have prevailed had Pete Carroll not been guilty of some egregious errors in the first half. He opted to go for it on a 4th-and-1 inside Atlanta's 15, which I didn't have a big problem with until he called for a Michael Robinson carry that was easily stuffed. Marshawn Lynch wasn't even on the field for some strange reason. Later on, the Seahawks left points off the board when Wilson took a sack with about a dozen seconds remaining prior to intermission. I don't know why Carroll didn't have his field-goal unit prepared, but Wilson tried to run a play on fourth down when time expired. Wilson's sack was his only blunder in what was an awesome afternoon for him. The dynamic rookie went 24-of-36 for 385 yards, two touchdowns and an interception (on the final Hail Mary) while leading the team with 60 rushing yards and a third score on the ground. He was unbelievable after halftime, going 14-of-19 for 241 yards following the break. The Falcons simply had no answer for him, as he led his team to the end zone on all but one of his final five drives if the Hail Mary at the end is excluded. ",
            "4": "It's remarkable that Wilson played so well when he didn't have Lynch assisting him. The stud back had an unusually poor outing, gaining just 46 yards and a touchdown on 16 carries. He also fumbled in the first quarter to set up an Atlanta touchdown. ",
            "5": "Some of the skill players who stepped up were Zach Miller and Golden Tate. The former hauled in eight balls for 142 yards and a touchdown, while the latter made six grabs for 103 yards and a score. I was disappointed that Wilson didn't try to air it out to Tate during his Hail Mary attempt. ",
            "6": "The Seahawks were really hurt by injuries to Chris Clemons and Red Bryant (he's been playing on a bum foot all year). They couldn't pressure the quarterback - Ryan wasn't sacked a single time - and they had major problems stopping the run. Both Michael Turner (14-98) and Jacquizz Rodgers (10-64) managed to rush for at least 6.4 yards per carry. Rodgers had several awesome runs, including one where he just bulldozed safety Earl Thomas. ",
            "7": "Speaking of injured defenders, John Abraham aggravated his ankle. He barely played. The Falcons will need him when they host Colin Kaepernick and the 49ers next week. ",
            "8": "FOX color analyst Brian Billick said some strange things. When the Falcons won, he commented, This win legitimizes the Seattle Seahawks as the No. 1 seed and as the team to beat. He also suggested that the Seahawks should kick a field goal and then attempt an onside kick down six with 44 seconds remaining. It's been reported that Billick interviewed with the Eagles for their head-coaching position. I hope he takes the job so that we don't have to listen to his ridiculous analysis anymore. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "28"
        },
        "comments": {
            "amount": "5",
            "1": "Arian Foster posted a picture of a Boston Globe article as his Twitter avatar this week. This article discussed how the Patriots were extremely fortunate to have two byes in the playoffs. Foster and his team used this as motivation. No one was giving them a chance despite their 12-4 record, so they were geared up for this rematch. Well, it turns out the Boston Globe was absolutely correct. The Patriots were granted two byes this January after all. The Texans offered very little resistance, and this final score isn't indicative of how much of a blowout this was. New England was up 38-13 at one point, and if the team didn't take the foot off the gas, it probably could have won by 40. This game was all about great plays by Tom Brady and blown opportunities by the Texans. Brady was amazing, as he went 25-of-40 for 344 yards and three touchdowns. The numbers could have been even better, but there were a few drops, including two by Wes Welker (8-131). New England's up-tempo offense was simply too much for Houston to handle. There were several occasions when the Texans were inexplicably caught offguard by the speed of the Patriots. You'd think they would have learned from the beatdown they suffered at Foxborough in December, but apparently not. ",
            "2": "It wasn't all positive for the Patriots. Both Rob Gronkowski and Danny Woodhead went down with injuries. Gronkowski will need more surgery on his elbow, so he's out for the playoffs. Still, it was impressive that New England didn't miss a beat with those two playmakers off the field. Brady constantly fed it to his other running backs; Stevan Ridley rushed for 82 yards and a touchdown on 15 carries, while Shane Vereen scored thrice, accumulating 41 rushing yards (seven attempts) and 83 receiving yards (five catches). ",
            "3": "As for the Texans, things seemed very promising early on when Danieal Manning took the opening kickoff to the New England 12-yard line. However, they settled for three instead of seven, which has been a theme for them of late. Matt Schaub threw a perfect pass to James Casey in the end zone, but the tight end dropped it. Schaub then missed Andre Johnson (8-95) on third down, so Houston had to kick a field goal. Schaub finished 34-of-51 for 343 yards, two touchdowns and a pick, but don't be fooled by those stats because they were padded in fourth-quarter garbage time. Schaub wasn't terrible, but he could have been much better. He missed some open targets and fumbled the ball when he was moving out of the pocket and carrying it around loosely. His interception was a killer; his team was in field-goal range down 11 in the third quarter. He carelessly lofted a pass over the middle of the field, but didn't see Rob Ninkovich dropping into coverage. ",
            "4": "Schaub's touchdowns went to DeVier Posey (3-47), who suffered an injury in the fourth quarter, and Arian Foster, whose seven catches for 47 yards complemented his 90 rushing yards and score on the ground on 22 carries. However, Foster struggled to run early on, and he was guilty of a dropped ball on what surely looked like it would be a long gain. ",
            "5": "New England will host the Ravens next Sunday in what will be a rematch of last year's AFC Championship. The Patriots are so sound offensively and defensively, but they have to be concerned about kick coverage. Manning had two big kickoff returns, so Jacoby Jones, who has three special-teams touchdowns this season, has to be licking his chops. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "3"
}