{
    "year": "2012",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "There's a reason the Raiders have gone 10 years without making the playoffs. They always do stupid things. This week's blunder had to do with the quarterback position. When Carson Palmer suffered a rib injury early in the first quarter, it gave the Raiders an excuse to give snaps to Terrelle Pryor. I mean, why not see what he has with an offseason coming up? That would have been the logical decision. However, 15-year-old head coach opted to go a different route. He went with Matt Leinart. Matt Leinart? Matt Leinart!? Why!? Haven't we seen enough proof that he sucks? I guess Allen is too young to remember when Leinart played for Arizona. Leinart was predictably horrible, going 16-of-32 for 115 yards and an interception to set up a Carolina touchdown right before halftime. Most of his completions were checkdowns. As for Pryor, he played a handful of snaps. He completed a 5-yard pass, rushed for two yards and hauled in a 22-yard reception. And that was it. Nice job, Dennis. ",
            "2": "Cam Newton was solid yet again, going 18-of-29 for 170 yards, two touchdowns (one passing, one rushing), 60 yards on the ground and an interception. The pick was his first since Week 10, but it came off a tipped pass. It's worth noting that Newton was whistled for a 15-yard personal foul for bumping an official because he was frustrated about an uncalled late hit. Some of the Raiders, led by Tommy Kelly, of course, took cheap shots on the Panthers all afternoon. ",
            "3": "Newton's aerial score went to Steve Smith (4-45). Greg Olsen led the team in receiving with six catches for 53 yards. ",
            "4": "The Panthers didn't run the ball very well for the first time in weeks. Take away Newton's stats, and they mustered just 52 yards on the ground. DeAngelo Williams (10-19) was a huge disappointment, though he did have a 76-yard touchdown nullified because of a hold. ",
            "5": "Speaking of ineffective running backs, Darren McFadden managed just 33 yards on 17 attempts. He also had a touchdown that was nullified by a hold, but the fact remains that his explosion is inexplicably gone. ",
            "6": "Oakland's leading receiver was Darrius Heyward-Bey (2-31). After that it was Pryor. That's how bad Leinart was. He struggled to move the chains all afternoon, converting just 4-of-15 third downs. It was so bad that after his team recovered a punt return fumble at the Carolina 32-yard line, the Raiders couldn't even attempt a field goal attempt with Sebastian Janikowski because of two negative plays and a penalty. Pryor needs to start next week, but Oakland is stupid, so the team can't be counted on to make the correct decision. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Saints",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "Oh, the Cowboys have finally gotten their act together, right? What an impressive victory against the Steelers last week; they must have learned how to win! Umm... no. It's the same old Cowboys. They get their fans' hopes up, and then absolutely crush them. Dallas' defense just had no answer for the Saints, who easily won the yardage battle, 562-446. Drew Brees was unbelievable, going 37-of-53 for 446 yards and three touchdowns - numbers that could have been even better if his targets hadn't dropped about half-a-dozen passes. The Cowboys just couldn't get New Orleans' offense off the field; Brees was an unreal 11-of-19 on third down, as it helped that Dallas simply didn't seem to realize that Brees was capable of throwing short passes to his backs. And on one instance on a goal-to-go in the fourth quarter, Dallas actually had just nine defenders on the field, but the Saints called timeout because the clock was running down. ",
            "2": "Four New Orleans players hauled in at least seven receptions: Marques Colston (10-153), Sproles (7-104), Jimmy Graham (7-88) and Pierre Thomas (7-61, TD). Colston had what looked like a huge fumble in the red zone in overtime, but the Saints were fortunate enough to recover on the Dallas 2-yard line, though I questioned why New Orleans was able to advance the ball on a forward fumble. Meanwhile, Graham's numbers were great, but he was guilty of some of the drops and a key false start when the Saints were trying to run out the clock. He made up for it, however, when he recovered Colston's aforementioned fumble. ",
            "3": "Brees' other touchdowns went to Lance Moore (4-30) and David Thomas. ",
            "4": "Sproles ran well (9-48), but Mark Ingram and Thomas couldn't find much running room, which was surprising because the Cowboys had been gashed on the ground ever since losing several key players to injury. Ingram (21-53) did save his fantasy owners with a touchdown. ",
            "5": "The Cowboys choked yet again, but don't blame Tony Romo. He went 26-of-43 for 416 yards and four touchdowns. He found Miles Austin-Jones in the end zone on a fourth down for the game-tying score at the end of regulation. Romo showed tremendous faith in Austin-Jones (4-45), who hurt him with three drops on the afternoon. ",
            "6": "Romo's two other prominent targets are worth noting. Dez Bryant had a monstrous performance, catching nine balls for 224 yards and two touchdowns. His scores, both 58 yards, featured completely pathetic New Orleans coverage and tackling. In my notes, I described the latter as worst tackling of all time pertaining to the second touchdown. Witten, meanwhile, hauled in six balls for 60 yards. It wasn't a great afternoon overall, but he managed to break the single-season receptions record for tight ends with 103. ",
            "7": "DeMarco Murray couldn't get much on the ground, gaining 40 yards on 11 carries. He did catch four balls for 51 yards, but had a key fumble that set up an easy New Orleans score. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Packers",
            "Points": "55"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Well, I guess the good news for Tennessee fans is that Bud Adams will almost surely fire the coaching staff for this. Adams threatened everyone following a blowout loss to the Bears much earlier in the season, but this was way worse. It could be the final straw in Mike Munchak's failed tenure as head coach of this organization. This game was just as ugly as the score indicates. It didn't even look like two NFL teams were playing this afternoon. The real statistics look even worse than the final ones, as the Titans padded some stats when they were down 55-0. By the time the score was 41-0, the Packers had the yardage lead, 421-115. Jake Locker was a miserable 7-of-20 for 66 yards and two interceptions. Aaron Rodgers, meanwhile, was unstoppable, especially in the second half, when he went 12-of-13 for 190 yards and two touchdowns. Rodgers' final numbers were 27-of-38 for 342 yards and four touchdowns (three passing, one rushing). He barely saw any pressure, as Tennessee mustered only one sack. ",
            "2": "Rodgers' aerial scores went to James Jones (7-100), Randall Cobb (3-62) and even Greg Jennings (7-45), who almost hauled in a second touchdown. Cobb suffered an ankle injury in the third quarter. Meanwhile, Jermichael Finley didn't find the end zone, but he's worth noting because he nearly made an amazing one-handed grab, but the ball hit the ground for a moment. He snagged five receptions for 70 yards. ",
            "3": "It was cool to see Ryan Grant run well for the first time in years. He tallied 80 yards and two touchdowns on 20 carries. DuJuan Harris chipped in with 29 yards and a score on 20 attempts. ",
            "4": "As for the Titans, Locker's final stats looked like this: 13-of-30 for 140 yards, one garbage-time score and two picks. The interceptions weren't his fault - one was a miscommunication with Kenny Britt (2-41), while the other sailed right through Damian Williams' arms - but he still was terrible. Of course, it didn't help him that his banged-up offensive line couldn't block the Packers, who collected a whopping seven sacks. ",
            "5": "Locker happened to lead the team in rushing, gaining 32 yards on four scrambles. Chris Johnson (11-28), who missed some time with a minor injury, couldn't find any running lanes. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "If you were to tell me that the Vikings would beat the Texans by 17 points, I, as well as any other football fan, would have assumed that Adrian Peterson went nuts and inched very close to breaking Eric Dickerson's single-season yardage mark. But that was hardly the case. Peterson had several good runs, but this was mostly about great Minnesota defense and Christian Ponder making several impressive throws to keep drives alive. The Vikings' stop unit was absolutely dominant. They completely shut down the run, limiting Arian Foster to 15 yards on 10 carries. It was easily his worst outing of the season. Making matters worse, Foster lost a fumble in the first half and later exited the contest in the second half with an irregular heartbeat. Foster called it a very minor situation. Meanwhile, Ponder had some brilliant moments, as indicated earlier. He also made several terrible throws. It was crazy how inconsistent he was. He'd make an awful-looking pass and then come back and convert a long-yardage situation. In all, Minnesota was 9-of-18 on third down, as Ponder went 16-of-30 for 174 yards and a touchdown. He also had seven scrambles for 48 rushing yards. ",
            "2": "Adrian Peterson still was great though. The Texans loaded the box on every play, so Peterson had many losses. However, he broke loose for several impressive gains, ultimately finishing with 86 yards on 25 carries. Peterson now has 1,898 rushing yards. He needs 208 yards to break Dickerson's record, which is feasible, though the Packers, who happen to be next week's opponent, just limited Chris Johnson to 26 yards. ",
            "3": "Ponder's lone touchdown went to Kyle Rudolph (3-39). Jarius Wright was the team's leading receiver; he had five receptions for 53 yards. ",
            "4": "As for the Texans, Matt Schaub just looked completely lost without a running game, which is the main concern for this team. If they battle an opponent in the playoffs that is capable of shutting down Foster, will they be able to move the chains consistently? They certainly weren't able to do that in this contest, as Schaub went 18-of-32 for 178 yards. ",
            "5": "The only Houston player with more than three catches and 27 receiving yards was Andre Johnson (7-97). Minnesota made an extra effort to shut down Schaub's tight ends. ",
            "6": "J.J. Watt is worth noting because he recorded a sack, giving him 20.5 on the year. It's a shame because Watt was so very close to collecting two more on top of that. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "One quarterback opened this contest 6-of-6 for 56 yards and a touchdown. The other was guilty of an interception on his first drive. But Chad Henne was the first signal-caller and Tom Brady was the second, and not the other way around. The Patriots played exactly as they did last Sunday night against the 49ers. They started sluggishly and committed turnovers, but then got their act together to mount an impressive comeback. This time, however, they didn't battle a team good enough to reestablish a lost lead - though Jacksonville came incredibly close. Brady began the game 3-of-10 for 50 yards and two interceptions. One of the picks was his fault, but the other was on Stevan Ridley, who tipped the ball into the air. I questioned why Ridley (18-94) was even on the field after fumbling twice last week, but Bill Belichick apparently wanted to see if his young back could be more careful with the football. Apparently not. Fortunately for New England, Brady eventually figured out Jacksonville's defense. After beginning 3-of-10, Brady was 21-of-31 for 217 yards and two touchdowns from then on, though one of his scores shouldn't really have counted because one of the Patriot receivers got away with a blatant offensive pass interference pick play. The Jaguars, as mentioned, nearly came back after blowing their 13-3 lead. They were down seven with a third-and-goal on the half-inch line. Unfortunately, Zach Potter false started, and Jacksonville ultimately got no points out of the drive because Mike Mularkey stupidly opted to go for it on a 4th-and-10. It's amazing how frequently Mularkey goes for it on fourth down despite failing nearly every time. It's like he has no clue. ",
            "2": "Brady's final numbers were 24-of-41 for 267 yards, two touchdowns and the pair of picks. His scores went to Wes Welker (10-88) and Danny Woodhead. Brandon Lloyd (6-62) was just OK, but Aaron Hernandez killed his fantasy owners with just a 13-yard reception. ",
            "3": "Henne (29-of-51, 348 yards, TD, 3 INTs) was absolutely miserable in the second half, going 14-of-27 for 138 yards and three picks following the break. His worst pick occurred when he inexplicably didn't see a Patriot defensive back. ",
            "4": "It didn't help Henne's cause that his receivers dropped four passes. Justin Blackmon (7-79) caught the lone touchdown, while Cecil Shorts pitched in with six grabs for 54 yards before leaving the game with a concussion in the fourth quarter. Jordan Shipley (5-82) was the team's leading receiver. ",
            "5": "Montell Owens gained just 42 rushing yards on 10 carries, but it's worth noting that he picked up a 53-yard reception at the end of the first quarter to set up a Jacksonville field goal. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "3",
            "1": "Congratulations to both the Colts and Chiefs for amazing achievements in this game. The Colts clinched a playoff berth with this victory. The Chiefs, meanwhile, became the first team in at least 23 years to rush for 350-plus yards and lose. I don't know which one is more impressive. Let's begin with the Colts. They were actually outgained in this contest, 507-288, and those numbers are not misleading. Kansas City's defense had a very spirited performance, shutting down the run - Vick Ballard managed 69 yards on 20 carries - and putting heavy pressure on Andrew Luck. The Chiefs mustered three sacks, but it could have easily been several more. Luck looked like a mere rookie in this contest, going 17-of-35 for 205 yards and a touchdown, though the score was a clutch one on third down late in regulation to take the lead for good. However, Luck held on to the ball way too long in the pocket. On a couple of occasions, it appeared as though the Chiefs would be able to strip-sack him, but he tucked the ball away just in time. ",
            "2": "Luck's game-winning touchdown went to Reggie Wayne, who tied for the team receptions lead with Donnie Avery (5-38), catching five balls for 81 yards and the score. TY Hilton (2-34) disappointed. ",
            "3": "Indianapolis' rush defense is a major concern. Kansas City racked up a whopping 352 net rushing yards. Jamaal Charles ripped off an 86-yard touchdown on the first play from scrimmage in the third quarter, ultimately finishing with 226 yards on just 22 carries. Peyton Hillis also was great, gaining 101 yards on only 15 attempts. Having said that, the Chiefs ran the ball one more time than they needed to. Down 27-20 late in regulation, they inexplicably gave Hillis a carry on a 3rd-and-8. Hillis managed just a minimal gain, forcing a punt. Kansas City never got the ball back. Romeo Crennel just didn't trust Brady Quinn at that point, but you can't really blame him. Quinn was anemic, going just 10-of-22 for 162 yards and two picks. One of the interceptions, which was taken back for a touchdown, occurred because the receiver wasn't looking. However, Quinn actually tossed a third interception, but the official called the Colts for an awful pass interference. The NFL will be better off if Quinn never plays a single snap ever again. Unfortunately, Crennel doesn't have any incentive to try out Ricky Stanzi, so Kansas City fans will probably have to deal with Quinn for one more week. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "This game was all about Reggie Bush and Lamar Miller dominating Buffalo's defense and the Bills killing themselves with mistakes. Buffalo had a chance to make this a close contest, but it had a dropped Stevie Johnson touchdown and three key turnovers, which derailed its efforts. Buffalo actually outgained Miami by 80 yards, but the three giveaways were killers. The first occurred when Johnson (4-44) fumbled in the red zone. Dorin Dickerson them fumbled in Dolphins' territory. After that, Ryan Fitzpatrick coughed the ball up, setting up a Miami score. Give credit to the Dolphins though, as they took advantage of Buffalo's mistakes. Bush gained 65 yards on the ground (19 carries) and 42 yards aerially (4 catches) and scored thrice in the process. Miller, meanwhile, mustered 73 yards on 10 attempts. He could be the team's starting running back next year, as Daniel Thomas is just a mediocre plodder. ",
            "2": "Ryan Tannehill, who was incredibly sharp in the second half of last week's contest, played well again. He went 13-of-25 for 130 yards and two touchdowns thrown to Bush. He also rushed for 44 yards on six scrambles. ",
            "3": "Tannehill's leading wideout was rookie Rishard Matthews (2-37). Brian Hartline had a pedestrian performance, snagging two balls for 12 yards, as he couldn't get open against rookie corner Stephon Gilmore. ",
            "4": "Speaking of stud corners, Sean Smith left the game with a knee injury. He'll probably be out next week. ",
            "5": "As for the Bills, Fitzpatrick was awful. His final numbers don't look bad - 20-of-35, 240 yards, one touchdown and an interception - but he padded those with junk yardage at the very end. He was just 6-of-13 for 75 yards at halftime. ",
            "6": "Buffalo was able to move the chains via C.J. Spiller, who tallied 138 yards on 22 carries, which includes a 62-yard burst to set up a field goal. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "So, Mark Sanchez isn't the answer. Greg McElroy, as we discovered today, is far from the solution as well. Oh, if only the Jets had another quarterback on the roster - one who pulled off marvelous fourth-quarter comebacks last year. What a shame that they don't possess such an individual. Darn it! McElroy wasn't as awful as Sanchez, but he was pretty ineffective. He went 14-of-24 for 185 yards, an interception and a lost fumble. Worst of all, he took a ridiculous 11 sacks, including 2.5 from Shaun Phillips and 3.5 from impressive rookie Kendall Reyes. McElroy is what he is - a game-manager who could at the very best Dilfer a team to a Super Bowl if the NFL still had the same passing rules of 10 years ago. But that's no longer the case, though I don't think Rex Ryan seems to realize that. Ryan, by the way, announced that McElroy will be the starter next week. That's because he doesn't have a quarterback who can win games on his roster. ",
            "2": "The Jets were able to establish a 14-7 lead thanks to some gimmick plays, including a 42-yard Jeremy Kerley pass to Clyde Gates. Shonn Greene scored both touchdowns, but couldn't do much else on the ground, gaining only 38 yards on 14 carries. ",
            "3": "Philip Rivers won this game and threw two touchdowns on 11-of-22 passing for 165 yards. That's the good news. The bad news is that Rivers was still pressured early and often in this contest, taking four sacks. ",
            "4": "Rivers' scores went to his two main guys: Danario Alexander (3-69) and Antonio Gates (2-44). If there's a silver lining to this season, it's that Rivers may have found a decent No. 1 wideout in Alexander. ",
            "5": "With Ryan Mathews out of the lineup, Jackie Battle handled most of the workload, tallying 49 yards on 19 carries. Ronnie Brown (5-31) didn't do much outside of third-down situations despite speculation that he would. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "The biggest takeaway from this game is that the Redskins won their second-consecutive contest despite not having a healthy Robert Griffin at their disposal. Griffin actually started this divisional matchup, but it was clear that he wasn't 100 percent. He looked gimpy, and the Redskins' coaching staff made sure to limit his rushing attempts. Still, Washington's rookie signal-caller prevailed over Philadelphia's. Griffin scrambled just twice for four rushing yards, but he was able to showcase his passing skills, going 16-of-24 for 198 yards, two touchdowns and an interception. Nick Foles, meanwhile, was very impressive at times, but showed his inexperience in some instances. He was able to go 32-of-48 for 345 yards, one touchdown and an interception that was the result of a tipped pass. However, he checked down often and lost a fumble because he held on to the ball too long. Later on, he did a good job of leading his team into the red zone on the final drive, but he short-armed a pass to an open Jeremy Maclin in the end zone for what would have been the game-tying score. Almost immediately afterward, Foles was guilty of intentional grounding, which ended the contest because of the added 10-second run-off. ",
            "2": "Maclin missed out on the touchdown at the very end, but still managed to put together a monstrous performance. He caught eight balls for 116 yards and a score. ",
            "3": "Two other Eagles caught at least eight balls. One was Jason Avant (8-70), while the other was LeSean McCoy, whose nine catches for 77 receiving yards saved his fantasy day. McCoy gained 45 yards for 13 carries on the ground. Bryce Brown didn't do much (4-18), as he was relegated to return work. In fact, it was Dion Lewis who vultured a touchdown from McCoy. ",
            "4": "Washington's running back did not disappoint. Alfred Morris mustered 91 yards and a touchdown on 22 attempts. He needed to have a good game with Griffin hobbling around. ",
            "5": "Griffin's two scores went to Joshua Morgan (2-21) and Santana Moss (2-26), who made an incredible toe-tap catch in the end zone. Pierre Garcon was the only Redskin with more than two catches. He logged seven receptions for 89 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "<i> WALT'S NOTE: Why have the Steelers transformed into the Cowboys? So weird. I don't get it. </i> ",
            "2": "All of sudden over the past two weeks, Ben Roethlisberger seems to have lost his ability to play in clutch time or elevate his level of play with the postseason on the line. He gave the Bengals their only touchdown with a pick-six, and a terrible fourth-quarter interception set up Cincinnati kicker Josh Brown to hit a 43-yard field goal with only seconds remaining. This was the second straight week Roethlisberger choked in crunch time and threw a bad interception to set up the game-winning field goal for the opposition. As a result, the Steelers will miss out on the playoffs, and Cincinnati clinched a wild-card berth for the second-straight season. ",
            "3": "The Bengals were all defense, as their stop unit carried them to a win with little help from the offense. Geno Atkins was just awesome. All day, he dominated guards David DeCastro and Ramon Foster. Atkins had 2.5 sacks and forced a fumble on a punishing hit on Roethlisberger. Atkins' sack-fumble came close to knocking Big Ben out of the game as he had to be helped off the field. Michael Johnson and Cincinnati's secondary had an impressive games as well. ",
            "4": "As for the scoring, the Bengals' stop unit took the lead late in the first quarter. Leon Hall made a great read of Roethlisberger to jump in front of Heath Miller (3-45) for an interception. Hall returned the pick 17 yards for a touchdown. The Steelers answered with a drive but missed a gimme 24-yard field goal in the second quarter thanks to a bad snap. Dalton engineered a drive for a field goal near the end of the first half. Roethlisberger answered as he got the Steelers on the board with a 60-yard touchdown pass to Antonio Brown (5-97) after he burned Adam Jones on a go route. The second half saw a lot of inept offense and two good defenses. Dalton was intercepted on the first play of the third quarter by Cortez Allen. It was a bad throw by Dalton, who had telegraphed the pass. The Bengals had a nice drive inside the Steelers' 20-yard line, but penalties pushed them way back into a fourth-and-22. Instead of a long field goal of around 50 yards, Cincinnati went for it. The team would've had it, but A.J. Green was pushed out of bounds before he could get two feet down on a superb catch. Pittsburgh took advantage with a drive that produced a Shaun Suisham 40-yard field goal. The Bengals crossed midfield in the fourth quarter but Green fumbled the ball away after getting hit by Allen. Dalton threw another pick to Allen, who made a great catch off a deflection. Cincinnati missed a 56-yard field goal late in the fourth quarter, but the Steelers missed a 53-yard field goal, too. With 20 seconds remaining, Roethlisberger made a dumb decision and overthrew Mike Wallace (1-3) on a roll out. The ball was easily picked off by Reggie Nelson. Dalton made a huge throw to Green to move the ball about 20 yards and get in range for the game-winning 43-yard field goal by Josh Brown. ",
            "5": "Roethlisberger was 14-of-28 for 220 yards with a score and two picks. Pittsburgh's ground game never got into a groove. Jonathan Dwyer (14-39) and Rashard Mendenhall (11-50) had some nice runs but never could establish control against the tough Bengals defense. ",
            "6": "One field-goal drive was all Cincinnati's offense could muster. The Steelers shut down the Bengals' ground offense, rendering BenJarvus Green-Ellis (15-14) completely ineffective. All Cincinnati could do to move the ball was some occasional completions to A.J. Green (10-116), Marvin Jones (5-65) and Jermaine Gresham (3-38). Dalton was 24-of-41 for 278 yards with two interceptions. ",
            "7": "Pittsburgh's defense played a great game as well. The stop unit kept the Bengals' offense out of the end zone and dominated the line of scrimmage. Allen was phenomenal, producing three turnovers for the Steelers. Lawrence Timmons (two sacks), Brett Keisel (1.5), James Harrison, Troy Polamalu and Steve McLendon all had sacks on Dalton. Some were Dalton's fault as he held onto the ball too long. Pittsburgh's defense played well enough to win, but the failings of Roethlisberger and the offense is why the Steelers will be watching in January. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Rams",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "<i> WALT'S NOTE: The Buccaneers seem to be mailing it in. You have to wonder if they've quit after the front office dealt Aqib Talib. Trading one of their top defenders amid a playoff race can't have pleased the locker room. </i> ",
            "2": "St. Louis' offense didn't do much, but didn't need to as Tampa Bay repeatedly turned the ball over on interceptions and got stopped on fourth down. After getting shut out last week by the Saints, Josh Freeman had a nice opening drive to get the Bucs a field goal. After that, the Rams' defense made the following plays to get the win:  - After Sam Bradford threw an interception in the end zone to Danny Gorrer, Freeman gave it right back when he was picked off by Janoris Jenkins. The rookie corner returned the ball 41 yards for a touchdown. Freeman made a terrible decision throwing off his back foot to a well-covered receiver.  - Just before halftime, Freeman threw another bad interception into a group of defenders. Linebacker James Laurinaitis came down with the ball. That set up a nice drive by Bradford that ended with a Steven Jackson (19-81) touchdown run.  - A few plays after St. Louis' touchdown that opened the third quarter, Freeman dialed up the Rams up for points with an interception to Trumaine Johnson. Bradford tossed a short touchdown pass to Austin Pettis. Those 21 points off of turnovers were the difference in the game. ",
            "3": "Offensively, St. Louis got what it needed on the first play of the third quarter when Tampa Bay was caught in busted coverage. Tight end Lance Kendricks (4-119) was wide open and was hit in stride by Bradford. Danny Amendola (2-5) got two great blocks downfield to spring Kendricks for an 80-yard touchdown. Other than that play, the Bucs' defense shut down Bradford and the Rams' offense in the final two quarters. Bradford finished 13-of-27 for 196 yards with two touchdowns and an interception. ",
            "4": "Freeman hit a 61-yard touchdown pass to Mike Williams after some missed tackles and angles from the St. Louis secondary. That play got Freeman back on track as he had a good drive with Williams (7-132) to move the ball to the 5-yard line. On fourth-and-1, down 28-13 late in the third, the Bucs went for it and were stuffed short by Michael Brockers. A 50-yard pass to Vincent Jackson (7-108) set up the Bucs inside the Rams' 5-yard line, but once again the defense made a stop on fourth-and-goal to take away points from Tampa Bay. Freeman's fourth interception came after Brockers batted a pass and Eugene Sims tracked down the ball. St. Louis' defense had two more fourth-down stops late in the fourth quarter. Freeman finished 30-of-54 for 372 yards with a score and four interceptions. The Rams' defense focused on Doug Martin (18-62 rushing, 7-57 receiving) and dared Freeman to beat them. ",
            "5": "St. Louis' defense gave up a few big pass plays, but overall the stop unit was excellent against Tampa Bay. It could have been worse for the Bucs as the Rams' defense came close to a number of other interceptions, and Tampa Bay recovered a couple of its own fumbles. The St. Louis defensive line played really well too, recording five sacks. Williams Hayes (two sacks), Chris Long (one sack), Kendall Langford (one sack), Brockers and Quintin Mikell (sack-fumble) all stood out. Jenkins and Johnson also had impressive days for the Rams. ",
            "6": "This was a tough loss for the Bucs as it ensured the team its third losing season in the last four years. Tampa Bay could also finish in last place in the NFC South for the third time in four years. At the end of his fourth season, Freeman should not be this much of a work in progress. The Bucs need to bring in some legitimate starting quarterback competition during the offseason. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "The Browns had no chance. This was one of those games where Peyton Manning was completely locked in, and there was nothing for the opposition to do but pray that his supporting cast would make mistakes. That actually happened once when Manning's target ran a wrong route in the end zone, which resulted in an interception. That was the only blemish Denver had throughout the afternoon, however. In fact, on one instance, a pass to Eric Decker ricocheted into the air and right into Brandon Stokley's arms for a 12-yard gain. That's what type of a game it was for Denver. Manning finished 30-of-43 for 339 yards, three touchdowns and an interception. He was 9-of-15 on third downs, leading Denver to 457 net yards. His passing numbers could have been even better, but the Broncos took the air out of the ball with such a huge second-half lead. ",
            "2": "Two of Manning's scores went to Decker (6-65), while Demaryius Thomas had the most yardage on the team; he snagged nine balls for 102 yards and a touchdown. ",
            "3": "Knowshon Moreno gained 78 yards on 22 carries to go along with five catches for 49 receiving yards. Denver fans held their collective breath when Moreno's knee bent very awkwardly on a fourth-quarter run, but he actually reentered the contest shortly afterward. If he went down, it'd be up to Ronnie Hillman (6-35) and Jacob Hester, who vultured a touchdown. ",
            "4": "It's amazing that Hillman had nearly as many carries as the Browns' rookie runner. Trent Richardson received just nine attempts, turning them into 53 yards. He also suffered some sort of a leg injury at the very end. Cleveland's game plan was puzzling. Richardson had just six carries by halftime compared to 16 Brandon Weeden attempts even though it was just a 14-3 contest at the break. ",
            "5": "Speaking of Weeden, he suffered a shoulder injury late in the third quarter when he took a sack. He left the game and never returned, though there wasn't much of a downgrade. Weeden went 12-of-19 for just 104 yards and a pick-six that was called back following a review, while Colt McCoy finished 9-of-17 for 79 yards and a touchdown. Both signal-callers were completely overwhelmed by a Denver front that accumulated six sacks. ",
            "6": "Thanks to Champ Bailey, the Broncos are capable of erasing an opposing wideout. That's what they did with Josh Gordon, who had only one catch. Greg Little (6-58, TD) was Cleveland's leading receiver. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bears",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "The Bears could have installed the Bobby Boucher offense and still won this game by double digits. In fact, if they did that, Arizona wouldn't have scored a single touchdown because its lone end-zone trip was the result of a blocked field goal at the end of the game. The Cardinals were especially pathetic in this contest, but the quarterbacks weren't the ones who deserved the most blame. That would go to Chris Wells and his three yards on four carries. Wells was given the ball right near his own goal line in the first quarter. He slipped and fumbled the ball, allowing Zackary Bowman to pounce on it for a touchdown. Wells was benched, giving way for an equally ineffective (but more careful) LaRod Stephens-Howling (11-20). Of course, Ryan Lindley's play didn't help. He went 17-of-30 for 141 yards and an interception. He had a second pick that was nullified by a penalty. He was benched after his real interception (returned for a touchdown) in favor of Brian Hoyer, who was added off the waiver wire. Hoyer went 11-of-19 for 105 yards and a telegraphed interception in relief. Hoyer wasn't good or anything, but he looked like a legitimate NFL quarterback (albeit a backup), as he was actually capable of getting the ball to Larry Fitzgerald, who hauled in eight catches for 111 yards. Fitzgerald hadn't topped the century mark since Week 3 when Arizona beat the Eagles to improve to 3-0. That seems like a million years ago. ",
            "2": "Multiple Chicago defenders are worth noting. I already mentioned Bowman. Charles Tillman had the pick-six. Julius Peppers, meanwhile, registered three sacks and a forced fumble. ",
            "3": "Perhaps the Bears should have kneeled down on every play in anti-Boucher fashion because Matt Forte suffered an injury, while Jay Cutler was under constant duress all afternoon. First, about Forte, he was in a walking boot in the locker room afterward, but his status for Week 17 and beyond is currently unknown. He gained 88 yards and a touchdown on 12 carries. With Michael Bush on injured reserve, the Bears will go with a platoon of Kahlil Bell and Armando Allen if Forte is out. Then there's Cutler, who began the game miserably. He was 0-of-6 in the first quarter before completing a 30-yarder to Brandon Marshall. He was also 1-of-11 at one point, but ultimately finished 12-of-26 for 146 yards and a touchdown. ",
            "4": "Cutler's score went to Marshall, of course, who led the team with six receptions for 68 yards. Only one other Bear had more then one catch (Kellen Davis, 2-19). "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "The Giants aren't officially eliminated from the playoffs, but they might as well be. In addition to winning next week, they need the Vikings, Bears and Cowboys all to lose. Two of those are feasible - Minnesota and Dallas will be big underdogs against the Packers and Redskins, respectively - but the hang-up is Chicago, who plays beleaguered Detroit. However, there's no guarantee New York will beat Philadelphia. If it plays like it did against the Ravens, it has no chance. The Giants were thoroughly dominated at the line of scrimmage on both sides of the ball. It was really bad. Eli Manning had zero time to throw on most occasions, while Joe Flacco barely had anyone in his pocket. ",
            "2": "Beginning with the Giants, Manning went just 14-of-28 for 150 yards and a touchdown. He was sacked three times, but that number might as well have been 10. Manning had just one completion longer than 14 yards - an impressive heave to Rueben Randle as he was getting hit. It was one of those plays where Manning chucks and ducks and doesn't appear to be looking where he's launching the ball, but it's somehow completed. However, he just didn't have the time in the pocket to consistently find his receivers downfield. ",
            "3": "Manning's top wideouts barely did anything. Victor Cruz (3-21) took a fierce helmet-to-helmet hit from Ed Reed late in the game, while Hakeem Nicks didn't log a single reception. ",
            "4": "Ahmad Bradshaw (9-39) and David Wilson (3-17, TD) probably would have been able to gash the Ravens had New York been able to stick with the running game. The Giants had to abandon that because they were down by double digits for most of the contest. ",
            "5": "As mentioned, Flacco didn't have to worry about any pressure. He consequently went 25-of-36 for 309 yards and three touchdowns (two passing, one rushing), though it helped that... - New York dropped two interceptions (Stevie Brown, Keith Rivers). - The Giants had Corey Webster in their secondary. Flacco targeted Webster on seemingly every throw. - Flacco's receivers somehow made unbelievable acrobatic catches all evening. ",
            "6": "Anquan Boldin led the team in receiving (7-93) despite leaving the game in the third quarter with a shoulder injury. Torrey Smith (5-88) and Ray Rice (6 catches, 51 yard) both hauled in touchdowns. ",
            "7": "Baltimore had two 100-yard rushers, as Jim Caldwell made sure he called an adequate amount of running plays. Rice (24-107) and Bernard Pierce (14-123) could not be stopped. ",
            "8": "The Ravens had more penalties than the Giants - thanks to Michael Oher, who was flagged three times on one drive - but it seemed like the zebras were out to get New York. On one sequence in the second quarter when the game was obviously still up for grabs, a long Bradshaw run was nullified by a shaky hold. After that, a Domenik Hixon deep reception was negated by an offensive pass interference (albeit a legitimate one). And then to top it off, the officials inexplicably did not allow Tom Coughlin to challenge a pair of fumble recoveries that should have given his team a fresh set of first downs. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "42"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "I don't care where the Seahawks play - they're a legitimate Super Bowl contender. Sure, they're more dominant in Seattle, but they're capable of winning anywhere - particularly if Russell Wilson keeps improving each week. Wilson was amazing in this game. He misfired on only six passes, going 15-of-21 for 171 yards, four touchdowns and an interception on a fluky tipped screen attempt. Wilson also rushed for 29 yards on six scrambles. He was up to his old tricks, maneuvering around the pocket and making defenders look silly trying to tackle him. Thanks to his ability to buy time, Wilson was able to convert an unreal 11-of-13 third downs. ",
            "2": "The 49ers had to worry about Wilson's scrambling ability, so they fully couldn't concentrate on Marshawn Lynch, who trampled the 49ers for 111 yards and a touchdown on 26 carries. He also caught two balls for 19 receiving yards and a second score. ",
            "3": "You have to wonder how great Wilson would be if he had a legitimate No. 1 wideout to work with. He had to resort throwing to Doug Baldwin (4-53, 2 TDs), Golden Tate (2-27) and Sidney Rice (1-14). He even tried launching a touchdown to Jermaine Kearse, but the young receiver dropped the ball. ",
            "4": "Colin Kaepernick took a step backward in this contest, going 19-of-36 for 244 yards, one touchdown and an interception thrown to Richard Sherman, who also took a Red Bryantblocked field goal and returned it for six. Kaepernick just seemed unbelievably befuddled early by Seattle's raucous crowd amid the constant downpour; he had to burn timeouts and was whistled for delay-of-game infractions. ",
            "5": "Kaepernick actually led the 49ers in rushing, scrambling for 31 yards on seven attempts. Frank Gore had just 28 yards on six carries. He appeared to lose a fumble, but Joe Staley somehow pounced on it when it seemed like Seattle was sure to secure a turnover. ",
            "6": "Three San Francisco players caught more than two passes: Michael Crabtree (4-65), Delanie Walker (4-54, TD) and Randy Moss (3-44). Sherman baited Kaepernick to throw to Moss into the end zone for the aforementioned interception. Vernon Davis, meanwhile, had just one catch for 27 yards because he was knocked out of the game with a concussion on a fierce (but legal) Kam Chancellor hit that was incorrectly penalized. Davis was just one of many 49ers who was knocked out of the contest. Mario Manningham and cornerback Tarell Brown were both assisted off the field. Manningham's X-rays came back negative. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "15"
}