{
    "year": "2012",
    "week": "07",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "This was an impressive duel between teams that love to screw themselves over with mistakes. It went back and forth, as both squads tried their best to top the other to see who could commit the worst blunder. Here's how this chess match went: Cowboys: Tony Romo missed Miles Austin-Jones for an easy touchdown in the first quarter. Panthers: Cam Newton was picked in the end zone as he was getting hit later in the opening quarter. Cowboys: Austin-Jones lost a fumble in Carolina territory in the second quarter. Panthers: Newton overthrew Jonathan Stewart in the end zone later in the period. Cowboys: Doug Free was whistled for a false start on a 3rd-and-4 in Carolina territory after halftime. Dallas consequently failed to convert in longer yardage. Panthers: Carolina did the same thing in a 3rd-and-10. Cowboys: Jay Ratliff's personal foul and Brandon Carr's defensive holding helped the Panthers score a touchdown. Dez Bryant then dropped a score of his own. Panthers: The Panthers committed a strange personal foul penalty as Dallas was running the clock out. This gave the Cowboys a first down, allowing them to run off more time. This also let them kick a field goal, which covered the spread. The FOX announcers were befuddled by this infraction, and so was I. It was almost as if the officials wanted to make sure that Dallas would win by more than a field goal. ",
            "2": "As for the actual players, both quarterbacks performed relatively well despite getting nothing out of the running game. Romo went 24-of-34 for 227 yards and a touchdown to Austin-Jones (5-97). Newton, meanwhile, was 21-of-37 for 233 yards, one touchdown to Brandon LaFell (4-53) and the aforementioned pick. One thing that really bothers me is that Newton is barely running in the red zone. He did scramble six times for 64 yards, but none of this came deep in Dallas territory. After the game, a sullen Newton told the media that he's demanding change. I'm not sure what sort of change, but it appears as though he's defeated mentally. ",
            "3": "Of the receivers who didn't score a touchdown, Steve Smith (7-83) was best. Jason Witten (6-44) was just OK. Dez Bryant (2-14), however, disappointed. He appeared to suffer a concussion but reentered the game and dropped a touchdown. This was a very disappointing outing, as Bryant continued to show the inconsistency that has plagued him throughout his career thus far. ",
            "4": "As mentioned, both running games were sluggish. Felix Jones, expected to gash Carolina's poor defense, gained just 44 yards on 15 carries. Jonathan Stewart, meanwhile, ran for 35 yards on only 10 attempts. DeAngelo Williams (2-4) was nowhere to be seen. ",
            "5": "Two potentially major injuries for the Cowboys: Phil Costa, who has been out most of the year, seemed to break his ankle in the second quarter. He was carted off the field. Sean Lee later left the game with a sprained toe, but he told the media he expects to play next week. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Titans",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "34"
        },
        "comments": {
            "amount": "5",
            "1": "If Chris Johnson could play against the Bills every week, he'd be able to retain his CJ2K moniker. Actually, he'd probably be CJ3K. In his previous two meetings against Buffalo, CJ2.5K - a compromise - rushed for 285 yards and four touchdowns on 49 attempts. He had his best performance yet versus the beleaguered Bills in this contest, gashing them for 195 yards and a pair of scores on 18 attempts. Don't think that Johnson is back to CJ2K form though; he did plenty of needless dancing at the line of scrimmage. What sparked his 195-yard output was his offensive line's great blocking. His 83-yard score was the product of a massive hole that Johnson just burst through easily. ",
            "2": "The bigger surprise in this game was Matt Hasselbeck's performance. He played pretty well last Thursday night, but that could have been attributed to being at home on a short week against a Pittsburgh defense that had defenders going down left and right. But Hasselbeck was even better in this contest. He went 22-of-33 for 205 yards and a touchdown. More importantly, he didn't turn the ball over, which is key because give-aways have plagued him in recent years. Hasselbeck came through at the very end, hitting Nate Washington for a game-winning touchdown, which capped off a 52-yard drive. Washington was actually Tennessee's leading receiver, catching six balls for 43 yards. ",
            "3": "As for the other Titan wideouts, Kenny Britt (4-30), Kendall Wright (3-19) and Jared Cook (2-37) all disappointed their fantasy owners. ",
            "4": "While Hasselbeck thrived in the clutch, Ryan Fitzpatrick choked this game away. Fitzpatrick made a terrible decision and forced an interception near midfield as the team was attempting to run the clock out. There was no reason for him to make that throw; just running the ball or even taking a sack would have forced the Titans to use a timeout. The Bills then could have punted the ball and put Tennessee in poor field position. Instead, Fitzpatrick's blunder gave the Titans a short field and a subsequent game-winning score. It's a shame for Fitzpatrick because he had a great game otherwise, going 27-of-35 for 225 yards, three touchdowns and the pick. His scores went to Fred Jackson (8 catches, 49 receiving yards), Steve Johnson (5-71) and Donald Jones (4-47). ",
            "5": "Buffalo's decision to let Fitzpatrick throw in that aforementioned instance is even more befuddling when you consider how well the team ran the ball. Both Jackson (9-71) and C.J. Spiller (12-70) gashed the Titans, who were really missing inside linebacker Colin McCarthy. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Texans",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "The Ravens came out of the tunnel fired up. Ray Lewis and Lardarius Webb were out, but they had Terrell Suggs back on the field. Suggs made a tackle on the first play and helped force a pair of three-and-outs on Houston's first two drives. He then collected a sack on the third possession and almost had another sack later on. The offense, meanwhile, scored a quick field goal and had possession with a 3-0 lead. And then reality set in. Cam Cameron, who forgot that he had Ray Rice in his backfield, asked Joe Flacco to throw way too often. Flacco took a couple of sacks on the drive, one of which was in the end zone for a safety. The Ravens then didn't even cross midfield until there was a minute remaining in the first half. Flacco was terrible, completing just three of his first 11 passes for 25 yards and a pick-six by Johnathan Joseph, which was tipped at the line of scrimmage by J.J. Watt, of course. Flacco was far from elite, looking like a rookie quarterback rattled by Houston's relentless pressure. Watt wasn't the only one tipping passes. Houston's entire front seven was doing this, prompting the announcers to say that the Texans were treating this like a volleyball game. One of the other key tips was made by rookie Whitney Mercilus, allowing the ball to fall into Glover Quin's hands for another pick right at the end of the first half. Flacco ended up finishing 21-of-43 for 147 yards, a touchdown and the two interceptions. Defensively, meanwhile, the Texans completely embarrassed Baltimore after three poor drives. They outgained the Ravens, 420-176, as Arian Foster couldn't be stopped, gaining 98 yards and two touchdowns on just 19 carries. Matt Schaub, meanwhile, went 23-of-37 for 256 yards and a couple of scores. After the Texans went up by double digits, the Ravens looked like they were sleepwalking. The only player showing any sort of effort was Suggs, who was all over the place. He even had some decent stints in pass coverage. I have no idea how he performed so well just six months after tearing his Achilles. The Ravens may have actually been competitive if the other players showed the same sort of heart that Suggs did. ",
            "2": "Schaub's touchdowns went to Kevin Walter (4-74) and Owen Daniels (7-59). Andre Johnson had a big game (9-86), but couldn't find the end zone. Ben Tate probably would have scored late in the game, but left with a hamstring. ",
            "3": "Flacco, meanwhile, tossed a late, meaningless score to Tandon Doss. Torrey Smith (4-41) and Anquan Boldin (3-24) both struggled because their elite quarterback couldn't get them the ball. ",
            "4": "I mentioned this above, but Cameron screwed up by not giving Rice the ball enough. Rice had just 14 touches, including only nine carries. That's just inexcusable. Cameron didn't give Rice any touches when the Ravens were pinned inside their own 6-yard line in the first quarter, which led to the safety and Houston's subsequent barrage of points. I'd say it's time for Baltimore to begin searching for a new play-caller, but I've been criticizing Cameron for years. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "I don't think too many people will disagree with me when I say that the Browns have done many stupid things over the years. Most recently, they chose not to trade for Robert Griffin, deeming him too small for their offense, and then proceeded to draft Brandon Weeden, who apparently was not too old for their offense. In this game, they opted not to have Joe Haden shadow Reggie Wayne. I don't quite understand what Cleveland was possibly thinking. I know it's not part of the team's scheme, but sometimes you have to adjust. Andrew Luck has only one play-maker at his disposal. The Jets, who used Antonio Cromartie to blanket Wayne, completely disrupted Indianapolis' offense as a consequence. The Browns had the opportunity to do so by asking Haden to shadow Wayne. They elected not to do so, and as a result, the Colts compiled 321 total yards of offense, with Wayne leading the team with six catches for 73 yards. Luck, meanwhile, went 16-of-29 for 186 yards with two rushing touchdowns. He started hot, and then just handed the ball off to Vick Ballard (20-84) and Delone Carter (11-41) with a lead throughout, as Indianapolis went conservative. ",
            "2": "The Browns helped the cause by making other dumb mistakes. Ben Watson scored a touchdown, but it was wiped out because of a Joshua Cribbs offensive pass interference. Greg Little (6-52, TD) found the end zone later on the drive, but he double clutched the ball and landed out of bounds. The play was reviewed and was incorrectly ruled a score (at least in my opinion). The killer was that the Browns botched the snap on the ensuing extra point, forcing them to go for a touchdown instead of a game-tying field goal in the fourth quarter. Cleveland committed another egregious error, which was a Josh Gordon (2-59, TD) dropped touchdown in the fourth quarter. It looked like he lost the ball in the sun, as the roof was open because it was an unseasonably warm October day in Indianapolis. ",
            "3": "All of the mistakes ruined a very good afternoon for Brandon Weeden, who went 25-of-41 for 264 yards and two scores. He should've thrown a third touchdown, but as mentioned, Gordon lost a potential 55-yard score in the sun. Weeden had the luxury of throwing from a clean pocket all afternoon; the Colts couldn't put any pressure on him, as Dwight Freeney continues to do nothing coming off an injury. Robert Mathis is missed. ",
            "4": "It was shocking that the Browns were able to move the chains without much help from Trent Richardson. Coming off a mysterious flank malady, Richardson gained just eight yards on eight carries - just one week after Shonn Greene gashed Indianapolis' stop unit. Richardson received his final touch at the 4:53 mark of the second quarter and stood on the sidelines after that. He aggravated his injury and told head coach Pat Shurmur that he made the right move by taking him out of the game. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "I never thought I'd say this, but the Cardinals miss Kevin Kolb. Crazy, but true. Skelton gave the game away last week with an interception in overtime, and he committed many mistakes in this contest, as he was overwhelmed by a Minnesota defensive front that destroyed his offensive line. Skelton began the game by being strip-sacked in the red zone by Brian Robison, who easily beat beleaguered rookie right tackle Bobby Massie. He forced terrible throws the entire afternoon, including one completely unnecessary one at the beginning of the second half, which was picked off by rookie safety Harrison Smith, who returned it for a touchdown. Skelton finished 25-of-36 for 262 yards, one touchdown and the pick-six, but most of his positive stats came in garbage time when he was down 14 points. Skelton, however, wasn't helped by his blocking (sacked seven times; three by Robison), play-calling and his own clock management. The coaching staff called for a Skelton bootleg on a 4th-and-2 deep in Minnesota territory in the middle of the third quarter. Skelton scrambled right, but couldn't find anyone open. He took a loss in the process. Later on, Skelton was responsible for a delay of game on a 4th-and-5 on the Vikings' 32. He was sacked immediately after the penalty on a 4th-and-10. ",
            "2": "Skelton's lone, garbage-time score went to Andre Roberts (7-103). Larry Fitzgerald (4-29) was taken out of the game by the Minnesota defense. ",
            "3": "William Powell was expected to receive most of the carries entering this contest, but he was benched after fumbling a kickoff. LaRod Stephens-Howling took over and gained 104 yards and a touchdown on just 20 attempts, which was very impressive because the Vikings hadn't surrendered more than 63 rushing yards to any opponent (excludes quarterback scrambles) since Week 2. ",
            "4": "Of course, what Stephens-Howling did paled in comparison to Adrian Peterson's impressive performance. Peterson rushed for 153 yards and a touchdown on just 23 carries, looking like the same exact runner who terrorized opposing defenses prior to his December ACL tear. ",
            "5": "The Vikings couldn't put the Cardinals away because Christian Ponder struggled mightily. He went 8-of-17 for 58 yards, one touchdown and two bone-headed interceptions. The first was a sloppy heave as he was escaping pressure. The second was a late throw over the middle in his own territory with five seconds remaining in the first half. Jay Feely was given a shot at a 47-yard field goal, but sailed it wide right. ",
            "6": "Ponder's score went to Percy Harvin, who was the only Viking to log more than two receptions. Harvin caught four balls for 37 yards. He also took the opening kickoff return for a 103-yard touchdown, but it was brought back because of a penalty. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Giants",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "If this game is any indication, the NFC East battles between the Giants and the Redskins are going to be very entertaining for years to come. Robert Griffin and Eli Manning were both outstanding, save for a couple of plays, with the veteran having the last laugh with a 77-yard touchdown to Victor Cruz. I said save for a couple of plays because both Griffin and Manning had some poor turnovers. Manning, who went 26-of-40 for 337 yards and a touchdown, tossed two poor interceptions. The first was an overthrow in Washington territory, which took a potential score off the board. The second led to a Redskin field goal. As for Griffin, he tossed an interception and fumbled twice. At one point in the second half, the Redskins committed turnovers on three consecutive possessions. They were back-breakers, as they all occurred in New York territory. Washington left points off the board in those instances. It also did so in the first quarter when a Griffin-to-Josh Morgan touchdown was wiped out by a mysterious illegal shift that had the FOX announcers befuddled. Having said all of this, the turnovers that these quarterbacks committed were overshadowed by the clutch plays they made. Griffin was awesome in his first divisional game. He converted multiple fourth downs, including one in his own territory where he danced around to avoid pressure and found his tight end for a 19-yard gain. He then scrambled for a 24-yard run and capped off the drive with a beautiful 30-yard lob to Santana Moss for a touchdown, finishing 20-of-28 for 258 yards, two scores and an interception along with 89 rushing yards on nine scrambles - stats that would've been much better had Leonard Hankerson not short-armed a deep pass. Manning, meanwhile, hit Cruz for the 77-yard game-winner and was also extremely sharp on third downs, going 8-of-12 on those situations. ",
            "2": "Cruz caught seven balls for 131 yards. Two other Giants snagged more than four passes: Martellus Bennett (5-79) and Hakeem Nicks (5-53). Nicks didn't look like himself, struggling to get open because his knee injury was still plaguing him. ",
            "3": "Ahmad Bradshaw, who was questionable coming into this game with a foot malady, received just 12 carries. He tallied 43 yards and a touchdown. Immediately afterward, he and Tom Coughlin engaged in a verbal fight on the sideline. Perhaps Bradshaw was angry that Coughlin allowed Andre Brown (5-17) to vulture a score earlier in the contest. ",
            "4": "Alfred Morris rushed for 120 yards on 22 carries, but also was guilty of a fumble. This occurred after a long run of his was negated by a leg whip penalty. ",
            "5": "Both of Griffin's scores went to Santana Moss (3-67), but before you get too excited, he received just four targets. There's not much here, as his touchdowns were fluky. He also had the game-losing fumble near midfield. Hankerson led the team with six catches for 70 yards. ",
            "6": "The Redskins suffered two injuries in this contest. The first was to Fred Davis, who tore his Achilles, so it'll be interesting to see if they sign Chris Cooley. The second was to London Fletcher, who mildly strained his hamstring. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Packers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "NFL teams, beware - Aaron Rodgers is heating up. A week after torching Houston's defense for six touchdowns, he absolutely shredded the Rams, going 30-of-37 for 342 yards and three touchdowns. Rodgers was awesome throughout, save for the first drive when he was sacked by Robert Quinn. The Packers went three-and-out, but Rodgers responded by going 4-of-4 for 79 yards and a touchdown to Jordy Nelson on the ensuing possession. At one point in the beginning of the second half, Rodgers was 20-of-22 for 232 yards and two scores. He would've been in for a much bigger day had the Rams been able to match them point-for-point. It was close for a while - St. Louis actually outgained Green Bay in the first half, 190-186 - but once the Packers established a big lead, the Rams couldn't do much offensively because the running game was taken away. ",
            "2": "I mentioned that Rodgers threw one touchdown to Nelson. The other two went to Randall Cobb. Both wideouts snagged eight balls for 122 and 89 yards, respectively. James Jones didn't find the end zone for once (he was close on one occasion), but still managed to haul in six grabs for 53 yards. ",
            "3": "James Starks was nowhere to be seen again, as Alex Green received all but four carries (three to John Kuhn; one to Cobb). Green had 20 rushes, but managed only 35 yards. To make matters worse, if you take away one fluky long run, he was only able to churn out 20 yards on 19 attempts. The Rams shut down Reggie Bush last week, so this was hardly a surprise. ",
            "4": "The Rams, meanwhile, moved the chains on the ground very efficiently. Steven Jackson (12-57, TD) and Daryl Richardson (8-36) were both effective in the first half, but as mentioned, couldn't do much after intermission because their team was facing a big deficit. ",
            "5": "Sam Bradford played pretty well considering that he didn't have his favorite receiver. He finished 21-of-34 for 255 yards, one touchdown and an interception. Bradford hit his weekly deep shot to Chris Givens (3-73) for 56 yards and was victimized by a bad drop by Brandon Gibson (5-60). Having said this, I still find it remarkable that the Rams can move the chains very well in between the 20s. They amassed 402 total yards of offense with crap wideouts and an offensive line missing three starters and one top reserve. Bradford was sacked only three times - once by Clay Matthews, who now has nine sacks on the year. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Saints",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: Does anyone else wish the Buccaneers went back to those Creamsicle jerseys? I love them. I liked the change to the new ones, but watching LeGarrette Blount get stuffed three times at the goal line reminded me of the fun days when Tampa Bay was the most inept team in the league. Seriously, Blount three times? He sucks, Schiano! ",
            "2": "In a shootout with either Drew Brees or Josh Freeman, one would have to bet on Brees, and he came out on top by a touchdown like Walt predicted. However, Freeman almost pulled off an incredible comeback to force overtime. He threw a touchdown to Mike Williams on the final play of the game, but the wideout had been forced out of bounds before catching the pass, so the completion was negated by an illegal touching penalty. This game featured tremendous aerial assaults by Freeman and Brees, but both Tampa Bay and New Orleans played awful defense. Neither secondary could cover, and both teams had little pass rush. The tackling by the Bucs and the Saints was absolutely abysmal. Both defenses were painfully bad, and that point can't be emphasized enough. ",
            "3": "The game didn't start out that way for Tampa Bay. Gerald McCoy tipped a pass on New Orleans' first possession, and Ronde Barber picked off the deflection. He had a nice return to the Saints' 13-yard line. Freeman threw a quick pass to Tiquan Underwood (2-35) on the next play for a touchdown. ",
            "4": "Saint linebacker Jonathan Vilma was playing in his first game back and made an impact with a blitz that caused Freeman to throw a pass too high, allowing Roman Harper to collect an interception. The refs blew the call by saying it was an incompletion, and they screwed up the challenge by not reversing it. Vilma tipped a pass later on the same drive and almost intercepted it. Doug Martin (16-85) finished the possession with a 36-yard touchdown run. Freeman then opened up a 21-7 lead by hitting Vincent Jackson for a 17-yard touchdown. Brees answered with a deep pass to Devery Henderson for 39 yards in busted coverage. That led to a 17-yard touchdown pass to Marques Colston (7-73). Brees then went to Henderson (3-75) after he beat Eric Wright down the field, and Mark Barron missed a tackle on the sidelines. That set up a short touchdown pass to Darren Sproles (5-27 rushing, 4-32 receiving). The Saints' defense then finally got a stop, and Brees rewarded the effort with a 48-yard touchdown pass to Joe Morgan (only catch). The wideout shed tackles by Barron and Wright, who he'd already burned running down the field. ",
            "5": "Brees was surgical in a two-minute drill late in the first half. He gave the Saints the lead with a 20-yard touchdown pass to David Thomas (2-27), who was left uncovered by the safeties. The veteran signal-caller went 20-of-25 for 313 yards, four touchdowns and one interception through the first two quarters. ",
            "6": "The Bucs blew big opportunities in the third quarter, missing a 42-yard field goal and squandering a 95-yard catch by Jackson. Malcolm Jenkins showed great hustle to chase down Jackson short of a touchdown, but the wide receiver seemed to be coasting. LeGarrette Blount (5 for -2) was stopped on three tries, and on a fourth-and-goal, Cam Jordan forced Freeman out of bounds. It was an epic fail for Tampa Bay with a bad decision by Greg Schiano not to take the points and terrible play-calling by offensive coordinator Mike Sullivan. The mistakes continued as the Bucs were called for an unsportsmanlike conduct on a pre-snap field goal attempt that gave the Saints a first down. Brees made Tampa Bay pay by the moving the ball close, setting up Pierre Thomas (13-32) to finish the drive with a short touchdown plunge. Brees finished 27-of-37 for 377 yards, four touchdowns and an interception. Lance Moore (9-121) was his favorite target, as Jimmy Graham was out. ",
            "7": "Freeman tossed a touchdown to Dallas Clark (5-51) with four minutes remaining. The Saints killed themselves with a few penalties on the drive to give the Buccaneers first downs. That gave Freeman one more chance, and he ripped the ball inside New Orleans' 10-yard line with 17 seconds remaining. Freeman connected with Jackson on a leaping catch in the back of the end zone, but his feet barely landed out of bounds. That led to the completion to Mike Williams that ended the game on illegal touching. Freeman finished 24-of-42 for 420 yards and three touchdowns. Jackson set a franchise record for receiving yards (216) and a score on seven receptions. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "26"
        },
        "comments": {
            "amount": "4",
            "1": "EDITOR'S NOTE: Outside of the Eagles' fans, I've never heard any fan base boo their team so vehemently in a win. If you just listened to the crowd, you would've thought that the Patriots lost by two touchdowns. This team is underachieving - but still is somehow in sole possession of first place in the division. ",
            "2": "The Jets' inability to rush the passer or produce big plays on offense cost them this game. New York fought hard, but the team clearly isn't on an equal footing with New England. The Patriots controlled the game before attempting to give it away in the fourth quarter, but the Jets didn't have the offensive play-makers to turn point opportunities into touchdowns instead of field goals. ",
            "3": "Mark Sanchez started the game by moving the ball through the air down the field with two passes for 50 yards to Jeremy Kerley (7-120). Tim Tebow, who had four carries for 12 yards, converted a third-and-2 with a run to the goal line. That set up a Shonn Greene (16-54) touchdown plunge. New England answered by Devin McCourty bringing the kickoff back 104 yards for a touchdown. Tom Brady took the lead for the Patriots by moving the ball with Ron Gronkowski and Aaron Hernandez. Gronkowski finished the drive with a diving 17-yard touchdown catch. New England tacked on two more after a botched handoff by Sanchez and Greene rolled into the end zone. Sanchez kicked the ball out of the back of the end zone for a safety. Massive penetration by Vince Wilfork caused the fumbled handoff. Sanchez got lucky on a few passes that could've been intercepted. His suspect decisions caught up with him when he threw a ball too late for an open receiver. It hung up in the air and that let Patriots corner Alfonzo Dennard recover to make a leaping catch. Sanchez should've had a touchdown on the play, but blew it by waiting. He did help move the ball down the field for a 54-yard field goal from Nick Folk just before halftime. Brady had a nice drive in the third quarter with a few third-down conversions by hooking up with Wes Welker (6-66). Hernandez (5-54) had a catch to bring it to the goal line and Brady went to Gronkowski (6-78) for the score. In the fourth quarter, down by 10, Sanchez engineered a nice drive with a short touchdown pass to Keller (7-93). It was a laser into a tight window. The game-tying drive started with a good completion to Keller, but rookie Stephen Hill (4-55) dropped a catch after getting wide open at the 13-yard line. Folk tied the game at 23 with a 43-yard field goal. New England gave it right back on the kickoff after McCourty fumbled the ball away. Sanchez took an idiotic sack by Dont'a Hightower, but Folk bailed him out with another 43-yarder to give the Jets a 26-23 lead with under two minutes remaining. Brady ripped the ball down the field to set up a 43-yard field goal to force overtime. That same scenario played out in overtime as Brady quickly led the Patriots to a 48-yard field goal. The Jets were completely incapable of getting any pass rush on Brady throughout the game, but especially late when they need it the most. The game ended when Sanchez was rocked for a sack-fumble by Jermaine Cunningham and Rob Ninkovich. Brady finished 26-of-42 for 259 yards. Stevan Ridley (17-65) led the Patriots on the ground. ",
            "4": "Quinton Coples and David Harris combined for a sack, but otherwise Brady had all day to throw the ball. New York's offense is devoid of play-makers. The team had numerous opportunities to get the ball in the end zone, but had to settle for four field goals. Sanchez played pretty well, completing 28-of-41 passes for 328 yards, a touchdown and interception, but he also left points on the field that would've made the difference for the Jets to get a win. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "comments": {
            "amount": "3",
            "1": "I still can't believe what happened in this game. As I tweeted (@walterfootball), After Mike Mularkey is fired, I'm going to read his book, 101 Ways to Lose an NFL Game After Establishing a Huge Lead. I received some replies about Norv Turner already writing it or penning the foreword, but San Diego's Monday night collapse was more on Philip Rivers. Mularkey was completely responsible for this debacle. The Jaguars had a 20-6 lead at the end of the third quarter of this contest despite losing both Maurice Jones-Drew to an ankle (on the second play of the game) and Blaine Gabbert to a shoulder. It's a shame for Gabbert, who was having a relatively decent performance. He finished 8-of-12 for 110 yards and a touchdown to a wide-open Cecil Salute Your Shorts that looked like a punt. Yes, most of Gabbert's passes were checkdowns and he nearly tossed two picks on one drive, including one into triple coverage, but this, sadly, was one of his better outings. Chad Henne stepped in and the drop-off was immediately noticeable. Henne, who went 9-of-20 for 71 yards, displayed zero pocket awareness and terrible accuracy. He didn't even look like he was sober. It seemed like he just walked out of a Michigan frat party and a Jacksonville coach ran up to him and said, Chad, we know you're over the legal limit, but Blaine is hurt and we really need you to play! Mularkey's horrible coaching first was apparent when he went for it on a 4th-and-1 at midfield in the second quarter with a 17-3 lead. The Raiders had nothing going on offense, yet Mularkey had Henne run a bootleg, which resulted in a loss of downs. Oakland scored an ensuing quick field goal - three points that would have been extremely useful for Jacksonville late in the game. In the second half, Mularkey continuously had Henne pass the ball despite never trailing. It's a borderline miracle that he was never picked off. The Raiders eventually tied it. They tried their best to lose this game themselves, wasting timeouts and turning the ball over (thrice). Carson Palmer, who went 26-of-46 for 298 yards, two touchdowns (one passing, one rushing) and a weird interception (a 10-yard shovel pass that bounced off a helmet), nearly tossed a second pick in the end zone, but the ball was dropped. On the very next play, Aaron Ross was whistled for pass interference, ultimately leading to a Palmer sneak for a score. After the Jaguars punted the ball at the end of regulation, the Raiders tried to run out the clock. Mularkey called a timeout even though he didn't have enough stoppages to force an Oakland punt, so Palmer decided to attempt a long pass. He actually completed it to Rod Streater for 23 yards, setting up what would've been a record-setting 64-yard field goal by Sebastian Janikowski. He was short by a few yards, but later nailed the game-winner in overtime following a Shorts lost fumble. ",
            "2": "As mentioned, Jones-Drew hurt his ankle. He was on crutches in the second half, meaning Rashad Jennings will likely start next week. Jennings gained just 44 yards on 21 carries, but scored a touchdown. He also caught seven balls for 58 receiving yards. He'll be a hell of a PPR fantasy addition, as both Gabbert and Henne will check it down to him quite often. ",
            "3": "On the other side of the ball, Darren McFadden struggled to find running room, gaining just 53 yards on 19 attempts. Darrius Heyward-Bey, meanwhile, was the leading receiver with four grabs for 85 yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "The Steelers are pretty lucky to win this game considering how many dumb errors they committed in the first half. This includes: - Mike Wallace, who has been having issues with drops since the bye, had three balls fall through his hands prior to intermission. He had a fourth drop (and nearly a fifth that was reviewed) after the break. He did manage to snag eight receptions for 52 yards, so it's not like he had a completely miserable outing. - Fifth-string running back Baron Batch, who had to play because both Rashard Mendenhall and Isaac Redman were out, dropped a touchdown in the second quarter from Antonio Brown (7 catches, 96 yards) on a trick play. This was doubly unfortunate for the Steelers because Ben Roethlisberger would throw an interception in the end zone later on the drive. It was a poor decision, as he forced a pass to Heath Miller into double coverage. - The Steelers had a whopping four penalties on returns, three of which negated big returns. Brown had about 100 yards worth of returns nullified by those infractions. - Roethlisberger was guilty of another mistake; he was strip-sacked deep in his own territory which led to a quick Cincinnati touchdown. ",
            "2": "The Steelers cleaned things up in the second half. Jonathan Dwyer provided some tough running with 122 yards on 17 carries, while Roethlisberger (27-of-37, 278 yards, TD, INT) did a remarkable job of converting third downs once again, moving the chains 10-of-16 tries in those instances. Big Ben's touchdown went to Miller (6-53). ",
            "3": "Earlier, I said the Steelers were lucky. That's because the Bengals couldn't do anything offensively after an 80-yard opening drive. They had just 105 total net yards after that. A big reason for this was the injury to center Jeff Faine. The Bengals had to turn to their third-stringer at the position because Faine was already their backup. This third-stringer was outmatched by Casey Hampton. Cincinnati suddenly couldn't open up any holes for BenJarvus Green-Ellis (18-69) or block pass-rushers up the middle. Andy Dalton was also at fault. The Red Rifle went 14-of-28 for 105 yards, one touchdown (a gift from the Steelers following the Big Ben strip-sack) and an interception. He made some nice throws, but was terribly inconsistent. ",
            "4": "Dalton's sole score went to A.J. Green, an 8-yarder. That catch was Green's only reception of the evening, as Ike Taylor rebounded from a horrible Thursday night outing with a dominant performance. For thoughts on Bears-Lions, check out my updated "
        }
    },
    "numberOfGames": "11"
}