{
    "year": "2012",
    "week": "13",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "18"
        },
        "comments": {
            "amount": "6",
            "1": "I guess history repeats itself. Chad Henne was on fire in his first year as a starter with the Dolphins, but reality set in when the Bills perplexed him in an ugly 31-14 blowout. Henne had enjoyed two great starts with Jacksonville coming into this contest, but once again looked lost at Buffalo. Henne finished 18-of-41 for 208 yards, one touchdown, an interception and a lost fumble. Those numbers are way better than how he really looked, as the score and a big chunk of the yardage came in garbage time as Buffalo was playing prevent. Henne was just 5-of-15 for 86 yards at the break. ",
            "2": "Henne's late, meaningless score went to Cecil Shorts (7-77), who was the only Jaguar wideout with more than three receptions. Shorts suffered a concussion in the fourth quarter, but it doesn't appear to be serious. Justin Blackmon had just one grab for nine yards. ",
            "3": "This was a rainy, sloppy matchup that naturally favored the team with the better ground attack. That obviously wasn't the Jaguars, who were missing both Maurice Jones-Drew and Jalen Parmele. Rashad Jennings (8-20) also sustained a concussion, while replacement Montell Owens was equally ineffective. ",
            "4": "The Jaguars could have kept this game closer, but continuously shot themselves in the foot with dumb errors. For instance, right tackle Cameron Bradfield committed an incredibly idiotic personal foul when the Jaguars achieved a first down on Buffalo's 3-yard line, negating a potential touchdown. Henne had the aforementioned lost fumble by Mario Williams, giving the Bills a gift field goal. In the third quarter, a roughing-the-passer penalty by newly added Jason Babin - a questionable call according to the CBS announcers - allowed Buffalo to continue the drive and eventually find the end zone. Having said that, the Bills played very well overall and deserved to win this game. As mentioned, the rushing attack was paramount, and the Bills ran all over Jacksonville. Fred Jackson actually had way more carries than C.J. Spiller for some strange reason, but both backs were very effective. Jackson gained 109 yards on 25 attempts, while Spiller mustered 77 yards and a touchdown on just 14 tries. Spiller's score came on a 44-yard burst early in the fourth quarter. ",
            "5": "Ryan Fitzpatrick went 9-of-17 for 112 yards, three touchdowns (two passing, one rushing) and an interception. The pick was ugly - it was heaved into heavy coverage and snagged by former teammate Paul Posluszny - but the veteran signal-caller was solid otherwise. He endured some drops, which was to be expected given the conditions. ",
            "6": "Fitzpatrick's best throw was a deep shot to T.J. Graham for 51 yards on the opening drive, which was a bit surprising because A) it was to T.J. Graham and B) it occurred following a Chris Hairston hold and a Steve Johnson drop, so the drive looked like it wasn't going anywhere. Johnson, by the way, had just two catches for 18 yards, but he managed to score a touchdown. He left the game in the third quarter with a hamstring. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Ruskell Wilkens is truly an MVP canadate. This was a tremendous performance by Russell Wilson. He was incredibly clutch at the end of the game, engineering a 97-yard drive to take the lead near the end of regulation, and following a quick Chicago field goal, he put together an 80-yard touchdown drive in overtime. What's remarkable about this is that he did this on the road, where the Seahawks perennially struggle, and against a supposedly stout Chicago defense. Wilson's final numbers are 23-of-37 for 293 yards and two touchdowns, though his passing numbers don't tell the whole story. He did a great job of buying time with his legs. He kept plays alive, either finding an open receiver after roaming around in the pocket or scrambling for yardage. He ran it nine times for 71 rushing yards. ",
            "2": "Wilson's two scores went to Sidney Rice (6-99) and the usually clutch Golden Tate (5-96). The scores were interesting because the two wideouts both fumbled just as they crossed the goal line. The plays were reviewed, but they stood as called. Rice, unfortunately, took a blow to the head at the end of the decisive score. He looked woozy walking off the field, and it shouldn't surprise anyone if he misses next week with a concussion. Wilson nearly had a third touchdown, by the way. At first glance, it appeared as though Braylon Edwards hauled in a pass in the end zone just prior to halftime, but the play was automatically reviewed and overturned. ",
            "3": "I feel like the Seahawks made things difficult for themselves early on by not running the ball enough. While Wilson aired it out 37 times, Marshawn Lynch received just 19 carries. He tallied 87 yards and a touchdown, so it's not like he wasn't effective. The problem perhaps was that he lost a fumble near midfield on the opening drive. ",
            "4": "Seattle is pretty fortunate that it won the overtime coin toss, as it was apparent that both reeling defenses wouldn't be able to stop the opposing quarterback. Jay Cutler finished 17-of-26 for 233 yards and two touchdowns. He had just three incompletions after intermission (7-of-10 for 108 yards) and did a great job of picking up third downs, converting 6-of-12 attempts. ",
            "5": "Brandon Marshall didn't catch a touchdown, but he had a monstrous performance, catching 10 balls for 165 yards. Matt Forte and Earl Bennett were the ones who found the end zone. ",
            "6": "Forte, by the way, couldn't find any running room against the Seahawks, collecting 66 yards on 21 carries. ",
            "7": "One injury of note for the Bears - cornerback Tim Jennings, the NFL's leader in interceptions (8), took a fierce hit from fullback Michael Robinson in overtime. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Colts",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "33"
        },
        "comments": {
            "amount": "7",
            "1": "How cool was it that we saw two rookie quarterbacks lead amazing fourth-quarter comebacks this Sunday? Well, Detroit and Chicago fans may not like it, but it made for compelling TV. The difference between the Seattle and the Indianapolis victories was that the Seahawks were down by one score the entire time. The Colts, meanwhile, trailed 33-21 late in the fourth quarter. In fact, that was the score with less than three minutes remaining in regulation, but Luck engineered two touchdown drives, including one that concluded on a fourth down just as time expired. Luck was 8-of-15 for 128 yards and two touchdowns on the two final possessions. He was remarkable at the very end after some shaky moments earlier in the game. He had numerous ugly throws, completing fewer than half of his passes (24-of-54) and throwing three interceptions. He did pass for four total touchdowns, however. ",
            "2": "Luck's game-winning score went to Donnie Avery, who actually hauled in two touchdowns to go along with his five catches for 91 yards. TY Hilton paced the team with six grabs for 100 yards, while Reggie Wayne (4-51) had one of his lesser performances of the season. Lavon Brazill and Coby Fleener (1-26) had the other scores. ",
            "3": "The Colts trailed throughout, so they couldn't run the ball very much. Vick Ballard was the more effective back (9-41, TD) compared to the struggling Donald Brown (6-13). ",
            "4": "The top player on the field was Calvin Johnson, and it wasn't even close. He grabbed a whopping 13 passes for 171 yards and a touchdown, which included an incredible one-handed 32-yard reception. ",
            "5": "Matthew Stafford played well in this loss. He went 27-of-46 for 313 yards and two touchdowns. He could have enjoyed an even better day had it not been for a ton of dropped passes by Detroit. The Lions had three drops in the first five minutes of the second quarter alone, one of which was nearly picked by Vontae Davis after Mike Thomas bobbled the ball out of his hands. ",
            "6": "Aside from Megatron, no other Lion had more than three receptions. Brandon Pettigrew (3-43) had Ser Stafford's other score, though he was guilty of two drops in the red zone. Of course. Ryan Broyles, meanwhile, suffered what appears to be a severe knee injury. ",
            "7": "Mikel Leshoure was given 21 carries, but didn't do much with them. He totaled just 57 yards on the ground with a touchdown, as none of his attempts went longer than seven yards. Leshoure and Joique Bell simply couldn't get the job done when the Lions were trying to run out the clock. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Packers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "How often do you see a team - the Vikings in this instance - rush for 240-plus yards and lose? It almost never happens. In fact, teams that have gained 240 rushing yards or more were 192-17 since 1989 going into this weekend. Adrian Peterson was amazing, but Christian Ponder completely sabotaged a potential victory for the Packers. He was absolutely horrible, going 12-of-25 for 119 yards, one touchdown and two interceptions. One of the picks was horrendous. Peterson trampled Green Bay's reeling defense on the entire drive, but Ponder was asked to throw inside the red zone. He scrambled right and didn't have anything, yet he still threw late across his body. The Packers snagged a very easy interception. Ponder just keeps getting worse. He now has 11 interceptions to just 10 touchdowns since Week 5. He's completed better than 54.3 percent of his passes just once since Week 7. He ruined what looked like a possible record-breaking day for Peterson, who was amazing. He rushed for 210 yards and a touchdown on 21 attempts. He eclipsed the 200-yard barrier early in the fourth quarter, so it appeared as though he could break his own single-game rushing record of 296 yards. Unfortunately, the Vikings trailed because of Ponder's ineptitude, so they couldn't give Peterson enough carries. ",
            "2": "The only Viking to catch more than two passes was Kyle Rudolph (6-51, TD). Ponder really misses Percy Harvin. ",
            "3": "Speaking of injured wideouts, Jordy Nelson suffered a hamstring injury in the first quarter of this contest. He had just one catch for 10 yards. Greg Jennings, coming back from his own malady, managed just four receptions for 46 yards. ",
            "4": "Despite a depleted receiving corps and a shaky offensive line, Aaron Rodgers went 27-of-35 for 286 yards, one touchdown and an interception. He was unbelievable on third down, converting 9-of-16 attempts. Rodgers passed a second score to James Jones (2-40), but it was called back because of a hold. Rodgers' top targets were Randall Cobb (6-62) and Jermichael Finley (6-60). ",
            "5": "It's surprising, but the Packers actually ran the ball well. Both backs were solid against Minnesota's weak front. James Starks (15-66) scored a touchdown, while Alex Green (12-58) had the better YPC average. ",
            "6": "Two kicking notes: For the Packers, the struggling Mason Crosby hit 3-of-4 attempts, including a 47-yarder, though he did doink in a 30-yarder off the upright. As for the Vikings, Blair Walsh whiffed on a 42-yarder late in the game for the potential cover. Walsh clearly was bought. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "Way to go, Chiefs. I don't know how they managed to be focused and play hard against the Panthers just one day after inside linebacker Jovan Belcher murdered his girlfriend and then committed suicide at Arrowhead Stadium, but they got the job done with a very spirited performance. Kansas City played a very clean game overall, as the team was guilty of only one penalty compared to Carolina's seven. Romeo Crennel also showed a ton of guts on one occasion, opting to go for it on a 4th-and-goal near the goal line with two seconds remaining in the first half. The Chiefs were able to find the end zone, which gave them incredible momentum going into the second half. ",
            "2": "It seemed like every Chief had his best game. Brady Quinn was unbelievably sharp for one of the few times in his career, going 19-of-23 for 201 yards and two touchdowns. The offensive line gave him great protection, limiting the Panthers to just one sack. ",
            "3": "Quinn's touchdowns went to Tony Moeaki (4-54) and Jonathan Baldwin (2-37). Dwayne Bowe led the team with 64 receiving yards off four catches. ",
            "4": "Picking up where Bryce Brown left off Monday night, Jamaal Charles ripped right through Carolina's soft run defense. He gained 127 yards on 27 carries, doing so on all on many moderately sized runs, so it's not like he picked up most of his yardage on one long gain or anything. Unfortunately, Peyton Hillis (12-19) vultured a touchdown on the opening drive. ",
            "5": "Cam Newton had a good performance in terms of running the ball. He once again led the team in rushing with 78 yards on seven scrambles. His passing wasn't as good, however. He finished 15-of-27 for 232 yards and three touchdowns, which looks good on paper, but the numbers are bloated by a 53-yard pseudo completed Hail Mary that didn't reach the end zone, though it's worth noting that Brandon LaFell dropped a score. The Chiefs were able to put heavy pressure on Newton the entire afternoon. ",
            "6": "Smith was the only Panther non-running back with more than two catches. He grabbed five balls for 120 yards and a touchdown. Newton's other aerial scores went to Greg Olsen (1-47) and Louis Murphy. ",
            "7": "Jonathan Stewart was out, so DeAngelo Williams took most of the carries. And by most of the carries, I mean 12, though he did muster 67 yards out of them. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: The Patriots won, but only pushed. They had trouble putting the Dolphins away - perhaps because they were playing a quarterback who doesn't butt fumble. ",
            "2": "The Dolphins hung tough with the big boys, but the Patriots clinched the AFC East with a competitive road win. The big aide for New England was crappy special teams play by Miami. If the Dolphins didn't have their special teams miscues, they could've pulled out a win over the division leaders. Miami's two mistakes led to both of New England's touchdowns. The game started terribly for the Dolphins when punter Brandon Fields fumbled a snap. He picked up the ball, but couldn't get the punt off before he was tackled. That set up the Patriots at the Miami 12-yard line, and Steven Ridley (19-71) put the ball in the end zone. The Dolphins' special teams had another critical error as a roughing-the-punter penalty gave New England a first down, which the Patriots turned into a short touchdown toss to Wes Welker. ",
            "3": "Tom Brady had one of his quietest games of the season, as Miami's defense played really well. He completed 24-of-40 passes for 238 yards, a touchdown and an interception. Brady led two field goal drives in the fourth quarter to put the game away, but he left points on the field. Brady overthrew a wide open Julian Edelman running into the end zone on a pass downfield. There were other receivers who were open, but Brady didn't have the time to get them the ball. Cameron Wake, Koa Misi, Paul Soliai and Reshad Jones all registered sacks. ",
            "4": "Welker caught 12 passes for 103 yards with his score, but also had a terrible dropped touchdown. Aaron Hernandez (8-97) also had a great game. ",
            "5": "Ryan Tannehill had a gutsy performance, but didn't have the weapons to produce points against the New England defense. Tannehill went airborne over Alfonzo Dennard a la Willie Beamen for the Dolphins only touchdown. Tannehill had Hartline running wide open into the end zone after getting a couple of steps on Aqib Talib, but the pass was overthrown. Tannehill completed 13-of-29 passes for 186 yards. Patriots backup defensive end Trevor Scott rocked Tannehill for a sack fumble that was recovered by Vince Wilfork. Otherwise, Tannehill made good decisions. Wilfork was a disruptive force for the Patriots on Sunday, especially in the first half. His fumble recovery produced a field goal for New England. Scott had two sacks for the Patriots while filling in for Chandler Jones. ",
            "6": "Reggie Bush (15-64) was kept under wraps, and the Dolphins had no offensive weapons that could make plays for them. It is absolutely critical that Miami gets Tannehill some play-makers this offseason. ",
            "7": "Dolphins' safety Reshad Jones had a great game. He made a phenomenal juggling interception and returned the pick for a touchdown, but a penalty on the return turned it from seven points into a field goal. ",
            "8": "Jake Long injured his triceps in the first half and left the game. Rookie Jonathan Martin moved to the left side from right tackle and had some struggles. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "7"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "6"
        },
        "comments": {
            "amount": "4",
            "1": "This was a riveting matchup, if you couldn't tell by the final score. No, really, it was. I mean, how many NFL games are you ever going to see where Greg McElroy is the best quarterback on the field? It is official - after 11-and-a-half games are miserable quarterbacking, Mark Sanchez was finally benched. Unfortunately, Tim Tebow was conveniently out with a rib injury of some sort, so McElroy was able to take the field. He completed 5-of-7 passes but for only 29 yards and a touchdown. McElroy is very limited physically, but he may get a shot at the job because unlike Sanchez, he didn't turn the ball over. Sanchez went 10-of-21 for just 97 yards and three picks. One of the interceptions wasn't his fault because Patrick Peterson made a great play, but the other two were absolutely awful. He nearly tossed a fourth pick, but it was dropped by William Gay (not that there's anything wrong with that). As for the Cardinals, it was a miracle that Ryan Lindley wasn't benched. To demonstrate how bad he was, he had a wide-open Larry Fitzgerald in the red zone for what would have been a short touchdown, but completely misfired. Lindley's completion rate looked like a batting average, as he connected on just 10-of-31 attempts for just 72 yards and a pick. That's a yards-per-attempt average of 2.3. I don't think I've ever seen a YPA that low on so many passes. I'm still not sure why John Skelton was benched in favor of this bum; Lindley just isn't prepared to play on this level. ",
            "2": "As you might expect, the skill-position players struggled statistically because of the ineptness of the two quarterbacks. I mentioned Fitzgerald - he actually led the team with 23 receiving yards (one catch). Meanwhile, Arizona's leading rusher was safety Rashad Johnson, who picked up 40 yards on the ground on a fake punt. Chris Wells (15-22) couldn't do anything. In fact, if you take away a nine-yard gain, Wells would've been limited to 15 yards on 14 carries. ",
            "3": "The Jets actually ran the ball pretty well - Shonn Greene mustered 104 yards on 24 attempts with defensive end Calais Campbell out of the lineup - but the leading receiver was Stephen Hill, who caught five balls for only 40 yards. Dustin Keller sustained a high ankle sprain. ",
            "4": "Former Jet safety Kerry Rhodes had an awesome day. He snagged two of Sanchez's picks and also forced a fumble. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Rams",
            "Points": "16"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "It's almost as if these teams are destined to either draw or come close to tying. All but 30 seconds expired in the overtime session before rookie kicker Greg Zuerlein nailed a 54-yarder to give the Rams their fifth victory of the season. Of course, St. Louis wouldn't have been in this position if it wasn't for a very strange play at the end of regulation. The 49ers were attempting to run out the clock, up 10-2, when Colin Kaepernick inexplicably pitched the ball back to Ted Ginn, who couldn't handle it. The ball was scooped up by rookie corner Janoris Jenkins, who recorded two pick-sixes last week, and took it back for a touchdown, though I thought it was obvious that he was down short of the goal line. Kaepernick did not have a good aerial performance. He went 21-of-32 for 208 yards and was responsible for a safety when he ran too far back in the pocket and heaved a pass that didn't reach the line of scrimmage. He wasn't bad, by any means, but he barely took any deep shots, which is curious because his ability to hit long passes - along with his scrambling strength - is what separates him from Alex Smith. But speaking of his scrambling, he made up for his mediocre throwing numbers with 84 yards on nine rushes, which includes a 50-yard scramble. ",
            "2": "Kaepernick's presence on the field usually opens things up for Frank Gore, but that was not the case in this contest. Gore mustered just 58 yards a touchdown on 23 carries. To indicate how much of a struggle it was for Gore, he tallied just 35 yards on 22 tries if you exclude a 23-yard burst. ",
            "3": "The 49ers' best skill-position player was Michael Crabtree, who had seven receptions for 101 yards. Vernon Davis caught just two balls for 15 yards, so expect more whining out of him this week. ",
            "4": "As for the Rams, Sam Bradford was a surprisingly effective 26-of-39 for 221 yards despite the absence of his preferred safety valve, Danny Amendola. He also had 31 yards on three scrambles, a couple of which took place in overtime. ",
            "5": "Bradford's favorite target in this contest was Chris Givens, who is really emerging as a capable starting receiver. Givens hauled in a whopping 11 balls for 92 yards. ",
            "6": "Steven Jackson's presence was also huge. He managed just 48 yards on 21 attempts, but he was a strong option for Bradford out of the backfield, catching five passes for 69 receiving yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Texans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "One thing I discovered this past week is that the Titans have struggled mightily against teams with winning records under Mike Munchak. That may sound like a no-brainer because Tennessee hasn't been good with Munchak, but they haven't been close in most of these games, being outscored by an average margin of 32-15 in seven defeats. This game followed that trend. The Texans completely dominated their AFC South opponent from the start. Taking advantage of a free play because Tennessee was offside, Matt Schaub hit Lestar Jean for a 55-yard touchdown, as Houston went six plays and 80 yards in just 2:31. The team never looked back. It went up 24-3 in the middle of the third quarter. At that point, the Texans were outgaining the Titans, 237-144. Tennessee didn't help its cause with numerous turnovers. Chris Johnson, who had just 51 yards on 13 carries, lost a fumble when he was trying to find a running lane that just didn't exist. The ball was forced out by J.J. Watt and returned for a touchdown by Antonio Smith - except that the official incorrectly ruled Smith down by contact. Jake Locker, meanwhile, was a disaster. His final numbers don't look too bad - 21-of-45, 309 yards, one touchdown, three interceptions - but most of those statscame late in garbage time. When Houston went up 24-3, Locker was just 8-of-24 for 96 yards, two picks and a lost fumble - and this was without No. 1 corner Johnathan Joseph on the other side. ",
            "2": "Locker's score went to Kenny Britt (2-40). His leading receivers were Nate Washington (3-96) and Kendall Wright (6-78). ",
            "3": "Meanwhile, the Texans sat on their 24-3 advantage and didn't seem interested in expanding it. Schaub finished 21-of-35 for 207 yards and two touchdowns. He threw just 11 passes after intermission. ",
            "4": "Two Texans tied for the team lead with five receptions: Andre Johnson (5-56) and Arian Foster (5-15). ",
            "5": "Speaking of Foster, he actually struggled to run the ball. He inexplicably was limited to just 38 yards and a touchdown on 14 carries despite the fact that Tennessee was missing inside linebacker Colin McCarthy. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "EDITOR'S NOTE: Greg Schiano has to stop it with these dumb kneel-down tactics. Someone is going to get hurt on a play that has almost no chance of succeeding. I hope the NFL does something about this because it's stupid and childish. ",
            "2": "Tampa Bay played Denver tough in the first half, but a huge third quarter from Peyton Manning won the game and the AFC West for the Broncos. The young Bucs fought until the end, but the Broncos had this game put away, and it wasn't as close as the final score. ",
            "3": "Manning ripped the ball down the field on Denver's first drive before tossing a short touchdown to defensive tackle Mitch Unrein, who entered the game as a big blocker for the goal-line package. After that drive, Tampa Bay kept Manning from adding more points. Some penalties really hurt Denver, and the Bucs' offense helped keep Manning on the sideline. Manning dominated the third quarter. He ripped the ball through a weak Tampa Bay secondary. The veteran signal-caller put Denver in the lead for good with a beautiful pass to Demaryius Thomas (8-99) for a touchdown. They hooked up again a short time later on a jump ball in the end zone. Manning led a field goal drive in the fourth and had another field goal attempt miss. He finished 27-of-38 for 242 yards with three touchdowns and an interception. Jacob Tamme (9-89) and Knowshon Moreno (20-69) had minor contributions. ",
            "4": "The game was iced for Denver with its third score of the quarter. Unrein blasted Josh Freeman and that forced a weak pass to float into Von Miller who returned it 26 yards for a touchdown. Miller played another great game and had a sack-fumble to go with his pick-six. Freeman was held back by an offensive line that allowed too much pressure. Right tackle Demar Dotson was whipped by Von Miller. Donald Penn didn't have his best game, and each drew penalties along with allowing pressures. Freeman's accuracy was off as a result, and he came close to a number of interceptions. He completed 18-of-39 passes for 242 yards with two touchdowns and an interception. He made a beautiful toss to Dallas Clark (3-21) for a touchdown and a 10-7 lead in the first half. Freeman threw a short touchdown pass to Mike Williams (6-93) in garbage time. ",
            "5": "Vincent Jackson (3-55) made some great catches, but the Broncos' corners really defended him well. Doug Martin (18-56) was also held in check. Defensively, Lavonte David had another superb day for Tampa Bay. The rookie had a nice interception dropping into the middle of the field on a poor decision by Manning. David also made some tackles for a loss and was all over the field. The weakness at cornerback continues to plague Tampa Bay and looks like the Achilles' Heel that could keep the team out of the postseason. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Charlie Batch outplayed Joe Flacco. Now I've seen everything. I picked the Steelers to cover, but I thought this would be a low-scoring, grind-it-out football game. When the Ravens took a 13-3 lead in the second quarter, I thought Pittsburgh was screwed. Batch, after all, couldn't even beat the Browns, though he was betrayed by all of his running backs. Instead, Batch lit it up in the second half. It's still hard to believe, but Batch went 14-of-20 for 219 yards, one touchdown and an interception after intermission. His numbers could have been even better, but Emmanuel Sanders appeared content to sabotage this game. Sanders caught a pass in the open field and had a long touchdown in his sights, but inexplicably lost a fumble even though he wasn't touched. Sanders then dropped a pass near the red zone, though he would ultimately redeem himself with a clutch reception in Baltimore territory. ",
            "2": "Batch (final numbers: 25-of-36, 276 yards, TD, INT) focused on throwing the ball to Sanders (5-60), Heath Miller (5-97, TD), Antonio Brown (5-58) and Mike Wallace (5-44). Wallace had yet another drop on a deep ball, while Brown made a terrible decision and heaved an interception on a trick play. Phil Simms called Brown's attempt a great throw, but he was obviously on crack because it was awful. ",
            "3": "After fumbling it twice last week, Rashard Mendenhall was a healthy scratch. Jonathan Dwyer (16-49, TD) handled most of the work, while Isaac Redman (9-43) worked as the change-of-pace back. The key is that unlike last week, none of the running backs fumbled. ",
            "4": "Joe Flacco, meanwhile, went 16-of-34 for 188 yards, one touchdown and a bad interception he forced downfield. This pick was his first in five meetings against the Steelers. He was just 5-of-12 for 54 yards after intermission. ",
            "5": "Pittsburgh once again did a great job of taking away Torrey Smith (3-33), so Flacco worked extensively to Anquan Boldin (5-81, TD). ",
            "6": "The Steelers limited Ray Rice to just 40 yards on 20 carries in their Week 10 meeting, but didn't have nearly as much success stopping him in this contest. He gained 78 yards and a touchdown on 12 carries, and he didn't even touch the ball in the fourth quarter. Cam Cameron needs to be fired for this. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Browns",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Congratulations are in order. Congrats to the Browns, who have snapped their 12-game road losing streak, marking the first time they've won away from Cleveland since defeating Kerry Collins and the Colts back in Week 2, 2011. And congrats to the Raiders, who tried for the first time in several weeks. Yes, athletes who are paid six and seven figures actually put effort into playing a football game. That's quite a feat. ",
            "2": "Trent Richardson was such a force in this game. The numbers don't look all that great - 20 carries, 72 yards, one touchdown; three catches, 23 receiving yards - but he had so many tough runs despite poor blocking up front. None of his attempts went over nine yards, but he punished the Raiders with so many power rushes. It was amusing to see his jersey by the fourth quarter because it was covered entirely with mud and grass stains. ",
            "3": "The other rookie in Cleveland's backfield, the geriatric Brandon Weeden, had a mixed outing. He went 25-of-36 for 364 yards, one touchdown and two interceptions. He made several nice throws, but the picks were not pretty. One was poorly underthrown, while another was overthrown in the end zone. ",
            "4": "The Browns' third starting rookie, Josh Gordon, tied the team lead with six receptions for 116 yards and one touchdown. Ben Watson also had six grabs for 80 yards. ",
            "5": "As for the Raiders, they went entirely with Carson Palmer despite reports indicating that Terrelle Pryor would see some action. Palmer went 34-of-54 for 351 yards, two touchdowns and an ugly, underthrown interception, but the numbers are misleading. For one, most of Palmer's stats came in garbage time - he was just 14-of-23 for 111 yards in an opening half in which Cleveland won by a touchdown - and two, he could have easily tossed several other interceptions. One of Palmer's near-picks was actually on Marcel Reece, who had a ball bounce out of his hands and nearly into a Cleveland defender's. Reece disappointed statistically, gaining 36 yards on just seven carries, getting benched in favor of someone named Jeremy Stewart (9-46). Darren McFadden is expected to return on Thursday. ",
            "6": "Tight end Brandon Myers had a huge performance. He caught a whopping 14 balls for 130 yards and a touchdown. Palmer's other score went to promising rookie Rod Streater (3-96). Denarius Moore, meanwhile, made just two catches for 31 yards because he was benched in the second half. ",
            "7": "Remember how I wrote about the Browns' negative streak coming to an end? Well, a positive streak of theirs wrapped up as well. Phil Dawson's consecutive field goal streak came to an end at 29, inexplicably on a 28-yard chip shot. NFL.com is crediting the Raiders with a block, but I didn't see any Oakland player get a hand on the ball. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "The Chargers have done a lot of pathetic things this season. Ranking near the top of that list is allowing BenJarvus Green-Ellis to rush for 118 yards on 25 carries. The Law Firm, normally a plodding runner with zero explosion, looked like a stud against San Diego. He ripped off big gains and broke numerous tackles. In fact, his numbers would have been much better had a long run of his wasn't negated by a hold. There were four reasons why San Diego lost its eighth game of the year. Being unable to tackle Green-Ellis was one. The poor passing game was the second. Philip Rivers went 26-of-48 for 280 yards and an interception, which doesn't look that bad. However, Rivers was awful in the red zone and missed several easy throws because of poor footwork. Of course, Rivers' mechanics are screwed up because of his anemic offensive line. The Bengals sacked him four times (twice by Carlos Dunlap) and forced him into two fumbles. The third San Diego gaffe was Norv Turner's unwillingness to go for it on two fourth-and-goal situations inside the 2-yard line. He was ultra conservative both times and settled for a pair of field goals. The Chargers had nothing to lose, so why not try to get into the end zone? A touchdown would have energized the team. At the very worst, a failed attempt would have pinned Cincinnati's offense near its own goal line. The fourth mistake the Chargers made was their usual unforced errors. For instance, they had consecutive false starts on the final drive of the first half. They allowed the Bengals to convert an early 4th-and-9 because of a holding penalty. They gave Cincinnati a free first down because of a Takeo Spikes personal foul. And in a sequence that epitomized their season, they took a delay of game near the end of the third quarter, which put them out of field goal range. Nick Novak had to try a 54-yarder, which was predictably just a bit short. ",
            "2": "San Diego couldn't run the ball either. Well, the team didn't even try. Ryan Mathews had just nine carries for 26 yards. In fact, Rivers nearly outgained him with 20 rushing yards on just two scrambles. ",
            "3": "Rivers' top targets were Danario Alexander (6-102), who continued to shine, and Antonio Gates (6-49), who still was mediocre. ",
            "4": "As for the Bengals' aerial attack, Andy Dalton, went 25-of-39 for 211 yards, two touchdowns (one passing, one rushing) and a pair of interceptions. One pick came on a deflected pass, but this occurred after San Diego dropped an interception. Dalton missed an open A.J. Green on a couple of downfield throws. It's a shame Green doesn't have a more consistent quarterback throwing the ball to him. ",
            "5": "Dalton's sole aerial score went to Jermaine Gresham (9-85). Green, despite the team's missed opportunities, was the team's leading receiver with nine grabs for 85 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "33"
        },
        "comments": {
            "amount": "7",
            "1": "Both of these teams invent new ways to blow games each week, so something bizarre was bound to happen in this contest. Well, what we saw was the Eagles dominating Dallas' defense early on, imploding via a fumble return for a touchdown and putting themselves back in with an inexplicable 98-yard punt return touchdown. All that was missing was the Cowboys screwing up the ensuing onside kick - and they probably would have if they weren't playing another stupid team like the Eagles. This was an entertaining game though, as both offenses couldn't be stopped for the most part. Perhaps the biggest surprise was Nick Foles, who went 22-of-34 for 251 yards and a touchdown. Foles has looked incompetent at times in relief of the starter, but he was pretty solid in his second road start. He made several great throws, though the Cowboys dropped a potential pick-six of his in the fourth quarter. ",
            "2": "Bryce Brown was awesome once again - for the most part. Brown, who ripped through the Panthers' defense Monday night for 178 yards and two touchdowns, picked up right where he left off, gashing Dallas for 169 yards and two scores on 24 attempts. The only blemish, which was something that was apparent versus Carolina, was a lost fumble that was returned for a score. Brown possesses unbelievable skill and cannot be forgotten when LeSean McCoy returns from his concussion, but he must correct his fumbling problem. He holds the ball way too far away from his body. ",
            "3": "Foles' sole touchdown went to Riley Cooper (2-31), who started in place of an injured DeSean Jackson. Brent Celek (7-73) saw the most targets. ",
            "4": "While Foles played well, Tony Romo was by far the superior quarterback in this matchup. He went 22-of-27 for 303 yards and three touchdowns. Romo was unstoppable after halftime, going a perfect 10-of-10 for 169 yards and the three scores following the break. Romo probably would've been great throughout had his offensive line held up. Right tackle Doug Free had a rough evening, surrendering a sack to Brandon Graham and being whistled for two holding penalties. ",
            "5": "Dez Bryant continued to shine on the stat sheet, catching six balls for 98 yards and two touchdowns. Miles Austin-Jones hauled in Romo's other score, while Jason Witten tied Bryant for the team lead with six receptions for 108 yards. ",
            "6": "Romo said afterward that DeMarco Murray's presence in the lineup was huge. I would definitely agree with that. Murray ran well, gaining 83 yards and a touchdown on 23 carries. ",
            "7": "I'm sure you were all grateful to hear Bob Costas' public-service announcement during halftime. Costas, in his latest attempt to save the world, suggested that neither Jovan Belcher nor his girlfriend would have died had Belcher not owned a gun. Way to go, douche. Nice job using a tragedy to promote your own political agenda. @stevenlourie said it best: F*** you Bob Costas, you are not fit to talk about the Jovan Belcher situation, go back to sniffing your own farts. For thoughts on Giants-Redskins, check out my updated "
        }
    },
    "numberOfGames": "14"
}