{
    "year": "2012",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "I tweeted this (@walterfootball), Just got a text from an Eagles' fan: 'We, the people, want Nick Foles.' I think he was speaking for many Philadelphians because QB Dog Killer was absolutely atrocious. He tossed four interceptions, all of which looked like they came from a rookie. One was thrown way late across his body. Another was forced into double coverage. The third was a weird, off-balanced, side-armed pass. The thing that hurts most is that QBDK had running room and may have picked up a first down on the ground. He would have scrambled prior to his contract, but it now appears as though he's mailing it in. QBDK finished 29-of-56 for 317 yards, two touchdowns and the aforementioned four interceptions; the final one being a pick-six that was tossed into double coverage. The second score won the game at the very end, but it almost didn't happen because Browns' rookie linebacker L.J. Fort dropped a possible interception on the prior play. ",
            "2": "For those who want Foles to take over for the rapidly declining QBDK, I'd suggest that the Eagles wait until they fix the issues with their offensive line. QBDK didn't have any time to throw in this contest. Part of the problem was his inability to read blitzes, but the linemen were constantly overwhelmed by the Cleveland pass-rushers. ",
            "3": "The offensive line affected LeSean McCoy as well. He rushed for 110 yards on 20 carries, but had numerous gains called back because of penalties. He did lose a fumble, however. ",
            "4": "The only reason the Eagles won this game is because the Browns couldn't do anything on offense. Cleveland was outgained, 456-210. Of course, this was to be expected, given that they were the fourth team in the past 44 years to start a rookie quarterback and a rookie running back in the same backfield in the first game of the season. Brandon Weeden was absolutely awful. His stat line (12-of-35, 118 yards, four interceptions) is pretty indicative of how he performed. Actually, his numbers could have been a lot worse because the Eagles dropped three potential picks. Weeden, who played like he was drunker than Derek Anderson, simply doesn't look like an NFL quarterback. Perhaps he'll improve as he ages and matures. ",
            "5": "As for the other rookie, Trent Richardson simply could not find any running room. He gained just 39 yards on 19 carries. He blew up Kurt Coleman on one run; the crash knocked Coleman's helmet right off. I'm sure you'll see that hit on SportsCenter. ",
            "6": "Greg Little didn't catch a single pass. He was targeted five times, but two of the balls were picked off (one was Little's fault). Little can be dropped because Weeden appears to be complete garbage. ",
            "7": "The Browns are a mess, but we knew that already. The bigger story in this game is how bad the Eagles looked. Their offensive line can't block, while their quarterback, who barely scrambles anymore, is just as inept against the blitz as ever. Philadelphia will be lucky to have a winning record this year. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Jeff Fisher coached a hell of a game. There's really no reason the Rams should have been competitive in this game. They were outgained, 429-251. They were also doubled up on first downs, 28-14. But Fisher, who spent some time in Detroit with his former disciple, Jim Schwartz, last year, knew some of Matthew Stafford's tendencies and was able to expose them. Ser Stafford went 32-of-48 for 355 yards, one touchdown and three interceptions, all of which occurred in the first half. He also had a potential fourth pick dropped in the end zone. Fisher's excellent game plan really frustrated Stafford, but talent ultimately won out. Stafford engineered a pair of 80-yard scoring drives in the fourth quarter, both ultimately concluding with a Kevin Smith touchdown. ",
            "2": "In addition to the two scores, Smith had 62 rushing yards on only 13 attempts, which makes me wonder why he wasn't given more carries. It's also worth noting that Joique Bell stole a touchdown on a 1-yard plunge in the second quarter. This makes me think that Mikel Leshoure will get goal-line work when he returns in Week 3. ",
            "3": "Calvin Johnson caught six balls for 111 yards despite drawing even more attention than normal from the Rams' defense. He didn't get into the end zone, but don't expect that to be the case often this season. Meanwhile, Brandon Pettigrew hauled in five balls for 77 yards. He dropped a touchdown, ultimately leading to one of Stafford's three interceptions. ",
            "4": "Tony Scheffler had five grabs for 30 yards. I mention him because the color analyst in this game exclaimed, Tony Scheffler such a matchup nightmare! Yeah, I'm sure Fisher won't be able to sleep tonight thinking about how he couldn't cover Detroit's backup tight end. ",
            "5": "Sam Bradford went just 17-of-25 for 198 yards and a touchdown. He engineered a nice, fourth-quarter drive to take the lead, but was pretty mediocre otherwise. His longest completion was a 23-yard score to Brandon Gibson, which was a great touch pass, but most of his attempts were short checkdowns. The bad news for Bradford is that left tackle Rodger Safford was carted off the field with a neck injury, which delayed the game for what seemed like 10 minutes. Center Scott Wells also went out with a foot issue, but Saffold's exit was much more significant because he was taken to the hospital and forced to stay overnight for observation. Besides, his replacement was Wayne Hunter, who can't help Bradford's David Carr Syndrome. ",
            "6": "Steven Jackson compiled about a third of the Rams' offense despite the fact that he couldn't find much running room. He gained just 53 yards on 21 carries and also chipped in with four catches for 31 more yards. ",
            "7": "Danny Amendola saw nine targets, catching five of them for 70 yards. On the other end of the spectrum, second-round rookie Brian Quick didn't receive a single target. Meanwhile, Steve Smith was thrown to just three times. He can be dropped in all fantasy formats. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Texans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: I hate fantasy football sometimes. Arian Foster left Thursday's practice and didn't do anything Friday because of a knee injury. He was a game-time decision, and ESPN's Chris Mortensen said that he would be limited. Well, Foster had 26 carries to Ben Tate's five. F*** you, Mort. The biggest take-away from this game is that the Texans' defense is the real deal. It made the Dolphins' offense look incapable of moving the ball and didn't allow a touchdown. Defensive end J.J. Watt deflected two passes into interceptions in the first half, and, the Houston defense produced a turnover in four straight possessions to basically win the game before halftime. The Texans' offense played flat throughout the early going, but the team's defense was so dominant, the offense didn't have to do much to have 24 points at the half. Houston controlled the ball in the third quarter. The defense played prevent to drain the clock in the fourth quarter, and stopped Miami twice on fourth-and-goal. Watt was an absolute animal for the Texans. He was a dominant force for four quarters and looks like he could be a NFL Defensive Player of the Year candidate. All of Houston's defensive starters had good plays, including the secondary. ",
            "2": "Houston entered this season having lost its 2011 starters on the right side of the offensive line, but right guard Antoine Caldwell and right tackle Derek Newton played very well in their debut for the Texans. They were solid in run defense and in pass protection. There was no visible drop off against the Dolphins. ",
            "3": "There was speculation that Houston running back Arian Foster wouldn't play due to a calf injury, but the fantasy football superstar answered the bell for the Texans, among others. He was held mostly in check in the first half and had a couple of dropped passes. However, Foster came alive before halftime with a 14-yard touchdown behind the right side of his line with a great block from center Chris Myers. Foster scored again a bit later; this time from one-yard out. He totaled 79 yards on 26 carries with two touchdowns. ",
            "4": "Andre Johnson used this game to show he's still a No. 1 receiver. Johnson caught some intermediate passes to move the chains before he made a beautiful 14-yard touchdown catch against Miami corner Shaun Smith along the sideline. Johnson also caught a 24-yarder to set up a field goal early in the fourth quarter. He totaled 119 yards and a touchdown on eight catches. ",
            "5": "Matt Schaub was 20-of-31 for 266 yards and a score. He moved the ball better in the third quarter, especially with Owen Daniels, who had 87 yards on four catches. ",
            "6": "The Dolphins started rookie quarterback Ryan Tannehill, who didn't actually play as bad as his numbers indicate. He was 20-of-36 for 219 yards with three interceptions. Tannehill had some bad luck as two of his three picks came on tipped passes. He got little help from his teammates as he was pressured consistently. ",
            "7": "It is painfully obvious that Miami has crap at wide receiver. None of the team's wideouts were getting separation and working themselves open. The Dolphins' leading wideouts were Devon Bess (5-45) and Brian Hartline (3-50). It was ugly. ",
            "8": "Miami's best offensive player was running back Reggie Bush. He ran for 69 yards on 14 carries and caught six passes for 46 yards. Bush and teammate Daniel Thomas each had a fumble. ",
            "9": "Dolphins defensive tackle Randy Starks really played well in the first half with two sacks. His second came when he beat Wade Smith with a nice shed and speed rush. Starks also had some nice plays in run defense. ",
            "10": "The highlight of the day for Miami was a punt return from Marcus Thigpen. He brought back a 72-yard touchdown with a sprint straight down the middle of the field. It looks like it is going to be a painful season for Miami. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "You have to feel for the Chiefs. They played well offensively in the first half of this game, but were simply overwhelmed by Atlanta's unbelievably high-powered offense. Kansas City, missing its two best defenders, Tamba Hali and Brandon Flowers, simply didn't have a chance. The Falcons were a machine. They punted only once. Matt Ryan went 23-of-31 for 299 yards and four touchdowns (three passing, one rushing). Those numbers would have been much better if the Chiefs kept up; Ryan already tallied 203 yards by halftime. ",
            "2": "I hope you obtained Julio Jones in your fantasy draft. He caught six passes for 108 yards and both of Ryan's first-half scores. As with Ryan, Jones could have posted better numbers if the Chiefs would've kept up. He could easily be the No. 1 fantasy receiver this season. ",
            "3": "Roddy White matched Jones' six receptions for 87 yards, but couldn't find the end zone. Ryan's third aerial score went to Tony Gonzalez, who was playing against the Chiefs for the first time in his Hall-of-Fame career. The crowd cheered him at the beginning of the game, but booed when he hauled in the touchdown. They were even more vocal when he dunked the ball over the goal post in celebration. ",
            "4": "Michael Turner looked like he was running in quicksand this preseason, and that's exactly how he appeared in this contest. He gained just 32 yards on 11 attempts. Jacquizz Rodgers saw some action (7 rushes, 22 yards), but was given only three carries prior to the fourth quarter. He needs to touch the ball more often in meaningful action. ",
            "5": "As for the Chiefs, Matt Cassel had a really nice first half. He was 10-of-12 for 123 yards and a touchdown prior to intermission, and the game would have been tied had Ryan Succop not whiffed on a 44-yard field goal. However, expecting Cassel to engage in a shootout with a quarterback like Ryan is just too much to ask. He would end up being responsible for three turnovers (two picks, one lost fumble). One of the interceptions was a terrible decision, as he threw very late across his body. ",
            "6": "Cassel's main target was Dexter McCluster, who had six catches for 82 yards. He's going to be a solid PPR receiver this year, which is why I listed him as one of my 20 fantasy football sleepers. If he's available, pick him up. ",
            "7": "Dwayne Bowe had just three catches for 53 yards. Jonathan Baldwin, meanwhile, didn't get a single target. He can be dropped. ",
            "8": "The Chiefs ran the ball somewhat well, but had to abandon the ground attack because they were playing catch-up in the second half. Jamaal Charles gained 87 yards on 16 carries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "There were many who thought that neither Adrian Peterson nor Maurice Jones-Drew would play in this game. As it turns out, both would have a big impact in what would be the first NFL game to ever have an overtime possession following a score. Peterson was a monster. He rushed for 84 yards and two touchdowns on 17 carries. He made a number of tough runs, breaking a ton of tackles like the Peterson of old. If I didn't know any better, I wouldn't have thought for a second that he was coming off major knee surgery. I would have only questioned why he had 17 carries, but that number will increase steadily as the season progresses. As for Jones-Drew, he gained 77 yards on 19 carries, but wasn't nearly as explosive as he was in 2011. Rashad Jennings started, but in an ironic turn of events, he was the one who left the game with a knee injury. Players who hold out typically get hurt, so that was shocking. Nevertheless, direct your hate mail toward Adam Schefter, who said that Jones-Drew would not report to the Jaguars prior to the season opener. ",
            "2": "The quarterback duel between Blaine Gabbert and Christian Ponder was almost as entertaining. Ponder went 20-of-27 for 270 yards. His only mistake was a lost fumble. He did a terrific job driving the Vikings down the field twice after the final minutes of regulation - once to tie the game and the second time to kick the decisive field goal in overtime. As for Gabbert, he was 23-of-39 for 260 yards and a pair of touchdowns. He made a couple of really nice throws, including his beautiful touch lob to for a 39-yard score to Cecil Shorts, which looked to be the game-winner. However, he also showed his mental limitations on too many occasions. He settled for too many checkdowns. Also, he was still tentative against the pass rush, overthrowing Justin Blackmon in the end zone under pressure. ",
            "3": "Some skill-position players of note: - Percy Harvin caught six balls for 84 yards. He actually received a goal-line carry in the third quarter, but was stuffed at the line of scrimmage. - Kyle Rudolph was thrown to quite frequently on third down. He hauled in five receptions for 67 yards. - A disappointing debut for Blackmon. He had just three catches for 24 yards. As mentioned, however, Gabbert missed Blackmon in the end zone for an easy touchdown. ",
            "4": "Major credit is due to Minnesota's front office, who made a ballsy move by cutting Ryan Longwell in favor of rookie kicker Blair Walsh. The swap is working out thus far; Walsh drilled a 55-yarder to tie the game and then hit the decisive kick in overtime from 38 yards. He was 4-of-4 overall. ",
            "5": "As mentioned, this was the first NFL contest in which the new overtime rules applied. I'm a fan. The Vikings didn't want to settle for a field goal, but ultimately had to, and it was cool to see the Jaguars get a chance to either tie or take the lead. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "32"
        },
        "comments": {
            "amount": "6",
            "1": "So much for the Saints not having any issues in the wake of Bountygate. The offense looked discombobulated, the defense was completely inept and the general attitude of the players was lethargic. There was one instance when a 12th man on defense was jogging off the field as the Redskins snapped the ball. It gave Washington a free first down in what was a crucial point in the game. There was just no sense of urgency. However, this game is all about Robert Griffin. Forget the fact that he was far and away the most impressive rookie quarterback in Week 1; outside of Matt Ryan, he was arguably the top signal-caller period on Sunday afternoon. Griffin started the game 8-of-8 for 149 yards and touchdown (with 24 rushing yards) before his first incompletion occurred in the end zone. He would end up finishing 19-of-26 for 320 yards and a pair of scores with 42 rushing yards on 10 scrambles. He was really amazing; he looked like a poised veteran, wanting to throw before running, even after his top receiver, Pierre Garcon, left the contest with a foot injury. ",
            "2": "It's a shame that Garcon's foot malady had to ruin what looked like it was going to be a special afternoon. He had four catches for 109 yards and a touchdown in the first quarter alone. The good news is that X-rays came back negative. Garcon told the media he'll play against the Rams next week, but who really knows at this point? ",
            "3": "When Garcon exited the game, I figured Santana Moss and Fred Davis would see more targets, but they had just five combined receptions. Griffin's top wideout became Aldrick Robinson, a sixth-rounder in 2011. He caught four balls for 52 yards and a touchdown. ",
            "4": "Mike Shanahan didn't tell a single soul which running back he would be riding in the season opener. Many expected it would be Evan Royster or Roy Helu, but it was Alfred Morris, who shouldered the workload. He gained 96 yards and two touchdowns on 28 attempts. If he's somehow available in your league, you must add him immediately. ",
            "5": "As for the Saints' players, Drew Brees was 24-of-52 for 339 yards, three touchdowns and two picks, one of which occurred on a Hail Mary. The offense as a whole just seemed out of sorts. Many things didn't make sense either. For example, why did Darren Sproles have just five touches? Sproles did save his fantasy owners with a touchdown on his five catches for 35 receiving yards. The other Saints who found the end zone were Lance Moore (6-120) and Jimmy Graham. Moore needs to be picked up in all fantasy formats, as he seems to be the player who will benefit most from Robert Meachem's absence. ",
            "6": "The officiating in this game was awful. The most egregious call was a ridiculous pass-interference penalty on Roman Harper in the end zone, which gave the Redskins a gift touchdown at the beginning of the third quarter. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "There's a team in the AFC East. It has a terrible offense that can't score at all, thanks to poor quarterbacking, a shaky offensive line and only one proven receiver. Several hours ago, I would have figured I'd write something like that about the Jets, but it applies perfectly to Buffalo. It's really amazing that the Jets posted 48 points in their opener. Seriously, how does something like that happen after they couldn't find the end zone once during the preseason? Forty-eight points is a franchise record for an opening game. Weren't they supposed to be completely offensively challenged? Mark Sanchez was on fire. He went 19-of-27 for 266 yards, three touchdowns and an interception. Tim Tebow, meanwhile, played just seven snaps, carrying the ball five times for 11 yards. He also hauled in an attempted onside kick. Tebow was on the field on the first play as a receiver. Sanchez, as you might imagine, looked the other way and threw way wide of his target. At that point, I didn't think the Jets stood a chance, but they went on to completely dominate the Bills on both sides of the football. Buffalo's treasured offseason acquisitions seem pretty irrelevant right now. ",
            "2": "Two of Sanchez's touchdowns went to Stephen Hill, who had five catches for 89 yards. So much for him being raw. He's worth picking up, but I'm not nearly as excited about him as I am with the other receivers available this week. ",
            "3": "Shonn Greene plodded for 94 yards on 27 carries. He didn't look good, but the important thing, fantasy-wise is that he had a rushing touchdown. Tebow did get touches inside the 20, but Greene still managed to score. ",
            "4": "I mentioned earlier that the Jets dominated on both sides of the ball. Of course, it helped that Ryan Fitzpatrick was extremely inept. He managed to throw three touchdowns, but all of them came at the end when the game was out of hand. Fitzpatrick's three picks were much more meaningful. All of them showcased his really weak arm. It's a major liability; the Bills must find an upgrade at quarterback next offseason. ",
            "5": "The Bills' offense went in the tank last year when Fred Jackson broke his leg. Well, he sprained his knee in this contest, so he'll probably be out for a while. C.J. Spiller took over and sprinted for 169 yards and a touchdown on just 14 carries. ",
            "6": "Fitzpatrick's touchdowns went to Steve Johnson (4-55), Donald Jones (5-41) and Scott Chandler (4-38). David Nelson, who had two grabs for 31 yards, tore his ACL. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "There are two major storylines in this game, both involving New England's defense. The first is the tremendous amount of pressure the Patriots were able to generate. They accumulated two sacks, but the front seven dominated the line of scrimmage. Chandler Jones, who had five tackles, one sack and a forced fumble, was double-teamed on almost every single play. The fumble that Jones caused was pretty cool in that fellow rookie Dont'a Hightower scooped up the ball and took it back for six. The second storyline is that both Jake Locker and Nate Washington were injured on the same play. Locker appeared to complete a deep pass to Washington, who fumbled the ball. Locker then tried to bring down the Patriot who had possession, but hurt his non-throwing shoulder while making the tackle. The play was reviewed and it was ruled an incompletion, but the damage was done. The good news is that Locker is expected to play next week. I haven't even heard anything pertaining to Washington, so I assume that he's OK. ",
            "2": "Locker played relatively well considering the circumstances, going 23-of-32 for 229 yards, a touchdown and an interception. However, he was constant siege in the backfield, and the Patriots were able to force him into enough errors (the pick and the aforementioned strip-six) to establish complete control of the game. ",
            "3": "New England also did an outstanding job of bottling up Chris Johnson. CJ2K had nowhere to run, gaining just four yards on 11 carries. He did, however, catch six balls for 47 receiving yards. ",
            "4": "Locker's sole touchdown went to Washington (2-53). The other receivers of note were Jared Cook (4-64) and Kendall Wright (5-37). ",
            "5": "As for New England's offense, Tom Brady was nearly perfect, going 23-of-31 for 236 yards and two touchdowns. He nearly had a deep score to Brandon Lloyd (5-69), but Lloyd stopped running for some reason. He had to leap for it awkwardly, looking like Wes Welker in the Super Bowl. Brady's scores went to Rob Gronkowski and Aaron Hernandez, both of whom had six receptions for 60 and 59 yards, respectively. ",
            "6": "Welker was a huge disappointment, catching just three passes for 14 yards. He's certainly losing leverage for his next contract. ",
            "7": "The Patriots may have finally found a quality running back. Stevan Ridley gained 125 yards and a touchdown on 21 carries. He also had two catches for 27 receiving yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "I think you'd have to say that the officiating is the major headline in this contest. There were numerous awful calls throughout, but nothing was nearly as egregious as what occurred in the final minute. As Russell Wilson was marching down the field, attempting to lead his team to a game-winning touchdown, the officials granted his team a fourth timeout following a Marshawn Lynch carry. This enraged the Cardinal players, who looked like they wanted to punch the refs. A 10-minute delay ensued. The crowd booed mercilessly. FOX brought in Mike Pereira, who explained what happened. The officiating crew apparently forgot to charge Seattle with a timeout on a Doug Baldwin injury. The lead ref then announced that the Seahawks did, in fact, have a third timeout to use because the clock was stopped during the Baldwin injury. Pereira came back and then angrily said, That's not true. Just because the clock was stopped, doesn't mean there's no charged timeout. Some of the replacement officials did well this weekend, but these guys, as well as the ones in the Green Bay-San Francisco game, were particularly atrocious. ",
            "2": "The Cardinals moved the ball pretty well in the first half. Their offensive line held up shockingly well after being unable to block whatsoever in the preseason. However, the Seahawks seemed to figure things out after intermission. The Cardinals didn't achieve a single first down until John Skelton was knocked out with an injury in the fourth quarter. Skelton started hot, going 11-of-17 for 124 yards in the first half, but was just 3-of-11 for only 25 yards and a pick after the break. However, Kolb stepped in and looked much sharper, going 6-of-8 for 66 yards and the decisive touchdown on his only drive. Kolb's score was pretty humorous because Ken Whisenhunt was running down the sideline, trying desperately to call a timeout. He has to be pretty happy that it wasn't granted. At any rate, Skelton suffered a high ankle sprain, but it doesn't matter at this point. Kolb will be starting next week. ",
            "3": "Kolb hit Larry Fitzgerald twice on his only possession. Fitzgerald had just two catches before that, so he finished with four grabs for 63 yards. Andre Roberts (5-54) caught the touchdown. ",
            "4": "The Cardinals couldn't run the ball at all. Chris Wells and Ryan Williams had just 14 and 9 rushing yards, respectively. Williams lost a fumble. ",
            "5": "Russell Wilson went 18-of-34 for 153 yards, a touchdown and an interception carelessly thrown into triple coverage in his debut. He ran a pretty conservative game plan, probably because Seattle's offensive line couldn't block the Cardinals. Wilson was sacked thrice, but he was constantly running for his life. ",
            "6": "Wilson's score went to Sidney Rice, who caught four balls for 36 yards. Braylon Edwards paced the team with five receptions for 43 yards. ",
            "7": "Marshawn Lynch started despite dealing with back spasms and still ran well, gaining 85 yards on 21 carries. He had some really tough runs, so it's a shame that his effort went to waste. Robert Turbin, meanwhile, had just two attempts for five yards. ",
            "8": "Bad news for the Seahawks - Russell Okung limped off the field in the fourth quarter. The severity is unknown. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "22"
        },
        "comments": {
            "amount": "8",
            "1": "So much for the 49ers' regression. I completely blew that prediction. San Francisco completely whipped up on the Packers. This score isn't even indicative of how lopsided this game was. Seven of Green Bay's points came on a bogus punt return (more on that later). Another seven occurred in garbage time. San Francisco had a huge edge in two areas. The first was on the line of scrimmage. The Packers simply couldn't block the 49ers. Aaron Rodgers was constantly running for his life. He didn't have time to find his receivers downfield. That would explain why he had just two passes longer than 25 yards. The second mismatch was in coaching. The Packers just seemed so discombobulated in pass defense. They had so many blown coverages, it was ridiculous. Alex Smith easily picked their secondary apart, going 20-of-26 for 211 yards and two touchdowns. Rodgers finished with better numbers (30-of-44, 303 yards, two scores and an interception), but San Francisco moved the chains so much more easily. Plus, Rodgers should have been pick-sixed in the fourth quarter. ",
            "2": "Smith's touchdowns went to Randy Moss (4-47) and Vernon Davis (3-43). Moss was completely wide open on his 14-yard score. It's amazing how the Packers just completely forgot to cover him. Meanwhile, Michael Crabtree led the team with seven grabs for 76 yards. ",
            "3": "While Green Bay's offensive line couldn't block, the defensive front was simply trampled. Frank Gore picked up 112 yards and a touchdown on 16 carries, while Kendall Hunter gained 41 yards on nine attempts. ",
            "4": "Several Packers disappointed. Greg Jennings had just five catches for 34 yards. Cedric Benson, meanwhile, couldn't find any running room, gaining just 18 yards on nine attempts. Rodgers had more rushing yardage (27 on five scrambles). ",
            "5": "Green Bay's leading receiver was James Jones, who hauled in four grabs for 81 yards and a touchdown. A close second was Randall Cobb, who had a whopping nine catches for 77 yards. He should be available, so pick him up if he is. ",
            "6": "Rodgers' other touchdown went to Jermichael Finley (7-47). Finley, who had a couple of bad drops, scored one play after he suffered an apparent injury. Perrish Cox flipped Finley over after a pass-interference call and then stepped on his ankle. It's good to know that Cox is still a scumbag. ",
            "7": "It's time to address the aforementioned special-teams gaffe that occurred during Cobb's 75-yard return touchdown. There was a flag on the play, and as soon as Cobb saw it, he sulked in the end zone. There was an obvious block in the back, and it appeared as though the score would be nullified. The officials did, in fact, call a block in the back - on the 49ers. Yep. The Niners, who were punting, were blocking for some reason. These refs are geniuses. ",
            "8": "Something else of note on special teams: David Akers tied an NFL record with a 63-yard field goal at the end of the first half. The kick doinked off the crossbar, but then bounced through. His teammates lifted him up as though he just won the game. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: And here I thought Cam Newton was immune to a sophomore slump because of his great work ethic. Oh, and it apparently doesn't matter if one of the Panther running backs get hurt. Jonathan Stewart outgained DeAngelo Williams - and he didn't even play. ",
            "2": "This game started out like the Carolina Panthers thought they were still playing in the preseason. Tampa Bay was ready to play and the Panthers were sleep walking through the first half. The Buccaneers' defense played tough for four quarters and carried the team to a win. The Bucs' defensive line deserves a lot of the credit, especially defensive tackle Gerald McCoy. He had a superb game, blowing up runs and rushing the quarterback. On the flip side, the Panthers' offensive line was atrocious. It didn't protect Newton well and was God-awful in run blocking. Carolina's offense couldn't extend drives, and as result, Tampa Bay dominated the time of possession. The Panthers had minus-1 yard rushing at halftime and finished with only 10 yards total on the ground. DeAngelo Williams had minus-1 yards on six carries. If Carolina's line doesn't pick up its play, it is going to be a painful season for the running game. The Bucs produced timely turnovers with interceptions by Ronde Barber and Ahmad Black. Tampa Bay cornerback Aqib Talib blocked a punt in the fourth quarter and that was a huge game-changer. The clutch special teams play led to a Bucs field goal. ",
            "3": "Tampa Bay's lone touchdown drive was a nice mix of Doug Martin runs and Josh Freeman precision passes. It ended with a short touchdown pass from Freeman to Mike Williams (2-12). The Panthers had zero pass rush as Freeman had all day to throw the ball in the first half. They played better in the second half and were able to sack Freeman a couple of times. ",
            "4": "Carolina's offense showed signs of life in the second half, too. Newton hit Steve Smith for 32 yards. Newton then had a nice third-down conversion to tight end Greg Olsen, before capping the drive with a touchdown strike to Brandon LaFell, who beat rookie safety Mark Barron to get wide open. Newton dropped in a bomb for 51 yards to Louis Murphy after he beat Talib down the field with five minutes in the fourth quarter. The drive stalled inside the five-yard line and Carolina settled for a field goal. ",
            "5": "Tampa Bay ran out the clock with Martin to seal the win for new head coach Greg Schiano. The rookie running back totaled 95 yards on 24 carries. LeGarrette Blount had eight yards on just three attempts. Wide receiver Vincent Jackson caught four passes for 47 yards. Freeman was 16-of-24 for 138 yards. ",
            "6": "Newton completed 23-of-33 attempts for 303 yards, a touchdown and two picks. Smith (7-106), LaFell (3-65), Murphy (3-63) and Olsen (6-56) all did a good job of getting open. ",
            "7": "If you need a tight end for your fantasy team, consider trading for Olsen. Without Jeremy Shockey on the team, all the tight end targets are going to Olsen rather than being split between the two tight ends. He had a good game and was open on other plays, but Newton didn't have the time to get him the ball. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "Peyton Manning is back. Not the predicted shell of his former self, but the real Peyton. He was out of football for about 600 days, but he looked as sharp as ever against the Steelers, particularly in the second half. Manning went 19-of-26 for 253 yards and two touchdowns. He was simply average on his first three drives when he was getting in calls from the sideline, but the Broncos opted to go with a no-huddle approach beginning on the fourth drive. It was at that point that Manning became absolutely lethal. Here's the disparity: First three drives: 4-of-7, 44 yards, 0 touchdowns, 2 sacks. Fourth drive and on: 15-of-19, 209 yards, 2 touchdowns, 0 sacks. The scary thing about Manning's no-huddle approach is that opposing defenders will be sucking for air in Denver's thin atmosphere. The Steelers looked winded in the second half. ",
            "2": "Manning's scores went to Demaryius Thomas (5-110) and Jacob Tamme (5-43). Eric Decker (5-54) nearly found the end zone, but Keenan Lewis made a nice pass break-up. ",
            "3": "Willis McGahee lost a fumble, but had a nice game considering he was battling the tough Steelers. He gained 64 yards on 16 carries. He lost a goal-line try to Knowshon Moreno after a failed attempt of his own, but he did score on a two-point conversion. ",
            "4": "Though they ultimately lost, the Steelers did a good job of controlling the clock, winning the time of possession by more than 10 minutes. In fact, Manning was off the field for 57 real-time minutes, as Ben Roethlisberger did an incredible job of converting third downs. ",
            "5": "Roethlisberger went 22-of-40 for 245 yards, two touchdowns and an interception. He was really impressive considering the lack of time he had in the pocket. In addition to David DeCastro being unavailable, right tackle Marcus Gilbert and right guard Ramon Foster left the game with knee and eye injuries, respectively. Still though, forty pass attempts? So much for running the ball more with Todd Haley. It's puzzling that Jonathan Dwyer carried the ball just nine times. He gained 43 yards in the process and had some really tough runs. Isaac Redman, meanwhile, flopped around 11 times for 20 yards. Rashard Mendenhall won't play until October, so Dwyer should be added. ",
            "6": "Roethlisberger's numbers should have been better. He had a wide-open Mike Wallace for a long touchdown, but didn't see him. Wallace and Antonio Brown caught four passes for 37 and 74 yards, respectively. Wallace scored on another occasion. ",
            "7": "More officiating ineptness: The refs called for the two-minute warning prior to an extra-point attempt following a Denver touchdown. The point-after try should have occurred first. An even worse error occurred when Mike Tomlin was allowed to challenge after the Broncos ran a play. Tomlin threw the red flag just as the Broncos snapped the ball. It ultimately screwed the Steelers over because they lost the challenge and Denver would end up finding the end zone anyway. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "1",
            "1": "You can read all about the Giants-Cowboys game in my Live Kickoff Blog. A few quick notes: - It's only Week 1, so let's stop it with the Cowboys' coming-of-age talk. It was an impressive victory, but many teams have achieved great wins in Week 1 and have gone on to do nothing. My worry is the eight procedural penalties Dallas was guilty of. It's stupid crap like this that always ends up being its downfall when the season is on the line. - As for those hitting the panic button on the Giants, remember that they lost to Rex Grossman in Week 1 last year. They'll get their s*** together, though I believe they will lose at Dallas later in the year. - As my female friend Val said on Wednesday, What's an Ogletree? Yes, pick up Kevin Ogletree. He's the new Laurent Robinson. You can check out my other Fantasy Football Add-Drops here. For thoughts on Ravens-Bengals and Chargers-Raiders, check out my updated "
        }
    },
    "numberOfGames": "13"
}