{
    "year": "2012",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "55"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Raiders' defensive line coach Terrell Williams' 4-year-old son passed away just prior to this game. Most teams would play hard in response to this. We all saw how the Ravens tried extra hard for Torrey Smith back in Week 3. A couple of years ago, the Bengals had a very spirted performance for defensive coordinator Mike Zimmer, who lost his wife. There are many other examples of this, including Brett Favre's memorable victory on Monday Night Football after his dad died. As for the Raiders? They can't even say they gave any sort of effort. It was pathetic. Oakland allowed the offensively challenged Ravens' scoring attack to do whatever it wanted. Baltimore picked up 419 yards of offense. Meanwhile, the Raiders once again killed themselves with stupid mistakes. They committed 10 penalties. On one instance, they were guilty of an offensive pass interference in the end zone, which was kind of bogus, but it didn't matter because Carson Palmer overthrew an open Brandon Myers by a mile. Earlier, Palmer tripped over his lineman's feet while going for it on a 4th-and-1 at midfield on the opening drive. The Raiders had no answer for Joe Flacco and Baltimore's downfield passing attack. Flacco went 21-of-33 for 341 yards, three touchdowns and a fluky interception that was deflected and popped into the air. Oakland failed to sack him a single time, and because of this, Flacco was able to locate his receivers deep down the field on numerous occasions. He completed five passes of 26-plus yards. ",
            "2": "One such long reception went to Torrey Smith for a 47-yard touchdown. Smith also had another touchdown from 20 yards out - and those were his only receptions of the afternoon. ",
            "3": "Flacco's other score went to Dennis Pitta (5-67) who took a fierce hit from Philip Wheeler. The linebacker was flagged for a late hit, setting up a Baltimore field goal after a Smith dropped touchdown. ",
            "4": "The Ravens shockingly couldn't run the ball whatsoever. Ray Rice managed just 35 yards and a score on 13 attempts, which is very surprising considering that Richard Seymour was out and Doug Martin nearly broke the NFL single-game rushing record last week. ",
            "5": "As for the Raiders, they struggled to move the chains on the ground with Darren McFadden out. Marcel Reece handled the bulk of the workload but tallied only 48 yards on 13 carries, though he did contribute with seven catches for 56 receiving yards. Taiwan Jones was projected to split touches with Reece, but he barely did anything (2-6). ",
            "6": "Palmer went 29-of-45 for 368 yards, two touchdowns and an interception that wasn't entirely his fault because Paul Kruger made a very athletic play to secure the turnover. Most of the yardage came in garbage time. Palmer's scores went to Denarius Moore (4-90) and Darrius Heyward-Bey (5-82). ",
            "7": "John Harbaugh pulled off a very classless move late in the game. Up 41-17 in the fourth quarter, the Ravens lined up for a field goal, but ran a fake, which resulted in a touchdown. As this happened, I tweeted ( @walterfootball), Stay classy, #Ravens. I couldn't believe Harbaugh did this. There's no reason to show up the Raiders like that. It's not like there's some hatred with them like there is with Pittsburgh. Just kick the damn field goal, John. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The officials seemed content to take this game into their own hands. The Broncos were up 7-3 and received a punt. Trindon Holliday, who scored on a kickoff return the previous week, took the punt back 76 yards to put Denver up two scores. What the refs missed was an obvious block in the back and Holliday dropping the ball prior to crossing the goal line. The first non-call is understandable - it happens - but the second is inexcusable. Every score is reviewed, so it just blows my mind how they were able to miss something so blatant. Now, could Peyton Manning just have scored on an ensuing drive without the help of Holliday? Absolutely - he was on fire the entire afternoon - but the fact that something so shady went down makes me believe that Carolina never had a chance anyway. Why was this so important? Well, even though the final score was 36-14, it was the difference in the game. With a double-digit lead, the Broncos were able to tee off on Cam Newton. They pressured him relentlessly, recording seven sacks - a ridiculous number considering Elvis Dumervil's shoulder injury (he left in the second quarter). Denver even stripped Newton once - a recurring problem this year - and intercepted him twice. One of the picks, which was returned for a touchdown, was an extremely dumb throw. Newton was under heavy pressure and forced a pass to prevent a sack. It was taken back 40 yards by Tony Carter. Newton went 21-of-36 for 241 yards, two touchdowns (one in garbage time) and the aforementioned two picks. What's puzzling is that he had just four scrambles for seven rushing yards. Newton needs to stop trying to become a passing quarterback. His best trait is running the ball. If he doesn't take advantage of that, he's only making things easier for the opposition. ",
            "2": "Both of Newton's touchdowns went to Greg Olsen (9-102). Meanwhile, Steve Smith predictably was erased by Champ Bailey. The only thing Smith managed to do was catch a 19-yard pass. ",
            "3": "The Panthers once again failed to run the ball. Jonathan Stewart (8-31) led the team in rushing, while DeAngelo Williams had six spectacular carries for six yards. I hope no one is wondering why no one traded for him at the deadline. ",
            "4": "As mentioned, Manning was hot throughout. He opened the game completing 13 out of his first 14 passes and ultimately finished 27-of-38 for 301 yards and a score on a nifty screen to Brandon Stokley (4-54). ",
            "5": "Demaryius Thomas appeared to suffer a knee injury in the second quarter. He was down for a while, but managed to return to the game almost instantly. And not only did he take the field again - he managed to lead the team with nine catches for 135 yards. Eric Decker disappointed with two receptions for 15 yards. He dropped a deep pass. ",
            "6": "Willis McGahee had an average fantasy performance (14-56), but fumbled twice. He lost one of the balls. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "This embarrassing blowout loss might just be the best thing that'll happen to the Giants all year. As we all know, they thrive when everyone counts them out. That's exactly what's going to happen in the wake of this defeat and the ensuing bye week. The New York players will be hearing about how awful they are for two weeks. This could spark yet another late-season run. You can't say this result is much of a surprise though. The Giants have played sluggishly on both sides of the ball the past few weeks. They were even worse in this contest, though they didn't exactly have to bring their A-effort because this game was largely irrelevant. They were playing a non-conference opponent right before their bye, all while sitting comfortably in first place of their division. A loss like this doesn't exactly mean much. What New York needs most is rest. Several NFL analysts have concluded that Eli Manning has a tired arm. He may also be fatigued mentally because he made numerous terrible decisions in this contest. He made consecutive poor mistakes in the second half, firing dumb interceptions, both of which led to Cincinnati touchdowns. He was also strip-sacked. Manning finished 29-of-46 for just 215 yards otherwise. ",
            "2": "The offensive performance can't be blamed entirely on Manning though. New York's pass protection was terrible; the offensive line surrendered four sacks. Ahmad Bradshaw, who rushed for 57 yards on just 10 carries, fumbled in Cincinnati territory. Victor Cruz (3-26), meanwhile, dropped a long touchdown pass. ",
            "3": "Manning's touchdown-less outing was his third straight. The silver lining though is that Hakeem Nicks finally looked healthy. Nicks finished with nine grabs for 75 yards. ",
            "4": "I mentioned Bradshaw's fumble a bit earlier. He coughed the ball up again later on, but the play was reviewed and eventually ruled a non-fumble. Bradshaw didn't touch the ball again after that, perhaps because he suffered some sort of neck injury. He underwent X-rays afterward. Andre Brown, who had 65 yards and a touchdown on just seven carries to go along with five receptions for 29 receiving yards, could get more of the workload going forward. ",
            "5": "As for the winning team, Andy Dalton was a near-perfect 21-of-30 for 199 yards and four touchdowns. He enjoyed a clean pocket all afternoon. With a comfortable lead throughout, he wasn't sacked a single time. ",
            "6": "Dalton's touchdowns went to four different players: A.J. Green (7-85), Mohamed Sanu (4-47), Andrew Hawkins (3-16) and Jermaine Gresham (3-15). Sanu saw six targets and a rushing attempt. ",
            "7": "The Bengals did this without running the ball effectively. BenJarvus Green-Ellis plodded his way for a meager 50 yards on just 15 carries. Cincinnati will have to address this position during the upcoming offseason. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Titans",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "Forum member MiamiDolphins4Life said it best: There are some weird things going on in this Titans-Dolphins game. How's this for weird? By halftime, Miami had outgained Tennessee, 154-120. Jake Locker had just four completions. But despite this, the Titans were destroying Dolphins, 24-3. It all started when Reggie Bush lost a fumble after a 15-yard gain on the second drive. Tennessee took over, and Locker quickly threw a touchdown to Kendall Wright. Later on, a Ryan Tannehill pass was tipped, picked and returned for six. Tannehill would then toss another interception because he forced a throw. This led to another Titan score. As all of this was going on, the Dolphins were killing themselves with penalties (five in the first half). Mix in poor tackling on both Chris Johnson and Locker, and that was the perfect recipe for their complete first-half meltdown. ",
            "2": "CJ2K - I feel like I can call him that again - had yet another monstrous performance. He rushed for 126 yards and a touchdown on 23 tries. He still looked tentative while looking for running room, but the difference is that his blockers are doing a better job. ",
            "3": "Locker finished with nine completions out of 21 attempts for 122 yards. However, he threw two touchdowns and scrambled for 36 yards (Cam Newton, take note of another running quarterback who is actually running). ",
            "4": "No Titan logged more than two receptions. In fact, only a pair of Titans - Kenny Britt (2-36) and Damian Williams (2-31) - had more than one catch. Locker's scores went to Jared Cook (26 yards) and Wright (9 yards). ",
            "5": "Meanwhile, the Dolphins had a rough outing offensively. I mentioned the early turnovers; Ryan Tannehill threw yet another interception later on. He finished 23-of-39 for 217 yards and three picks and failed to complete a pass longer than 17 yards. This was a reality check after an alleged hot start. ",
            "6": "Brian Hartline had a solid fantasy outing despite Tannehill's struggles, catching eight balls for 79 yards. ",
            "7": "Bush, who had the aforementioned fumble, had just four carries for some strange reason, turning them into 21 yards. Daniel Thomas had the same amount of yardage on five attempts. Bush, who also had an eight-yard reception, needs to have the ball more often. There's no excuse for giving him just five touches. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "The Vikings were not given much of a chance in this game. With Percy Harvin out, they were made home underdogs. All of the pundits on ESPN picked Detroit, completely dismissing any sort of possibility that Minnesota could prevail. Yet, everyone seemed to forget about Adrian Peterson, who absolutely dominated this contest. Peterson rushed for 171 yards and a touchdown on 27 carries. He was awesome, showcasing his unbelievable talent. The Lions simply had no answer for him. ",
            "2": "Detroit also struggled to contain Christian Ponder. The secondary is dealing with numerous injuries, but there's simply no excuse for that, especially with Harvin sidelined. Ponder, who looked like he was lacking confidence entering this contest, went 24-of-32 for 221 yards and two touchdowns. Ponder was locked in on rookie receiver Jarius Wright early. He hit him with a 54-yard bomb on the opening drive and then tossed a 3-yard touchdown to him in the end zone. Wright (3-65, TD) had just three more targets after the score (including one drop), as Ponder began focusing more on Kyle Rudolph (7-64, TD) once again. It was nice to see Rudolph emerge as a weapon in the passing game again because he disappeared for a few weeks, which happened to coincide with Ponder's recent struggles. ",
            "3": "The Lions were sluggish offensively all afternoon. They converted just one third down and committed two key turnovers that led to a pair of Minnesota field goals. The early give-away came via a Matthew Stafford interception. He forced a poor throw on third-and-long for some reason. He would end up finishing 28-of-42 for 329 yards, three touchdowns and that pick, but most of this was junk yardage, as his team was down by double digits for most of the afternoon. The other turnover was Calvin Johnson's fault. Megatron fumbled the ball near midfield, disrupting what appeared to be a promising drive. On the bright side, Johnson finally caught a touchdown from Stafford - amazingly, his first of the year. Things looked bleak when Megatron was tackled inside the 2-yard line yet again on one instance, only to see another score go to someone else, but he would end up finding the end zone later in the game. He finished with 12 catches for a whopping 207 yards. ",
            "4": "Stafford's other touchdowns went to Titus Young (4-35) and Brandon Pettigrew (3-32). ",
            "5": "Mikel Leshoure ran all over the Jaguars, but couldn't do anything versus Minnesota, mustering just 43 yards on 13 tries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "31"
        },
        "comments": {
            "amount": "6",
            "1": "The Patriots may have won this game, but they had no business prevailing. The Bills completely outplayed New England but made dumb mistakes the entire afternoon. Buffalo outgained New England, 481-347, and had more first downs (35-27), but cost itself with the following blunders: - The Bills had a ridiculous 14 penalties for a whopping 148 yards. It was evident that this would be a problem early. They had a 3rd-and-1 on their opening drive, but that quickly transformed into a 3rd-and-21 because of a series of infractions, one of which negated a 14-yard completion. - Some of the penalties were more crucial than others. On one New England possession, the Bills committed a pass interference on a 3rd-and-15. Rookie corner Stephon Gilmore then was guilty of a face mask and a pass interference, though the ball landed five yards out of the back of the end zone. This was a gift touchdown awarded to the Patriots when they should have been punting from deep in their own territory. - Fitzpatrick was strip-sacked for the second week in a row. The turnover gave the Patriots a first-and-goal. - Fred Jackson fumbled twice, which is amusing because the Bills talked about giving C.J. Spiller more touches all week. The first was a killer because it came at the goal line. The second was reviewed and ruled a non-fumble, but it cost Buffalo its final timeout because Jackson was injured on the play (a possible concussion). The lack of touches Spiller received was alarming. He had 11 last week and was given just two more at New England. He had nine carries for 70 rushing yards and four catches for 61 receiving yards. He did so much more with the football than Jackson (16-80; 4-35) and didn't even cough it up. You have to wonder what Chan Gailey is thinking with this bizarre strategy. ",
            "2": "Outside of the strip-sack, Fitzpatrick had a solid outing. He went 27-of-40 for 337 yards, two touchdowns and a late, desperation interception. ",
            "3": "Steve Johnson led the team in receiving yards (6-86), but couldn't find the end zone. Fitzpatrick's scores went to Donald Jones (6-74) and Scott Chandler (5-65). ",
            "4": "The Patriots struggled defensively all afternoon because of poor tackling. Luckily, they were able to move the chains consistently, albeit with the help of Buffalo's penalties. Stevan Ridley gained 98 yards and a touchdown on 22 attempts. Danny Woodhead chipped with a 15-yard rushing score. ",
            "5": "Tom Brady went 23-of-38 for 237 yards and a pair of touchdowns. His numbers could have been better, but Wes Welker dropped a wide-open score in the first quarter. Welker would rebound to finish with six receptions for 74 yards, but failed to find the end zone. ",
            "6": "Brady's touchdowns went to Woodhead (4 catches, 46 yards) and Rob Gronkowski (3-31). Brandon Lloyd disappointed yet again with five receptions for just 45 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "One of the Falcon fans in our live in-game thread - I think it was ElliJay - complained about his team not being able to beat the Saints during this contest. It just appears that New Orleans has Atlanta's number. The Saints have won the previous three, six of seven and 10 of 12 in this rivalry. The Falcons were competitive, but it just seemed like they were tentative throughout this contest - almost as if they knew that New Orleans was going to defeat them yet again. The Falcons had some close calls entering this game but managed to win them all despite struggling in the red zone. That finally cost them, as they converted just three of six tries deep in New Orleans territory, including one instance late in the game in which a Matt Ryan incompletion on fourth down all but ensured a New Orleans victory. ",
            "2": "Ryan went 34-of-52 for 411 yards, three touchdowns and an interception on a deep throw. He opened this contest with 49-yard bomb to Roddy White (7-114), but struggled in the middle of this contest after Julio Jones left the game because he rolled his ankle. Jones (4-75) eventually reentered the contest, but it was too late by then, as the Saints had established a 28-17 lead. It's worth noting that White screwed up on one play in the fourth quarter. Ryan threw a nice deep ball in his direction, but White underplayed it by stopping his route. Had he kept running, it may have been a touchdown. ",
            "3": "Tony Gonzalez was the leading receiver and scorer for the Falcons, snagging 11 balls for 122 yards and a pair of touchdowns. Ryan's other score went to eligible offensive lineman Mike Johnson. ",
            "4": "Shame on the Falcons' coaching staff for not using the recent bye week to plan for Jacquizz Rodgers to receive more touches. Michael Turner was given 13 carries in this contest, but managed a laughable 15 yards. He's completely done, and everyone knows it - save for Atlanta's coaching staff. ",
            "5": "While Atlanta's offense sputtered at times, the Saints' scoring attack was sharp for most of the afternoon. Drew Brees was phenomenal, going 21-of-32 for 298 yards, three touchdowns and an interception on the opening drive. Brees was sacked only once, as his offensive line had a rare solid performance. ",
            "6": "Jimmy Graham caught two of Brees' touchdowns and also led the team in receiving with seven catches for 146 yards. Lance Moore (7-91) and Marques Colston (3-26, TD) both had solid fantasy outings. ",
            "7": "The Saints ran the ball pretty well. Mark Ingram had most of the carries (16-67), but Chris Ivory had the best one. You'll definitely see it on SportsCenter, but Ivory eluded several Falcon tacklers, tip-toed the sideline and then capped the run off with a fierce stiff arm. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: I received two texts from former contributor Matt McGuire during this game. The first: This Bucs' defense has bigger holes than a spider web. Very true. Tampa needs cornerbacks desperately, which is why I have it picking two in my 2013 NFL Mock Draft. The second: Thought it was funny how Bill Simmons copied you on his podcast. Check out my NFL Picks for more about that. ",
            "2": "The Chargers may be the most finesse team in the NFL. They play with zero physicality, attitude and tenacity. On both sides of the ball, their lines struggle to control the line of scrimmage and they lack any players who are physically dominant. Once again, their self-distructive ways cost them a game that could have been a win.  Two big plays by Tampa Bay's special teams and defense ended up being the difference in this game. The Bucs took the lead in the first half when Dekoda Watson blocked a punt, and it was returned by Adam Hayward 29 yards for a touchdown. San Diego was down 21-24 in the fourth quarter, but close to taking the lead, when Philip Rivers threw a bone-headed interception to Leonard Johnson that was returned 82 yards for a touchdown and a 31-21 Tampa Bay lead. There was no receiver even close and the pass was thrown right between Johnson's numbers for a gimme pick-six. That iced the game for the Buccaneers. ",
            "3": "The afternoon started well for San Diego in the first half. Rivers hit Danario Alexander on a quick slant on the first third down of the game. He was spun around by Johnson, but kept his balance and sprinted down the field for an 80-yard touchdown. Rivers connected with Antonio Gates later in the first half for 33-yard gain against Mark Barron. The veteran duo took advantage of the rookie again for a 13-yard touchdown. Gates had Barron beaten for another touchdown, but Rivers had a poorly underthrown pass to let Barron recover for the pass breakup. The Chargers took the lead just before halftime with Rivers throwing a fastball for a short touchdown pass to Malcolm Floyd. ",
            "4": "The Bucs' defense held Rivers to only three second-half points. He had the opportunity for more scores, but shaky pass protection and improved play from the Tampa Bay secondary kept him from capitalizing. Rivers completed 29-of-37 passes for 337 yards, three touchdowns and two interceptions. ",
            "5": "Alexander led the Chargers in receiving with 134 yards on five catches. Floyd (6-63), Gates (4-57), Eddie Royal (3-36) and Ryan Mathews (5-22) all contributed. Mathews also ran for 54 yards on 17 carries. ",
            "6": "Tampa Bay's offense played well, but had limited opportunities as San Diego dominated the time of possession. The first Buccaneers' touchdown was set up by Josh Freeman connecting with Doug Martin for 41 yards on a dump-off pass to set up a short touchdown pass to Dallas Clark. Freeman later hit Mike Williams (2-64) for 55 yards to set up a Connor Barth field goal. Freeman connected with Vincent Jackson (5-59) in the third quarter for a gain of 31 yards and on the next play hit Tiquan Underwood for a touchdown. Freeman completed 14-of-20 passes for 210 yards with two touchdowns and zero interceptions. Martin carried the ball 19 times for 68 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "The Jets are pathetic. I wouldn't even write about them if it wasn't so amusing. They do such stupid things all the time, whether it's on a play-by-play basis or just fundamentally by barely using their best offensive player. I mean, really, what other team in the NFL keeps its top offensive player on the sideline? It's like Rex Ryan is choosing to play this season on hard difficulty mode because he needs a challenge. There were a couple of instances that epitomized the Jets' futility extremely well. The first occurred when Tim Tebow lined up at quarterback with Mark Sanchez split out wide. Sanchez appeared to false start, though the official whistled another Jet for the infraction. It was hilarious that Sanchez would perhaps subconsciously sabotage one of Tebow's rare plays. So, anyway, New York was called for a 5-yard penalty. What did Tebow do on the next play? Nothing. Because he was on the sideline again! The other occurrence took place near the end of the second quarter. Tebow was stationed at quarterback, but there was yet another false start. The coaching staff took Tebow off the field and replaced him with Sanchez, who threw an interception on the very next play. It wasn't even difficult for Seattle; second-year corner Richard Sherman baited Sanchez into the pick. It's a complete joke that the Jets are continuing to lie to themselves at Sanchez. He sucks. He absolutely sucks, and he needs to be benched immediately. He finished 9-of-22 for 124 yards and the aforementioned pick. Tebow, meanwhile, completed all three of his passes (for eight yards) and also picked up 14 rushing yards on four scrambles. ",
            "2": "The other Jet leaders were Shonn Greene (15 carries, 58 yards) and Jeremy Kerley (5 catches, 57 yards). Dustin Keller (3-47) was the only other New York player to log more than one reception, though he dropped a key pass on a 3rd-and-2 in the second half. ",
            "3": "The Jets' former general manager reportedly really wanted to draft Russell Wilson. Well, Wilson the top quarterback in this matchup, though that's not saying much. Wilson went 12-of-19 for 188 yards and two touchdowns but played terribly for most of the first half. He looked like a rookie trying to do way too much. He tried to keep too many plays alive by scrambling around in the pocket. It cost him on one instance when he was stripped of the ball. Muhammad Wilkerson returned it for a touchdown. Wilson did finish strongly though. He made some great plays in the second half, which includes a 31-yard touchdown to Sidney Rice (2-54). Rice caught another score from Golden Tate (2-51, TD) on a trick play. ",
            "4": "Marshawn Lynch lost a fumble in this contest, but it was his only blemish. He ran very hard once again, finishing with 124 yards and a touchdown on 27 carries. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: I'm usually against mid-season coaching firings because they're pointless and can ultimately be detrimental (see Kansas City), but Andy Reid has to go now. Reid will continue playing QB Dog Killer when the right move would be going to Nick Foles. Foles didn't look very competent in this contest, but the Eagles need to determine if he can be a legitimate starter. Starting QBDK is pointless in the long-term, but Reid will continue to do so because that's his best chance of holding on to the job. That's why Reid needs to be fired immediately. ",
            "2": "With the New York Giants looking vulnerable, the winner of this game could entertain thoughts of getting into the chase for the NFC East, but the Eagles and head coach Andy Reid lost their fifth straight game and are completely done in 2012. The Cowboys on the other hand, are alive and find themselves in striking distance of the Giants. Aside from the result, the big news of the game was Michael Vick leaving with a concussion. He was popped by linebacker Ernie Sims and defensive tackle Jay Ratliff during the second quarter. The trainers took Vick to the locker room and ruled him out for the game. Rookie signal-caller Nick Foles stepped in for Vick and had some nice passes in his first plays, but almost threw a pick-six to Orlando Scandrick. Foles put the Eagles in the lead early in the third quarter with a 44-yard touchdown pass to Maclin (8-93). Maclin ran a go route down the seam and was left completely uncovered by the Cowboys' safeties. The rookie rolled out and dropped in a precision pass. Foles got lucky in the fourth quarter when a bad interception was negated by a Dallas penalty. His luck ran out on the next drive, however, when he threw a pass behind Jackson. The pass pin-balled around before Brandon Carr snatched it and returned it 47 yards for a touchdown. Foles moved the ball to set up a short touchdown run with just under two minutes left. The Eagles had one more shot, but Anthony Spencer started a strip sack that was recovered in the end zone for a touchdown by Jason Hatcher. Foles finished 22-of-32 for 219 yards with a touchdown and an interception. He flashed good and bad, and he doesn't look ready to take the league by storm. Philadelphia's play-calling was once again pathetic about using LeSean McCoy (16-82 rushing, 4-20 receiving). ",
            "3": "The Cowboys answered an early Vick touchdown with a nice drive. They tied the game on a short screen pass from Tony Romo to Felix Jones (16-71) where Nate Allen, Nnamdi Asomugha and others missed tackles on Jones. Romo later set up a field goal after Dez Bryant (3-87) burned Dominique Rodgers-Cromartie on a double move for a gain of 49 yards. ",
            "4": "Romo played well, but his offensive line stunk. Nate Livings and Doug Free were really struggling. The interior of the line was getting whipped by Eagles defensive tackles Fletcher Cox and Cullen Jenkins. Romo made an insane play during the third quarter on which he dodged three defenders to make a throw downfield for a 25-yard completion to Miles Austin (2-32). Romo threw for the end zone on the drive, and Bryant laid out for the ball. It was a bad call and ruled a 30-yard touchdown, as the ball had clearly rolled on the ground. There also was a pass interference penalty called on Rodgers-Cromartie. However, the officials botched the review and kept it a Dallas touchdown to tie the score at 17 entering the fourth quarter. Dwayne Harris gave the Cowboys the lead with a 78-yard punt return for a touchdown just a bit later. Romo finished the game completing 19-of-26 passes for 209 yards with two touchdowns and zero interceptions. Jason Witten (8-47) had a modest contribution. ",
            "5": "Defensively, there were a number of standouts for each team. Cowboys' linebacker Bruce Carter was excellent defending the run with some hard hits. Victor Butler and Spencer recorded sacks and both played well. Eagles' linebackers Mychal Kenricks and DeMeco Ryans played well along with the rest of the Philadelphia defensive line. ",
            "6": "There were some meltdown performances. Cowboys' rookie corner Morris Claiborne was flagged a total of four times, twice for pass interference penalties in the third quarter and two offside penalties. A holding penalty by Claiborne took away an interception by Spencer that would've set the ball up at the Eagles 18-yard line. Dallas also had five offside penalties. Eagles right tackle King Dunlap had some costly penalties with a hold to negate a good run by McCoy and a facemask that wiped out a good pass from Foles that would've set up a first-and-goal from the 1-yard line. Dunlap added another hands to the face penalty in the fourth quarter. As if the penalties weren't enough, Dunlap was getting abused by Dallas. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "I hate ties. There shouldn't be any ties. They're cheap and communistic, and like the old saying goes, it's like kissing your sister. And that sucks, unless you're a hick. Having said that, it's very fitting that these teams tied - the first time this has happened since Donovan McNabb's ignorant revelation in 2008 - because both the Rams and 49ers completely mirrored each other. Both ran the ball extremely well. Both tried their best to control the time of possession. And both shot themselves in the foot to sabotage a potential victory. ",
            "2": "The Rams were awesome on the ground. Steven Jackson ran like a madman, gaining 101 yards and a touchdown on 29 carries. Daryl Richardson, meanwhile, gashed the 49ers for 58 yards on just seven tries. As for San Francisco, Frank Gore collected 97 yards and a score on 21 attempts, while Colin Kaepernick scrambled on eight occasions for 66 yards and a touchdown. ",
            "3": "Kaepernick was in the game because Alex Smith suffered a concussion in the second quarter. Smith was a near-perfect 7-of-8 for 72 yards and a score to Michael Crabtree (5-70). The switch to Kaepernick wasn't much of a downgrade. Kaepernick did a decent job of moving the chains aerially - he went 11-of-17 for 117 yards - but more than made up for Smith's absence with his rushing ability on the ground. ",
            "4": "Sam Bradford, meanwhile, went 26-of-39 for 275 yards and two touchdowns. The return of Danny Amendola helped; the small slot receiver caught 11 balls for 102 yards. He had a 79-yard reception in overtime negated because of a very late (albeit fair) illegal formation penalty. And thus, I must begin discussing all of the Rams' mistakes. The infraction that wiped out Amendola's near-game-winner was just one of 13 St. Louis committed. In fact, it wasn't even the only one that eliminated a play by Amendola that almost resulted in a touchdown. An illegal block above the waste negated an Amendola punt return to the San Francisco 2-yard line. St. Louis had some stupid penalties, like a delay-of-game on a 3rd-and-2 on a good-looking drive. Another delay of game was much more costly, however, as it was called just as Greg Zuerlein nailed the decisive 53-yard field goal in overtime. The Rams were pushed back five yards, and on cue, Zuerlein was wide right from 58. ",
            "5": "Zuerlein wasn't the only kicker who screwed up on a potential game-winner. David Akers whiffed from 41 in overtime. The 49ers also committed more special-teams blunders, including two instances in which they were caught napping on Rams' fake punt attempts. They had seven penalties in total, including a Jonathan Goodwin hold on a 15-yard Kaepernick completion on a 3rd-and-10 situation. ",
            "6": "The officials must be mentioned. They were terrible. Some of the calls were awful, and they robbed the Rams of about 10 seconds at the end of overtime by incorrectly spotting the ball. Oh, and then there's the minute or so that completely disappeared off the clock because the time kept running during a stoppage. It's almost like Roger Goodell invited the replacement refs back for this contest. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Texans",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "This was one of the worst close games I've ever seen. I'm all for watching hard-hitting defensive battles, but this matchup was just sloppy, particularly on Chicago's part. It might have been apparent that this wasn't going to be the Bears' day when they committed a pair of turnovers in the first quarter. Kellen Davis fumbled near midfield and then Michael Bush coughed the ball up deep in Houston territory after converting a 4th-and-1. Davis, by the way, had a brutal performance. He struggled in terms of blocking, committed that fumble and dropped several passes. He was booed off the field after suffering an injury in the fourth quarter. Somewhere in a Pittsburgh hotel room, Eric Winston was seething. The worst turnover transpired near the end of the first half. While scrambling, Jay Cutler threw a short completion to Devin Hester. It was incorrectly ruled an illegal forward pass because the officials said he was over the line of scrimmage. However, Cutler was drilled on the play. Later on the same drive, Cutler tossed an ugly interception because he slipped and then apparently misread the coverage. What really happened though was that Cutler was playing through a concussion. He was removed from the contest at halftime and never came back. He finished 7-of-14 for 40 yards and two picks. Jason Campbell took over right after intermission. He didn't turn the ball over, but he certainly didn't do anything positive either. He threw mostly checkdowns and converted just four first downs, finishing 11-of-19 for 94 yards. ",
            "2": "Amazingly, the only Bear who had more than nine receiving yards was Brandon Marshall, who hauled in eight grabs for 107 yards. The numbers are awesome, but Marshall dropped a couple of passes, including a touchdown in the second quarter. ",
            "3": "There was no running room whatsoever. Matt Forte churned out just 39 yards on 16 carries. In fact, Cutler nearly outgained him in just one half of action with 37 rushing yards on three scrambles. ",
            "4": "The Texans ran the ball much better than the Bears. Arian Foster compiled 102 yards on 29 attempts, while Justin Forsett chipped in with a 25-yard burst that set up Houston with a first-and-goal in the second quarter. Folster would ultimately find the end zone on a 2-yard reception. ",
            "5": "Matt Schaub struggled against Chicago's stout defense, finishing 14-of-26 for just 95 yards, the touchdown to Foster and two interceptions. One of the picks seemed to go back for a touchdown, courtesy of Tim Jennings, but after a review, it was ruled that Jennings was (barely) down by contact. It was close; the call could have gone either way. ",
            "6": "Andre Johnson had more than a third of Schaub's yardage, which normally would be good enough for a solid fantasy performance, but not in this contest. Johnson had just four catches for 35 yards. For thoughts on Steelers-Chiefs, check out my updated "
        }
    },
    "numberOfGames": "12"
}