{
    "year": "2012",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Colts",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "The ESPN analysts on <i>Sunday NFL Countdown</i> were discussing the Chuck Pagano leukemia-related absence prior to this game. They pointed out that teams usually perform well when players suffer some sort of tragedy (like Brett Favre, Torrey Smith, etc.), but the same doesn't apply to head coaches because they're just too important in terms of game planning and making adjustments. I actually agreed with that, picking the Packers to cover for two units. Well, everyone was wrong. Sort of, but I'll get to that later. The Colts won for their head coach. Reggie Wayne, the only person to visit the quarantined Pagano, had the game of his life, catching 13 balls for 212 yards and a touchdown. Wayne, who has known Pagano the longest - Pagano recruited him to Miami - made sure his team won for his coach, telling Pagano that he would be back next week with the game ball. Wayne made several incredible plays, including an amazing, one-handed divinggrab. ",
            "2": "Andrew Luck went 31-of-55 for 362 yards, three touchdowns (two passing, one rushing) and an interception. He was amazing in the fourth quarter, especially given that he was really roughed up early on. The Packers swarmed the backfield and constantly hit him fiercely in the first half - at least prior to B.J. Raji's ankle injury. As a result, Luck struggled in the beginning of the game, nearly tossing numerous picks. There was good fortune on his side, however, and things opened up for him in the second half. Green Bay's secondary had no chance. ",
            "3": "The Colts were also very lucky on the other side of the ball. In addition to Raji leaving the game, the Packers lost Cedric Benson and Jermichael Finley to leg and shoulder maladies, respectively. That's why Green Bay scored just six second-half points after tallying 21 in the first half. The Packers led 21-3 at the break, and you have to wonder if they would've held on to that advantage if they didn't lose three key players to injuries. ",
            "4": "Aaron Rodgers went 21-of-33 for 243 yards, three touchdowns and an interception (with 57 rushing yards). It was mediocre early - he overthrew an open Jordy Nelson for a deep touchdown - and it was ugly late, as Rodgers clearly missed both Benson and Finley. The offensive line was also an issue; the Colts constantly swarmed the backfield and managed to bring down Rodgers five times. Dwight Freeney, who had a sack, made a huge impact in his return to the lineup. ",
            "5": "Two of Rodgers' scores went to James Jones (4-46). The other was thrown to Randall Cobb (4-82). Jordy Nelson did nothing (2-29), but should have caught that aforementioned deep pass. ",
            "6": "Meanwhile, Luck's aerial second touchdown went to Dwayne Allen (4-38). Luck nearly had a third to Donnie Avery (3-22) but just missed him. ",
            "7": "The Colts ran the ball well because Raji was out for half the game. Donald Brown gained 84 yards on just 17 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "9"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "The Chiefs have killed themselves with penalties all season, and they continued to self-destruct with stupid mistakes in this contest. They should have beaten Baltimore. In fact, they should have led by double digits at halftime. They had outgained a sleepwalking Baltimore team, 216-106 at that point. Here were the terrible mistakes: - Cyrus Gray fumbled the ball in Baltimore territory in the first quarter. I jotted down, Why the f*** is Gray carrying the ball? in my notes, but Gray would play well in the second half (4 carries, 20 yards). - Matt Cassel (9-of-15, 92 yards) fumbled a snap at the 1-yard line. He also threw two picks, but neither was his fault. The first tipped off Dwayne Bowe's hands and into Lardarius Webb's. The second bounced off Bowe's chest and into Cary Williams' arms. - Bowe also committed an offensive pass interference penalty that wiped out a 25-yard gain in the fourth quarter. Bowe, who only collects his yardage in garbage time, will be appearing in my next overrated players list. He had six catches for 60 yards in this game. - Bowe found the end zone on one instance, but that was negated by another offensive pass interference. - Flacco fumbled the ball late in the fourth quarter, and the Chiefs recovered it and scored a touchdown. Except it never happened because the officials blew the play dead. Yeah, this isn't a Kansas City mistake, but it was amusing watching an ultra-nice Romeo Crennel refrain from lashing out at the refs in his post-game press conference. ",
            "2": "Cassel suffered a concussion in the fourth quarter. The crowd cheered when Cassel was on the ground, which drew the ire of right tackle Eric Winston. It's 100-percent sickening, Winston said angrily afterward. Cassel was replaced by Brady Quinn, who completed all three of his passes for 32 yards. Quinn looked confident and may be named the team's starter going forward. The coaching staff showed no confidence in Cassel anyway, opting to run a draw play on a 3rd-and-8 in Baltimore territory in the opening quarter. ",
            "3": "The Chiefs ran the ball extremely well against the Ravens, who surrendered triple-digit rushing yards in a half for the first time since 1998. Jamaal Charles gained 140 yards on 30 carries. Shaun Draughn, playing for an injured Peyton Hillis, chipped in with 40 yards on 12 attempts. ",
            "4": "The Ravens also did a great job of moving the ball on the ground. Ray Rice totaled 102 rushing yards on 17 carries. The question is, why didn't Rice receive more than 17 attempts? The Ravens, despite being outplayed, never trailed in this contest. Cam Cameron, once again, inexplicably forgot about him. ",
            "5": "Joe Flacco went just 13-of-27 for 187 yards and an interception. There were two reasons why the Ravens couldn't do anything aerially. First, the team dropped a ton of passes. Second, Flacco was constantly pressured. He was sacked four times, twice each by Tamba Hali and Justin Houston. ",
            "6": "Torrey Smith disappointed with just three catches for 38 yards. Anquan Boldin led the team with four grabs for 82 yards despite leaving the game briefly with a minor injury. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "13"
        },
        "comments": {
            "amount": "4",
            "1": "<i> EDITOR'S NOTE: The Bengals have beaten the Browns (0-5), Redskins (2-3) and Jaguars (1-4). They just lost to the Dolphins (2-3). Think they were a bit overrated heading into this game? </i> ",
            "2": "This was a sloppy game and Cincinnati had a 4-1 start there for the taking, but instead the team played flat and fell to 3-2. The Dolphins and Bengals were both putting the ball on the ground, but ultimately Miami played clean football in the second half while Cincinnati self-destructed. An early Miami turnover set up the Bengals to take an early lead. A punt bounced off a Dolphins back and was recovered by Vontaze Burfict, which led to a Mike Nugent field goal. Miami later fumbled the ball away when Nate Clements popped Jorvorski Lane. Cincinnati went for a fourth-and-2 on its ensuing drive, and Dalton converted with a 20-yard toss to Jermaine Gresham to set up three more. Dalton had an ugly performance. He had a number of passes off the mark and made the Dolphins' defense look like one of the league's better stop units. The signal-caller pulled a Mark Sanchez and threw an interception to Miami defensive tackle Randy Starks. It was a great play by Starks to make a leaping catch. The Dolphins scored a short touchdown off of that with Reggie Bush (19-48). Andrew Hawkins (5-47) made a highlight-reel, leaping, one-handed 24-yard catch in the middle of the field, but Nugent missed a 41-yard field goal with three minutes remaining. The game ended after Dalton tried to fit a pass into a tight window, but the ball was overthrown and fell to safety Reshad Jones for a pick. Dalton was 26-of-43 for 234 yards with a touchdown to A.J. Green (9-65) and two picks. ",
            "3": "The Bengals' running game is horrible. Bernard Scott (5-40) led them in rushing, but had 29 yards come on one carry. BenJarvus Green-Ellis (9-14) was completely ineffective and ran with zero confidence, but at least he didn't fumble. Cincinnati botched the running back position last offseason, and the team clearly needs a difference-maker at running back to help cover up for Andy Dalton's limitations. ",
            "4": "Ryan Tannehill played mistake-free football and completed 17-of-26 passes for 223 yards with zero touchdowns or interceptions. He threaded a needle in tight coverage while getting hit hard to Charles Clay (3-35) for a 24-yard gain. That set up a short Daniel Thomas (10-29) touchdown. Brian Hartline (4-59) and Anthony Fasano (3-28) had modest contributions. Both the Dolphins and the Bengals played good defensive football. Miami got good games from Cameron Wake (1.5 sacks), Starks (one sack, one pick) and Paul Soliai (.5 sacks). Cincinnati had good days from Reggie Nelson (10 tackles), Micheal Johnson (one sack) and Geno Atkins (one sack). Atkins and Domata Peko abused Dolphins guard John Jerry. He stinks and Miami could use two new guards to go along with some wide outs. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Giants",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "It's amazing how one stupid play can change an entire game. The Browns were in complete control of this contest. They were up 17-10 and driving deep into New York territory with a couple of minutes remaining before halftime. On a 3rd-and-1, the sensible move would have been to give the ball to Trent Richardson, who had been gashing the Giants all afternoon (17 carries, 81 yards). Instead, Brandon Weeden attempted a weird throw off his back foot. It was picked off. A couple of plays later, the Giants scored a touchdown and tied the game. If that wasn't bad enough, Joshua Cribbs fumbled the ensuing kickoff. Wasting no time, Eli Manning hit Victor Cruz for a quick touchdown to take a seven-point lead. The Browns got the ball back but failed to run the clock out. They punted to the Giants, who then were the recipients of a bogus, long pass interference penalty on an uncatchable ball. Lawrence Tynes hit a 40-yard field goal, giving New York a 10-point advantage. In other words, the Browns could have led 24-10 at intermission, but trailed 27-17 instead. Game, set, match. ",
            "2": "Pat Shurmur was guilty of terrible play-calling. I mentioned the poor decision not to give Richardson the ball on that 3rd-and-1; well, Shurmur panicked and forgot to give the ball to his best player. Richardson received just TWO carries in the third quarter. It's not like the game was out of hand either; it was a 10- or 14-point lead for the Giants throughout most of the period. In fact, one sequence just after intermission at midfield saw the Browns call a double reverse (gain of two yards), an ugly incompletion and a checkdown short of the first-down marker. Cleveland consequently had to punt. ",
            "3": "Weeden was terrible. His final numbers look decent - 22-of-35, 291 yards, two touchdowns, two picks - but most of the yardage, save for a 62-yard touchdown bomb to Josh Gordon, came in garbage time. On one instance, Weeden was whistled for an illegal forward pass because he tossed the ball into the end zone after the ball was batted back to him. Immediately afterward, Weeden heaved an interception into the end zone. Weeden was mostly awful, which has to be especially discouraging for Cleveland fans because the Giants were missing half of their back seven. ",
            "4": "Both of Weeden's scores went to Gordon, who caught just those two balls for 82 yards. Meanwhile, Jordan Norwood hauled in nine passes for 81 yards. ",
            "5": "While Richardson ran very well, that's nothing compared to what Ahmad Bradshaw was able to accomplish. He fumbled on his first carry because his own lineman hit him and then committed a chop block, but he rebounded and was able to finish with a whopping 200 yards and a touchdown on 30 attempts. Meanwhile, Andre Brown suffered a concussion. ",
            "6": "Manning, meanwhile, went 25-of-37 for 259 yards, three touchdowns and an interception despite not having Hakeem Nicks and losing Martellus Bennett to an injury for a stretch. He wasn't sacked a single time. ",
            "7": "All three of Manning's scores went to Victor Cruz, who caught five balls for 50 yards otherwise. Rueben Randle (6-82) and Domenik Hixon (5-55) filled in well for the injured Hakeem Nicks and Ramses Barden. ",
            "8": "New York really had no business covering this game. The Browns, as mentioned, should have been up by 10 at halftime, but shot themselves in the foot. A D'Qwell Jackson concussion late in the second quarter didn't help matters. Jackson has been Cleveland's best defender all year, so not having him on the field made a huge difference. The Giants, meanwhile, didn't seem especially focused. For example, they had 10 men on the field during a field goal attempt. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "What is up with Pennsylvania NFL teams and their tendency to make dumb mistakes and win ugly despite of them? Both the Steelers and Eagles tried their hardest to lose this game, but the more desperate squad prevailed. For the Eagles, it was more of the same. QB Dog Killer took a hiatus from turning the ball over last week but was able to pick up where he left off in a loss to the Cardinals the prior Sunday. QBDK fumbled three times, including once at the goal line. He went 20-of-30 for 175 yards and two touchdowns, looking pretty sharp in the second half. Of course, it helped his cause that the Steelers lost two key defenders to injury prior to intermission. Troy Polamalu aggravated his calf injury, while LaMarr Woodley left with a hamstring. This completely ruined Pittsburgh's game plan, almost ruining a tremendous effort by Lawrence Timmons, who had a monstrous performance. The Steelers, meanwhile, made several dumb errors. Maurkice Pouncey inexplicably botched two snaps, including one on a 4th-and-10 try. Receivers Mike Wallace and Antonio Brown committed illegal procedure penalties. The defense, perhaps feeling the frustration of being shorthanded, were flagged for dual personal foul penalties during one of Philadelphia's two touchdown drives. One of the penalties would have almost certainly forced a punt because the Eagles would have been stuck with a third-and-long. Philadelphia's other scoring drive was amusing. The Eagles had a 4th-and-1 deep in their own territory at the beginning of the final quarter. Andy Reid inexplicably sent his players out to go for it. He then decided to challenge the prior play. As always when coaches attempt to review a spot, Reid was denied, costing him a precious timeout. Reid still decided to go for it, despite the pleas of Troy Aikman, and barely converted. Later on the drive, Reid asked for yet another useless timeout and went for it again on a 4th-and-1. Philadelphia somehow scored a touchdown out of this, but in typical Reid fashion, the team didn't have any stoppages at the end of the game to prevent the Steelers from running the clock out and kicking the decisive field goal. ",
            "2": "Ben Roethlisberger won this matchup on his own. He went 21-of-37 for 207 yards, but was masterful on third downs. Big Ben should have had a touchdown added to his stats, but Antonio Brown dropped a ball in the end zone. Brown did catch seven passes for 86 yards. ",
            "3": "No other Steeler wideout did very much. Heath Miller (4-41) and Mike Wallace (2-17) both disappointed. ",
            "4": "The Eagle receivers also struggled. DeSean Jackson (4-58) and Jeremy Maclin (5-39) hurt their fantasy owners, though the latter drew a 41-yard pass interference penalty. ",
            "5": "LeSean McCoy couldn't get anything going on the ground, rushing for just 53 yards on 16 carries, but saved his fantasy day with four grabs for 27 receiving yards and a touchdown. Meanwhile, Rashard Mendenhall looked good, gaining 81 yards and a score on 14 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "It was bound to happen eventually. Robert Griffin has such a small frame and was taking too many fierce hits to remain healthy. He was finally knocked out of a game when he was hit cleanly on the helmet in the red zone. Upon taking the blow, Griffin had trouble getting up and appeared out of it. He was taken to the locker room and was later diagnosed with a minor concussion. His status for Week 6 will be completely up in the air for the next few days. Kirk Cousins took the field in the wake of Griffin's absence. If you watch <i>SportsCenter</i>, you'll see him hook up with Santana Moss on a 77-yard touchdown, but he was pretty terrible otherwise. Forget that one throw, and Cousins went 4-of-8 for 34 yards. I don't want to take everything away that long strike, but that was all Moss, who was wide open. Mike Shanahan spent a fourth-round pick on Cousins for some strange reason, so much more was expected out of the Michigan State product, even though it was his debut. The fact remains that the Redskins, who could have possibly won this game with Griffin, had no chance with the other rookie at the helm. Griffin, by the way, went 10-of-15 for 91 passing yards and just seven rushing yards. He barely had any time to throw. ",
            "2": "The Redskins ran the ball well, as expected. Alfred Morris rushed for 115 yards on 18 carries. They couldn't give Morris more opportunities because they barely had the ball; the Falcons won the time of possession by 15 minutes. ",
            "3": "Matt Ryan was expected to shred Washington's hobbled secondary, and he did just that, going 34-of-52 for 345 yards, two touchdowns and an interception, which was a really athletic pick-six by Ryan Kerrigan. It could have been an even better day for Atlanta's aerial attack, as Ryan and Julio Jones (10-94, TD) nearly connected on three deep balls. Ryan was also victimized by several drops, one of which was a potential 45-yard bomb that bounced off Jones' chest. ",
            "4": "Ryan's scores went to Jones and Tony Gonzalez, who caught a whopping 13 balls for 123 yards. Roddy White (4-68) didn't do much this week. ",
            "5": "Michael Turner didn't run the ball all that well, gaining 67 yards and a touchdown on 18 carries. ",
            "6": "Billy Cundiff may have played his final game in the NFL. Already struggling all year, he pathetically whiffed on a 31-yard attempt. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks won by just four points, but this might as well have been a blowout because Seattle absolutely dominated Carolina on both sides of the ball. It wasn't even close. The Seahawks pushed Carolina around, easily winning the battles in the trenches. Seattle outgained Carolina, 310-190. It won the time of possession by 12 minutes. If the Seahawks hadn't squandered opportunities in the red zone, and if Russell Wilson hadn't tossed a very ugly pick-six, they would have been victorious by double digits. ",
            "2": "Cam Newton just couldn't get anything going offensively. He was 12-of-29 for 141 yards, but that doesn't tell the whole story. He was 3-of-15 for 40 yards by halftime, nearly getting picked on a couple of occasions. He converted just 2-of-11 third downs. He missed an open target for a touchdown by skipping the ball to him. He stared down Steve Smith and ignored Greg Olsen, who was open on some occasions. He was constantly pressured, getting sacked four times, including twice by Bruce Irvin, who forced a fumble to seal the victory for Seattle. If Newton weren't so mobile - he rushed for 42 yards on seven scrambles - the Seahawks would have accumulated at least eight sacks. It was complete domination. ",
            "3": "Thanks to Newton's struggles, Smith disappointed fantasy owners, catching just four passes for 40 yards. Brandon LaFell (3-44) had more receiving yards. ",
            "4": "Carolina's leading rusher was Jonathan Stewart, who gained 16 yards on four carries. Stewart also dropped a pass. DeAngelo Williams, meanwhile, gained just six yards on six attempts. He lost a fumble and got stuffed on a goal-line touch. ",
            "5": "Marshawn Lynch had nearly quadruple the amount of rushing yards of Stewart and Williams combined. Having said that, Lynch struggled to find running room, gaining 85 yards on 21 attempts. Lynch did have some nice, tough runs at the end of the game to chew up the clock. ",
            "6": "Russell Wilson was very economical, going 19-of-25 for 221 yards, one touchdown and two interceptions. I mentioned his awful pick-six. The second give-away wasn't his fault, as Lynch bobbled the ball and tipped it into the air. ",
            "7": "Taking advantage of Chris Gamble's absence, Sidney Rice caught five balls for 67 yards. Wilson's lone score was tossed to Golden Tate (3-31). "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bears",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "Given the final score and the fact that Chicago outgained Jacksonville, 501-189, it's almost hard to believe that this was a 3-3 tie at halftime. The Bears were very sloppy prior to intermission. It seemed like they false started a billion times. Jay Cutler threw an interception following a low snap. The players as a whole looked sluggish, but whatever Lovie Smith did at halftime apparently worked because both the offense and defense clicked after the break. ",
            "2": "Cutler went 23-of-39 for 292 yards, two touchdowns and the aforementioned interception. The offensive line had no issues blocking Jacksonville's No. 32 pass rush, which had just two sacks entering this contest. ",
            "3": "As usual, Brandon Marshall saw a large chunk of Cutler's targets, catching 12 balls for 144 yards and a touchdown. No other Bear had more than two receptions, though Devin Hester (2-49) made an awesome, one-handed diving catch for 39 yards in the second half. Alshon Jeffery (2-20, TD) suffered some sort of hand injury. ",
            "4": "Matt Forte rushed for 107 yards on 22 carries. Michael Bush ran the ball just four times, gaining 26 yards. His most meaningful play was a third-and-long conversion with a 15-yard reception in which he hurdled a defender and dived past the first-down marker. ",
            "5": "Maurice Jones-Drew, meanwhile, gained 56 yards on only 12 carries. The Jaguars tried to involve him in the passing game as well, but he was guilty of an important drop. ",
            "6": "Blaine Gabbert, once again, was awful. He took more deep shots than usual, but it cost him with numerous inaccurate passes and two interceptions. I'm not sure if Justin Blackmon (3-40) ran the wrong route one of the picks, but it might have just been a poor underthrow. Gabbert finished 17-of-33 for 142 yards otherwise. ",
            "7": "Gabbert's two interceptions were both returned for scores by Charles Tillman and Lance Briggs. This is significant, as both Tillman and Briggs scored defensive touchdowns just six days earlier in Dallas. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "If there's a silver lining for the Titans in this game, it's that Jake Locker won't have to worry about any sort of quarterback controversy the next time he performs poorly. Matt Hasselbeck was awful. No, he was worse than awful. The Titans could have pulled a drunken, fat slob fan out of the stands and gotten equal production. Hasselbeck was inaccurate unless he was checking down, which he did far too often. He also made poor decisions; he tossed a terrible interception, inexplicably on a 3rd-and-19 when it was just 7-0 Vikings in the second quarter. Hasselbeck went 26-of-43 for 200 yards, one touchdown and that aforementioned pick, but a big chunk of his yardage and the sole score came in garbage time when the Vikings stopped trying. In fact, Tennessee didn't even cross the Minnesota 47-yard line until midway through the fourth quarter. It was so pathetic, words can't even describe it. ",
            "2": "If Hasselbeck's ineptness wasn't enough, Chris Johnson pitched in with a futile effort of his own. CJ2.9YPC gained just 24 yards on 15 carries and lost a fumble after Tennessee successfully converted a fake punt with a Jordan Babineaux run. Backup Javon Ringer, meanwhile, suffered a season-ending knee injury in the second quarter. ",
            "3": "Hasselbeck's lone garbage score went to Jared Cook (5-37). Kendall Wright led the team with nine catches for 66 yards. Kenny Britt played, but wasn't himself, making just two grabs for 23 yards. ",
            "4": "As for Minnesota, Christian Ponder was the final quarterback not to throw an interception this season. He was nearly picked off by Ryan Mouton in the second quarter and then immediately was intercepted by Robert Johnson. Ponder was picked a second time (Babineaux), but performed well otherwise, going 25-of-35 for 258 yards and two touchdowns. He also rushed for 31 yards on three scrambles. ",
            "5": "Ponder's scores went to Percy Harvin (8-108) and Kyle Rudolph (4-23). Harvin had a monstrous game; in addition to catching his eight passes, he also scored a four-yard rushing touchdown in the third quarter. ",
            "6": "Adrian Peterson continued to perform on a high level in the wake of his return from major knee surgery. Peterson gained 88 yards on just 17 carries, ripping off numerous tough runs all afternoon. I keep harping on this, but it's amazing how he's been able to be this effective following that devastating knee injury he incurred in December. ",
            "7": "It's worth noting that Vikings' rookie safety Harrison Smith was thrown out of this game in the second quarter. He got into a tussle with a Titan wideout, and as the official was breaking up the fight, Smith shoved the ref aside. It's safe to say Minnesota didn't miss Harrison because Hasselbeck was so woefully inept. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: Willis McGahee dropped a pass on fourth down and fumbled the ball in the red zone late in the game. I'm thinking about sending him an invoice for the $220 I lost betting on his team. F-U, Willis. </i> ",
            "2": "Peyton Manning versus Tom Brady XIII turned out to be a familiar refrain for the 2012 Denver Broncos: another fourth-quarter comeback that fell short after the defense dug too big a hole to climb out of. New England moved the ball at will on Denver and set a team record with 35 first downs, while running for 251 yards. Brady was firing bullets through the Broncos secondary early on with Wes Welker being his go-to receiver. So much for Welker (13-104) getting phased out by the Patriots; he had nine catches in the first half and helped build New England's lead with a short touchdown catch. Brady finished 23-of-31 for 223 yards, that score, a rushing touchdown and zero interceptions. ",
            "3": "All of the Patriots running backs contributed to the win. New England got the ground game going late in the first half with Steven Ridley and Brandon Bolden (14-54). That extended into the third quarter with Danny Woodhead (7-47) converting a third-and-17 with a run that caught Denver by surprise, and Shane Vereen's one carry was a touchdown plunge. The Broncos had no answer for Ridley, and he ripped up Denver's defense on runs to the outside and inside. Ridley (28-151) was having a flawless day until he fumbled the ball away with five minutes left on the clock. Von Miller ripped the ball out. Miller had a great game with a couple of sacks as well. ",
            "4": "Manning moved the ball well from start to finish, but was let down by pass-protection issues and mistakes from his receivers. Demaryius Thomas caught a long pass early in the game and was racing down the field when Sterling Moore popped the ball out from behind. Moore recovered the ball just in front of the goal line. A blind-side sack by Rob Ninkovich forced a fumble, which Vince Wilfork pounced on, to set up a Ridley touchdown and a 31-7 lead for New England. ",
            "5": "After Denver went down by 24 points, Manning moved the ball down the field quickly on a few possessions. He finished drives with short touchdown throws to Eric Decker (4-21), Joel Dreessen (4-21) and Brandon Stokley (2-10). Jacob Tamme (6-50) and Willis McGahee (5-51 receiving) contributed as well. ",
            "6": "Demaryius Thomas (9-188) had a phenomenal game for Denver, aside from his fumble, and overwhelmed the Patriots defensive backs with some highlight-reel catches. One was a 30-yard one-handed grab. He had a leaping 45-yard reception, too, beating double coverage downfield. Manning went downfield to Thomas late in the fourth quarter on a fourth-and-short. He made the catch on his knees for 28 yards. Manning finished 31-of-44 for 345 yards and three touchdowns. ",
            "7": "McGahee (14-51) had a clunker of a game with a bad dropped pass on a fourth down that would've gone for a first down and a fumble late in the fourth quarter after getting hit by Ninkovich. The fumble was inside the red zone and ended the Broncos' comeback attempt. ",
            "8": "Denver's defensive coordinator Jack Del Rio and head coach John Fox have to fix their defense. There are too many big windows in the secondary and the gap integrity of the front seven has to get better. These big deficits from the defense could prove to be the Achilles' heel that keeps the Broncos out of the playoffs. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "The 49ers beat the Bills 45-3, outgained them 621-204, won the time of possession by 13 minutes and converted 7-of-11 third downs. So, with all of that in mind, would you believe it that San Francisco played very sloppily in the first half? It's true. The 49ers made several mistakes early on. They were at the Buffalo 1-yard line in the first quarter, but couldn't get into the end zone. They later had a 41-yard pass to Michael Crabtree wiped out by a chop block. Colin Kaepernick then lost a fumble in the red zone. This game, consequently, was tied at three in the middle of the second quarter when it could have been even worse for Buffalo. The Bills, meanwhile, made plenty of errors of their own. They had a kickoff return touchdown wiped out by a holding penalty. Scott Chandler would then lose a fumble in the second quarter, which immediately led to an Alex Smith touchdown to Michael Crabtree. That turnover really got the 49ers going. ",
            "2": "Smith was near-perfect, going 18-of-24 for 303 yards and three touchdowns through three quarters. He also had 49 rushing yards, including a 24-yard scramble. He left the game occasionally for Kaepernick, who had 39 rushing yards and a score on the ground himself. Kaepernick attempted only one pass, which was completed for seven yards. ",
            "3": "Smith's touchdowns went to Crabtree (6-113), the beleaguered Kyle Williams (2-50) and Mario Manningham (4-26). Both Kyle Williams and Manningham torched Aaron Williams. Vernon Davis also had a big game (5-106), mostly thanks to a 53-yard reception in which he was inexplicably wide open, thanks to Buffalo ineptness. ",
            "4": "The 49ers ran all over the Bills, in case you couldn't tell by Smith and Kaepernick's rushing totals. Frank Gore rumbled for 106 yards and a touchdown on just 14 attempts, while Kendall Hunter gained 81 yards on only 11 carries. ",
            "5": "Buffalo didn't have nearly as much success on the ground, which is an understatement. Fred Jackson (9-29) and C.J. Spiller (7-24) both found life very difficult Sunday afternoon. ",
            "6": "Ryan Fitzpatrick went 16-of-26 for 126 yards and a very ugly interception in which his wobbling pass seemed to get caught in the wind and fall short of its intended target in the end zone. ",
            "7": "San Francisco's defense shut down everything, including Steve Johnson, who had six catches for only 39 yards. Scott Chandler (4-40) was the team's leader in receiving yards, but he was guilty of that aforementioned fumble. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Saints' season would have been officially over had they lost this game. They would've dropped to 0-5 on an emotional night in which Drew Brees broke Johnny Unitas' consecutive-game touchdown streak. The suspended Sean Payton, Mickey Loomis and Joe Vitt observed from above in luxury boxes as Brees hit Devery Henderson for a touchdown, making it 48 straight games that he found a receiver in the end zone. Brees endured some rough spots in this game despite the fact that he went 29-of-45 for 370 yards, four touchdowns and an interception. He too frequently threw behind his receivers; he was guilty of his sole pick on one such occasion. The problem was two-fold. First, his offensive line once again struggled to pass protect, surrendering three sacks, which is a ton for a quarterback who releases the ball as quickly as Brees. Second, Jimmy Graham suffered an ankle injury in the second quarter. He returned to the game but was clearly hobbled. He couldn't get open and only served as a decoy. ",
            "2": "Brees was awesome in the fourth quarter, so I don't want to take any credit away from him or his teammates, but the officials had a huge say in this game. The Chargers actually had a pick-six in the third quarter, but the turnover was nullified by a helmet-to-helmet hit on Brees. That was a legitimate penalty, but the refs made some very ticky-tack calls on big Charger gains on the final drive. At one point, San Diego was whistled for three consecutive penalties and found itself in a 2nd-and-37, only to be bailed out by a good hands-to-the-face call, though that strangely gave the Chargers a first down despite the fact that it was just a five-yard infraction. I'll never understand why that's an automatic first down, and I never will. Ultimately though, it didn't matter because Rivers was strip-sacked in Saints' territory. Martez Wilson easily got around laboring left tackle Jared Gaither, who couldn't move because his back apparently flared up. ",
            "3": "The antics on the final drive ruined a great performance from Rivers, who went 27-of-42 for 354 yards, two touchdowns and an interception. Rivers should have thrown a third score, but the ball was knocked out of Antonio Gates' hands at the last second. ",
            "4": "Both of Rivers' touchdowns went to Robert Meachem, who caught three balls for 67 yards. It seemed like the Chargers were determined to get the ball to Meachem in an attempt to stick it to the Saints. Before you get excited, however, Meachem was targeted only five times in Rivers' 42 attempts. Malcom Floyd (5-108) was much more involved on offense. Gates (3-19) did nothing, killing his fantasy owners with that dropped touchdown. ",
            "5": "Ryan Mathews ran with purpose in attempt to win back the faith of Norv Turner. He rushed for 80 yards and a touchdown on just 12 carries and also chipped in with six catches for 59 receiving yards. The discouraging thing is that he was replaced by Jackie Battle in a goal-line situation. He also saw Ronnie Brown get touches on the final drive. ",
            "6": "As for the Saints, Henderson (8-123) had a breakout performance, which included the record-setting score, but it was Marques Colston who posted the best numbers, snagging nine balls for 131 yards and a whopping three touchdowns. "
        }
    },
    "numberOfGames": "12"
}