{
    "year": "2012",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "Marvin Lewis told the media that he planned on playing his starters in this contest because his teams suffered two blowouts after he sat his first-stringers in meaningless Week 17 contests. Well, Lewis kept his word - well, sort of. Andy Dalton, A.J. Green and company were on the field for just a half before giving way to Bruce Gradkowski. The Ravens, meanwhile, used Joe Flacco and Ray Rice for about two-thirds of the first quarter. Thus, I'm not going to delve much into this game. ",
            "2": "Dalton went 10-of-15 for 78 yards and a touchdown to Marvin Jones (5-45, TD). Green caught two balls for 26 yards. BenJarvus Green-Ellis sat out. ",
            "3": "For the Ravens, Flacco went 4-of-8 for 34 yards. He didn't have Anquan Boldin at his disposal. Ray Rice rushed three times for five yards. ",
            "4": "Bernard Pierce handled most of the workload with Rice sitting out. He gained 89 yards on 22 carries. ",
            "5": "One injury worth noting: Baltimore fullback Vonta Leach went down on the second play, but John Harbaugh said he'll be fine for next week. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers may have won this game to avoid a losing record, but the big story is that they were outgained by more than 100 yards by a team featuring a backfield comprised of Thaddeus Lewis and Montario Hardesty. Lewis actually didn't look too bad. He did a good job of moving the chains with mostly short throws, and his one big mistake was a poor pass in the red zone that was picked by Troy Polamalu. Lewis went 22-of-32 for 204 yards, one touchdown and the interception. He also picked up a big chunk of yardage on a long pass interference, though official Walt Coleman blew that call because there was no chance the Cleveland receiver was going to catch Lewis' underthrown attempt. Lewis at least proved that he can be a capable backup in this league. His backfield mate didn't have as much success, however. Montario Hardesty had just 37 yards on 14 carries. He ripped off a 16-yarder, so he gained just 21 yards on his 13 other attempts. ",
            "2": "The Steelers struggled for most of the afternoon because they once again couldn't get out of their own way. They continued to kill themselves with dumb mistakes. For instance, they had two consecutive fails on 3rd-and-1 in the first quarter. After that, a 43-yard Ben Roethlisberger bomb to Antonio Brown was wiped out because of a Doug Legursky hold. ",
            "3": "Big Ben was very clutch in the red zone, converting all three trips there into touchdowns. He misfired only eight times in total, going 15-of-23 for 134 yards and three scores. His touchdowns went to Brown (2-22), Leonard Pope and Plaxico Burress (2-24). ",
            "4": "Believe it or not, no Steeler caught more than two balls. Buress and Brown were among the leading receivers, falling just shy of Emmanuel Sanders' two grabs for 28 yards. ",
            "5": "The Steelers ran the ball pretty well with Jonathan Dwyer (11-52). Rahsard Mendenhall struggled, mustering just 19 yards on six carries. He's likely gone after this season. ",
            "6": "One injury of note for Cleveland was to top receiver Josh Gordon, who injured his ankle on a second-quarter fumble. He was carted into the locker room. Gordon's four catches (39 yards) trailed only Ben Watson's seven grabs for 64 yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Colts",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "This game meant nothing to the Colts in terms of playoff positioning, but it meant everything to them emotionally because head coach Chuck Pagano was on the sidelines for the first time since Week 3. There was a minute-long montage on the big screen to honor Pagano prior to kickoff, and that absolutely energized the players, who put together an opening touchdown drive. The Colts just looked like the better team throughout, as Houston's defense simply could not get off the field. Indianapolis converted 9-of-15 third-down attempts, as Andrew Luck went 14-of-28 for 191 yards and two touchdowns. The numbers don't seem very good overall, but he was brilliant on third downs, including a 3rd-and-23 situation where he hit TY Hilton down the seam in between three Texans for a 70-yard strike. ",
            "2": "Hilton (4-111, TD) and Reggie Wayne (2-21) were the only Colts with more than two receptions. Just six Indianapolis players caught passes. ",
            "3": "Vick Ballard gained 78 yards and a touchdown on 27 carries. His one blunder was a seemingly key drop on a 3rd-and-3. The Colts ran extremely well as a whole, keeping the ball away from Houston for the final nine minutes of the contest. ",
            "4": "The Texans, meanwhile, continue to have issues coming from behind. They were down 14-6 at halftime and consequently couldn't run the ball as much as they wanted to. Matt Schaub had more than double the attempts compared to Arian Foster carries. Schaub went 24-of-36 for 275 yards and a pair of interceptions. One was on an underthrow, while the second came on a heave into the end zone. ",
            "5": "Schaub targeted Andre Johnson almost exclusively. Johnson caught 12 balls for 141 yards, whereas no other Texan logged more than three receptions. He was mostly brilliant, though he did drop a touchdown. ",
            "6": "As mentioned, Foster couldn't run the ball very much. He had just 16 carries for 96 yards and a touchdown. Houston fans have to be very concerned about their team's chances of winning a game in which Foster is unable to run as much as he'd want to. ",
            "7": "J.J. Watt, who needed 2.5 sacks to break Michael Strahan's single-season record, didn't add to his total this afternoon. He actually managed to accumulate half a sack on a Luck strip-sack, but the call was overturned by an automatic replay. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Titans",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "This is general manager Gene Smith's final game with the Jaguars - - so it's only fitting that one of his dumber draft choices would be the catalyst for Tennessee's victory. When Smith selected punter Bryan Anger in the third round, everyone but him knew it was a stupid pick. In fact, members of his front office were frustrated by it. A great punter is supposed to set up great field position for the team, but the complete opposite occurred in this contest. Two of Anger's punts were returned for touchdowns by Darius Reynaud. Anger has actually been very good this year, but it just demonstrates how foolish that decision was. So, Reynaud scored twice for Tennessee. Another unlikely Titan also had a pair of touchdowns. Rookie linebacker Zach Brown took two picks to the house. The first was poorly thrown by Chad Henne, while the other was tipped into the air by backup receiver Toney Clemons, who was in the lineup because a concussed Cecil Shorts was ruled out. Given the four bizarre Tennessee touchdowns, it shouldn't surprise you that Jacksonville outgained the Titans, 375-221. They probably would have won the game if they hadn't played so stupidly - they were up 14-7 before the madness began - but that's exactly why they're 2-14. ",
            "2": "Chad Henne played well outside of the picks. He went 25-of-41 for 298 yards, two touchdowns and three interceptions despite missing Shorts. He targeted Marcedes Lewis (7-103), Justin Blackmon (6-79, TD) and Jordan Shipley (7-51, TD) almost exclusively. ",
            "3": "Running back Montell Owens injured himself in pre-game warmups, so Keith Toston drew the start. He looked pretty good, gaining 74 yards on 17 carries. Toston actually outgained Chris Johnson, who once again struggled to find any running lanes behind his banged-up offensive line. Johnson managed just 56 yards and a touchdown on 21 carries. ",
            "4": "Jake Locker didn't have to throw much because his defense and special teams did all of the work. He was just 9-of-15 for 152 yards, with most of the yardage coming off completions of 42 and 36 yards to Lavelle Hawkins and Kendall Wright, respectively. Wright's catch was a short one that turned into a long gain. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Giants",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "Giant fans have to feel very frustrated. They watched their team suffer consecutive blowouts where the players looked lifeless prior to this weekend. New York then rebounded with its best effort since beating the Saints several weeks ago, but it was all for naught; Chicago's victory over the pathetic Lions sealed its fate. This was such a great performance on New York's part that Eli Manning set a personal record. It was the first time he's ever thrown three touchdown passes in the first quarter (the second time with three scores in any quarter). He was merciless in the opening period, going 6-of-7 for 116 yards and the trio of touchdowns, as he torched Nnamdi Asomugha almost exclusively. Manning also fired five touchdowns for the first time in his career. He finished 13-of-21 for 208 yards otherwise. The Eagles didn't really show any interested in tackling, but Manning would have had a great performance anyway. He was just in the zone. ",
            "2": "Two of Manning's scores went to rookie Rueben Randle (4-58), who led the team in receiving yardage, as Hakeem Nicks barely played because of his nagging knee injury. The other touchdowns went to Victor Cruz (4-52), David Wilson and Henry Hynoski. Hynoski's score was the first of his career. ",
            "3": "Manning didn't have to do very much in the second half because his team held a massive lead. In fact, he attempted just five passes after the break. The Giants were still able to move the chains though, as Philadelphia couldn't (or didn't want to) do anything about Ahmad Bradshaw (16-107, TD) and Wilson (15-75). ",
            "4": "As for the Eagles, it's been announced that Andy Reid will be fired Monday. Reid opened the 2000 season, which ultimately culminated with a second-round trip in the playoffs, with a ballsy onside kick against the Cowboys. The Eagles recovered that and ultimately won the game. Reid tried the same tactic in this contest. He called for an onside kick and his team once again came up with the ball. Unfortunately, he opted to go with a brain-dead quarterback over Trent Edwards in the wake of Nick Foles' broken hand, and it cost him. QB Dog Killer heaved an interception on a terrible overthrow during the ensuing drive to Brent Celek, prompting forum member Alastair to suggest that we should call him Michael Pick. Sounds good to me. Pick went 19-of-35 for 197 yards, one touchdown and the aforementioned interception. He also fumbled, but recovered it. He was awfully inaccurate all afternoon, but some stupid team will undoubtedly sign him, which will ultimately get that head coach fired. ",
            "5": "LeSean McCoy split carries with Bryce Brown (8-18) but was much more effective, gaining 45 yards on 10 attempts. He also caught a team-high five balls for 61 yards. Jeremy Maclin, meanwhile, snagged QBDK's lone touchdown, finishing with four grabs for 22 yards. ",
            "6": "This was a chippy game that featured a fist fight between Antrel Rolle and King Dunlap. Neither was ejected somehow, though Dunlap was penalized. Someone on Twitter humorously wrote that Dunlap was the biggest a**hole since King Joffrey, for all of you <i>Game of Thrones</i> fans. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Bears",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "I didn't get many things right in my Week 17 page, but I called this one exactly. I said that the Bears were in a poor spot, but would win because the Lions would find some way to screw up, and that they did. Detroit did the following to sabotage its chances: - Joique Bell, replacing the inept Stefan Logan on kickoffs, lost a fumble on a return. - Matthew Stafford, who got away with a lost fumble on what turned out to be a tuck-rule situation, was eventually strip-sacked by Israel Idonije. - Stafford lobbed a weird, side-armed overthrow that was intercepted. - Stafford then lost another fumble to give the Bears the ball inside the red zone. Chicago kicked an easy field goal. ",
            "2": "Jay Cutler didn't have a terrific game, by any means, as his team was just 4-of-15 on third-down attempts. However, he took advantage of Detroit's stupidity and took care of the football. He went 18-of-31 for 257 yards and a touchdown. ",
            "3": "For once, Cutler's leading receiver was not Brandon Marshall (5-42). In fact, Marshall was behind both Earl Bennett (5-109, TD) and Alshon Jeffery (4-76) thanks to numerous drops. ",
            "4": "Matt Forte served as a great complement to Cutler, gaining 103 yards and a touchdown on 24 carries despite being questionable entering the contest. He outgained Mikel Leshoure (15-57), who received all but two of Detroit's carries. Bell was given just four touches, perhaps as punishment for his aforementioned fumble. ",
            "5": "Stafford finished 24-of-42 for 272 yards, three scores and an interception. The numbers look good, but the three turnovers ruined Detroit's chances of pulling the upset. That's been the story of the Lions' disappointing 2012 campaign. ",
            "6": "Calvin Johnson led the team with five grabs for 72 yards. He fell just 36 yards shy of 2,000 for the season, but his 1,964 is an NFL single-season record. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "<i> WALT'S NOTE: This is why I've never had the Falcons No. 1 in my - and with John Abraham possibly done for the playoffs, I may move them out of my top 10. </i> ",
            "2": "With their playoff positioning locked up, the Falcons mailed in this performance. They didn't play with any sense of urgency and seemed to be using their starters just out of a sense of obligation. If Atlanta was going all out to win, the front office should be very worried about another immediate postseason exit. ",
            "3": "To make matters worse, the Falcons had key players get banged up in this meaningless game. John Abraham hurt his ankle during the fourth quarter and had to be helped off the field. That wasn't the only injury for Atlanta; Dunta Robinson and Asante Samuel were injured too. Abraham's injury looked the most significant for Atlanta's first playoff game in two weeks, and he is an essential player for the team's defense. ",
            "4": "After trading field goals in the first quarter, the Bucs took the lead with an 8-yard pass from Josh Freeman to Mike Williams (6-65). The Falcons punted the ball into the back of one of their blockers and that set up another field goal for Tampa Bay. The Bucs' offense had success moving the ball between the 20s throughout the afternoon. Freeman looked improved as he made better decisions and spread the ball around to a variety of teammates. ",
            "5": "Atlanta showed some signs of life in the third quarter when Asante Samuel picked off a dumb pass by Freeman. That set up the offense at the Bucs' 21-yard line. Michael Turner (6-18) ran those 21 yards on two plays to score his teams's first touchdown. The momentum was short lived as Doug Martin (28-142) broke two tackles during a 40-yard touchdown run. Midway through the fourth quarter, Matt Ryan threw a short touchdown on fourth-and-goal to Harry Douglas. Tampa Bay stopped Atlanta on its final possession to end the Buccaneers' five-game losing streak. ",
            "6": "Freeman finished 19-of-35 for 222 yards with a touchdown and an interception. Vincent Jackson (3-50) and Luke Stocker (3-50) also contributed. Ryan finished 28-of-33 for 238 yards and a touchdown. Julio Jones (3-56), Tony Gonzalez (5-41) and Roddy White (5-42) were unable to provide any splash plays. Jacquizz Rodgers (5-28 rushing, 8-50 receiving) played well. Tampa Bay's defense cut it close but managed not to break the NFL record for the most passing yards allowed in a single season. ",
            "7": "Atlanta isn't entering the postseason on a confident note after this performance, and the Falcons really need a favorable matchup in their first game to break their postseason losing streak. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "38"
        },
        "comments": {
            "amount": "6",
            "1": "The last thing any coach wants to see is an injury in a meaningless game. Panthers' head coach Commander Adama nearly witnessed this when Cam Newton's leg bent awkwardly at the beginning of the fourth quarter. It looked very bleak, but Newton walked off and actually reentered the game on that very same drive. Not only did he remain in the contest; he led Carolina all the way down the field for a touchdown. Newton failed to complete 50 percent of his passes in this contest, but was lucky to have DeAngelo Williams by his side for once. Williams had his best performance of the season, rushing for 210 yards and two touchdowns on just 21 carries. Williams looked great, but the Saints were just pathetic in their attempts to tackle him. They absolutely have to upgrade their defense in the offseason. ",
            "2": "Newton finished 16-of-33 for 248 yards and a weird interception on an attempted screen. He also rushed for 34 yards on seven scrambles. He could have enjoyed a better fantasy outing for those whose leagues extend to Week 17, but Mike Tolbert vultured three goal-line touchdowns. This has to be a concern for any potential Newton fantasy owner in 2013. ",
            "3": "Only four Panthers caught more than one pass: Steve Smith (3-73), Brandon LaFell (5-62), Louis Murphy (3-57) and Greg Olsen (4-43). ",
            "4": "Drew Brees lost this game, but managed to become the NFL's first-ever back-to-back 5,000-yard passer. He finished 29-of-43 for 396 yards, four touchdowns and an interception. ",
            "5": "Two of Brees' scores went to Marques Colston (5-52), while the other two were caught by Jimmy Graham (9-115) and Darren Sproles (8-79). Lance Moore didn't find the end zone, but led the team in receiving with four grabs for 121 yards, highlighted by a spectacular 51-yard grab that he made as he was getting hit and falling down. Speaking of Graham, he was involved in several on-field skirmishes in what was a feisty game. He was called for a personal foul on one occasion. ",
            "6": "It was speculated that the Saints would use this opportunity to showcase Chris Ivory for a trade. Unfortunately, they couldn't really do that because they were trailing throughout. Ivory was given just four carries and turned them into 22 yards. Mark Ingram (10-39) didn't get much of a chance either. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "0"
        },
        "comments": {
            "amount": "8",
            "1": "<i> WALT'S NOTE: Ryan Tannehill, who played college football at Texas A&amp;M, did not seem like he enjoyed the cold weather. He had this expression on his face where it looked like he was thinking, F*** this s***, I'm flying down south after this game and lounging by my pool for a whole week. </i> ",
            "2": "This game took on real meaning for the Patriots when the Texans lost to the Colts earlier in the afternoon. That opened up the opportunity for New England to get a first-round bye with a win over Miami. After an ugly performance a week ago, the Patriots played with a sense of urgency and dominated the Dolphins from start to finish. ",
            "3": "Miami was playing pretty tough against New England early on. However, the game turned in New England's favor when Ryan Tannehill threw a bad pass that was intercepted by Steve Gregory. Tannehill was pressured by Rob Ninkovich and telegraphed the throw. Tom Brady fired a bullet to Wes Welker a few plays later for a touchdown. Two Brady-led drives were capped off by short touchdown runs from Stevan Ridley (20-74). Brady moved the ball methodically down the field, distributing the ball to a variety of receivers. Welker (8-94) had a number of clutch catches to extend the chains. The Patriots took a 21-0 lead into the locker room at halftime, and the game was pretty much over. ",
            "4": "Tannehill had a good drive in the third quarter that was blown by a Reggie Bush (8-26 rushing, 2-23 receiving), fumbling a couple yards short of the end zone. With nine minutes left in the fourth quarter, the Patriots added some style points as Brady hit Ron Gronkowski (2-42) in stride down the seam for a 23-yard touchdown. ",
            "5": "New England's defense was fortunate that some well-thrown balls by Tannehill were dropped downfield. Armon Binns had two terrible drops that could've been huge plays for Miami. Tannehill also had Bush running wide open for a touchdown, but overthrew him. Aside from those busted plays, the Patriots' defense played a superb game. The stop unit destroyed the Dolphins' offensive line, recording seven sacks. Undrafted rookie Justin Francis had three sacks to lead the way. Vince Wilfork, Trevor Scott, Kyle Arrington and Patrick Chung all played well. ",
            "6": "Brady finished 22-of-36 for 284 yards with two touchdowns and zero interceptions. Danny Woodhead (five receptions for 79 yards) and Aaron Hernandez (5-44) both contributed well for New England. ",
            "7": "Tannehill completed 20-of-35 passes for 235 yards and one interception. He played better than the numbers indicate, and once again, was undermanned. Tannehill's receiving corps leaves him constantly bringing a water pistol to a gun fight. Brian Hartline (5-69) led the Dolphin receivers, while tight end Anthony Fasano (3-31) was knocked out of the game with an injury. ",
            "8": "Landing the bye was huge for New England to get some players healthier before attempting another postseason run. The Patriots got exactly what they needed on Sunday. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "34"
        },
        "comments": {
            "amount": "8",
            "1": "Nine yards. Adrian Peterson was just nine yards shy of breaking Eric Dickerson's single-season rushing record. It looked like he might eclipse the mark on his final carry of the game, but he landed at the Green Bay 11-yard line instead of the 2, but that set up Blair Walsh with a chip-shot field goal to catapult the Vikings into the playoffs. They'll go back to Lambeau to take on the revenge-seeking Packers next weekend. Peterson rushed for 199 yards and two touchdowns (one rushing; one receiving) on a season-high 34 carries. He was a monster, as the Packers had absolutely no answer for him. He set up tons of play-action opportunities for Christian Ponder, including one instance where he hit Jarius Wright for a 65-yard bomb. ",
            "2": "Ponder had perhaps his best performance of the season. He went 16-of-28 for 234 yards and three touchdowns, making several great throws. He also had some luck. For example, one of his passes was tipped in the air by three different Packers but somehow landed into Wright's hands. Later on, Casey Hayward dropped an interception. Ponder also saw Michael Jenkins drop a touchdown, but thanks to an idotic illegal-hands-to-the-face infraction on Tramon Williams, he was able to find Jenkins in the end zone. ",
            "3": "Jenkins (3-37, TD) was one of a trio of Vikings to register a team-high three receptions. The others were Wright (3-90) and Jerome Simpson (3-39). ",
            "4": "The Packers, meanwhile, struggled to move the chains early, as Aaron Rodgers saw a ton of pressure, taking five sacks, including three from Everson Griffen. However, Rodgers got hot in the second half, as Minnesota had no answer for him. Rodgers finished 28-of-40 for 365 yards and four touchdowns. ",
            "5": "Two of Rodgers' scores went to Greg Jennings (8-120). The others were thrown to Jordy Nelson (3-87) and James Jones (6-62). It's big that Jennings and Nelson were so effective. They're clearly over their injuries. ",
            "6": "Jones' touchdown was interesting. He appeared to fumble at the goal line with Minnesota making a recovery. The replay, however, showed that he was down as he broke the plane. The play was going to be automatically reviewed because it was a turnover, but Mike McCarthy threw a red flag anyway. Nelson, completely aware of the rules when McCarthy inexplicably wasn't, quickly snatched the flag off the ground and stuffed it into his pants. This didn't get by official Mike Carey, who penalized Green Bay 15 yards for McCarthy's Jim Schwartz-like blunder. McCathy had a rough afternoon with challenges. In addition to that mistake, he lost an earlier review and then hesitated to throw a flag on a Jermichael Finley (8-72) touchdown that was ruled short of the goal line. McCarthy didn't challenge because he would have been out of reviews. Luckily it didn't matter because Jennings ultimately found the end zone. ",
            "7": "Ryan Grant approached nearly 100 yards last week, but received only two carries in this contest. DuJuan Harris handled most of the workload and ran pretty powerfully, finishing with 70 yards on just 14 attempts. ",
            "8": "The Packers lost and will have to play next weekend, but a silver lining is that struggling kicker Mason Crosby nailed a 51-yarder just prior to halftime. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "Last year, the Broncos needed to beat the Chiefs in Week 17 to win the AFC West and qualify for the playoffs. They lost, but still won the division anyway because the Chargers suffered a defeat to the Raiders. Well, Denver didn't need any help this time, destroying pathetic Kansas City by five touchdowns to clinch homefield advantage in the AFC. Of course, this was to be expected because while Tim Tebow had some great moments for the Broncos last year, Peyton Manning is playing some of the best football in his Hall-of-Fame career. Manning tossed just six incompletions, as Denver outgained Kansas City, 488-119. And believe it or not, this contest was much uglier than that yardage disparity indicates. Ronnie Hillman lost a fumble near the red zone, while Manning sat for the entire fourth quarter because the game was out of reach. ",
            "2": "Manning went 23-of-29 for 304 yards and three touchdowns. He was deadly on third downs, converting 5-of-7 attempts. ",
            "3": "Two of Manning's scores went to Eric Decker (7-76), one of which was a diving, left-handed grab. The other touchdown went to Demaryius Thomas (7-122) who also impressively snatched the ball out of the air with one hand. ",
            "4": "Hillman wasn't seen or heard from again after his fumble. Knowshon Moreno (15-44, TD) handled most of the early workload, while Lance Playa Hatas' Ball (15-66, TD) handled mop-up duty. ",
            "5": "As for the Chiefs, they fell well short of the 350-plus rushing yards they mustered last week. Jamaal Charles led the team with 53 yards on 14 carries, while Peyton Hillis managed just four yards on five attempts. ",
            "6": "Brady Quinn was awful yet again, going 7-of-16 for a pathetic 49 yards. He constantly had defenders in his face when he wasn't checking down; he took four sacks. ",
            "7": "Because Quinn completed just seven passes, only two Chiefs logged more than one reception: Tony Moeaki (2-21) and Devon Wylie (2-11). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "Terrelle Pryor made his first career start, while Norv Turner perhaps called his last game ever as a head coach. And the NFL circle of life continues... Pryor was decent in his first start. He didn't complete 50 percent of his passes - he went 13-of-28 for 150 yards, two aerial touchdowns and an interception (an awesome grab by Quentin Jammer in the end zone) - but he scrambled nine times for 49 yards and an additional score on the ground. Some of Pryor's numbers came in garbage time, including a backdoor touchdown thrown late over the middle of the field to a wide-open Denarius Moore, whose 5-yard score was his only reception of the afternoon. ",
            "2": "Pryor, perhaps more comfortable throwing to his fellow backups, relied on Rod Streater the most; the rookie wideout tied Brandon Myers (53 yards) for a team-high four receptions for 77 yards. However, Moore and Darrius Heyward-Bey (2-13) were the ones who scored the touchdowns. ",
            "3": "Darren McFadden ended his disappointing season with 57 yards on 19 carries. He once again showed a lack of explosion, though Greg Knapp's zone-blocking scheme didn't exactly work. McFadden saw all but one carry, as Mike Goodson and San Diego's Takeo Spikes were both ejected because of a scuffle in which no punches were thrown. Spikes, who still has inexplicably not made the playoffs in his otherwise illustrious career, may have played his last game. ",
            "4": "Unlike the Eagles, the Chargers played hard for their dead man walking. The team opened with a kickoff return for a score. Philip Rivers in particular was awesome, going 13-of-17 for 151 yards and two touchdowns. He has struggled this year because of a banged-up offensive line, but the Raiders, who have a poor pass rush, managed to get to Rivers on only two occasions. ",
            "5": "Rivers threw touchdowns to his reliable guys: Danario Alexander (1-34) and Antonio Gates (2-15). Eddie Royal led the team in receiving with four catches for 61 yards. ",
            "6": "Ryan Mathews was out again, so Jackie Battle handled most of the workload, generating just 37 yards on 19 carries. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "49ers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "It looked for a while that the 49ers would be in danger of falling to the No. 5 seed. They were down 6-0 in the second quarter and up just 7-6 at halftime, but Colin Kaepernick got into a rhythm and was unstoppable after the break. With their 11th victory of the season, the 49ers have sealed up the No. 2 seed in the NFC. Kaepernick finished 16-of-28 for 276 yards and two touchdowns. He also had a potential third score dropped by Delanie Walker. He didn't do much on the ground, but he didn't really need to. Though he had two potential interceptions dropped early by Patrick Peterson and Pro Bowl snub Daryl Washington, Kaepernick was very impressive in torching an Arizona secondary that had improved over the past few games. ",
            "2": "Kaepernick continued to show great rapport with Michael Crabtree. The emerging wideout snagged eight balls for 172 yards and two touchdowns. He was the only 49er receiver to log more than two receptions. Vernon Davis, meanwhile, had just one catch for five yards. He's been completely phased out of the passing game ever since Kaepernick too over. ",
            "3": "Frank Gore rushed for 68 yards and a touchdown on 20 carries to go along with three catches for 21 receiving yards. LaMichael James played a factor as well, gaining 49 yards on seven attempts. ",
            "4": "If there's one concern with the 49ers scoring points, it's David Akers. He missed two field goals of 44 and 40, prompting the crowd to boo him on his next try. Jim Harbaugh was so fed up with Akers that he eschewed two field-goal tries in the second half. Kaepernick actually converted both fourth-down attempts. ",
            "5": "Brian Hoyer was OK. He went 19-of-34 for 225 yards, one touchdown (the first by an Arizona quarterback in seven weeks) and an interception. He didn't have much time behind his offensive line, while every pass of his was contested. The pick was bad, but he was able to throw an all-important backdoor touchdown at the very end. I thought Hoyer did a great job of getting the ball to Larry Fitzgerald last week. Fitzgerald didn't do much in this contest - he caught two balls for 13 yards - but Hoyer instead locked in on Michael Floyd, who generated eight receptions for 166 yards and a score. If Floyd can use this as momentum for next year, Arizona's next quarterback will have a pair of solid targets to throw to. ",
            "6": "Impending free agent Chris Wells told the media that he was going to use this game as an audition for the other 31 teams. Well, I think the other general managers can delete these three hours on their DVR because Wells didn't even play. William Powell (14-52) saw most of the carries. ",
            "7": "Like J.J. Watt, Aldon Smith needed 2.5 sacks to break Michael Strahan's single-season record, and like Watt, he failed to record a single sack in Week 17. Strahan's mark is safe for now. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks may have won this game, but one potential flaw was exposed. They couldn't pass protect. The Rams were in their backfield the entire afternoon. Russell Wilson was sacked four times in the first 18 minutes alone. He ultimately took six sacks - three from Chris Long - but that number could have been a lot more if he wasn't so elusive. He did a good job of dodging defenders in the second half to finally get going. Wilson, who finished 15-of-19 for 250 yards and a passing touchdown, went 8-of-10 for 177 yards and the score following halftime. He would have thrown a second aerial touchdown to Zach Miller, but it was nullified by offensive pass interference. If it would have counted, Wilson would have broken Peyton Manning's rookie record for passing scores, which he was able to tie at 26. Wilson was also great on the ground; he rushed for 58 yards and a score. ",
            "2": "Wilson was once again lethal in the option-read attack. Defenses continue to have no answer for this, as Marshawn Lynch compiled 100 yards on 18 carries. ",
            "3": "Wilson passed only 19 times, so no Seahawk caught more than three passes. Golden Tate had nearly half of Wilson's yardage, snagging three balls for 105 yards. ",
            "4": "The Rams' offense couldn't take advantage of the dynamic pass rushing of the defense. Sam Bradford went 25-of-42 for 252 yards, one touchdown and an interception, but he just couldn't sustain drives; St. Louis was just 2-of-11 on third downs. Bradford was just 11-of-21 for 113 yards and a pick after halftime. ",
            "5": "Steven Jackson has discussed retirement, so this may have been his final game. He nearly totaled 100 yards, rushing for 52 yards on 11 carries and catching seven balls for 45 receiving yards. ",
            "6": "No Ram had more than 54 receiving yards (Chris Givens). Danny Amendola logged just four catches for 27 yards. He also muffed a punt, but was fortunate enough to watch the ball dribble out of bounds. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "18"
        },
        "comments": {
            "amount": "8",
            "1": "Not even the greatest Tony Romo enthusiasts can defend him at this point. Romo had been playing extremely well entering this game, but had his teammates disappoint him. Well, Romo was at fault this time. When he wasn't yelling at people on the sidelines for failing to pick up the blitz, he was tossing picks. He threw three hideous ones. Romo's first interception was an overthrow as he was getting blitzed. The second was worse, as it was terribly underthrown. Romo, however, saved his worst pick for last. If there were any baseball umpires on the field, they would have called the infield fly rule; Romo just floated the ball, allowing a Washington defender to easily snatch it out of the air. Romo finished 20-of-37 for 218 yards, two touchdowns and the three picks. Jerry Jones has a very difficult decision to make with him. Romo is entering the final year of his contract, so he has a massive cap number of $16 million. Jones could decrease that, but that would involve extending Romo to another contract. If Jones does nothing, however, he won't have much maneuverability this offseason. ",
            "2": "Of course, this wasn't all on Romo. As mentioned, his teammates struggled to pick up the blitz. Dez Bryant (4-71) suffered an injury and was in a wheelchair after the game. The defense could have given Romo more time (as well as a six-point deficit) to work with at the very end, but Jason Hatcher hit Robert Griffin in the helmet, giving the Redskins a free set of downs and an eventual touchdown instead of a field goal try. ",
            "3": "Speaking of Griffin, he still didn't look completely healthy, but was definitely better than he was last week. He completed just 9-of-18 passes for 100 yards, but endured two drops, one of which came from Pierre Garcon on a key 3rd-and-2 play. Griffin also rushed for 63 yards and a touchdown on six carries. He toyed with DeMarcus Ware all evening. The Redskins thought outside the box and left Ware unblocked so Griffin could fool him with his read-option plays. ",
            "4": "With the Cowboys concentrating so much on Griffin, Alfred Morris was able to rush for a whopping 200 yards and three touchdowns on 33 carries. Morris eclipsed the Redskins' single-season rushing record, which was previously held by Clinton Portis. ",
            "5": "Despite the aforementioned drop, Garcon led the team with three catches for 46 yards. ",
            "6": "As for the Dallas receivers, Miles Austin-Jones didn't long a single reception, thanks in part to an ankle injury he suffered in the second quarter. Jason Witten was second to Bryant in receiving, snagging seven balls for 56 yards and a touchdown. Witten finished with 110 catches on the year, extending his NFL single-season record for tight ends, which he broke last week. ",
            "7": "These two teams were among the most penalized entering this weekend, so it was surprising that the first yellow flag wasn't thrown until the 8:59 mark of the fourth quarter. Washington and Dallas combined for just three infractions. ",
            "8": "The Redskins locked up the NFC East and the No. 4 seed with the victory. They'll host the Seahawks next Sunday. Sportsbooks actually have them as a 2.5-point home underdog. "
        }
    },
    "numberOfGames": "15"
}