{
    "year": "2012",
    "week": "14",
    "Game 1": {
        "Team 1": {
            "Name": "Rams",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "Jeff Fisher told his team that it would have a chance at a playoff push with a victory in Buffalo. Both teams would actually been given life with a victory; because the Bengals and Steelers both lost, the Bills, at 6-7, would have been just one game back. Buffalo led throughout most of the afternoon, but the Rams prevailed thanks to an 84-yard, game-winning touchdown in the final few minutes. It's a borderline miracle that St. Louis was able to pull out this win - or at least it would have seemed that way early on because Sam Bradford didn't appear to have a chance. He was 5-of-17 for 37 yards and an interception in the opening half. The Bills were getting tons of pressure on him, which forced a number of errant throws. He deserves credit, however, for the aforementioned decisive drive. The key play was a 4th-and-1 conversion to Austin Pettis for nine yards, though the wideout needed to make a spectacular catch because the ball was thrown behind him. ",
            "2": "Bradford's final numbers looked like this: 19-of-39 for 209 yards, one touchdown and a pick that would have gone back for six, but was nullified by a hold. His score went to Brandon Gibson (6-100). Danny Amendola was inactive, while Chris Givens (3-25) couldn't produce much because Bradford was inaccurate for most of the afternoon. ",
            "3": "Steven Jackson had an OK outing, gaining 64 yards and a touchdown on 19 carries. Buffalo's defense has improved against the rush since the bye, so this was a good effort from Jackson. ",
            "4": "As for the Bills, Chan Gailey deserves to be fired for this latest defeat. His best player, C.J. Spiller, touched the ball just eight times and wasn't given an opportunity of any sort inside the red zone. He had 37 yards on seven carries to go along with a 15-yard reception. He was so much better than Fred Jackson; it wasn't even close. Jackson mustered only 14 yards on nine attempts, which included a lost fumble deep in St. Louis territory. Jackson ultimately suffered a knee injury that reportedly doesn't look good. I don't understand what the hell Gailey was thinking; his refusal to involve Spiller in this offense has cost his team multiple victories. It's bad enough to do it once or twice, but this has occurred at least half-a-dozen times already this season. He has to be axed because he clearly can't learn from his mistakes. ",
            "5": "Despite holding a lead throughout, the Bills attempted 33 passes to just 16 runs. That's smart. Ryan Fitzpatrick was economical though, going 25-of-33 for 247 yards, one touchdown and an interception. He spent most of the afternoon dinking and dunking, however, because the Rams were able to apply consistent pressure. Rookie defensive tackle Michael Brockers dominated the line of scrimmage, registering 1.5 sacks (all in the first quarter) and a forced fumble. ",
            "6": "Fitzpatrick's two leading receivers were Stevie Johnson (6-71) and Scott Chandler (5-71). Frustrated fantasy owners watched someone named Lee Smith catch Fitzpatrick's sole touchdown. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "All the Panthers needed this whole time to reverse their fortunes was to win the opening coin toss. They called it correctly for the first time all season and they were able to hold on for a victory. Coincidence? OK, maybe. Everyone is going to be asking what's wrong with Atlanta, but it didn't really need to win this game. At 11-1, well ahead of everyone in the NFC, why care about some stupid 3-9 Carolina squad? The Falcons consequently played like they were half-asleep, failing to get into the red zone until the 7:30 mark of the third quarter. They had just 35 yards of offense and two first downs in the opening half. They completely mailed it in. ",
            "2": "The other prevailing story is Cam Newton's dominating performance. He played with complete confidence, torching a William Moore-less Atlanta secondary, going 23-of-35 for 287 yards and two touchdowns. He also had 116 rushing yards and a third score on the ground that went for 72 yards. Newton's best non-scoring play was perhaps a 13-yard scamper he had on 3rd-and-11. Defensive tackle Corey Peters had hold of his jersey for what seemed like five seconds, but Newton eventually shook him off and scrambled past the chains. ",
            "3": "Steve Smith didn't catch a touchdown, but still led the team with seven receptions and 109 yards. The two Panthers not named Newton who found the end zone were DeAngelo Williams (17 carries, 56 rush yards; 2 catches, 56 rec. yards) and Greg Olsen (4-55). ",
            "4": "The Falcons, meanwhile, couldn't run the ball because they were way behind right away. Michael Turner (7-14, TD) had just two carries in the first half. Jacquizz Rodgers (4 carries, 21 rush yards; 6 catches, 43 rec. yards) was once again more productive than the plodding Turner despite not getting enough touches. ",
            "5": "Matt Ryan's final numbers look great. He finished 34-of-49 for 342 yards, two touchdowns and a late, desperation pick on a fourth down. However, most of these stats came in garbage time when the Panthers were playing prevent. Ryan was just 7-of-10 for only 40 yards at the break. ",
            "6": "Roddy White (9-117) and Julio Jones (5-66) both caught Ryan's late scores, so at least their fantasy owners were happy. Tony Gonzalez (8-61) also had a decent outing. ",
            "7": "I have to mention Luke Kuechly because he was all over the field. He registered a whopping 16 tackles. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "The Cowboys usually find a way to lose games in the fourth quarter, but they managed to come back from a 19-10 deficit in the fourth quarter of this contest. The victory was what the team needed to get their minds off the loss of practice-squad player Jerry Brown, who was killed Saturday in an alleged drunk-driving accident. Tony Romo was absolutely lethal in the fourth quarter, going 11-of-15 for 118 yards and a touchdown in the final period. His impressive comeback pretty much nullified all of the dumb mistakes Dallas made throughout - and there were plenty of them. For example, defensive coordinator Rob Ryan was whistled for a 15-yard personal foul penalty for throwing a flag in the third quarter. His defense was then called for 12 men on the field when the Bengals reached the red zone. The Cowboys also were guilty of getting the plays in late yet again, which cost them a timeout in the two-minute drill of the first half. ",
            "2": "Romo finished 25-of-43 for 268 yards, one touchdown and an interception that was essentially a punt on a third-and-long situation. However, it's worth noting that he was nearly picked in the first half by former teammate Terence Newman. Romo did a great job of compiling those numbers considering all of the pressure that was in his face. Geno Atkins had just one sack, but he might as well recorded four because he dominated the line of scrimmage. ",
            "3": "Romo's sole touchdown went to Dez Bryant (4-50), who was one of a quartet of Cowboys who caught four passes. The others were Jason Witten (4-62), Miles Austin-Jones (4-46) and DeMarco Murray (4-22). ",
            "4": "Speaking of Murray, he couldn't run the ball very well, gaining just 53 yards and a touchdown on 21 carries. His offensive line simply didn't give him anything to work with. ",
            "5": "As for Cincinnati's ground attack, BenJarvus Green-Ellis collected 89 yards on 12 attempts. It's curious as to why he didn't touch the ball very much. The Bengals didn't trail for a single second of this contest. ",
            "6": "Andy Dalton went 20-of-33 for 206 yards, one touchdown and an interception. He could have enjoyed a better day, but A.J. Green (3-44) betrayed him with some drops, including one that would have been a potential score. ",
            "7": "Dalton's top target was Andrew Hawkins (6-44, TD). Jermaine Gresham, like Green, disappointed with four catches for 43 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Browns",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "I'm not going to spend much time on this game because the Browns aren't going anywhere and the Chiefs are a complete joke. Things looked promising for them when Jamaal Charles opened up with an 80-yard touchdown run, but things just went downhill from there. Ryan Succop missed a 27-yard field goal to go up 10-0. Dwayne Bowe go hurt. Cleveland's Travis Benjamin scored on a 93-yard punt return. And then the defense just seemed to give up in the second half, as the Browns tallied 204 net yards of offense after the break compared to Kansas City's 73. ",
            "2": "Brady Quinn was terrible. He finished 10-of-21 for 159 yards and an interception. He was almost picked in a first-quarter trip to the end zone, and he went just 5-of-11 for 58 yards and an interception after intermission, as he looked lost without Bowe. He should not be allowed to start another NFL game ever again, but Romeo Crennel is going to keep sticking with him for some reason. ",
            "3": "Charles finished with 165 yards and a touchdown on 18 carries. The only skill-position player of note was Bowe (2-70); as mentioned, he left the game in the first quarter with a rib injury. ",
            "4": "As for the Browns, Brandon Weeden was an economical 17-of-30 for 217 yards. His leading receiver was Josh Gordon (8-86), who just keeps getting better and better. ",
            "5": "Trent Richardson scored both offensive touchdowns for the Browns, but he managed just 42 yards on 18 carries - a disappointing outing considering that the Chiefs were ranked 26th against the rush heading into this contest. It's worth noting that Richardson negated a score with an offensive pass interference. ",
            "6": "This game was miserable to watch, so the most amusing aspect of it was that the Cleveland fans continuously chanted a**hole whenever Peyton Hillis touched the ball. Hillis, of course, was one of many former Browns on Kansas City, including Quinn, Crennel and offensive coordinator Brian Daboll. Considering how many former failed team members they were facing, Cleveland almost had to win this game. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "Is anyone surprised that A) the Titans blew a double-digit lead in the second half and B) the Colts managed to engineer a late comeback? Both teams maintained their M.O., with Tennessee coughing up a 20-7 advantage. Jake Locker started hot, completing his first seven passes for 69 yards and a touchdown to go along with a 32-yard scramble. However, he was just 7-of-15 for 49 yards and two interceptions after intermission. One of the picks was returned for a score, as he telegraphed his throw from his own goal line. It wasn't surprising to see both good and bad from Locker, as he has been inconsistent thus far in his brief NFL career. As for Andrew Luck, he went 16-of-34 for 196 yards, one touchdown and two first-half interceptions. Neither pick was his really his fault; one was on a Hail Mary just prior to intermission, while the other occurred as he was falling down. The ball sailed right into the arms of linebacker Will Witherspoon, who took it back for six. However, replay showed that Luck's knee was down as he heaved the ball. The shady official, however, ruled that the play stood as called - and I say this as someone who bet on the Titans. Luck's numbers could have been better had Donnie Avery caught a long touchdown in the fourth quarter; the ball bounced off his helmet. Luck had issues with pressure the entire afternoon, however. He was sacked four times, twice by Karl Klug, and constantly had to hurry his throws. ",
            "2": "The Colts were fortunate to win this game considering that they ran out of running backs. Vick Ballard (19-94) handled most of the workload Donald Brown was out, while Delone Carter, who vultured a touchdown, left the game with an ankle. ",
            "3": "Only one of Luck's receivers had more than three receptions. That, of course, was Reggie Wayne, who snagged six catches for 64 yards and a touchdown. TY Hilton (2-50) disappointed. ",
            "4": "Locker's final numbers were 22-of-35 for 262 yards, one touchdown and two interceptions. His lone score went to Jared Cook (3-20), who suffered a shoulder injury. His leading receiver was Kenny Britt (8-143), whose only blemish was an offensive pass interference. ",
            "5": "While Tennessee's aerial attack was working for most of the afternoon, Chris Johnson spent the entire time dancing around the line of scrimmage behind his banged-up offensive line. He gained just 44 yards on 19 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "When the NFL schedule was released, the thinking was that Tim Tebow would be starting for the Jets and returning to the Jacksonville area where he played college football. With Tebow under center, the Jets would run the ball well, play great defense and eke out a victory at the end, as the Broncos did on most weeks with Tebow last year. Well, the Jets did exactly that - but only with Mark Sanchez under center. Tebow didn't even see the field to the chagrin to all those who bought tickets to this game. ",
            "2": "A week after being benched, Sanchez had just an OK outing. He did nothing spectacular, going 12-of-19 for 111 yards, but the good news is that he turned the ball over once, getting strip-sacked by new Jaguar Jason Babin in the second quarter. ",
            "3": "Sanchez didn't have to do anything with the running backs ramming it right down Jacksonville's throat. The Jets gained 176 rushing yards, with Bilal Powell (19-78) and Shonn Greene (20-77) both scoring touchdowns. ",
            "4": "The only New York player who had more than two receptions was Jeremy Kerley (4-27), who lost a fumble. Stephen Hill suffered what looks like a severe knee injury. He'll have an MRI Monday. ",
            "5": "One of the main reasons why the Jaguars lost this contest was because they had a stupid game plan. Despite never trailing by more than seven points until the fourth quarter, they had Chad Henne throw 43 passes despite Cecil Shorts' absence. Meanwhile, they gave Montell Owens just 14 carries. Owens turned those touches into 91 yards and a touchdown. ",
            "6": "I don't know why Jacksonville felt that Henne had to air it out nearly 50 times, but the results weren't very good. Henne went 21-of-43 for just 185 yards and two interceptions. One of the picks was a miscommunication at the very end, while the other took place in the red zone because he held on to the ball too long in the pocket and didn't feel the pressure from his blind side. Henne was especially brutal in the second half, going just 9-of-24 for 95 yards and an interception after the break, though he did endure some drops. He's gotten worse and worse each week, and it's gotten to the point that the front office can't go into the 2013 season with him as their starter. The Jaguars will have to draft or sign a quarterback this offseason. ",
            "7": "There were only two Jaguar receivers of note: Justin Blackmon (6-57) and Jordan Shipley (5-55). Shipley had what looked like the play of the game when he converted a 4th-and-15 with a 28-yard reception. Meanwhile, Marcedes Lewis (1-4) did nothing. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The concern for the Bears entering this game was stopping Adrian Peterson with Brian Urlacher out of the lineup. Urlacher has not been having a good season, but his leadership would surely be missed on the field. Things looked very bleak when the Vikings went 80 yards on their opening drive, thanks to a 51-yard Peterson run on the first play. However, Chicago's stop unit didn't allow a single point after that. The offense, on the other hand, self destructed and was responsible for this loss. Jay Cutler essentially tossed two pick-sixes. The first wasn't his fault; Alshon Jeffery slipped, allowing Josh Robinson to take it back into the end zone. The replay review showed that Robinson stepped out of bounds near the 5-yard line, but Minnesota scored an easy touchdown. In the third quarter, Cutler overthrew his intended target in Minnesota territory, giving Harrison Smith a pick-six. It was amazing how inept Chicago was once they crossed midfield. They were in Vikings' territory seven times and were able to come away with just two touchdowns and no field goals - though the latter became improbable when Robbie Gould suffered a minor injury in pre-game warmups. He was still able to attempt extra points, but wasn't going to try any long kicks. ",
            "2": "Cutler went 22-of-44 for 260 yards, one touchdown and the two interceptions. Most notably, he left the game with an injury in the fourth quarter. At first glance, it appeared as though it was a concussion because Everson Griffen went helmet to helmet on him, but it's reportedly a neck or a shoulder malady. ",
            "3": "Brandon Marshall eclipsed 100 receptions on the year, breaking a Chicago single-season record, previously owned by Marty Booker. He finished with 10 grabs for 160 yards and a late touchdown from Jason Campbell (6-9, 64 yards, TD). Jeffery (3-57) caught the other score. ",
            "4": "Matt Forte couldn't contribute much in the running game because the Bears were down by two scores early on. He rushed just 13 times, but managed 85 yards. He also chipped in with six catches for 34 receiving yards. ",
            "5": "Peterson, as indicated, was a beast. Well, he was in the first quarter anyway, finishing the opening period with 100-plus rushing yards and two touchdowns. However, the Bears did a great job of clamping down on him after that. Peterson's final numbers were 154 yards and two scores on 31 carries. ",
            "6": "The Vikings couldn't really move the chains beyond the first drive because Christian Ponder was so ineffective. He went 11-of-17 for 91 yards and an interception. His longest completion was a 16-yarder to Jarius Wright. Kyle Rudolph didn't even catch a single pass because Ponder didn't have to throw very much. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "Pittsburgh's effort in this game was absolutely pathetic. The team had a terrific, emotional victory against the Ravens and had to go up against the Chargers, whose season pretty much officially ended when they lost last week to drop to 4-8. San Diego had never won in Pittsburgh in the regular season, so Philip Rivers, who loves Norv Turner and obviously didn't want to hear that his head coach was going to be fired, told his squad that this was their chance to make history. And so history was made. The Chargers dominated this game. They had Pittsburgh outgained 226-153 when the score was 27-3. The Steelers continuously screwed up. For example... - They were offside multiple times on one San Diego scoring drive. - Mike Wallace had a drop for what would have been a big completion, prompting the crowd to boo him. Antonio Brown then had a deep pass fall through his hands. - The defense surrendered a converted first down on a 3rd-and-13 run when the Chargers were just trying to get into better field goal position. - San Diego scored a defensive touchdown when Ben Roethlisberger carelessly threw a lateral pass that doinked off a player's rear end. ",
            "2": "The Steelers lost by only 10 points, but don't be fooled by that. As mentioned, the score was 27-3 at one point, but Pittsburgh padded its stats with meaningless junk-time numbers. For example, Roethlisberger finished 22-of-42 for 285 yards, three touchdowns and an interception, but he was just 9-of-20 for 105 yards, no scores and no picks at halftime. Likewise, Wallce (7-112, 2 TDs) and Brown (4-35, TD) both look good in the box score, but killed their team with the aforementioned drops. ",
            "3": "Other Steelers of note: Heath Miller (5-66) had an average statistical performance, but it could have been much better because he fell inches short of the goal line in the fourth quarter. Jonathan Dwyer rushed for 32 yards on just eight carries. Plaxico Burress caught an 18-yard pass on a 3rd-and-12. This was his first reception as a Steeler since the 2004 AFC Championship. ",
            "4": "Rivers, meanwhile, had a solid performance especially in the second half. He finished 21-of-41 for 200 yards and three touchdowns, with just five incompletions and two scores coming after intermission. ",
            "5": "Two of Rivers' touchdowns went to Danario Alexander (7-88), who did drop two passes on third downs. The other was thrown to Malcom Floyd (3-10). Antonio Gates struggled again, catching just three balls for 31 yards. ",
            "6": "The Chargers may have broken a futile streak with a victory at Pittsburgh, but they weren't able to stop all of them. They still haven't scored a rushing touchdown since Week 5. Ryan Mathews (25-65) was pedestrian yet again. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: When Andy Reid hugged Duce Staley following the game-winning score, it suddenly dawned on me: Andy Reid may not be fired after this year... if Nick Foles keeps this up, he's not getting fired. Sorry, Eagle fans. </i> ",
            "2": "Ten years ago, the Buccaneers knocked out the Eagles on the road in the NFC Championship game. Philadelphia got a measure of revenge this Sunday by dealing a fatal blow to Tampa Bay's 2012 playoff hopes. The Bucs honored the 10-year anniversary of their Super Bowl Championship team with a reunion of the 2002 players and coaches, but the Eagles spoiled the celebration by ending their 2-month-long losing streak. Tampa Bay was lucky to almost get this win as Philadelphia outplayed the Buccaneers for the majority of the contest. Rookie quarterback Nick Foles was simply awesome. He was deadly on third down and would've had an even bigger day if his offensive line could've produced just an average performance. ",
            "3": "In the second quarter, an insane catch by Jason Avant set up a field goal for the Eagles. He made a leaping one-handed catch while landing on his back. The 20-yard gain came on a third-and-17. Avant (7-133) was superb. A 39-yard pass to him set up Foles to run the ball into the end zone from 10 yards out on the next play. Philadelphia was up 10-0 at halftime. It all went wrong for the Eagles in the third quarter with a 10-point swing in the Buccaneers' favor. A muffed punt by Damaris Johnson set Tampa Bay up at Philadelphia's 6-yard line. Josh Freeman threw a touchdown to Mike Williams (3-18). Foles put together a decent drive, but a short field goal was shanked by Alex Henery. The Bucs took the lead when Freeman laced a rope into Vincent Jackson. Doug Martin added another touchdown to make it 21 unanswered for the home team and a 21-10 lead. Late in the fourth quarter, Foles turned into Brett Favre with two jaw-dropping touchdown drives to get a walk-off winner. The rookie quarterback dominated Tampa Bay's anemic secondary. To get the comeback started, Foles had a superb possession that ended with a touchdown toss to Clay Harbor (6-52). The 2-point attempt went incomplete and left Philadelphia needing another touchdown. Foles' final drive was legendary as he ripped the ball down the field. On fourth-and-5, the rookie drilled a 22-yard bullet to Avant to the 1-yard line. The Eagles managed to spike the ball fast enough to leave two seconds on the clock and time for one more play. Foles rolled out and threw a fastball to Jeremy Maclin (9-104) for a touchdown. ",
            "4": "Foles finished 32-of-51 for 381 yards with two scores throwing, one rushing and zero interceptions. He was utterly amazing in crunch time. If Foles has a good NFL career ,this will be the game that is remembered as the start of it all. ",
            "5": "Freeman was hot garbage in the first half and the Bucs were shut out. He was 5-of-16 for 61 yards. Martin had only 34 yards on nine carries as the Eagles' defense was owning the line of scrimmage. Mychal Kendricks, Fletcher Cox, Dominique Rodgers-Cromartie and Cullen Jenkins all had good games for Philadelphia. ",
            "6": "Martin (28-128) and Jackson (6-131) were phenomenal in the second half, but Freeman continued his spotty play. His throws were off the mark all day with pathetic accuracy. He finished 14-of-34 for 189 yards with two scores, but was lucky he didn't throw multiple interceptions. ",
            "7": "Gerald McCoy and Michael Bennett each had two sacks. They were awesome against a weak Eagles' line. If McCoy or Bennett didn't get pressure on Foles, the defense was incapable of stopping the rookie. Late-season fantasy phenom Bryce Brown (6-12) was completely shut down by the Bucs' outstanding run defense. ",
            "8": "Philadelphia's concussion woes continued with tight end Brent Celek suffering one in the first quarter. He left the game and is probably done for the year. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "The Redskins improved to 7-6 with a victory over their regional rival, but they appeared to suffer a season-ending loss. Robert Griffin's knee was bent backward very awkwardly during a fourth-quarter scramble. He left the game and came back in. He completed two passes of 15 and 22 yards, but was limping around, unable to put pressure on his leg. After an intentional grounding, he finally bent over in unbelievable pain and had to exit the contest for good. Kirk Cousins stepped in and was able to continue the drive, ultimately leading Washington into the end zone with an 11-yard touchdown to Pierre Garcon. An impressive kickoff return later, and Washington was able to prevail in overtime. The victory was important, but the concern was Griffin. The rookie signal-caller smiled and laughed in front of the media at the podium and told them that it was not a torn ACL. Indeed, he was correct; his MRI came back clean, which is obviously terrific news for the Redskins and their supporters. ",
            "2": "Griffin went 15-of-26 for 246 yards and a touchdown along with 34 rushing yards on seven scrambles. He could have thrown a second score, but Leonard Hankerson had a drop in the end zone. The Ravens did a great job of containing him. They were able to limit him to 4-of-11 on third downs and sack him three times. Cousins, meanwhile, completed both of his attempts for 26 yards and the aforementioned score to Garcon (5-87, TD). ",
            "3": "The Redskins ran the ball well for most of the afternoon. Alfred Morris opened things up with a 29-yard gain on the first play. He finished with 122 yards and a touchdown on 23 carries. He also had a 21-yard gain negated by a hold. Unfortunately, he also cost his team with a fumble deep in his own territory to give the Ravens an instant red-zone possession. ",
            "4": "Despite the loss, Joe Flacco played very well early on. He was 10-of-13 for 127 yards and three touchdowns in the opening half, but self-destructed after intermission. He tossed an interception in the red zone and lost a fumble. He also went three-and-out in overtime. ",
            "5": "Flacco's final numbers were 16-of-21 for 182 yards, three scores and the pick. Two of his touchdowns went to Anquan Boldin (3-78), while the other went to Dennis Pitta (5-46). Torrey Smith was a disappointment, catching just one pass for 21 yards. ",
            "6": "Cam Cameron attempted to make amends for not giving Ray Rice a single touch in the fourth quarter last week. Ray Rice received 13 carries after intermission. He ultimately rushed for 121 yards and a touchdown on 20 attempts. ",
            "7": "The Ravens had a major injury of their own. Guard Marshal Yanda, who has been playing on a Pro Bowl level, sprained his ankle and could be out for several weeks. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: Did Colin Kaepernick really have to cover the spread with that 50-yard run!? AHHHHHHHHHHHH WGHWGIORGOIR NOB REB OB ERO EN ETB ER. </i> ",
            "2": "The Dolphins played the 49ers tough, but this young Miami squad isn't ready to go across the country and get a hard road win against an elite team. San Francisco, led by Frank Gore, Colin Kaepernick and Aldon Smith, took care of business in crunch time. With Atlanta losing to Carolina, the 49ers still have a shot at landing the No. 1 seed in the NFC. The first half of the game was a defensive battle, and the 49ers clawed to a 6-3 lead. The Dolphins' defense played excellently led by Cameron Wake, who had three sacks and a forced fumble. In the third quarter, Miami gifted a touchdown to the 49ers. Marcus Thigpen muffed a punt inside the 10-yard line that San Francisco recovered. Gore (16-63 rushing, 2-22 receiving) banged the ball into the end zone a few plays later.  Kaepernick then dropped in a perfectly thrown bomb in the end zone to Randy Moss, but the veteran dropped it. Gore took the drive over with some powerful runs and a 19-yard reception. He moved the ball down the field to set up a short Anthony Dixon (2-9) touchdown plunge. Kaepernick put the game on ice with a 50-yard touchdown off a of a read option with 2:10 left in regulation. Jared Odrick blew contain to open up the side of the field. Kaepernick finished 18-of-23 for 185 yards with six carries for 53 yards and a score. Michael Crabtree (9-93) played well, while Moss (2-30) continued to prove he's a washed-up waste of a roster spot. ",
            "3": "Ryan Tannehill played well once again, but he doesn't have the talent around him to help put Miami over the top. The offensive line allowed way too much pressure and the receivers were pitiful. He had a third-quarter deep ball that was slightly overthrown, but still should've been caught by Marvin Miller for a huge gain. The drive still ended well as Tannehill hooked up with Anthony Fasano for a touchdown on fourth-and-goal. Fasano (2-9) made a tremendous reception as he laid out for a diving one-handed catch along the sideline. Tannehill's final drives were shut down. He finished 17-of-33 for 150 yards with a score and zero interceptions. Tannehill played better than his stats indicate against one of the best defenses in the NFL. Davone Bess (5-50), Reggie Bush (14-65 rushing, 5-38 receiving) and Brian Hartline (2-34) were kept out of the end zone. ",
            "4": "Aldon Smith continued his tremendous season with two sacks. Navarro Bowman, Patrick Willis and Justin Smith all played well for San Francisco. ",
            "5": "The Dolphins have a solid defense and are well-coached, but until they get some play-makers at wide receiver for Tannehill to work with, the team is going to keep coming up short against good opponents. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Giants",
            "Points": "52"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "Look at the score. Would it surprise you that the Saints outgained the Giants by nearly 100 yards? Indeed, New Orleans had 487 net yards compared to New York's 394. It was turnovers and special-teams blunders that capsized their chances, however. Take a look at what went wrong for the Saints: - Marques Colston lost a fumble at midfield on the opening drive. - Jed Collins also lost a first-quarter fumble in New York territory. On the following drive, he had a hold to negate a 19-yard gain. - Lance Moore stepped out of bounds prior to making a reception that would have moved the chains on a third down in the red zone. - The Saints allowed the Giants to average a ridiculous 56.8 yards per kickoff return. Rookie David Wilson took one back for six. - Drew Brees tossed two picks, one of which bounced right off the hands of Jimmy Graham. ",
            "2": "Brees didn't have a good game by his standards. He went 26-of-43 for 354 yards, one touchdown and the two picks (the second one was his fault), both to Stevie Brown. He missed some throws and wasn't very efficient in the red zone. ",
            "3": "Brees' lone touchdown went to Darren Sproles, who had 84 yards from scrimmage and scored a second time on the ground. Colston (4-61) and Graham (5-56) both disappointed statistically in addition to screwing up with key turnovers. Joseph Morgan led the team in receiving (106 yards), doing so on two deep completions. ",
            "4": "The Saints actually ran the ball well when they tried to, but they couldn't maintain it because they were down big early. Mark Ingram rushed for 68 yards on just 13 tries. ",
            "5": "Speaking of successful running games, Wilson rushed for 100 yards and two touchdowns on just 13 carries in relief of an injured Ahmad Bradshaw (11-33) who was in and out of the lineup. Wilson's 327 all-purpose yards is a Giants' franchise record. ",
            "6": "Eli Manning was nearly intercepted on his first drive and tossed a pick-six on his second possession, but he settled down after that. He finished 22-of-35 for 259 yards, four touchdowns and two picks. The other interception was his fault, but he was nearly flawless after an ugly first quarter. ",
            "7": "Manning threw his scores to Victor Cruz (8-121), Hakeem Nicks (4-67), Martellus Bennett (5-32) and Domenik Hixon (3-30). "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "58"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "Congratulations to anyone who started Seattle's defense in a fantasy playoff matchup. I did this in one of my leagues, prompting my opponent to call this a conspiracy. Arizona put on one of the most pathetic offensive showings in recent memory. Let's take a look at how the Seahawks' stop unit scored points: - The Arizona quarterbacks were sacked three times. Two of the sacks resulted in fumbles. - The Cardinals lost a whopping four fumbles. - Seattle's secondary collected four interceptions, two by Richard Sherman. - The Seahawks scored two defensive/special teams touchdowns - one on a pick-six; another on a muffed punt. - Arizona was held to zero points. ",
            "2": "As you can tell, the Cardinal signal-callers were extremely pathetic, especially John Skelton. He went 11-of-24 for only 74 yards, all four picks and a lost fumble. One of the picks wasn't his fault, as it was caught and bobbled by Larry Fitzgerald, but regardless, Skelton may have lost a spot in a league based on this performance. ",
            "3": "Because Skelton sucked so much, Fitzgerald had just one catch for two yards. That's it. Sherman took him away, and that was that. Chris Wells didn't do anything either, rushing for 18 yards on six carries. ",
            "4": "Russell Wilson went to the bench a few minutes into the third quarter because his team was up 45-0. He went 7-of-13 for 148 yards, one touchdown and an interception. ",
            "5": "Marshawn Lynch did most of the early scoring. He found the end zone thrice, gashing Arizona's inept defense for 128 yards on just 11 carries. ",
            "6": "There was some drama at the end of the game. Despite being up by 40- and 50-something for most of the second half, the Seahawks kept throwing the ball. Ken Whisenhunt looked like he was pissed. I was hoping to see a confrontation at the coaches' handshake, but nothing happened. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Packers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "It's hard to believe that the Lions once looked like they were going to win this game easily. They were up 14-3 and driving into Green Bay territory when Matthew Stafford had the ball slip out of his hands. No Green Bay defender forced it; the ball just squirted out. Packers' defensive end Mike Daniels scooped up the ball and took it back for six. That's when the momentum turned. The Lions' offense was never the same after that, and it didn't help that Brandon Pettigrew left the game with an injury. With Pettigrew, Ryan Broyles, Nate Burleson and Titus Young all out, Stafford had no one to throw to besides Calvin Johnson. He had to keep forcing it to someone named Kris Durham, who ran the wrong route on one play, resulting in an interception. Stafford eventually became so frustrated that he began heaving the ball off his back foot on what seemed like every other throw. He finished 27-of-45 for 264 yards, one touchdown and a pick. ",
            "2": "The Packers tried their best to contain Megatron, but he still managed to catch 10 passes for 118 yards. He also drew a downfield penalty. He's now up to 1,538 yards on the season, leaving him 310 yards shy of Jerry Rice's single-season mark of 1,848. The record is definitely in reach. ",
            "3": "The Lions split carries between Mikel Leshoure (14-49) and Joique Bell (12-49) pretty evenly. As the numbers indicate, Bell looked like the better running back. ",
            "4": "Speaking of running the ball well, the Packers did just that with all of their backs. Alex Green (13-69) handled most of the workload, while DuJuan Harris (7-31, TD) looked good in mop-up duty. Even Ryan Grant got into the act, ripping off a 13-yard gain to move the Packers into the red zone in the fourth quarter. ",
            "5": "Aaron Rodgers' passing numbers looked pretty pedestrian; he went 14-of-24 for 173 yards, as he faced tons of pressure all evening. He salvaged his fantasy day with a 27-yard rushing touchdown in the third quarter. ",
            "6": "Rodgers told Al Michaels that he wanted to throw the ball 10 or so times to Greg Jennings, but that didn't work out because the Lions controlled the time of possession. Jennings had just one catch for 27 yards. In fact, the only Packer to have more than two receptions was Randall Cobb (7-102). "
        }
    },
    "numberOfGames": "14"
}