{
    "year": "2012",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Bears",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "The headline going into this game was how Jay Cutler would rebound from his poor pass protection and his subsequent sulking last Thursday. Well, despite having nine days off and switching out left guards, the Bears still haven't been able to fix their pass protection issues. Cutler was sacked just twice, but that's a misleading statistic. He was frequently harassed in the pocket and seldom had time to throw. As a result, the Bears were just 4-of-14 on third-down conversions, though they managed to somehow move the chains on a 3rd-and-17 on a short pass to Michael Bush. Cutler went 17-of-31 for 183 yards and a bizarre interception. The pick was tipped by Brandon Marshall (5-71; two drops) into the hands of Cortland Finnegan. Finnegan ran about 30 yards downfield and then fumbled. The ball was scooped up by Devin Hester, who ran the ball back to where Marshall initially fumbled. It was a crazy sequence of events, but the play was challenged, and it was ultimately ruled that Finngean was down by contact. ",
            "2": "Chicago's one offensive touchdown came on the ground with Michael Bush, who took advantage of Matt Forte's injury by rushing for 55 yards on 18 attempts. ",
            "3": "The Bears' other score was a Major Wright pick-six of Sam Bradford, who stared down Danny Amendola. Bradford a nightmare of an afternoon. He went 18-of-35 for 152 yards and two interceptions. He took a whopping six sacks behind an offensive line ravaged by injuries. Bradford was able to successfully dink and dunk against a poor Washington defense last week, but that doesn't work versus elite units like Chicago's. It's worth noting though that he was betrayed by his pedestrian receivers, who dropped several passes. ",
            "4": "The Rams couldn't move the chains whatsoever. In a pathetic effort, they had just 20 yards of total offense just prior to the two-minute warning of the first half. In addition to being unable to advance the ball aerially, they also struggled on the ground. Steven Jackson gained only 29 yards on 11 carries. He was on and off the field because of his knee injury. In fact, it looked like he would be pulled after three carries. He stood on the sideline with an enormous ice pack on his knee, but he reentered the contest. You have to admire Jackson's courage to play through pain, but it was really a stupid idea. Jackson should have taken the time to heal; instead, his football arrogance hurt his team because it kept a healthy Daryl Richardson, a better option considering the circumstances, on the sideline. ",
            "5": "The only St. Louis receiver to accumulate more than 20 receiving yards was Amendola, who had five catches for 66 yards. Second-round rookie Brian Quick wasn't even active. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "The Bills may have won this game, but they suffered a huge loss with C.J. Spiller. The NFL's leading rusher coming into this weekend suffered a shoulder injury in the first quarter. Spiller had already tallied 58 total yards and a touchdown, so his fantasy owners have to be frustrated that they didn't enjoy what looked like a potentially monstrous day. As you can imagine, Buffalo's offense sputtered afterward. The team scored just 10 points and lost a fumble in the final three quarters without Spiller. Tashard Choice put together a nice statistical performance (20 carries, 91 yards) thanks to great run blocking, but he's obviously nowhere near the playmaker that Spiller is. Still, you'll want to pick up Choice because Fred Jackson may not be able to return until Week 5. ",
            "2": "As for Ryan Fitzpatrick, he went 22-of-35 for 208 yards, three touchdowns and the aforementioned fumble which initially looked like a forward pass heaved desperately because of pressure. He could have tossed a fourth score, but missed an open Steve Johnson in the third quarter by underthrowing him. It's worth noting though that Fitzpatrick had a pretty clean pocket the entire afternoon, as the Browns failed to accumulate a single sack. Fitzpatrick's touchdowns went to Spiller, T.J. Graham (3-24) and Johnson (7-61). ",
            "3": "As for the Browns, Brandon Weeden took a step backward after a decent Week 2 outing, finishing 27-of-43 for 237 yards, one touchdown and two picks. Weeden really had a third interception when he stared down his receiver, but it was wiped out by a very shaky defensive holding penalty. Weeden's late score was to Travis Private Benjamin (2-44). Cleveland's leading receiver was tight end Jordan Cameron, who had five catches for 45 yards. ",
            "4": "Greg Little notched just two receptions for 17 yards. He continued to hurt his team with drops. ",
            "5": "Trent Richardson struggled to run the ball against Buffalo's stalwart front, gaining 27 yards on just 12 carries. He did manage to save his fantasy day with a second-quarter touchdown. He also led the team with six catches for 24 receiving yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "Editor's Note: I'd like to personally thank Josh Freeman for playing like absolute trash for 58 minutes and then spending the last two engineering one of the more epic back-door drives this decade. ",
            "2": "The biggest take-away from this game is that the Cowboys' offensive line is horrible and could be the Achilles' heel that ends up sinking the team's season. Dallas' offense really struggled because the players were getting destroyed up front. Gerald McCoy and defensive end Michael Bennett dominated the Cowboys' line. The Tampa Bay defenders produced sacks at clutch times to negate potential points. McCoy had a sack-fumble on Tony Romo to bail out Tampa Bay from allowing at least a field goal. McCoy rocked Romo again in the fourth quarter, and Dallas was lucky that its quarterback held onto the ball. Doug Free was getting whipped by Bennett for pressures, hits and holding calls. He had a sack-fumble of Romo in the third quarter to set up the Bucs at the Cowboys 31-yard line, but the Dallas defense forced a punt. ",
            "3": "The Cowboys' first score was set up by a Josh Freeman interception. The ball was deflected into the air by running back D.J. Ware and was snatched by Sean Lee. DeMarco Murray ran the ball in for a short touchdown. Romo later threw a deep ball for 50 yards to Miles Austin who beat Eric Wright running down the field. That set up a field goal. Romo finished 25-of-39 for 283 yards with zero touchdowns and an interception. He never could get in rhythm because of the terrible play of his line. ",
            "4": "Murray ran for 38 yards on 18 carries. Austin (5-107), Dez Bryant (6-62) and Ogletree (5-57) could've had big games if Romo had any protection. A 44-yard punt return by Bryant set up the field goal to clinch the win for Dallas. ",
            "5": "Jason Witten had three dropped passes. He had a terrible drop inside the 10 that could've set up a touchdown. The 10-year veteran looks like he is declining. ",
            "6": "The other biggest headline from this game is that Freeman is still deeply in regression mode. He was pathetically ineffective for Tampa Bay, and this kind of performance is inexcusable in his fourth season. The vast majority of his passes were off the mark and wildly inaccurate. Freeman completed only 10-of-28 attempts for 110 yards, one touchdown and an interception. Vincent Jackson had one catch for 29 yards. The Bucs pounded Doug Martin (19-53) without good results and, curiously, continued to run him late in the game when down by two scores. ",
            "7": "Tampa Bay's line also had protection issues. DeMarcus Ware had a sack-fumble in the second quarter, but the Buccaneers recovered the ball. That repeated itself again in the fourth quarter. Ware beat left tackle Donald Penn and the Bucs recovered the ball at their own 1-yard line. A muffed punt by Jordan Shipley led to a Dallas field goal. ",
            "8": "The inept replacement officials reached a new low. The ref threw his hat into the end zone right in front of Cowboys receiver Kevin Ogletree. That caused Ogletree to stumble on the hat, and the pass sailed over him for an incompletion. It could've been a Dallas touchdown. Otherwise, the officials were terrible all game trying to figure out the situation and resume play. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Colts obtained the No. 1 pick this past April for more reasons than just Peyton Manning's absence. The team as a whole was abysmal. One of the many things they couldn't do was stop the run, and that was very apparent in this contest. Taking advantage of linebacker Pat Angerer's absence, Maurice Jones-Drew trampled the Colts, gaining 177 yards and a touchdown on 28 carries. Jones-Drew was so dominant that he actually accounted for 193 of Jacksonville's 333 total net yards. ",
            "2": "Blaine Gabbert really needs to give Jones-Drew some of his rookie-contract signing-bonus money because he wouldn't have had a chance to win this game if it wasn't for his stud back. Gabbert finished 10-of-21 for 155 yards and a touchdown, but those numbers are really deceiving because more than half of that yardage (80) came on one touchdown pass to Cecil Shorts. Now, I don't want to take anything away from Gabbert for that 80-yard strike. It was a nice throw over the middle of the field, but Gabbert really struggled until then. In fact, he was 6-of-11 for 48 yards at halftime. As I commented in the forum, Big improvement from Gabbert - he has more than TRIPLE the yardage than he did at halftime last week! ",
            "3": "Excluding Shorts, Jacksonville's leading receiver was someone named Kevin Elliott, who had two grabs for 24 yards. Justin Blackmon had just one 7-yard reception. Laurent Robinson, meanwhile, left the game in the first quarter with an apparent concussion. ",
            "4": "Andrew Luck vastly outplayed Gabbert, going 22-of-46 for 313 yards, two touchdowns and an interception, with 50 rushing yards on four scrambles. The pick was a bad one, as it was tossed right to Paul Posluszny. There could have also been a second interception, but safety Dwight Lowery dropped the ball in the end zone. Luck did a good job of moving the chains otherwise, however, but was ultimately betrayed by some drops and a missed Adam Vinateri 36-yard field goal. Luck's two scores went to Ty (don't feel like hitting caps lock and the period button twice) Hilton (4-113) and Mewelde Moore. Hilton, drafted to be Luck's deep threat, had a monstrous afternoon, though he did have a bad drop. ",
            "5": "Reggie Wayne once again saw a ton of targets, catching eight of them for 88 yards. Donnie Avery was also thrown to frequently, but managed to haul in only two of his nine targets for 28 yards. ",
            "6": "Austin Collie saw some action for the first time since his preseason concussion. He caught one pass for six yards and then suffered a knee injury. I'd make a joke about this, but it's just sad. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "This was an unbelievable game of offensive futility. Both quarterbacks were awful. Both running attacks struggled. Both receiving corps embarrassed themselves. But someone had to win, and it was the team that didn't make a mistake in overtime, as Miami kicker Dan Carpenter blew an opportunity to win the game with a 47-yarder. ",
            "2": "Mark Sanchez won the game, but he's really fortunate that he was battling another inept quarterback. He went 21-of-45 for 306 yards, one touchdown and two interceptions, but that doesn't begin to tell the whole story. He was wildly inaccurate all afternoon. His interceptions were terrible, and he missed multiple significant gains, including a wide-open Chaz Schilens at the end of the contest. The bulk of Sanchez's passing yards came on a short completion to Jeremy Kerley that turned into a 66-yard gain. I really don't understand what the Jets think they're doing offensively. Tim Tebow plays receiver frequently, but he's not a receiver. In one humorous instance, Sanchez heaved a pass toward Tebow, who didn't look for the pass and consequently had the ball bounce off his helmet. But then when the Jets need to use Tebow, he's nowhere to be found. For example, the Jets had a first-and-goal at the Miami 1-yard line in the third quarter, but they didn't use Tebow a single time. As a result, they couldn't find the end zone, when Tebow probably could have scored easily. ",
            "3": "Sanchez's one touchdown went to Kerley (2-73). Santonio Holmes couldn't find the end zone, but he had a big game, catching a whopping nine balls for 147 yards. ",
            "4": "Shonn Greene really struggled to find running room against Miami's top-three ground defense. He gained just 40 yards on 19 carries. ",
            "5": "I mentioned earlier that both ground games struggled. That's because Reggie Bush was knocked out with a knee injury in the second quarter. He finished with 61 yards on just 10 attempts. Daniel Thomas received most of the workload after that. He managed to tally 69 rushing yards (19 carries) and a touchdown, but lost a fumble in his own territory. Fortunately, the injury to Bush didn't seem too serious, but you never know. ",
            "6": "Ryan Tannehill was a mess. He went 16-of-36 for 196 yards and an embarrassing pick-six thrown to LaRon Landry. He was guilty of what seemed like a billion overthrows in the end zone late in the game. This had to be disappointing to Miami fans, especially considering that the Jets were without Darrelle Revis in the second half. Jason La Canfora is reporting that Revis has torn his ACL. ",
            "7": "Only a pair of Dolphins had more than two receptions: Davone Bess (5-86) and Anthony Fasano (5-47). One of Fasano's receptions was highly controversial, as he seemed to drop the ball when he landed out of bounds. Skinny Rex Ryan challenged the call, but the reception was shockingly upheld. The Dolphins scored several plays later. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "24"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "I can't even count how much hate mail I received from 49er fans for not having their team No. 1 in my NFL Power Rankings. But I just couldn't slot them atop the list because I just don't trust Alex Smith. I can't see him winning a Super Bowl in this new pass-happy era in the NFL. Smith didn't make any mistakes when the game was still in question, but he was extremely mediocre, going 24-of-35 for 204 yards, one touchdown and a late, desperation interception. His longest completion in non-garbage time was to Vernon Davis for 20 yards. In fact, he had just two connections greater than 12 yards when he still had a chance to win. ",
            "2": "San Francisco's offensive game plan perplexed me. The team is built on running the ball and playing great defense, so why did Frank Gore carry the ball only six times in the first half? It's not like it was a blowout early or anything; Minnesota was up by no more than 11 prior to intermission until Blair Walsh's 52-yard field goal as time expired. And it's not like Gore ran poorly or anything; he gained 63 yards on just 12 carries. He did lose a fumble, but there's no excuse for feeding him the ball so seldom. ",
            "3": "Smith's touchdown went to Davis (5-53). Mario Manningham also had five grabs for 56 yards, but his longest completion (22 yards) came in garbage time. Michael Crabtree had the most receptions on the team (6), but tallied only 40 yards. As for Randy Moss, he hauled in just three grabs for 27 yards. There's no real reason he should be on the roster, and he'll only be a distraction as reporters ask him why he's not piling up awesome stats. ",
            "4": "Having said that, the Vikings deserve all of the credit. They just made more plays than the 49ers all afternoon. Christian Ponder clearly was the better quarterback, going 21-of-35 for 198 yards and two touchdowns. He also had 33 rushing yards and another score on the ground. ",
            "5": "It's pretty evident that Ponder loves forcing the ball to Kyle Rudolph on third downs and in the end zone. Ponder had an open Adrian Peterson in the end zone on one occasion but opted to heave it toward Rudolph with a defender draped all over him. Rudolph still managed to make an impressive, one-handed grab. He finished with five catches for 36 yards and both of Ponder's touchdowns. ",
            "6": "Adrian Peterson had some really tough runs, accumulated 86 yards on 25 carries. Those numbers aren't great on their own, but considering the opponent, they're pretty impressive. Peterson moved the piles and showed tons of heart, continuing to amaze considering the severity of the knee injury he suffered in December. ",
            "7": "Percy Harvin had a big game, snagging nine passes for 89 yards. ",
            "8": "The Vikings were missing starting weakside linebacker Erin Henderson, but Chad Greenway really picked up the slack, collecting 13 tackles and a pair of sacks. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "The Saints miss Sean Payton. It's obvious things like calling two timeouts in a row, which resulted in a delay of game in a crucial situation. It's also obscure stuff like making adjustments. This was the third consecutive week that they've started hot with a quick offensive touchdown but sputtered afterward. Brees (20-of-36, 240 yards, 3 TDs, 1 INT) led the team down the field on an 83-yard drive to start the game, but the Saints managed only 205 total net yards after that. Poor blocking was once again the culprit. Chiefs' second-year rush linebacker Justin Houston was absolutely dominant, tallying three sacks, one of which resulted in a safety. He and the rest of Romeo Crennel's defense led the charge down 24-6 to win in overtime. Of course, Jamaal Charles also played a big part. Charles gashed New Orleans' pathetic defense for 233 yards and a touchdown on 33 carries (with six catches for 55 receiving yards). This included a 91-yard touchdown burst when the team had that 18-point deficit. The game seemed over at that point, but that score gave the Chiefs life and sparked their incredible comeback. ",
            "2": "Back to the Saints, the interim to the interim head coach failed to give Darren Sproles enough touches for the second time in three weeks. Sproles had seven carries for 62 yards but zero receptions. Instead, a quartet of Saints had four catches: Lance Moore (4-70, TD), Pierre Thomas (4-55), Devery Henderson (4-53) and Jimmy Graham (4-16, TD). Thomas is worth noting because he should have caught a touchdown. He found the end zone after a reception, but it was ruled incomplete following a review. It was incredibly obvious that the ball never hit the ground, yet the inept officials found some way to overturn the original call. The Saints would go on to miss a field goal. ",
            "3": "As for New Orleans offensive players who struggled, Marques Colston, continuing to labor with a foot injury, had just three grabs for 40 yards. He also dropped a pass. Mark Ingram, meanwhile, had only 11 yards on five carries. He appears to be a sunk cost despite all of the resources the Saints inexplicably spent on him. ",
            "4": "Speaking of sunk costs, Peyton Hillis carried the ball just three times for 11 yards. He also dropped a pass. And then there's Matt Cassel, who went 26-of-44 for 248 yards and an interception. Cassel made some nice throws down the stretch, but he struggled to move the chains in the first half. The Chiefs need a franchise quarterback. ",
            "5": "Cassel's leading receiver was Dwayne Bowe, who had seven catches for 79 yards. Dexter McCluster, who had three grabs for 28 yards, lost a fumble when he injured his elbow. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Titans",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "41"
        },
        "comments": {
            "amount": "6",
            "1": "Where'd this come from? The Titans looked absolutely inept against the Patriots and Chargers, yet they performed like a Super Bowl contender against the Lions, who are perceived to be an upper-echelon team. Still, it's amazing how many times they nearly blew what appeared to be a sure victory. The first instance occurred in the third quarter. They were up 20-9, but two missed field goals by Rob Bironas helped the Lions come back. Detroit actually took a 27-20 lead, but Tennessee roared back with a 105-yard kickoff return, an insane Nate Washington touchdown and a strip-six. The second occurrence took place at the end of regulation. This game was apparently over. The Lions scored what appeared to be a garbage touchdown when Shaun Hill, replacing an injured Matthew Stafford, tossed a touchdown to Calvin Johnson. Detroit then recovered an onside kick, and Hill launched a Hail Mary that was answered when a crowd of players tipped the ball to Titus Young. And finally, the Titans kicked a field goal in overtime, which gave the Lions a chance. They moved it deep into Tennessee territory and looked like they might find the end zone, but they botched a quarterback sneak on a fourth down when they should have tried a game-tying kick. Jim Schwartz said afterward that he wanted to lure the Titans offside and that snapping the ball was a mistake. ",
            "2": "I mentioned earlier that Stafford suffered an injury. He'll have an MRI on his right leg Monday. Ser Stafford went 33-of-42 for 278 yards and a touchdown. Shaun Hill replaced him and was really sharp, going 10-of-13 for 172 yards and a pair of scores. ",
            "3": "Four Lions had at least six receptions: Calvin Johnson (10-164, TD), Young (6-75, TD), Nate Burleson (10-69, TD) and Brandon Pettigrew (8-61). ",
            "4": "The silver lining in this loss was that Mikel Leshoure looked great. He rushed for 100 yards and a touchdown on 26 carries, while chipping in with four catches for 34 receiving yards. Kevin Smith barely saw the field. ",
            "5": "As for the winning team, Jake Locker was awesome. Aside from a lost fumble, he started hot, completing his first six passes for 67 yards. He ended up 29-of-42 for 378 yards and two touchdowns. He seldom had any poor throws, and he also had some positive runs on the ground, gaining 35 rushing yards on four scrambles. Locker's two scores went to Washington (3-112) and Jared Cook (4-77), who suffered a shoulder injury that doesn't appear to be too serious. Washington's touchdown was awesome, as he caught the ball over the defender and ran 71 yards into the end zone. ",
            "6": "It appears as though Chris Johnson won't be back with the Titans next year. He once again disappointed, rushing for only 24 yards on 14 carries, increasing his YPC to 1.36. He took numerous big losses because his offensive line was blown up. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "31"
        },
        "comments": {
            "amount": "5",
            "1": "Think the Redskins missed Brian Orakpo and Adam Carriker? With two of the front-seven starters out, the Redskins had absolutely no answer Cincinnati's offense, spoiling a pretty decent home debut by Robert Griffin. Griffin did what he could. He went 21-of-34 for 221 yards and a passing touchdown as well as 85 rushing yards and second score on the ground on 12 scrambles. Matching the Bengals, point for point, proved to be too difficult, however, especially with No. 1 wideout Pierre Garcon out for the second consecutive week. Pass protection was a big issue. Despite his elusiveness, Griffin was sacked five times. Michael Johnson, heading for free agency in March, had three sacks. As a result, Griffin fumbled the ball thrice, losing the ball once. The problem was that left tackle Trent Williams suffered a knee injury in the first quarter. He'll have an MRI on Monday. ",
            "2": "Griffin's sole score was to Santana Moss, and the 3-yard touchdown was his only reception. The only Redskins with more than three grabs were Fred Davis (7-90) and Leonard Hankerson (4-56). ",
            "3": "Washington ran the ball well with Alfred Morris. He gained 78 yards and a touchdown on just 17 carries. He didn't break any long gains, but most of his runs were really tough and he managed to move several piles. ",
            "4": "Cincinnati's ground attack is worth noting as well, but not because BenJarvus Green-Ellis had only 38 yards and a touchdown on 17 carries. It's notable because the Law Firm fumbled for the first time in his career. ",
            "5": "The Bengals opened this game with a trick play. Rookie receiver Mohamed Sanu fired a 73-yard touchdown bomb to A.J. Green. Soon after, Andy Dalton was pick-sixed on the goal line, prompting me to begin mulling jokes about how Sanu should replace Dalton as the team's quarterback. Unfortunately, Dalton rebounded, finishing 19-of-27 for 328 yards, three scores and that interception. Dalton's scores went to Andrew Hawkins (2-66), Jermaine Gresham (5-64) and Armon Binns (3-63), who torched a secondary that lost Cedric Griffin in the first quarter. As for Green, he had a monstrous performance, hauling in nine balls for 183 yards and the aforementioned score. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Eages",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "As with my ranking of the 49ers, I received lots of hate mail for placing the Eagles too low for most people (No. 14). I never bought into them; they were two plays away from being 0-2. I figured they'd beat the Cardinals because of Andy Reid's familiarity with Kevin Kolb. Instead, it seemed like Arizona's coaching staff had QB Dog Killer's number. QBDK was awful yet again. He didn't throw any interceptions this time, but he lost two fumbles, including one at the end of the first half that was returned for a touchdown. I honestly thought he was playing with a concussion; he banged his head several plays beforehand and didn't seem right when he got up. On the strip-six, he stood in the pocket like an idiot despite the fact that the clock was at about the 4-second mark. He was sacked, and the ball came out. James Sanders took it back 93 yards. QBDK finished 17-of-37 for 217 yards otherwise. He took numerous crushing hits from Arizona's unbelievable defense. The Cardinals sacked him five times, as center Jason Kelce was sorely missed. ",
            "2": "The Eagles are coached poorly, and that was evident in this contest, as LeSean McCoy inexplicably had just four carries in the first half. He finished with 70 yards on 13 carries, so that should tell you that most of his rushing statistics came in garbage time. ",
            "3": "Jeremy Maclin was out. Rookie Damaris Johnson started in his place and caught five balls for 84 yards. DeSean Jackson (3-43) and Brent Celek (2-36) disappointed their fantasy owners. ",
            "4": "As for Kolb, I'm beginning to think that Reid never watched what his former quarterback did in practice. Kolb went 17-of-24 for 222 yards and two touchdowns. He took several sacks, as expected, but was really sharp otherwise. Kolb's touchdowns went to Larry Fitzgerald (9-114) and Michael Floyd (1-8). Fitzgerald was a monster, rebounding from two poor performances to kick off the season. It just goes to show that elite players can't be silenced forever, even when battling elite competition. ",
            "5": "Ryan Williams ran the ball shockingly well. He totaled 83 rushing yards on just 13 carries and was much more effective than Chris Wells (8-18), who is struggling because of turf toe and lack of talent. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "The Falcons are for real. Their offense is clicking on all cylinders, while their defense is really underrated - or at least it has been, up until this point. Their complete demolition of Philip Rivers may have opened many eyes. Rivers went just 21-of-38 for 173 yards and two interceptions, both by safety Thomas DeCoud. He had absolutely no time to throw. It was pathetic how poor his blocking was in this contest. He was somehow sacked only once, but he was running for his life on every other play. ",
            "2": "The Falcons also did a great job of shutting down the run. Ryan Mathews gained just 44 yards on 10 carries. He had a huge fumble inside the Atlanta 5-yard line at the beginning of the second quarter when the score was just 6-0. On a positive note, he led the team with five catches for 32 receiving yards. ",
            "3": "Save for Mathews, only three Chargers caught more than two balls. They were Malcom Floyd (3-52), Robert Meachem (4-43) and Antonio Gates (3-22). Gates' fantasy day was completely ruined by San Diego's decrepit offensive line, though he did have a bad drop that would have moved the chains in a crucial situation. ",
            "4": "Matt Ryan was unstoppable. He went 30-of-40 for 275 yards, three touchdowns and an interception. He could have put together an even better statistical day had the Chargers been competitive; Ryan had 208 of his yards and all three scores by halftime. ",
            "5": "With a huge second-half lead, the Falcons turned to Michael Turner exclusively. He did nothing prior to intermission, but rushed for 65 yards on just six attempts after the break. His final numbers were 80 yards and a touchdown on 14 attempts. ",
            "6": "Ryan's scores went to Tony Gonzalez (9-91), Julio Jones (5-67) and Jacquizz Rodgers (5-35). Roddy White also had five grabs (55 yards), but couldn't find the end zone because of a poorly called offensive pass interference penalty. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "25"
        },
        "comments": {
            "amount": "7",
            "1": "Editor's Note: This is the first time that Peyton Manning didn't cover as a home underdog since his rookie year. Hmm... ",
            "2": "This was the second straight week the Broncos didn't play a complete game. They had another comeback come up short after struggling for three quarters. Houston built up a big lead and Denver ran out of time after getting hot in the fourth quarter. The Texans' offense and defense completely outexecuted the Broncos for the majority of three quarters. Houston mixed in some good runs and big plays through the air with a stifling defense that did a good job of getting off the field. ",
            "3": "Denver struck first in the opening minutes with a safety on a sack by Elvis Dumervil. The Broncos then added a field goal before the Texans dominated until the fourth. Houston took the lead with a long 60-yard touchdown pass to Andre Johnson after he torched Tracy Porter. Arian Foster then finished off a 97-yard drive with a three-yard touchdown reception. He ran well, totaling 105 yards on 25 carries to go with his touchdown catch. Schaub lit up the Broncos a bit later for a 52-yard touchdown by dropping in a ball to Kevin Walter (3-73) on a deep post. The signal-caller also burned Porter on the route. ",
            "4": "Schaub had to leave the game briefly in the third quarter after getting nuked by two defenders. The helmet-to-helmet hit from Joe Mays will probably result in a fine. Schaub had a good gain to Lestar Jean of 46 yards after he made a leaping catch and exploded down the sideline. That set up a 14-yard touchdown pass from Schaub to Owen Daniels. Johnson (2-72) made a huge 12-yard reception late in the fourth quarter to get a first down on a critical third down with the Broncos attempting a comeback. Schaub finished the game 17-of-30 for 290 yards, four touchdowns and an interception. ",
            "5": "The Denver offense would flash a nice gain or two during the first three quarters, but couldn't sustain drives or put the ball in the end zone. The Texans' defense was playing really well, led by J.J. Watt, who was having another great game with 2.5 sacks. ",
            "6": "The Broncos' scoring unit finally came to life in the fourth quarter, but it was the defense that lit the fire under the team. The Houston offense was driving to put the game away, but Ben Tate (8-26) fumbled the ball away after a hit by Denver defensive tackle Kevin Vickerson. Peyton Manning made them pay two plays later with a 38-yard touchdown toss to Brandon Stokley, who got open running down the middle seam. Manning threw a bullet into the end zone for Demaryius Thomas on the next possession, but the big wideout didn't tap his back foot and stepped out of bounds for an incompletion. A pass bounced off Eric Decker later in the drive, but dropped into tight end Joel Dreesen in the back of the end zone. That put the Broncos down 31-25 with six minutes remaining. Denver didn't get the ball back until there were only seconds on the clock, and the Broncos were too far from the end zone to have a real shot at stealing a win. Manning finished 26-of-52 for 330 yards, two touchdowns and zero interceptions. Decker (8-136) led Denver through the air. Stokley (6-73), Thomas (3-34) and Jacob Tamme (3-31) contributed. ",
            "7": "Willis McGahee (12-36) left the game early with a rib injury. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "31"
        },
        "comments": {
            "amount": "5",
            "1": "There were two major storylines in this game. The most significant is how the officials failed to make calls on plays in which star athletes were hit illegally. The one that will stick out is the shot to the helmet that Darrius Heyward-Bey took in the end zone. Heyward-Bey was down for a good 15 minutes and was put on a stretcher. The good news is that all he has is a concussion. He'll be out for a couple of weeks, but it could have been much worse. One play that may not make it into the SportsCenter highlights is a Philip Wheeler low hit to the back of Ben Roethlisberger's knee. I was shocked there was no penalty until I remembered that there are inept replacement officials on the field. Big Ben limped around for a while, but it eventually seemed like he was fine. ",
            "2": "The second big take-away from this game was how utterly bad Pittsburgh's defense looked without Troy Polamalu and James Harrison. The Steelers simply had no answer for Carson Palmer, and both Roethlisberger and Mike Tomlin knew it. That's why they went for it on their own 29 on a 4th-and-1 with the contest tied at 31 and 3:30 remaining in regulation. They converted it, but the drive ultimately stalled. The Steelers had to punt, and Palmer was able to engineer a game-winning drive, culminating with a 43-yard Sebastian Janikowski field goal. The Raiders punted just three times, as Palmer seldom threw incomplete passes, finishing 24-of-34 for 209 yards, three touchdowns and an interception. I thought Oakland's offense would be deflated after losing Heyward-Bey, but Palmer couldn't be stopped. Palmer's touchdowns went to Denarius Moore (5-45), Heyward-Bey (2-14) and Richard Gordon (1-1). ",
            "3": "Meanwhile, Darren McFadden had something to prove after struggling to run the ball in his first two games. He accumulated 113 rushing yards and a touchdown on 18 carries, including a 64-yard scoring scamper. ",
            "4": "The Steelers posted some terrific offensive numbers as well, at least in the passing game. Roethlisberger went 36-of-49 for 384 yards and four touchdowns. He did his usual pocket maneuvering and was once again sharp on third down, converting 8-of-14 attempts. Big Ben's scores went to Mike Wallace (8-123), Antonio Brown (7-87) and Heath Miller (8-60) twice. It's not surprising to see Miller find the end zone so much after Roethlisberger told the media that he really wants to make his tight end a Pro Bowler this year. ",
            "5": "The Steelers predictably struggled to run the ball, with Isaac Redman gained just 27 yards on nine attempts. Rashard Mendenhall could be back following Pittsburgh's Week 4 bye. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "It's the best of both worlds - the Patriots hung on to cover to seal my September NFL Pick of the Month and the Ravens managed to win for Torrey Smith, who lost his younger brother to a motorcycle accident just hours earlier. Smith was outstanding despite the fact that it was unclear whether he'd play or not. He caught six balls for 127 yards and two touchdowns. This was such an intense game. There were so many fierce hits (despite all of the points) and the players constantly got into it with each other. The officials lost control of this contest by letting stuff go early, and it got really bad. They then overcompensated by calling everything - there were 24 combined accepted penalties - prompting both coaches to scream incoherently at the refs. The crowd continuously chanted bull-s*** for what seemed like 10 minutes, and after the Ravens seeminglynailed a game-winning field goal - I still don't know why they didn't review that (it is reviewable) - Belichick ran after one of the officials and grabbed his arm. I've never seen Belichick that animated. It just goes to show how much of an atrocity the officiating crew was in this game. It's become such a farce, but it doesn't matter because Roger Goodell has proven that he doesn't give a damn about player safety as long as players can't sue him for it. ",
            "2": "It's a shame that the horrible refs are the major headline of a game that featured so much explosive offense. Tom Brady proved that all talk of him regressing was just nonsense, as he torched Baltimore's secondary, going 28-of-41 for 335 yards and a touchdown despite not having Aaron Hernandez at his disposal. Meanwhile, Joe Flacco was even better, finishing 28-of-39 for 382 yards, three scores and a pick. Flacco's reaching the level where you're scared to death when he's about to throw if you're betting against him. He had so many great throws in this contest, though there were three situations in which the Patriots missed out on an interception. Two potential picks were dropped, while the third never occurred because Kyle Arrington tripped over his own feet. ",
            "3": "The Ravens struggled to move the chains early on, but they got it together once Cam Cameron remembered that he has one of the premier runners in the NFL available to him. Ray Rice rushed for 101 yards and a touchdown on 20 carries. He also chipped in with five receptions for 49 more yards. ",
            "4": "As previously mentioned, two of Flacco's scores went to Smith. The other was to Dennis Pitta (5-50), who found the end zone thanks to the worst dual tacking attempt I've ever seen by Steve Gregory and Devin McCourty. ",
            "5": "As for the Patriot receivers, it was mostly Wes Welker (8-142) and Brandon Lloyd (9-108). It was fairly obvious that the former would be reincorporated into the offense in the wake of Hernandez's injury. The other tight end, Rob Gronkowski, had just two grabs for 21 yards, as the Ravens focused on shutting him down. ",
            "6": "New England ultimately lost because it couldn't run out the clock, allowing Flacco to take over against its inept defense. Stevan Ridley struggled (13-37 with a dropped pass), while Danny Woodhead inexplicably received more carries (15-34, TD). I don't understand Belichick's obsession with Woodhead. He's a nice third-down back, but there's no reason he should be receiving carries near the goal line or in short yardage. ",
            "7": "One last note on the officials: Following the game, Brandon Spikes tweeted: Can someone please tell these f***ing zebras foot locker called and they?re needed Back at work !!!! #BreakingPoint For thoughts on Packers-Seahawks, check out my updated "
        }
    },
    "numberOfGames": "14"
}