{
    "year": "2012",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "Embarrassed after the Thursday night blowout against the Giants, the Panthers showed great resolve. They played their best game possible against a team that many considered to be the class of the NFL. They led for most of the second half, but ultimately lost. I have no idea how they're going to come back from that. With that being said, the Panthers shouldn't be too hard on themselves because Matt Ryan was unbelievable. Ryan, who went 25-of-40 for 369 yards, three touchdowns and an interception despite being sacked seven times, did a masterful job of engineering two field goal drives at the end of regulation. He barely had any time at the end of the final possession, but hit Roddy White on a 59-yard bomb from his own end zone. ",
            "2": "White had an awesome performance, catching eight balls for 169 yards and two touchdowns. Julio Jones, meanwhile, had just one catch for 30 yards. He simply couldn't get open against Chris Gamble. He nearly had a second reception, but couldn't get two feet inbounds on a long pass in the fourth quarter. ",
            "3": "Ryan's third score went Michael Turner, who partied like it was 2008. He gashed Carolina's pathetic defense for 103 yards on only 13 carries, and he also had 68 receiving yards on three catches. The bulk of Turner's receiving yardage came on a 60-yard catch, thanks to an awful angle by safety Hiro Nakamura. Nakamura also had poor coverage on one of Atlanta's passing touchdowns. Though he did intercept Ryan in the end zone, Nakamura would be relegated to special teams on a team that didn't have a crappy defense. That, or he could be told he has to save the world by stopping time. ",
            "4": "Tony Gonzalez nearly had a touchdown of his own, but was whistled for offensive pass interference. He had five catches for 51 yards. ",
            "5": "While the Panthers lost, it was encouraging that Cam Newton was able to rebound from such an ugly performance. He went 15-of-24 for 215 yards and three touchdowns (two passing, one rushing) and also had nine scrambles for 86 yards on the ground. He played with much more confidence despite battling a defense that completely befuddled both Peyton Manning and Philip Rivers the past two weeks. ",
            "6": "Newton's two aerial scores went to Greg Olsen (6-89) and someone named Kealoha Pilares (1-36). Steve Smith had just three grabs for 52 yards. He also fumbled an end-around. ",
            "7": "DeAngelo Williams and Jonathan Stewart split carries pretty evenly. They tallied 11-49-TD and 10-40, respectively. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "52"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "28"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: Rob Gronkowski fumbled and dropped two key passes, including a touchdown. Wes Welker lost a fumble. Stephen Gostkowski missed two field goals - all in the first half. I was going to complain that the Patriots threw this game, but they still won, 52-28. It makes you wonder what the margin would have been if they didn't make all of those dumb mistakes early on. </i> ",
            "2": "When New England was down 21-7 in the third quarter, it looked like a third loss in a row was possible for the Patriots, but then Tom Brady got hot and the Bills were completely dominated. Once again Brady and Belichick came away with a win when they had to have it. Buffalo jumped out a 21-7 lead after two Scott Chandler touchdown catches and Donald Jones taking a quick slant 68 yards for a score. He beat corner Kyle Arrington and safety Patrick Chung took a bad angle. Brady answered by catching fire. He threw an 18-yard touchdown pass to Danny Woodhead. Brady then moved the ball with passes to Wes Welker, and the signal-caller ran the ball into end zone on a short scramble. Brady followed that by throwing a strike to Ron Gronkowski for a 28-yard score. New England ran in short touchdowns with Stevan Ridley and Brandon Bolden to route the Bills with 31 points in the fourth quarter. ",
            "3": "The Bills out-executed the Patriots into the third quarter. New England missed two field goals; Welker fumbled the ball away; Gronkowski also coughed the ball up and let go of a potential touchdown. Once the Patriots put their foot on the gas, Buffalo had become a turnover machine and Ryan Fitzpatrick was throwing frequent interceptions. ",
            "4": "New England stayed in the game because its front seven was awesome. Vince Wilfork tipped a pass up and Jerod Mayo came down with the interception. C.J. Spiller (8-33) fumbled the ball inside the Patriots' five-yard line after a massive hit from Brandon Spikes. Spikes forced another fumble in the second half. Fitzpatrick had T.J. Graham running deep with a step on Devin McCourty, but the pass was underthrown and fell into McCourty. McCourty had his second pick on another under thrown pass. ",
            "5": "It was a mixed day for Gronkowski (5-104). He had a 41-yard catch that led to a short Ridley touchdown. He also was stripped of the ball by safety Jarius Byrd. A play after Gronkowksi's fumble, Fitzpatrick lofted in a touchdown pass to Chandler (4-62) over Chung. ",
            "6": "Bills' corner Stephon Gilmore had an impressive game. He had blanket coverage on Brandon Lloyd on a number of throws to force incompletions. Gilmore helped set up Gronkowski's fumble by holding him up for Byrd. Gronkowski got open running deep down the field during the third quarter, but Gilmore blasted him as he crossed into the end zone to force an incompletion. It wasn't a complete game as Gilmore couldn't hold on for an acrobatic interception and was trucked over on a play in run defense. Still, it was an impressive performance for the rookie. ",
            "7": "Fitzpatrick was 22-of-39 for 350 yards with four touchdowns and four interceptions. Stevie Johnson (2-23) saw double coverage, and Fitzpatrick missed him for an easy touchdown. Fred Jackson (13-29) never got going either. ",
            "8": "Brady was 22-of-36 for 340 yards with three scores and no picks. Wes Welker caught nine passes for 129 yards. Lloyd caught three for 50 with a garbage-time touchdown. ",
            "9": "If you need a running back for your fantasy team, think of picking up Bolden. Ridley (22-106) and Bolden (16-137) were phenomenal against Buffalo. They both ran hard and dominated the Bills' linebackers. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "The Vikings are 3-1. Not nearly as unbelievable as Arizona's 4-0, mark, but still crazy nonetheless. After upsetting the 49ers last week, they went into Detroit and defeated one of their divisional rivals. If it weren't for the Cardinals, they'd be this season's surprise team. Of course, the big surprise is Adrian Peterson. It's almost as if he's never had any sort of knee injury. He rushed for 102 yards on 21 carries and also caught four balls for 20 receiving yards. With the passing attack unimpressive against Detroit's banged-up secondary, Peterson did a great job of moving the chains via nice cuts and keeping Detroit's explosive offense off the field. ",
            "2": "The Lions might have explosive players, but they self-combusted in this game. They committed way too many sloppy errors. Brandon Pettigrew had multiple drops, including one in the end zone. Titus Young dropped a potential first-down catch on a third down. Even Calvin Johnson had two drops, including a potential touchdown. Meanwhile, Mikel Leshoure lost a fumble and Matthew Stafford should have thrown an interception, but rookie safety Harrison Smith dropped the ball. Ser Stafford finished 30-of-51 for 319 yards. As mentioned, drops wiped out a touchdown and an interception. It's worth noting that he was able to get a 56-yard pass-interference flag on an attempt to Johnson. ",
            "3": "Megatron totaled just five catches for 54 yards, but had that long pass-interference flag, as just mentioned. He also nearly caught a touchdown, but Harrison Smith dislodged the ball with a great hit. Detroit's two leading receivers were Pettigrew (7-67) and Joique Bell (6-72). Bell is apparently serving as Detroit's third-down back, as Kevin Smith has completely disappeared into oblivion. ",
            "4": "Leshoure had a poor outing. He was questionable all week and probably should have sat out. He rushed for just 26 yards on 13 attempts and was responsible for a fumble. ",
            "5": "As for the Vikings' aerial attack, Christian Ponder was 16-of-26 for 111 yards. He threw just one pass longer than 17 yards, but didn't need to, as the Vikings led throughout and consequently went conservative. Literally. They went up by a touchdown right away when Percy Harvin took the opening kickoff to the house. Harvin didn't do much otherwise. He caught three balls for 22 yards and rushed three times for 12 more yards. Ponder's leading receiver was Jerome Simpson, who had four grabs for 50 yards, one of which was a huge reception as the Vikings were running out the clock at the end of regulation. Simpson also drew a pair of pass-interference flags. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Texans",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "This game was over on Tennessee's second drive. Jake Locker was hit by safety Glover Quin on a third down and grabbed his hand in pain. He went into the locker room and later emerged with his arm in a sling. Hours later, the Tennessean's Jim Wyatt reported that Locker had a separated shoulder and that the Titans fear the worst. Matt Hasselbeck played the rest of the afternoon, and while he did manage to lead his team on a touchdown drive in the second quarter, but he was pretty useless otherwise. He finished 17-of-25 for 193 yards, two touchdowns and a pair of picks. A good chunk of that yardage and one of the scores came on a bogus drive at the very end of the game. Meanwhile, one of the interceptions was returned for six when it was still a one-score game in the third quarter. ",
            "2": "Hasselbeck's scores went to Kendall Wright (4-46) and Craig Stevens (2-24). Despite Kenny Britt being out, Nate Washington (3-43) and Jared Cook (3-36) did nothing for their fantasy owners. ",
            "3": "The one silver lining in this game is that Chris Johnson looked like his old self again. There was one run in which he took a big loss because he danced at the line of scrimmage, but he ran less tentatively overall. This was a great sign that Johnson may eventually regain CJ2K form, provided the Titans actually fix their issues on the offensive line next season. ",
            "4": "As bad as Tennessee's offense played, the defense was worse. It showed no resistance on most of Tennessee's drives, as Matt Schaub was a near-perfect 20-of-28 for 202 yards and two touchdowns. Schaub carved up the middle of the field, taking advantage of Colin McCarthy's absence and the Titans' awful safeties. The duo of Owen Daniels and James Casey combined for 11 catches, 108 yards and two touchdowns. Andre Johnson, meanwhile, hauled in two receptions on the opening drive but didn't do much afterward, finishing with just three grabs for 56 yards. ",
            "5": "Arian Foster received 24 of the 29 carries given to the running backs, rushing for 86 yards and a score. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "I think there's only one word in the English language that can be used to describe this epic failure of a game for the Chiefs: debaclation. It was ridiculous. Kansas City completely self-destructed in the first half, allowing San Diego to build a 27-6 lead. It started when Matt Cassel threw an interception on the opening drive, giving San Diego a chip-shot field goal. Cassel came back to hit Dwayne Bowe for a 36-yard pass, but that was wiped out by an illegal formation. Oh, and then there were two Jamaal Charles fumbles that gave San Diego the ball deep in Kansas City territory on both occasions. The Chargers scored one touchdown off of the fumbles, but Philip Rivers tossed a lazy interception after the other. If that wasn't bad enough, Cassel followed everything up with two interceptions late in the first half. One was way behind Tony Moeaki and returned for six by emerging inside linebacker Donald Butler. The other was tipped off the hands of Dexter McCluster. The crowd was booing fiercely beforehand, but they barely made a sound after that last one. It was just sad at that point. Cassel finished 24-of-42 for 251 yards, two touchdowns and three picks. Cassel's yardage numbers are bogus; he was able to compile them when the Chargers were playing prevent in the second half. Kansas City needs to move on from Cassel after this season. The team cannot bench him now, unfortunately, because it doesn't have anyone behind him. ",
            "2": "Jamaal Charles had a nice fantasy day, rushing for 92 yards on just 17 carries, catching three balls for 23 more yards and scoring a pair of touchdowns. Unfortunately, those two aforementioned fumbles really cost his team. ",
            "3": "Dwayne Bowe caught seven balls for 108 yards. He was the only Chief with more than four receptions and 50 receiving yards. ",
            "4": "Meanwhile, the Chargers surprised many by giving Jackie Battle and LeRon McClain carries instead of Ryan Mathews on their opening drive. Mathews fumbled the ball inside the opposing 5-yard line last week, so this was apparently punishment for that. Mathews was cheated out of a rushing touchdown when Battle (15-39, TD) scored, but Mathews had way more yardage (61 yards on 14 carries). Mathews is the best runner on the roster though, so don't expect this Battle charade to last much longer. In fact, he's a nice buy-low target this week. ",
            "5": "Philip Rivers didn't have to do much because he had a lead the entire afternoon. He threw just five incompletions, going 18-of-23 for 209 yards, two touchdowns and a pick. Not included in those numbers was a drawn pass interference to Antonio Gates (3-59) in Kansas City territory. ",
            "6": "Rivers' scores went to Battle (4-42) and Eddie Royal (3-16). Malcom Floyd barely did anything (2-23), while Robert Meachem once again did nothing. Meachem was targeted only twice, and one of the instances was Rivers' interception. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "49ers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "No Darrelle Revis, no chance for the Jets, right? Well, New York could have had two Revises on the field and it wouldn't have mattered because the 49ers barely passed. When San Francisco established a 24-0 lead, Alex Smith was just 12-of-19 for 143 yards. The 49ers' demolition was all about great running and just watching Mark Sanchez attempt futile passes all afternoon. It's really laughable how bad Sanchez is. He takes stupid sacks, makes careless mistakes and can't fire accurate accurate passes consistently. Sanchez went 13-of-29 for 103 yards an interception and a lost fumble on a third down in San Francisco territory. Sanchez nearly tossed a couple of other picks, as the crowd booed him mercilessly throughout the entire contest. I tweeted (<a href=https://twitter.com/walterfootball>@walterfootball</a>) the following during the third quarter following one of Sanchez's turnovers: Hey Jets, it's Tebow time. It really is. It has to be. Even if you're not a Tebow believer, you have to at least agree that it's time for New York to give up on Sanchez, and Tebow is the only alternative. Tebow was on the field on several occasions. He completed his only pass attempt for 9 yards, on a 3rd-and-1. However, his tight end fumbled the football after a fierce hit and the 49ers recovered it. ",
            "2": "That wasn't the only instance in which an injured Jet coughed up the football while writhing in pain. Santonio Holmes hauled in a rare Sanchez completion but suffered a non-contact injury to his foot (though at the time, it seemed like he hurt his knee). As Holmes went down, he flipped the ball away carelessly like a selfish POS, seemingly giving up because he perhaps knew that his season was over. Carlos Rogers scooped up the ball and ran it in for six. Holmes, meanwhile, was carted off into the locker room. He finished with four catches for 29 yards. ",
            "3": "The Jets, of course, couldn't run the football either because Shonn Greene is terrible. He gained just 34 yards on 11 carries. ",
            "4": "As for the 49ers, I mentioned earlier that they pounded the ball very well. Their front line pushed New York's defense around, as the Jet players couldn't tackle whatsoever. San Francisco ran a number of plays out of the Wildcat with Colin Kaepernick, who rushed for 50 yards and a touchdown on five attempts. Frank Gore (21-62, TD) and Kendall Hunter (8-56, TD) also couldn't be stopped. ",
            "5": "With the runners gashing the Jets easily, Alex Smith didn't have to do much. He finished with essentially the same line as posted above (12-21, 143 yards), and none of his receivers had more than three receptions. Both Vernon Davis (2-28) and Michael Crabtree (2-15) snagged just two passes. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Rams",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Think the Seahawks were screwed karmically in this game? They should have lost last week, so naturally, strange things occurred in this contest. Receivers fell down; passes were tipped; a rookie kicker nailed field goals from 60 and 58 yards; and Sam Bradford actually looked functional against a really good defense. Bradford went 16-of-30 for 221 yards and an interception that wasn't his fault because his receiver Brandon Gibson ran the wrong route. His best pass was a beautiful, 52-yard touch pass to Chris Givens that occurred just prior to the fluke pick. That was Givens' only reception - he was targeted thrice - but Bradford remained locked in to Danny Amendola, who had six catches for 55 yards and a touchdown (the score actually came on a fake field goal). Bradford had no choice, as he had to get the ball out quickly, given the state of his banged-up offensive line. The Seahawks managed to sack Bradford on just two occasions. ",
            "2": "Steven Jackson had a pretty solid outing despite his mediocre statistics. He rushed for just 55 yards on 18 attempts, but he did a good job on some tough runs versus Seattle's stout ground defense. ",
            "3": "Meanwhile, Marshawn Lynch was much more productive on paper. He trampled St. Louis' defensive front for 118 yards and a touchdown on 20 attempts. He also caught four balls for 37 receiving yards. As always, he was extremely difficult to bring down. ",
            "4": "Russell Wilson had a nice completion percentage (17-of-25 for 160 yards), but tossed three interceptions. I alluded to some of them earlier; one occurred because Anthony McCoy slipped, while another was tipped at the line of scrimmage and popped up into the air. Of course, the latter turnover could be attributed to Wilson's height. ",
            "5": "No Seahawk caught more than four passes, with Sidney Rice (4-41) tying Lynch for the team's reception lead. The same problem persists; the Seattle wideouts simply can't get separation. This is an area that must be addressed this offseason (and not via washed-up veterans). ",
            "6": "I mentioned this earlier, but Rams' kicker Greg Zuerlein drilled 60- and 58-yard field goals. He's now a perfect 12-of-12 on the season. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "I don't know what's more amazing: Ryan Tannehill's 431 passing yards, Brian Hartline's 253 receiving yards, Kevin Kolb's 324 passing yards or Arizona's current record of 4-0. I don't even know where to begin, to be honest. Well, I guess I should congratulate the Dolphins on a valiant effort. The Cardinals were missing stud defensive lineman Darnell Dockett, but Tannehill's stat line of 26-of-41 for 431 yards, one touchdown and two interceptions was impressive nonetheless. Tannehill, who misfired on numerous long attempts against the Jets last week, connected on multiple long bombs to Hartline. However, he made what would be the game-losing pick in overtime, heaving the ball carelessly as he was hit. It's worth noting that Tannehill was actually intercepted on a third occasion just after halftime, but the turnover was wiped away because of a shaky call on Adrian Wilson. Tannehill also took a terrible sack in the red zone in the first half on what was a loss of 14 yards. ",
            "2": "Hartline was awesome. He caught 12 balls for the 253 yards I mentioned. The bulk of it came on an 80-yard touchdown bomb in the fourth quarter when it appeared as though Arizona established control of the game. Davone Bess, meanwhile, snagged seven balls for 123 yards. ",
            "3": "Reggie Bush was a game-time decision but ended up playing. He gained 67 yards on just 17 yards. He, as well as Daniel Thomas (4-4), lost a goal-line carry to Jorvorskie Lane, who converted. ",
            "4": "A Miami skill-position player who nearly screwed them was Legedu Naanee, who caught a ball and fumbled in the fourth quarter. I didn't think it was a fumble because Naanee didn't make a football move, but I guess I was biased. Patrick Peterson scooped up the football and took it inside the Miami 5-yard line. However, two plays later, Sean Smith made one of the best sideline interceptions I've ever seen, though it's worth noting that he shoved Larry Fitzgerald out of the way prior to making the pick. On the very next play, Tannehill hit Hartline for the aforementioned 80-yarder. ",
            "5": "The Dolphins established a 21-14 lead, but Kevin Kolb had a very clutch drive, culminating with a 15-yard touchdown to Andre Roberts on a last-gasp fourth down. Kolb then put his team into field-goal range following Tannehill's overtime pick. It was amazing how great Kolb was at the end of the game considering how much he struggled throughout the afternoon. Kolb finished 29-of-48 for 324 yards, three touchdowns and two picks, but couldn't get anything going early on because he was constantly harassed by the Miami pass rush. His offensive line had no chance against the Dolphins, particularly Cameron Wake, who tallied an eye-popping 4.5 sacks. Kolb was sacked eight times in total. ",
            "6": "Two of Kolb's scores went to Roberts (6-118). The other was thrown to Fitzgerald (8-64). Michael Floyd also chipped in with four receptions for 35 yards. ",
            "7": "With Chris Wells out, Ryan Williams received most of the carries. There weren't many, however, because the Cardinals trailed the entire game. Williams had just 26 yards on 13 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "Think Peyton Manning was pissed that everyone was saying that he was done? Manning proved everyone wrong, torching the Raiders mercilessly. He helped the Broncos compile 503 yards of total offense and converted 10-of-16 third downs. This demolition could have been even worse, but Demaryius Thomas fumbled a 40-yard reception as he was trying to switch the ball to his other hand. Manning was nearly perfect, going 30-of-38 for 338 yards and three touchdowns. He essentially did whatever he wanted, as the Raiders couldn't put any pressure on him. ",
            "2": "Manning's scores went to Eric Decker (7-79), Joel Dreessen (2-17) and Lance Ball (1-14). Thomas didn't score because of the fumble, but he did lead the team with 103 receiving yards on five catches. ",
            "3": "When Manning wasn't embarrassing Oakland's decimated secondary, he was handing off to Willis McGahee, who ran right through the Raiders' defensive front as if it were tissue paper. McGahee gained 112 yards and a touchdown on just 19 carries. ",
            "4": "The story of this game, aside from Manning's validation, is what occurred on third downs. While the Broncos were 10-of-16, the Raiders were just 1-of-12. Part of the reason for this was Darren McFadden's inability to find any running room. McFadden finished with just 34 yards on 13 carries. One third-down attempt that sticks out was a slow-developing outside run. The Broncos beat the Raiders in the trenches and stuffed McFadden quite easily. ",
            "5": "Carson Palmer went 19-of-34 for 202 yards. He was solid in the first half, but couldn't get anything going after intermission. Coincidentally, he hurt his arm just prior to halftime, so it's safe to wonder if that impacted him. However, it wouldn't have mattered because Manning couldn't be stopped. ",
            "6": "Palmer's leading receiver was Denarius Moore, who had four catches for 71 yards. McFadden, meanwhile, inexplicably had just one reception. You have to wonder what Oakland's coaching staff is thinking by giving McFadden only 14 touches. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "If you can shut down Jacksonville's ground attack, you're probably going to win. The Bengals did just that despite coming into this game ranked dead last against the run, giving up 5.8 yards per carry. Cincinnati was able to restrict Maurice Jones-Drew to just 38 yards on 13 carries despite the fact that Jacksonville had its offensive line intact for the first time all season. Even though the Bengals were missing their top three cornerbacks, they showed no respect for the Jaguar passing attack, opting to stack the line of scrimmage. Jones-Drew consequently couldn't find any running lanes. He did, however, help his PPR fantasy owners with five catches for 42 receiving yards. The Bengals were very smart in completely dismissing Jacksonville's aerial game because Blaine Gabbert sucks tremendously. His supporters will point to his great completion percentage (23-of-34), but he threw mostly checkdowns, which would explain why he managed to compile just 186 yards. He threw a touchdown but also was responsible for an ugly interception the one time he took a shot downfield. It's also worth noting that he lost a fumble on a strip-sack, but that was negated by a face mask penalty. ",
            "2": "Gabbert's sole score went to Marcedews Lewis (3-32). Meanwhile, Justin Blackmon was the leading receiver, catching six balls for just 48 yards. Blackmon will never live up to his potential as long as Gabbert is his quarterback. This game validated Gabbert's status as a sunk cost. I have the Jaguars picking a quarterback in my <a href=/draft2013.php> 2013 NFL Mock Draft</a>. ",
            "3": "Andy Dalton, somehow chosen a round later than Gabbert, went 20-of-31 for 244 yards, two touchdowns and an interception. The pick was weird; linebacker Kyle Bosworth caught the pass and ran it into the Bengals' red zone. He then inexplicably dropped the football, allowing Cincinnati to pounce on it. ",
            "4": "Dalton's scores went to A.J. Green (6-117) and someone named Chris Pressley (1-1). Jermaine Gresham nearly found the end zone, but drew a pass-interference flag instead. ",
            "5": "The Cincinnati player who had the most disappointing game was BenJarvus Green-Ellis. The Law Firm had three opportunities from the 1-yard line. He was stuffed twice and then lost a fumble for the second time in his career (and for the second time in two weeks) when he tried leaping into the end zone. ",
            "6": "The Bengals' offense needed some help from their special teams. Down 7-3 in the second quarter, they ran a direct snap to Cedric Peerman, who ran for 30 yards. This really sparked the Bengals, who later scored a touchdown on that drive and never looked back. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Packers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "I seriously hope that there isn't a deranged Packer fan out there who goes on a killing spree, murdering anyone wearing a black-and-white shirt. Green Bay ended up winning this game, so maybe this won't happen. The officials were clearly the story of this game. Packer fans wore yellow t-shirts saying, worst call ever and understandably cheered the real refs when they took the field. Those cheers quickly turned into boos, and those boos transformed into constant chants of bulls***, as the officiating crew inexplicably botched numerous calls against Green Bay. Some of those include: - Marques Colston (9 catches, 153 yards, TD) committed a very blatant offensive pass interference in the end zone that wasn't called. Colston caught a touchdown, but it shouldn't have counted. - Jimmy Graham caught a long pass that obviously hit the ground. The FOX announcing crew, particularly Troy Aikman, thought it was extremely apparent that it was a drop. It was ruled a catch, so Mike McCarthy challenged, but it somehow stood as a reception. Aikman was so taken aback that he didn't know what to say. - McCarthy lost that challenge as well as another one, so he couldn't ask for a review on another obvious play. The Saints clearly fumbled on a kickoff. It wasn't even close. The Packers recovered the fumble, but then the official said that the runner was down by contact. This is when the Packer fans erupted in the bulls*** chant. - Despite all of this, the Packers still held a 28-27 lead as the Saints were attempting a game-winning field goal. In an ironic turn of events, a Garrett Hartley successful kick was nullified by a New Orleans hold. Hartley then missed on his next try. ",
            "2": "It took a lot of guts for the Packers to win this game when they were continuously screwed by the refs. Mike McCarthy made a very ballsy call, opting to go for it on fourth-and-inches at his own 15, up 14-7 in the middle of the second quarter. He converted, and the Packers ended up scoring on the drive. ",
            "3": "Both quarterbacks were amazing in this game. Drew Brees went 35-of-54 for 446 yards and three scores. He tied Johnny Unitas with 47 consecutive games with a touchdown, which is an all-time NFL record. Brees can break the mark next week against the Chargers. Rodgers, meanwhile, was a near-perfect 31-of-41 for 319 yards, four touchdowns and an interception despite losing Greg Jennings to a groin (again). This was thanks to a clean pocket; he wasn't sacked a single time. Rodgers missed one play in which he was poked in the eye. Graham Harrell took the field, and as he was trying to hand the ball off to Cedric Benson (18-84), he tripped over center Jeff Saturday's feet and fumbled the ball. ",
            "4": "Two of Rodgers' scores went to James Jones (5-56). The others were thrown to Jordy Nelson (8-93) and Jennings (1-9). Brees, meanwhile, threw touchdowns to Colston, Darren Sproles (5-44) and former baseball player Joe Morgan (1-80). ",
            "5": "The Saints couldn't run the ball. Pierre Thomas (9-14) and Mark Ingram (5-11) struggled to find any sort of running lanes. Ingram sucks. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "22"
        },
        "comments": {
            "amount": "10",
            "1": "<i> I can't believe Billy Cundiff made a game-winning field goal, especially after missing three. If I could have, I would've bet my entire mortgage on Cundiff missing that kick. Good thing that option wasn't available to me. </i> ",
            "2": "Robert Griffin got some revenge for a bunch of fired former Buccaneer staffers who now work with the Redskins. Former head coach Raheem Morris and general manager Bruce Allen were treated to a last-second win over Tampa Bay. ",
            "3": "It was a game of halves as the first portion was all Washington and the final two quarters were all Tampa Bay. The Bucs' offense and defense were lost in the early going, but came alive to lead a furious comeback. ",
            "4": "The Skins got moving with a nice ground game led by Alfred Morris. He ran for 113 yards and a touchdown on 21 carries. Morris' day was highlighted by a 39-yard touchdown run. Griffin moved the ball with precision passes and good decision-making. He spread the ball around to Fred Davis (4-70), Josh Morgan (4-62), Leonard Hankerson (7-57) and Darrel Young (2-40). Griffin basically ran for two touchdowns. The first one was ruled a Griffin fumble that was recovered in the end zone by Pierre Garcon. ",
            "5": "Tampa Bay helped out with penalties. The Bucs had two critical offsides, one on a fourth-and-1 and one on a third-and-1. Ronde Barber was also flagged for a long pass-interference penalty. ",
            "6": "Tampa Bay's offense couldn't move the ball in the first half. Josh Freeman was horribly inaccurate in the first two quarters. He threw an interception to DeAngelo Hall on a pass poorly thrown toward Vincent Jackson. Freeman missed open receivers and threw many far off the mark. The Redskins had a nice pass rush going led by Ryan Kerrigan, who beat Demar Dotson for a sack and a number of pressures. After six ugly quarters dating back to last week, Freeman finally got going just after halftime with a 66-yard pass to Mike Williams. He beat Josh Wilson on a go route down the sideline. The drive ended with a short touchdown throw to Vincent Jackson. Freeman and Jackson connected on the next possession for a 54-yard bomb. That helped set up a touchdown run for LeGarrette Blount (6-17). Doug Martin (8-33) was held in check by Washington. Freeman moved the ball into field goal range later in the game, and the Bucs took the lead with a 47-yarder from Connor Barth. Freeman got away with a pass that should've been intercepted by Josh Wilson, but the signal-caller really played well in the second half against the Redskins. He completed 24-of-39 passes for 299 yards, a touchdown and an interception. Jackson (6-100) and Williams (4-115) played well for Tampa Bay. ",
            "7": "The Redskins did a trick play on a critical third down at the end of the third quarter with a handoff followed by a lateral back to Griffin and a pass downfield to Niles Paul for a gain of 30 yards. That play worked out, but was wasted after Billy Cundiff missed a 31-yarder. ",
            "8": "After Tampa Bay took the lead, Griffin had 102 seconds to work with. He threw the ball downfield and ran for a good gain. That set up Cundiff to nail a 41-yard field goal to win the game for Washington. Griffin was 26-of-35 for 323 yards through the air and ran for 43 yards on seven carries. ",
            "9": "If the Redskins lost, it would've been Cundiff's fault. He missed three field goals including a 41-yarder and a 31-yarder. Washington should scout out available kickers and have a replacement in mind in case the team needs to cut Cundiff. ",
            "10": "An odd event happened before the game. Redskins safety Brandon Meriweather and Aldrick Robinson collided in pre-game warmups and knocked each other out. Both were made inactive. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "I watched this game from start to finish and perused the box score, but I'm still not seeing it. Yes, it's true. The Eagles did not commit a single turnover. This is remarkable because they were giving the ball away at a record pace entering this contest. QB Dog Killer, who was responsible for most of the turnovers, played very well. He went 19-of-30 for 241 yards and a touchdown. He also scrambled six times for 49 rushing yards, as the Eagles made it a point to attack Osi Umenyiora's side. Umenyiora did not play disciplined, refusing to stay at home and mindlessly rushing the passer instead. If there's one dark cloud over this performance for Philadelphia's offense, it's that the team struggled in the red zone. The Eagles had to settle for a quartet of field goals. That's not going to cut it down the road, especially when the turnover issues resurface. ",
            "2": "QBDK's lone touchdown went to DeSean Jackson (6-99). Jeremy Maclin played, but barely did anything, catching just one pass for seven yards. ",
            "3": "LeSean McCoy was the star for Philadelphia, rushing for 123 yards on just 23 carries. His cutting ability was simply a pleasure to watch. It's almost physically impossible to run like he does. ",
            "4": "The Giants, conversely, couldn't run the ball at all; Ahmad Bradshaw had nearly triple the amount of carries compared to Andre Brown, 13-5, respectively, but they gained just 53 combined yards, with Brashaw getting 39 and Brown tallying 14. Eli Manning consequently had to do pretty much everything, and he basically did. He went 24-of-42 for 309 yards, two touchdowns and an uncharacteristic interception in the end zone in which he was fooled by the defense. Manning was able to complete multiple long gains against Philadelphia's tough cornerback group, a unit that missed Nnamdi Asomugha for nearly half the game because he was poked in the eye. It was initially reported that he would have to go to the hospital, but he felt better and returned to the field in the fourth quarter. ",
            "5": "Manning's touchdowns went to Victor Cruz (9-109) and Bear Pascoe (1-6). Ramses Barden (2-36) was very disappointing. Not only was he outclassed by Domenik Hixon (6-114); he committed an egregious offensive pass interference on the final series of the game, putting the Giants out of field-goal range. Naturally, Lawrence Tynes was short on his 54-yard try. ",
            "6": "A couple of interesting things in this game: - Brian Dawkins was due to have his number retired at halftime. He was also the final player introduced prior to kickoff, which really pumped up the team and the crowd. - The Giants were able to have good field position all evening because of David Wilson's kickoff returns. Wilson averaged 36 yards per attempt, as there were gaping holes nearly every time the ball was kicked to him. The crowd eventually booed after each Giants' kickoff. - Speaking of an angry crowd, I thought it was hilarious that the fans jeered AndWy Reid when he challenged a DeSean Jackson reception. It's amazing how little confidence Philadelphians have in their head coach. - Giants' safety Kenny Phillips suffered a knee injury in the first half. This is a devastating blow to a secondary that already had numerous injury concerns. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "13"
}