{
    "year": "2012",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "It's funny how things can change in just a few weeks. The Bengals were once 3-1 and many were projecting them to challenge for the AFC North. Around the same time period, Denver lost to the Patriots by double digits, dropping to 2-3. The consensus was that Peyton Manning's arm was shot and that the Broncos would struggle to get into the playoffs because the Chargers were on fire. Well, I think we know where both teams currently stand. Manning, the hottest quarterback in the NFL entering this weekend, picked the Bengals apart despite the fact that Cincinnati strongly believed it had a solid game plan against him based on the success the defense had in its previous meeting. The Bengals were apparently dead wrong. Manning was pretty much flawless, going 27-of-35 for 291 yards, three touchdowns and two interceptions. The picks were his first since the opening half of Week 6. The first wasn't really his fault; Eric Decker stopped short on his route. The second was pretty bad, as Manning heaved an inaccurate ball from his own end zone. However, he rebounded with consecutive touchdown drives after that. Manning could have put together an even better performance had his supporting cast not let him down. I already mentioned Decker's blunder on the first pick; the Broncos dropped several passes early on. Decker was also responsible for an offensive pass interference penalty. ",
            "2": "Despite the mistakes, Decker still had a monstrous fantasy performance, catching eight balls for 99 yards and two touchdowns. The other score went to Joel Dreessen (4-38). ",
            "3": "Manning's supporting cast endured a couple of injuries. Demaryius Thomas (6-77) limped off the field in the first half, but was able to reenter the contest, drawing a long pass interference penalty late in the game. Meanwhile, Jacob Tamme (3-18) banged his elbow. He was fortunate though, as he was able to get back on the field. ",
            "4": "The Broncos didn't rush the ball very well. Willis McGahee (23-66) had a couple of good runs, especially late when the team was trying to salt the game away, but Cincinnati did a good job overall of containing him. ",
            "5": "As for the Bengals, Andy Dalton's stats were impressive; he went 26-of-42 for 299 yards, one touchdown and an interception. Dalton made several terrific throws, but could have been picked a couple more times, so he had a mixed outing. ",
            "6": "Dalton's sole score went to A.J. Green, who had an impressive performance against Champ Bailey, catching seven balls for 99 yards. Jermaine Gresham (6-108) was the team's leading receiver. ",
            "7": "BenJarvus Green-Ellis was his usual, mediocre self, gaining 56 yards on 17 attempts. He didn't have a single rush longer than six yards, but he was able to salvage his fantasy day with a goal-line touchdown. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "15"
        },
        "comments": {
            "amount": "4",
            "1": "Joe Flacco and Brandon Weeden are bipolar. At least that's the conclusion I made after watching this game. Flacco started hot, sucked in the middle of the contest and was able to finish well. Weeden, meanwhile, was awful early on, got hot in the middle quarters, but was terrible toward the end of regulation. Starting with the victor, Flacco opened up 10-of-12 for 110 yards, leading the Ravens to a pair of first-quarter touchdowns to establish a quick, 14-0 advantage. He was then was four of his next 11 for just 24 yards. He had several passes that easily could have been picked off. However, he came through when it mattered most, engineering a game-winning touchdown drive. The clinching score went to Torrey Smith, though it's worth noting that it was just a short completion that was all Smith (4-46). Flacco's final numbers were 15-of-24 for 153 yards and a score. He won the game, but this inconsistency is very discouraging for the Ravens, who need their offense to carry them in the wake of the defense's demise. ",
            "2": "Baltimore fans should be encouraged that Cam Cameron finally realized that he has one of the best running backs in the NFL at his disposal. Ray Rice carried the ball 25 times, mustering 98 yards and a touchdown. Backup runner Bernard Pierce (7-26) vultured a score of his own at the end of the first quarter. ",
            "3": "Weeden, meanwhile, went 20-of-37 for 176 yards and two picks. He had several nice strikes to his receivers, particularly Greg Little (5-52) and Josh Gordon (2-38). Gordon actually scored a touchdown in the second half, but an illegal formation erased that. However, Weeden could have easily tossed a few more interceptions, as the Ravens' secondary uncharacteristically dropped some gifts. Ed Reed, who would ultimately end up with a pick, was one of the offenders, as the ball fell right through his hands. Weeden humorously was intercepted on the very next play, as he forced a poor attempt under pressure. ",
            "4": "The Browns ran the ball successfully, but weren't able to pound the rock often because of their early 14-0 deficit. Trent Richardson tallied 105 yards on 25 carries. He also caught six passes for 31 receiving yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "It's safe to say that neither quarterback was looking forward to this matchup. The Packers and Cardinals' defenses came into this weekend leading the league in sacks, while the two offensive line units had surrendered the most sacks in the NFL. Thus, it wasn't really a surprise that both signal-callers were brought down behind the line of scrimmage on their opening drives. Aaron Rodgers, however, did a great job of evading the Cardinal defenders. He scrambled so many times in the first half that it made me realize how often he used to do this. Rodgers hasn't utilized his legs much this season, failing to rush more than five times in any contest entering this weekend. He ran eight times versus the Cardinals. He picked up 33 rushing yards on those attempts, which doesn't seem like much, but they were instrumental in picking up first downs. ",
            "2": "Looking at the box score, you may think that Rodgers struggled. He went 14-of-30 for 218 yards. However, he threw four touchdowns to just one interception, and he endured so many dropped passes. The Packers were actually guilty of four drops in the first 22 minutes of action. It must also be noted that Rodgers didn't have the services of his top two receivers. Greg Jennings is going to be out for several more weeks, while Jordy Nelson made a foolish decision by trying to play with a bum hamstring despite a bye coming up. Player arrogance once again backfired, as Nelson, who failed to haul in a single pass, limped off the field on the second drive. ",
            "3": "James Jones and Randall Cobb did a good job of picking up the slack. Jones (4-61) scored once, while Randall Cobb (3-37) found the end zone twice in addition to giving the Packers good field position all afternoon with quality kick returns. Rodgers' fourth touchdown went to someone named Tom Crabtree, who sprinted in for a score with a 72-yard catch - his only reception of the afternoon. ",
            "4": "The Packers actually ran the ball pretty well for a change, though this isn't a huge surprise because of Arizona's recent inability to stop ground attacks. James Starks received most of the carries, gaining 61 yards on 17 tries. Alex Green (11-53), who saw one of his yardage come on a 21-yard scamper, has been supplanted. ",
            "5": "Meanwhile, John Skelton put together a solid statistical outing (23-of-46, 306 yards, TD, INT), but most of his numbers came in garbage time, as he put two scoring drives together after the Packers went up 24-7. ",
            "6": "Four Cardinals caught at least four passes, including Larry Fitzgerald (6-74) who hauled in Skelton's only touchdown. The others were Andre Roberts (4-86), Michael Floyd (5-80) and Rob Housler (5-55). The most notable player on that list is Floyd, but before you get too excited, he had just one target in the first half and only three targets prior to the beginning of the fourth quarter. Most of his stats came in meaningless action. ",
            "7": "Two major injuries in this contest, save for Nelson's ankle: Clay Matthews hurt his hamstring in the third quarter. Even more dire is Bryan Bulaga's hip injury. He was carted into the locker room. It's a good thing the Packers have a bye next week. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Texans",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "9"
        },
        "comments": {
            "amount": "4",
            "1": "I don't even want to talk about this game. If Rian Lindell just hit a 37-yard field goal, the Bills would have covered, which is obviously the most important thing to occur in this contest. Hey, I'm not being facetious; the Texans have the No. 1 seed locked up, while Buffalo is a disgrace, so what did this final result matter? There are so many things the Bills did wrong in this contest against the sleepwalking Texans. This includes: - Fred Jackson (6-21) and C.J. Spiller (6-39) received just 12 total carries even though the Texans were never up by more than eight points until the fourth quarter. On the bright side, they each caught five passes for 14 and 63 yards, respectively, so they were at least utilized in the passing game. - The Bills dropped several passes, particularly in the second half. Steve Johnson (3-29) and Donald Jones had the ball slip through their hands on plays that would have moved the chains. Scott Chandler (3-51) had two drops. Johnson was banged up; he took a fierce hit from safety Glover Quin in the second quarter and didn't look like himself after that. - Ryan Fitzpatrick was decent overall - 25-of-38, 239 yards - but had a crucial fumble in Houston territory in the fourth quarter, as Whitney Mercilus stripped the ball out of his hand as he was trying to scramble for yardage. - As mentioned, Lindell completely whiffed on a 37-yard try. In a dome. It wasn't even close. - The defense was epically fooled on one play-action bootleg play. Every single defender bit on what they thought was an Arian Foster run, allowing Matt Schaub to move left and hit an open Owen Daniels for a 39-yard touchdown in the opening quarter. ",
            "2": "Of course, you can't really blame the Bills for getting tricked like that, as Foster couldn't stopped all afternoon. He rushed for 111 yards and a touchdown on 24 carries. ",
            "3": "Schaub, as usual, utilized play-action fakes beautifully. He went 19-of-27 for 268 yards and two scores to Daniels (4-62) and reserve tight end Garett Graham. Andre Johnson couldn't find the end zone, but still managed to grab eight balls for 118 yards. ",
            "4": "I was typing when I heard one of the announcers say that a Buffalo defender named Williams suffered an injury. I immediately thought of ways to write about Mario Williams' failed return to Houston, but it turns out that cornerback Aaron Williams was the one who was hurt. Aaron Williams was helped off the field with a knee. Mario Williams, meanwhile, actually had a solid outing, collecting a sack and leading the team in tackles (7). "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "EDITOR'S NOTE: I really hope that this result stops stupid ESPN analysts from proclaiming that Ryan Tannehill is better than Andrew Luck. I still can't believe that. Luck, by the way, is on pace for 4,808 yards, which is just sick. ",
            "2": "Andrew Luck was a beast for the Colts on Sunday and looked like a quarterback who is capable of leading his team to a wild-card berth in the weak AFC. Ryan Tannehill played really well, but wasn't good enough to keep pace with Luck. The rookies started the game on fire as they combined for 431 yards through the air by halftime. Luck kept it going in the second half and set the rookie record for passing yards in a single game.  Tannehill led an early field goal drive and Luck answered. Rookie tight end Dwayne Allen drew a long pass interference from Koa Misi to set up a nine-yard touchdown pass on a frozen rope from Luck to Reggie Wayne (7-78). Tannehill responded to Luck's first touchdown pass with a 31-yard scoring pass to Charles Clay. Miami scored again with a beautiful 18-yard touchdown run by Reggie Bush (10-41). He zig-zagged his way around defenders to dart into the end zone. Luck laid out a perfect 48-yard pass to Donnie Avery (5-108) late in the second quarter. It was a great throw that beat the double coverage. Luck then launched a great deep ball to T.Y. Hilton (6-102) that should've been a touchdown, but the pass was dropped. The drive settled for a field goal. Luck had 273 yards at the half, and it could've been a lot more if it his receivers weren't dropping passes. Luck put the Colts in the lead during the third quarter. He converted a third-and-16 with a 19-yard pass to LaVon Brazill (2-25) and finished the drive with a 36-yard touchdown pass to Hilton. Tannehill answered with some clutch throws to get a field goal and tie the score at 20. Luck answered with a drive for a 43-yard goal that was the game-winner. He had one terrible decision in the final minutes while trying to avoid a sack, but Sean Smith dropped an interception. Luck was amazing on third down versus the Dolphins. He converted many third-and-longs, including a critical one to Allen on a third-and-11 deep in Indianapolis territory. The Colts finished 12-of-18 on third down. Luck was 30-of-48 for 433 yards with two touchdowns in his record-setting day. Tannehill had one more shot, but the Colts' defense stopped him. He completed 22-of-38 passes for 290 yards and one touchdown. Brian Hartline (8-107) and Davone Bess (6-67) were his leading receivers. Miami has to be pleased with the way Tannehill played while injured, and the team just need to get him more receiving talent to work with. ",
            "3": "The Colts' special-teams unit let Luck down. Adam Vinateri missed a 48-yarder and Miami rookie defensive end Olivier Vernon blocked another field goal in the second quarter. ",
            "4": "Defensively, both teams had ugly games from their secondary, but they both had good edge-rushing. Dwight Freeney beat Jake Long for a sack-fumble that Long recovered. Robert Mathis returned to lineup and beat Dolphins rookie right tackle Jonathan Martin for a sack in the first quarter. Cameron Wake had a sack-fumble on a blindside sack of Luck that was recovered by the Colts. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Lions",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "It's a good thing the Lions acquired Mike Thomas from Jacksonville. They were able to learn all of the Jaguars' secrets, giving them an unbelievable advantage in this matchup... ...Or maybe this was just all about the edge that they had at the quarterback position. By the time it was 21-0, Matthew Stafford was 15-of-24 for 216 yards, while Blaine Gabbert was a pathetic 4-of-7 for 10 yards, with all four completions being checkdowns. Even more laughable was his Hail Mary attempt at the end of the first half; throwing from midfield, Gabbert's weak lob sailed only 30 yards and was nearly intercepted at the Detroit 20-yard line. Gabbert would end up finishing 27-of-38 for 220 yards, two touchdowns and a pair of picks, one of which was a pathetic pass that just seemed to die in mid-air. Don't be fooled by the final numbers; his stats came in complete garbage time where the Lions were just playing prevent. It's clear by now that he's not the long-term solution at the quarterback position. They can't possibly sell their fans on him for another season. ",
            "2": "Gabbert's meaningless scores went to Michael Spurlock (5-35) and Justin Blackmon (5-32). Blackmon's touchdown was the first of his professional career. ",
            "3": "If there is a silver lining for Gabbert's performance, it's that he spread the ball around. Six Jaguars caught at least three passes. In addition to Spurlock and Blackmon, they were Laurent Robinson (6-41), Marcedes Lewis (4-41), Cecil Shorts (3-56) and Rashad Jennings (3-7). ",
            "4": "The best play of the day for the Jaguars came on special teams. Third-round rookie Bryan Anger blasted a 73-yard punt. As this happened, I posted: Bryan Anger with a 73-yard punt! The highlight of the Jaguars' 2012 season! Sad, but true. ",
            "5": "As for Stafford, he didn't have to throw at all once the team established a 24-0 lead. He finished 22-of-33 for 285 yards. He once again couldn't find Calvin Johnson in the end zone, but Megatron still had a monstrous performance, catching seven balls for 129 yards. He just missed out on a touchdown, getting tackled at the 1-yard line. ",
            "6": "The man who did all of the scoring for the Lions was Mikel Leshoure, who rushed for 70 yards on 16 carries. He found the end zone three times. It's nice to see that Detroit's coaching staff finally realized that Leshoure is the best option at the goal line. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bears",
            "Points": "51"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Bears are always sound because they play great defense and special teams. That was on display in this contest, as they managed to blow out the Titans with virtually no offense whatsoever. To give you an idea, they had just 44 total yards of offense when they took a 28-2 lead. Chicago established such a massive advantage thanks to a blocked punt, a Devin Hester return to the 10-yard line, a Brian Urlacher pick-six of Matt Hasselbeck and a Chris Conte fumble recovery of Chris Johnson. It's amazing that the Bears didn't even really need to run a single offensive play to get out to a 26-point lead. In fact, it would have been a 28-point advantage had they completely gone with the anti-Bobby Boucher approach because they took a safety on an offensive line penalty in their own end zone. The Titans were guilty of five turnovers in the first half. I mentioned the blocked punt, pick-six and Johnson fumble; Johnson had another fumble in Chicago territory, while Kenny Britt coughed the ball up at midfield. Jared Cook also fumbled in the second half; his two catches for six yards makes you wonder why no team wanted to acquire him at the trade deadline. ",
            "2": "Jay Cutler didn't have to do much, but he put together a solid performance. He went 19-of-26 for 229 yards and three touchdowns, though it's worth noting that most of his production came when his team was well ahead and several of the Titans seemed to quit. Amazingly though, Cutler was sacked thrice, which makes you wonder how he would have survived had Tennessee not killed itself with stupid mistakes. ",
            "3": "All three of Cutler's touchdowns went to Brandon Marshall, who had a monstrous afternoon with nine catches for 122 yards. Only one other Bear caught more than two passes (Earl Bennett: 4-22). ",
            "4": "Matt Forte was set up with a short touchdown thanks to Hester's aforementioned return. He received just 12 carries on the afternoon, but was able to finish with 103 yards and the score. ",
            "5": "Chris Johnson, meanwhile, finished with 141 yards and a touchdown on just 16 attempts. Those are pretty bogus numbers, however, because he scored on an 80-yard scamper in garbage time. He otherwise would have mustered 61 yards on 15 tries, most notably getting stuffed twice on 2nd-and-1 and 3rd-and-1 on the second drive. He also fumbled twice. ",
            "6": "Hasselbeck finished 20-of-35 for 194 yards, one score (to Nate Washington, 2-35) and the aforementioned pick-six. The stats don't look bad, but Hasselbeck wasn't able to do much until this game was out of hand. ",
            "7": "Tennessee's leading receiver was Kenny Britt, who had five catches for 67 yards. Kendall Wright (2-30) left the game in the third quarter with an elbow injury. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "It appears as though Barack Obama's presidency will be coming to an end after just four years. The Panthers won, which all but ensures that Mitt Romney will be the next U.S. President, given that the challenging party has been victorious all but one time whenever the Redskins have suffered a defeat prior to Election Day throughout the team's history. Perhaps Obama should have influenced the NFL schedule-makers, as short, home favorites have a dubious history going into the bye. Teams that aren't favored by much at home generally aren't very good, and teams that lack in talent tend not to be focused in these situations, perhaps eschewing the task at hand and instead thinking about where they are going on vacation for the few days they have off. I say this because the Redskins looked lethargic and out of rhythm all afternoon. The offensive line couldn't block, the receivers couldn't catch passes and penalties nullified positive gains. ",
            "2": "Robert Griffin went 23-of-39 for 215 yards to go along with 11 scrambles for 53 rushing yards. He had a rushing touchdown wiped out by a Will Montgomery hold and a passing score to Leonard Hankerson eliminated because of an illegal formation. He was sacked four times, which is a very high number considering how elusive he is. ",
            "3": "Griffin doesn't have much to work with. His leading receiver was tight end Logan Paulsen (5-59). Leonard Hankerson (3-49) and Joshua Morgan (6-46) were next after that. Santana Moss (1-2) didn't do much because he suffered an apparent concussion in the third quarter. ",
            "4": "Alfred Morris rushed for 76 yards on 13 carries. He probably would have enjoyed a great afternoon had the Redskins not trailed throughout. ",
            "5": "Perhaps extra focused to prove that he's the best recent Heisman Trophy winner, Cam Newton went 13-of-23 for 201 yards and a touchdown to go along with 37 rushing yards and another score on eight scrambles. It was nice to see Newton run in the red zone for a change because he's been reluctant to do so this season. ",
            "6": "Newton's lone aerial score was to Steve Smith (3-41), who visited the end zone for the first time all year. Newton's best throw was an 82-yarder to a wide open Armanti Edwards downfield. This was the only positive thing Edwards has done as a pro, so it'll be a nice memory that Panther fans will have after the former Appalachian State quarterback is cut once the season is over. ",
            "7": "DeAngelo Williams surprisingly scored a 30-yard touchdown in which he tip-toed the sideline, but did nothing otherwise, finishing with 37 yards on just six attempts. Jonathan Stewart handled the majority of the workload once again, finishing with 51 yards on 10 carries. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "32"
        },
        "comments": {
            "amount": "5",
            "1": "EDITOR'S NOTE: Great job by Greg Schiano utilizing LeGarrette Blount to run out the clock when Doug Martin was just 54 rushing yards away from breaking Adrian Peterson's all-time single-game record. You really fooled the Raiders with that move, Greg. ",
            "2": "The meager playoff aspirations for the Oakland Raiders took a massive hit after being dropped at home by Tampa Bay. It was the Bucs' first win in Oakland in franchise history and helps Tampa Bay stay in the wild-card chase. Doug Martin (25-251) dominated to open up a big lead, but the pass defense almost blew an 18-point second-half lead. ",
            "3": "This game was extremely sloppy in the early going. Oakland helped Tampa Bay move the ball with a series of penalties, but the Raiders' defense came up big with Lamarr Houston blocking a 35-yard field goal. He picked up the ball and returned it 33 yards. A roughing-the-punter penalty on the Bucs gave Oakland a first down. Carson Palmer burned Mark Barron for a 50-yard touchdown pass to Derek Hagan a few plays later, but a holding call brought the score off the board. A fake punt by Oakland was easily snuffed out by Ronde Barber, and Bucs kicker Connor Barth missed a 54-yard field goal before halftime. ",
            "4": "Josh Freeman had a good day throwing against a pathetic secondary. He threw a 64-yard pass to Vincent Jackson and then finished the drive a few plays later with a touchdown pass to Jackson (2-84). The Buccaneers dominated the third quarter. Martin had a 45-yard touchdown run up the middle of the Raiders' defense. Tampa Bay expanded its lead with a short touchdown pass to Mike Williams (4-68). Palmer ended a promising drive with a pass off the back foot that was intercepted by Leonard Johnson. Martin took off on a 67-yard touchdown run a few plays later. Oakland found the endzone again in the fourth quarter, but Martin ran up the middle for a 70-yard touchdown sprint in response. LeGarrette Blount fumbled the ball away to aid the Raiders' comeback effort. Martin had his fourth score in the final two minutes. Freeman was 18-of-30 for 247 yards with two touchdowns and zero interceptions. ",
            "5": "Darius Heyward-Bey (5-74) made a brilliant 46-yard one-handed catch going against E.J. Biggers along the sideline. The Raiders ran the same route for a 25-yard touchdown pass to Rod Streater (4-54) a short time later. After falling way behind, Palmer had two short touchdown passes to tight end Brandon Myers (8-59). Palmer threw another pretty touchdown pass to Marcel Reese (8-95). The Raiders then went for the two-point try. Palmer evaded a sack and tossed the ball up for grabs to Juron Criner who outjumped Biggers to narrow the score to 35-32. Palmer quickly got the ball back, but threw a terrible pass to empty space and it was picked off by Ahmad Black to seal the game. Palmer finished 39-of-61 for 414 yards with four touchdowns and three interceptions. Darren McFadden had an awkward landing in the first half and left the game with a leg injury. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "This game was close for a while. Thanks to Adrian Peterson's impressive running, the Vikings were able to establish a 17-14 lead in the second quarter. They managed just three points after that, however, as the offense got completely bogged down. So, what happened? Percy Harvin's injury happened. The dynamic wideout injured his ankle at the beginning of the second half. He missed some action and then reentered the contest, but he was completely ineffective once he took the field again. He was limping around, which really limited the offense. He finished with two catches for 10 yards and four carries for 24 rushing yards. ",
            "2": "Christian Ponder didn't really have his top option in the second half, so some will blame Harvin's injury on Ponder's pathetic stats (11-of-22, 63 yards and an interception), but Ponder was just 7-of-13 for 42 yards prior to halftime, which is when Harvin was healthy. Ponder has regressed terribly the past few weeks, and those impressive home victories over the 49ers and Titans seem like a million years ago. ",
            "3": "I mentioned Peterson earlier. He's the only reason why the Vikings were even competitive. He opened the contest with a 74-yard burst and finished with 182 yards and two touchdowns on 17 carries. Peterson had just five attempts after halftime, so the Vikings need to be criticized for abandoning the ground attack so willingly. Peterson also led the team with three catches for 11 receiving yards. Sadly, the leading Minnesota receiver was Jerome Simpson, who had one catch for 14 yards. Kyle Rudolph did nothing yet again. It's unbelievable that the Vikings are struggling to find a way to get him involved offensively. ",
            "4": "As for the winning team, Russell Wilson played like the MPVP canadate that Mario Migelini styles him to be, going 16-of-24 for 173 yards and three touchdowns to go along with nine carries for 27 rushing yards. Wilson's numbers could have been better had the Seahawk wideouts not dropped a handful of passes; the team had three drops in the first quarter alone. ",
            "5": "Two of Wilson's scores went to Golden Tate (4-28). The other was thrown to Sidney Rice (4-54). ",
            "6": "Marshawn Lynch's numbers weren't as good as Peterson's, but he was a beast, pummeling Minnesota's defense for 124 yards and a touchdown on 26 carries. ",
            "7": "A key injury for the Seahawks: Stud linebacker K.J. Wright was knocked out of the game in the first quarter with a concussion. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "In full disclosure, I stopped watching this game for about a quarter and a half. I did this because I thought the officials were bought. Following a completely bizarre play in which an obvious Ben Roethlisberger incompletion transformed into a fumble returned for a touchdown (and an easy clipping penalty wasn't called), I tweeted ( @walterfootball), The next time @nflcommish tells the refs to give the #Giants a victory, he should advise them to be more discrete about it. I didn't think the Steelers had a chance because of some sort of conspiracy. As it turns out, there was no conspiracy because the Steelers were able to come back and win... meh, there was still a conspiracy. I'll let you know about it in tomorrow's NFL Power Rankings. There were some other shady calls - a terrible, 41-yard pass interference penalty on Hakeem Nicks, as well a bogus personal foul penalty on Victor Cruz that was not a blow to the helmet - so give the Steelers credit for hanging in despite flying in that morning and having to deal with the emotion the Giants would be playing with in the wake of Super Hurricane Sandy. Pittsburgh did a great job of sticking with the running game despite falling behind early. Isaac Redman, starting because both Rashard Mendenhall and Jonathan Dwyer were out, rushed for 147 yards and a touchdown on 26 carries. ",
            "2": "Ben Roethlisberger had a very good game overall despite the bogus strip-six. He finished 21-of-30 for 216 yards, two touchdowns and an interception in which he felt phantom pressure and uncharacteristically forced a pass into double coverage. He was especially sharp in the final quarter, going 6-of-8 for 99 yards and a score despite not having the services of Antonio Brown, who suffered a high ankle sprain in the opening period. ",
            "3": "With Brown out, Mike Wallace (3-66, TD), Jerricho Cotchery (4-50), Heath Miller (4-48) and Emmanuel Sanders (2-20, TD) did a good job of picking up the slack. ",
            "4": "Brown wasn't the only high-profile receiver who got hurt. Cruz took that illegitimate personal-foul penalty and was down on the ground for some time. He left, but reentered the contest later to lead the team in receiving; he caught five passes for 67 yards. In fact, Cruz was just one of two Giants to log more than one catch; the other was Martellus Bennett (3-40). Hakeem Nicks (1-10) was open deep in the first quarter, but was overthrown. He also drew the aforementioned pass interference, but that was a terrible call. ",
            "5": "Eli Manning completed just 10 passes out of 24 attempts for 125 yards and an interception. He looked off right away when he overthrew an open Nicks for a potential longtouchdown. I'd say it was a weird outing for Manning, but he struggled last week at Dallas. He and his teammates look like they desperately need the bye week. ",
            "6": "Ahmad Bradshaw gained just 48 yards on 15 carries. Making matters worse, Andre Brown (7-20) vultured a touchdown and received other goal-line opportunities. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "I thought the Cowboys were the right side in this contest, but I refused to bet on them because I thought they would screw up somehow. They always find a way to shoot themselves in the foot, and in this contest, the offense, defense and special teams all contributed to this loss. On offense, Kevin Ogletree and Miles Austin-Jones both had easy drops on third down that would have moved the chains and kept drives alive in Atlanta territory. This would have given the Cowboys a pair of field-goal opportunities at the very least, which is key because they lost by two field goals. Also, Dallas had seven plays in the red zone in the opening quarter and gained just 19 yards. On special teams, Dallas had a nice punt to pin the Falcons at their own 6-yard line at the end of the third quarter. The Cowboys committed a penalty, however, which gave Atlanta possession at the 20. The Falcons would go on to score a touchdown on the drive, breaking the 6-6 tie. On defense, the Cowboys had several opportunities to stop Atlanta and force a punt in the final minutes. However, Orlando Scandrick missed a tackle on Jacquizz Rodgers and then was whistled for a hold on Roddy White, allowing the Falcons to move the chains, eat up more time on the clock and kick the covering 32-yard field goal, prompting Al Michaels to give us his obligatory gambling reference. ",
            "2": "Of course, the Falcons weren't flawless either. Matt Bryant whiffed on two attempts from 37 and 43 yards. Asante Samuel, meanwhile, dropped a gift Tony Romo interception in the end zone during the first half. Romo was decent overall, going 25-of-35 for 321 yards and a touchdown to Kevin Ogletree (3-96). ",
            "3": "Dez Bryant was questionable entering this contest. He played, but did nothing (1-15), hurting his fantasy owners. Three Cowboys caught at least five passes: Austin-Jones (7-76), Felix Jones (5-70) and Jason Witten (7-51). Witten now has more receptions than any Dallas player in franchise history, passing Michael Irvin tonight. ",
            "4": "With DeMarco Murray out again, Jones (9-39) and Lance Dunbar (8-26) split carries. Jones did well on some of his touches, but it's clear that Murray is missed. ",
            "5": "Matt Ryan went 24-of-34 for 342 yards. He was clutch all evening on third downs, going 7-of-14 in those instances. ",
            "6": "Julio Jones (5-129) and Roddy White (7-118) performed well despite battling a tough secondary. Jones also looked good on an 8-yard carry in the second half. ",
            "7": "Michael Turner had a rare quality outing, rushing for 102 yards and a touchdown on 20 carries. He had a 43-yard burst at the end of the third quarter, taking advantage of the hobbled Jay Ratliff. Yes, the Cowboys have suffered yet another defensive injury. Ratliff injured his ankle in the second quarter. He returned after halftime, but did not look like himself. On a related note, Falcons' defensive tackle Peria Jerry left the contest with a knee issue. Shocking, I know. For thoughts on Saints-Eagles, check out my updated "
        }
    },
    "numberOfGames": "12"
}