{
    "year": "2014",
    "week": "20",
    "Game 1": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "22"
        },
        "comments": {
            "amount": "7",
            "1": "What an amazing game. When the Packers led 19-7 with five minutes remaining, it seemed clear that they would prevail. Green Bay had dominated the entire afternoon, as Seattle couldn't muster anything at all on offense; in fact, its only score came on a fake field goal. Four minutes later, the Seahawks had established their first lead of the afternoon, taking a 22-19 advantage. The Packers were able to kick a game-tying field goal to send this contest into overtime, but Seattle won the coin toss and never relinquished possession, marching down the field and scoring the decisive touchdown on a 35-yard Russell Wilson pass to Jermaine Kearse. The Seahawks are going to the Super Bowl. The Packers are going to be kicking themselves for all of the blown opportunities they had in this contest. It began early when Aaron Rodgers threw an interception in the end zone, as Richard Sherman picked off a pass heading toward Davante Adams. After that, Green Bay had the following unforced blunders: - Following an overturned John Kuhn touchdown, Mike McCarthy opted to kick a field goal from the 1-inch line. Rodgers could've easily converted on a sneak. - McCarthy did the same exact thing on the ensuing drive that saw Rodgers miss Jordy Nelson by inches. McCarthy opted to send out Mason Crosby on the 1-yard line. His conservative play-calling left a whopping eight points off the board in the first quarter. - Brandon Bostick dropped the ball on an attempted onside kick at the very end of the game. Bostick just had the ball slip out of his hands. Had he hung on to it, the Seahawks wouldn't have gotten the one possession they needed to take the lead. - Ha Ha Clinton-Dix had a chance to intercept a pass on a two-point conversion following a Seattle touchdown that gave the Seahawks their first lead of the afternoon. Instead, the ball went right over his head and into the hands of Luke Willson. Had Clinton-Dix made the pick, Mason Crosby's 48-yard field goal at the end of regulaton would've clinched a trip to the Super Bowl for the Packers. - On Green Bay's game-tying drive, McCarthy opted not to call any timeouts. Time trickled off the clock, and Green Bay never really had an opportunity to score the go-ahead touchdown. ",
            "2": "It would be a mistake to concentrate on the Packers exclusively, given how awesome Wilson was at the very end. Wilson, at one point, was 2-of-9 for only 13 yards and a whopping three interceptions. Green Bay smothered him, as Julius Peppers and Clay Matthews put immense pressure on him. Wilson couldn't even scramble; he generated just two rushing yards in the opening half. Following intermission, Wilson was 12-of-20 for 196 yards, two touchdowns (one passing, one rushing) and an interception that wasn't his fault, as the ball deflected off Kearse's hands. Wilson also finished with 25 rushing yards on seven scrambles. The transformation was amazing; Wilson looked like Jake Delhomme in the first half, but was his usual clutch self when the game was on the line. A tearful Wilson was overcome with emotion during his post-game interview with Erin Andrews, who had to be relieved that she wasn't getting yelled at like she was at this time last year. <div class=dfpAdSlots> ",
            "3": "Kearse was one of the heroes because he caught the touchdown, but he was having a miserable afternoon prior to that reception, which was his first of the contest. Kearse, who was responsible for a pick, dropped several other passes. Doug Baldwin (6-106), who lost a fumble on a kickoff, led the team in receiving, but it's clearer than ever that the Seahawks have to address their receiving corps this offseason. That's exactly what I have them doing in my . ",
            "4": "Marshawn Lynch was awesome in what is likely to be his final game in front of the Seattle faithful. He rushed for 157 yards and a touchdown on 25 carries. He nearly scored on a 35-yard reception, but his foot was ruled to be out of bounds. Lynch couldn't get much early, being limited to 37 yards in the first half, but as usual, he had numerous tough runs following the break. ",
            "5": "As for the Packers, Rodgers began the game hot, but threw for only 63 yards in the second half. He showed some mobility early on, moving out of the pocket to find his receivers, but he rolled his ankle at one point and then began hobbling around. Rodgers' poor health was most apparent on the Packers' final drive of regulation when he limped out of bounds on a scramble and then eschewed running downfield despite having tons of room in front of him. Instead, he flipped the ball toward Eddie Lacy, who wasn't even looking for the pass. That missed opportunity ruined the final possession, as it put the Packers in a long-yardage situation, which they couldn't recover from. Rodgers finished 19-of-34 for 178 yards, one touchdown and two interceptions. The first pick was a great play by Sherman, who injured his arm in the second half. The other was a miscommunication with Cobb. ",
            "6": "Speaking of Cobb, he hauled in Rodgers' sole score and managed to lead the team with seven receptions for 62 yards. Jordy Nelson (5-71) and Richard Rodgers (4-35) were the only other Packers to catch more than one pass. ",
            "7": "Lacy, meanwhile, had some tough runs against Seattle's stout front. He mustered 73 yards on 21 carries, but the Seahawks did a great job on him following intermission; he was limited to just 16 rushing yards in the second half. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "The Colts have taken a step deeper in the playoffs each year in the Andrew Luck era, but there has been one constant: their inability to beat the Patriots. Indianapolis is now 0-4 versus New England, and none of the matchups have been remotely close. Luck simply had no chance based on how his defense played. Indianapolis' stop unit couldn't get off the field on third downs, as Tom Brady continuously hooked up with Julian Edelman for clutch completions. When Brady wasn't moving the chains, LeGarrette Blount was trampling the defense for long bursts on most of his carries. The Patriots were an unreal 12-of-18 on third downs, and some of those failures came late in the game when they stopped trying. As a result, New England won the time of possession by more than 15 minutes. ",
            "2": "The Colts need to bolster their pass rush, which is what I have happening in my . They got no heat on Brady at all, registering just one sack. Brady, as a result, finished 23-of-35 for 226 yards, three touchdowns and a pick, which was his only poor decision of the evening because he forced a ball to Rob Gronkowski when Edelman was briefly out of the lineup with a minor injury. Brady was fantastic. The completion percentage doesn't look good at first glance, but keep in mind that he endured four drops, all by different players. He could've enjoyed a much better statistical performance, but he was able to hand the ball off to Blount, who did most of the work for him. ",
            "3": "Speaking of Blount, the monstrous back abused the Colts once again, gashing them for 148 yards and three touchdowns on 30 carries. Blount ran like a truck on most plays, but showed some shiftiness and made some juke moves a man his size shouldn't be able to do. Blount abused a poor defense that needs to improve this offseason. ",
            "4": "The Patriots ran some trick plays with previously ineligible players once again. Some didn't work, but one produced a touchdown when Brady found left tackle Nate Solder on a short pass, and he saw the tackle lumber into the end zone. No word if John Harbaugh called in to yell at the officials some more. ",
            "5": "Brady's other touchdowns went to Rob Gronkowski (3-28) and fullback James Develin. Gronkowski, who had a drop, nearly secured a second touchdown, but was interfered with in the end zone. The official inexplicably didn't throw the flag even though the defensive back clearly had his arm wrapped around Gronkowski's mid-section. Edelman, meanwhile, logged nine receptions for 98 yards. <div class=dfpAdSlots> ",
            "6": "As for the Colts' offense, they just couldn't generate anything outside of one possession that featured a Vince Wilfork penalty on a third down and an amazing sideline catch by T.Y. Hilton, which Bill Belichick nearly challenged (he would've lost). Otherwise, Indianapolis couldn't get out of its own way. Luck missed Reggie Wayne on the first drive, which was a three-and-out. Joshua Cribbs muffed a punt when Indianapolis forced a three-and-out on its own, which led to a New England touchdown. The following possession saw Robert Herron screw up with two drops, and Adam Vinatieri was way wide right from 51 yards out. The Colts scored their sole touchdown after that to make it 14-7, but the Patriots posted 10 points right before halftime and after intermission. Before the Colts knew what hit them, it was 31-7 in the middle of the third quarter. Luck had to start forcing the issue, which led to a pair of desperate interceptions. ",
            "7": "Luck finished 12-of-33 for 126 yards and two picks. He didn't play well, but he wasn't as awful as his putrid numbers indicate. Some drops hurt him, and he didn't get the appropriate protection to help him maintain drives. He was just 5-of-14 for 37 yards and two interceptions following intermission when the game was mostly out of hand. ",
            "8": "Hilton was Indianapolis' leading receiver even though he had just one catch - the aforementioned sideline grab - which went for 36 yards. Coby Fleener (3-30) and Dwayne Allen (4-30) were the only other Colts to register more than 15 receiving yards. ",
            "9": "Daniel Herron had a nice yards-per-carry average - he tallied 51 yards on 10 carries - but the Colts just weren't in a position to run the ball all that much. Herron hurt his team with a couple of drops, including one near the end zone. The alien known as Zurlon Tipton (5-14) vultured a touchdown. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> <div class=dfpAdSlots> "
        }
    },
    "numberOfGames": "2"
}