{
    "year": "2014",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "The Chiefs entered this game as one of the hottest teams in the NFL. However, they were coming off a huge victory over the defending Super Bowl champion Seahawks and had the Broncos on the horizon. This game had trap written all over it, as the two anchors on <i>Pardon the Interruption</i> even spent a couple of minutes discussing the possibility of Kansas City having a letdown. As it turns out, the Chiefs came in cocky and overconfident. They didn't take the Raiders seriously whatsoever. They looked sluggish and dropped a game as a touchdown favorite as a result. They're now 7-4, so if they don't beat Denver next week, they'll be in an extremely tough bind in terms of contending for a wild card spot. ",
            "2": "Kansas City was especially sluggish in the first half. Alex Smith was 8-of-19 for only 48 yards at one point, while the defense was miserable, surrendering a 90-yard touchdown run to someone named Latavius Murray. The Chiefs are actually lucky that Murray suffered a concussion and had to leave the game in the second quarter because they had no answer for the explosive back, who tallied 112 yards and a pair of scores on just four carries. The Chiefs had more success getting the Raiders off the field once the two aging running backs, Darren McFadden (12-29) and Maurice Jones-Drew (3 carries, -1 yards), started touching the football. Kansas City consequently came back from a 17-3 deficit, as Alex Smith caught fire, completing 10 passes in a row. However, some bad coaching - Jamaal Charles didn't touch the ball once during a drive in which his team kicked a field goal instead of scoring a touchdown, and then Andy Reid didn't challenge a Derek Carr sneak that was short of the first-down marker - as well as a drive lasting 7:21 featuring strong running by Marcel Reece (8-37), allowed the Raiders to re-take the lead and win their first game of the season. ",
            "3": "Smith was very inconsistent. As mentioned, he was horrible early on. His throws were low and behind his targets, and Kansas City, as a result, averaged a hideous 3.3 yards per play during the first half. Smith, however, finished 20-of-36 for 234 yards and two touchdowns. He was on fire during a portion of the second half, but his limitations were pretty prevalent on a failed final drive despite that the Raiders began celebrating early, allowing a big return and nearly getting whistled for being way offsides prior to the final play of the game. ",
            "4": "Charles didn't have the big game everyone was expecting. He touched the ball only 23 times, which is simply unacceptable. He had 19 carries go for 80 rushing yards, but he at least scored a touchdown as a pass-catcher, logging four grabs for 42 receiving yards. Charles also should've drawn a pass interference in the end zone at one point during the second quarter, but the officials inexplicably didn't throw a flag. ",
            "5": "Yet another week, and yet another game in which no Kansas City wideouts scored a touchdown. Dwayne Bowe (3-42) led the group in yardage. Travis Kelce (4-67) outgained him, while Anthony Fasano (2-30) reeled in Smith's other touchdown. ",
            "6": "As for the Raiders, this was a Pyrrhic victory for them. They should have lost, as they have a better strength of schedule than the Jaguars. Many teams will be dying to trade up for Marcus Mariota, and now the Jaguars will be the fortunate franchise to acquire a boatload of picks. Check out my <a href=/draft2015.php>2015 NFL Mock Draft</a> for more. ",
            "7": "At least Oakland has its franchise quarterback, right? Jim Nantz exclaimed that the Raiders finally found their guy in Carr once this game was over. I wouldn't be too sure about that. Carr made some very nice throws in this contest, but he could have been picked at least five times. The Raiders were very unfortunate that the Chiefs dropped all of those potential interceptions, as a loss would have really helped them. Carr finished 18-of-35 for 174 yards and a touchdown. ",
            "8": "Carr's score went to James Jones (5-47). Oakland's leading receiver was Andre Holmes (5-55), while Mychal Rivera (1 catch, 8 yards) was a huge disappointment for his fantasy owners. ",
            "9": "Some Raider defenders worth mentioning are Sio Moore (12 tackles, 1 sack) and Khalil Mack. Both were part of a strong pass rush that put lots of pressure on Smith. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Browns",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "When Mike Smith blew a victory against the Lions in London, there was some speculation that he would be fired. The Falcons opted to keep Smith on, which seemed like a good decision amid Atlanta's winning streak. However, Arthur Blank and Thomas Dimitroff could be lamenting not letting Smith go in the wake of this latest defeat, as Smith once again bungled time management at the end of the game. The Falcons took over near midfield following a Brian Hoyer's interception with a couple of minutes remaining, and they were able to move into field goal range to attempt what appeared to be a game-winning kick. However, Smith inexplicably used timeouts instead of letting the clock bleed. The Browns, consequently, were able to preserve all three of their timeouts, which allowed them to easily move down the field and set up what turned out to be the true decisive field goal on the ensuing possession. The Falcons could easily be 6-5 right now, but Smith's horrible gaffes at the end of the Detroit and Cleveland games have really cost his team. Fortunately for him, the rest of the division sucks, so Atlanta is alive and well in the NFC South race. ",
            "2": "The Browns, meanwhile, had some coaching mistakes themselves. Mike Pettine screwed up right before halftime; he had his kicker attempt a 60-yarder, which would've been returned by Devin Hester had Mike Smith not called a timeout to ice the kicker (a strategy that has been proven futile; I guess Smith never got the memo). Seeing this, you'd think Pettine would either concede or have Brian Hoyer throw a Hail Mary, but he tried a 60-yarder again. It fell short for the second time, and Hester nearly took it back for the touchdown. Pettine also misused his third timeout at the very end of the game, but it didn't matter because Cundiff was able to seal the victory. Pettine, however, needs to make a decision on his starting quarterback, as Hoyer was terrible once again. He deserves credit for leading his team on the final drive, but the Browns shouldn't have even been in that position, as Hoyer threw two horrific interceptions late in the game. The first occurred in the red zone when Hoyer inexplicably drifted back 15 yards in the pocket and forced it to Josh Gordon. The second, which was also forced to Gordon, was carelessly lobbed downfield despite the fact that Hoyer was nursing a lead with only a couple of minutes remaining. Hoyer finished 23-of-40 for 322 yards and three interceptions (the other was underthrown in the first half). Johnny Manziel might be the better option, as Hoyer has been very sloppy with the football lately. He's a limited player, so he needs to be smarter and stop being so sloppy with the football. ",
            "3": "The big story entering this game was that Gordon would be on the field for the first time this year. Hoyer tried to get Gordon involved early by taking a deep shot to him, but he overthrew his No. 1 wideout. Gordon, however, converted a third down deep in his own territory and then proceeded to dominate. He was targeted a whopping 16 times. There were some good moments for him - he caught eight balls for 120 yards - but Hoyer's two second-half picks came while trying to force the issue to him. ",
            "4": "Gordon returning opened things up for the other players. Andrew Hawkins (5-93) and Miles Austin (6-64) both had solid outings, while both Isaiah Crowell (12-88, 2 TDs) and Terrance West (14-62) were able to run well. ",
            "5": "The Browns suffered another big blow to their defense in this game when safety Tashaun Gipson was carted off. Gipson led the NFL in interceptions heading into this weekend. ",
            "6": "Some quick stats for the Falcons: - Matt Ryan went 27-of-43 for 273 yards, two touchdowns, an interception that was forced into tight coverage, and a lost fumble. Ryan was under pressure all afternoon, as the three sacks he took is not indicative of the heat he faced. Paul Kruger had two sacks and a forced fumble, bringing Ryan down once for a loss of 12. - Ryan's touchdowns went to Julio Jones (5-68) and Jacquizz Rodgers. Roddy White led the team in receiving, catching nine balls for 96 yards. - Steven Jackson scored once, but he wasted his other 12 carries, finishing with just 34 yards. It's amazing that Mike Smith continues to waste downs by feeding the ball to such a decrepit player. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "If I didn't have a four-unit wager on the Buccaneers going, I probably would've had a kick watching this game. These two terrible teams took turns making dumb mistakes, as each appeared to be trying to upstage each other. Here's the rundown: Bucs: Kyle Fuller nearly picked Josh McCown on the first drive because of a miscommunication. However, he was actually intercepted, as he was ultimately picked as he threw the ball. Chris Conte made a one-handed grab. Tampa followed that up by giving Chicago a free first-and-10 by roughing the kicker (even though William Gholston rolled into the punter and barely touched him). Bears: Jay Cutler was strip-sacked, which led to a Tampa touchdown. Bucs: Speaking of that Tampa score, Mike Evans was whistled for taunting, which gave the Bears a very short field. Bears: Chicago did nothing with the short field position, as there was a dropped interception. Robbie Gould followed that up with a missed field goal, albeit from 54 yards. The Bears then allowed a completion to Vincent Jackson on a third-and-23. Bucs: McCown, who was nearly picked a second time just prior to halftime (a FOX announcer said, He better get down on both knees and be thankful that wasn't intercepted), lost a fumble on a strip-sack and then fired a pick on a high throw to Charles Sims. Both turnovers led to touchdowns. Thanks to a Vincent Jackson fumble (a terrible call by Walt Coleman, who failed to overturn it via replay because he was too senile to remember where he was) and several awful sacks by McCown allowed Chicago to clinch this win and cover. ",
            "2": "McCown had a miserable performance for the ages, going 25-of-48 for 341 yards, one touchdown, two interceptions and a lost fumble against one of the worst defenses in the NFL. His play made Jay Cutler look like a quarterback god even though he struggled as well. Cutler, who went 17-of-27 for 130 yards, a touchdown and a lost fumble, was booed heavily throughout the entire afternoon, particularly when Tampa dropped a potential interception of his on third down. He had some bad incompletions that weren't even close, and he was only able to generate 204 net yards of offense on just 3.6 yards per play. Chicago would have lost this game had its opponent not self-destructed. ",
            "3": "With Cutler struggling, Brandon Marshall (3-32) and Alshon Jeffery (3-22) struggled to get yardage, though the latter reeled in a touchdown. Martellus Bennett (4-37) led the team in receiving yards. ",
            "4": "Matt Forte was the only Chicago skill-position player to produce much, gaining 89 yards and two touchdowns on 23 carries. He also caught five balls for 23 receiving yards. ",
            "5": "As for the Buccaneers, two receivers eclipsed the century mark, and neither was Mike Evans. Jackson (5-117) and Murphy (6-113) were the players, though Evans (3-47) reeled in McCown's sole touchdown. ",
            "6": "Doug Martin returned to the lineup, but the Buccaneers still struggled to run the ball. He mustered just 27 yards on 11 carries, while Sims (6-22) didn't have much more success. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "1",
            "1": "Andy Dalton finally overcame his demons. Well, sort of. He still needs to win in the playoffs, but he at least was able to finally beat the Texans after dropping two postseason games to them earlier in his career. Dalton was stellar in this game despite several injuries to his offensive line. Andre Smith went out early with what appeared to be a torn tricep. His replacement, Marshall Newhouse, also left the game. This didn't bother Dalton at all, who continued to bounce back from that dismal Thursday night performance, going 24-of-35 for 233 yards, one touchdown and an interception. The pick was his only blemish, as he stared down his receiver, allowing to Johnathan Joseph to pick off the pass and take it back for six. Dalton appeared shell shocked by this... "
        }
    }
}