{
    "year": "2014",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "1",
            "1": "This was an extremely ugly game early on. Both teams made horrible mistakes, and there weren't any points scored until there were three minutes remaining in the second quarter. It was extremely frustrating to watch. Boring too, as the Panthers' owner showed us when he took a nice nap: "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Good teams tend to step up and achieve unlikely victories when their starting quarterback is out. The Cowboys are a good team, but Brandon Weeden was so terrible that they never had a chance. Dallas consequently dropped its second in a row, while Arizona maintained the best record in the NFL, improving to 7-1. Words can't describe how awful Weeden was. His poor numbers don't even do his epic failure of a performance any justice. He went 18-of-33 for 183 yards, one touchdown (in garbage time) and two horrible interceptions. The first occurred in the red zone on a pass thrown way behind Jason Witten. The second was a complete misfire. Weeden did some other awful things. He took a bad sack because he held on to the ball too long, which forced a longer field goal that was blocked. Many of his throws were off the mark. He also didn't see open receivers. For example, he had Cole Beasley to move the chains on a third down during the second half, but just couldn't find him. Weeden couldn't connect with Dez Bryant either, and as a consequence, Bryant spent the afternoon pouting on the sidelines. The frustrated Bryant didn't catch a single ball in the first half, though that was partly his fault because he had a drop. Bryant later snatched an insignificant score. It was one of two catches (15 yards) that he had on the afternoon despite being targeted a whopping 10 times. ",
            "2": "Only one Cowboy had more than two catches. That was Witten, who hauled in six balls for 62 yards. And other than Witten, only Lance Dunbar (2 catches, 52 yards) logged more than 19 receiving yards. That's how pathetic Weeden was. The Cowboys will desperately need Tony Romo back in the lineup, even against the lowly Jaguars in London. Dr. Jerry Jones may clear Romo for action in response to this utterly embarrassing defeat. ",
            "3": "For the first time in 2014, DeMarco Murray failed to rush for 100 yards. He managed just 79 yards on 19 carries, and he was stuffed on a crucial fourth-and-1 in the final quarter. Murray simply didn't have any running room against a stalwart Arizona front that played close to the line of scrimmage because it just didn't respect Weeden. ",
            "4": "On top of losing this game, the Cowboys saw two of their key defenders go down. Tyrone Crawford sustained an MCL injury, while Rolando McClain also hurt his knee. It's sounding like McClain could be fine for next week's game, but Crawford could be out a while. ",
            "5": "Carson Palmer looked like he wanted to give the game away early on. He almost threw an interception on the first play of the game and then he was pick-sixed by someone named Tyler Patmon, whom Palmer didn't see drop into coverage. Palmer's teammates let him down after that, as the Cardinals dropped numerous passes throughout the afternoon. That was the only reason the Cowboys were able to stay within striking distance for a while, but Arizona eventually got its act together and was able to ultimately prevail by double digits. Palmer finished 22-of-34 for 249 yards, three touchdowns and his pick-six. His receivers came through following intermission, which would explain why Palmer was a nearly flawless 11-of-14 for 111 yards and one score in the second half. ",
            "6": "Arizona's leader in targets wasn't Larry Fitzgerald - though he paced the team with five grabs and 70 receiving yards - nor was it Michael Floyd (4-36). That player happened to be John Carlson, though the tight end snagged just two of his eight targets for 19 yards and a touchdown. He dropped three balls. ",
            "7": "Andre Ellington had a huge afternoon. He nearly gained 100 yards, mustering 95 yards on 21 carries. He also had four catches for 39 receiving yards and an aerial touchdown. Unfortunately, Marion Grice vultured another potential touchdown of his on the ground. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Editor's Note: Blake Bortles wasn't terrible, Toby Gerhart didn't look like he was running at 2 mph, and Allen Hurns actually caught passes. And yet the Jaguars still lost by double digits. On the bright side, they actually covered the spread! ",
            "2": "The Bengals were ripe for a letdown after a big win over Baltimore last week and with a game against division rival Cleveland this coming Thursday. However, Cincinnati drew Jacksonville, and the Jaguars just don't have the talent to go on the road and beat a playoff-caliber team like the Bengals. Jeremy Hill and Mohamed Sanu came up with huge performances to lead an injury-depleted Cincinnati squad to the win. ",
            "3": "The Jaguars were fortunate to get on the board first as Bengals cornerback Terence Newman dropped interception deep in Jacksonville territory. Denard Robinson had a nice run, and Toby Gerhart (3-19 rushing, 3-49 receiving) converted a third-and-16 by breaking tackles and dragging defenders for the yards. That led to a field goal. The Bengals answered with a drive that featured a few completions to A.J. Green, a clutch reception by Cedric Peerman, a chunk run by Hill, and a 19-yard touchdown pass to Sanu. Cincinnati's next score was set up by Rex Burkhead, getting a piece of a punt to shorten the field. Dalton dropped in a rainbow to Sanu, who made an over-the-shoulder catch for a 32-yard gain to the 10-yard line. On the next play, Sanu recovered a fumble by A.J. Green to maintain the scoring opportunity that ended with a field goal by Andy Dalton. The Jaguars went three-and-out, thanks to a sack by Carlos Dunlap and Jaguars punter Bryan Anger had his second consecutive punt blocked, which Taylor Mays turned into a safety. Cincinnati could have broken the game open as Bortles had another interception dropped; this time by linebacker Emmanuel Lamur before the half. In the third quarter, Dalton went right back to Sanu for a 36-yard reception to the 11-yard line. Sanu (4-95) ran a great route and beat safety Josh Evans for the ball. Hill finished the drive with a short touchdown run. The Jaguars answered with Bortles throwing a 40-yard touchdown to Allen Hurns. Hurns had a step on Leon Hall, but the ball was underthrown, and Hurns had to adjust to make the reception in front of Hall. Dalton helped the Jaguars out with a poorly thrown ball that was picked off by Sherrod Martin. The Bengals' defense came up with a stop despite, once again, dropping an interception. That near-turnover was around Jacksonville's 20-yard line. Pacman Jones then returned a punt 31 yards to set up a 28-yard touchdown pass from Dalton to Green (3-44). Jacksonville fought back with an 18-yard touchdown pass to Hurns (7-112). He made a great adjustment to outfight Terrance Newman for the ball in the front of the end zone. In response, Dalton had a ball slip out of his hands, and linebacker J.T. Thomas III intercepted the ball after it ping-ponged off a helmet. A couple of plays later, Robinson (17-94) ran the ball into the end zone to close the lead to three. Just seconds later though, Hill ripped off a 60-yard touchdown run. Hurns then bailed out Bortles with a great catch over Hall to move the ball into Cincinnati territory, but Bortles' poor decisions came back to bite the Jaguars, as he threw a pass into a crowd of defenders in the end zone for an interception by George Iloka. That clinched the game for Cincinnati. ",
            "4": "Bortles completed 22-of-33 passes for 247 yards with two touchdowns and an interception. He really should have thrown three or four interceptions and has to improve his decision-making. ",
            "5": "Dalton completed 19-of-31 passes for 233 yards with two touchdowns and two interceptions. He also had bouts where he was careless with the football. ",
            "6": "The real star of the game was Hill, as he ripped off 154 yards on 24 carries with two touchdowns in his first NFL start. With Hill running that well, Cincinnati may decide to hold out Gio Bernard (hip) again on Thursday night. ",
            "7": "Defensively, Iloka played well for the Bengals. Dunlap got steady pressure on Bortles, while Margus Hunt beat Luke Joeckel for a sack on the final play of the game. The Jaguars received a nice performance from Sen'Derrick Marks. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Browns",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "The Browns prevailed by five, but this was an evenly played game that could have gone either way. Tampa actually outgained Cleveland by 30 net yards and may have pulled out a victory had the team not made some costly errors. This includes a blocked chip-shot field goal on the opening drive, some Mike Glenon turnovers, and a gift-wrapped touchdown to Cleveland when Gerald McCoy was inexplicably whistled for being offside on fourth-and-4 inside the 5-yard line. Of course, the Browns made some mistakes as well, most of which were Brian Hoyer's fault. Hoyer went 21-of-34 for 300 yards, two touchdowns and a pair of interceptions. Those numbers don't look terrible, but they're not indicative of his pedestrian afternoon. Hoyer's first pick was a horrible overthrow. He then missed an open Andrew Hawkins for a potential score by overshooting him. His next interception, which occurred shortly afterward, came off a deflection. Hoyer has simply not played well ever since All-Pro center Alex Mack was knocked out for the year. Hoyer was able to lean on a strong ground attack, but that hasn't been possible the past few weeks. Ben Tate once again absolutely had no running room, as he tallied just three yards on 10 carries. Terrance West took over as the primary ball-carrier as the afternoon progressed, and he was much more effective. West notched 48 yards on 15 attempts, and he also caught a 2-yard touchdown. He did a good job picking up some blitzes - including one on Hoyer's game-winning touchdown pass - so he might be Cleveland's starting running back going forward. ",
            "2": "Hoyer's two scores went to West and Taylor Gabriel (5-87). Andrew Hawkins led the team with eight targets, but couldn't convert many of them, logging three grabs for 34 yards. Hoyer simply couldn't connect with him; as mentioned, Hawkins missed out on a long touchdown because of an overthrow. Hoyer was also inaccurate on several other attempts to his speedy wideout. ",
            "3": "Glennon was also guilty of some bad misfires, and he was even worse than Hoyer. Barely completing half of his passes, Glennon went 17-of-33 for 260 yards, two touchdowns and a couple of picks, one of which occurred in the end zone that wasn't even close to his intended target. The other was an underthrow in which Joe Haden tipped the ball to Donte Whitner, who returned it deep into Tampa territory. Glennon also had a lost fumble that was nullified by a penalty, and he also held the ball too long on some occasions, taking sacks as a consequence. Despite Glennon's accuracy and pocket-presence issues, he had the team in position to potentially win the game at the end. He found Vincent Jackson near the Cleveland 30-yard line, but Jackson dropped it. A couple of plays later, on a fourth-and-1, Glennon connected with Mike Evans for a 9-yard gain, but the rookie wideout was flagged for offensive pass interference. That completely ruined the drive and allowed the Browns to take over and run the clock out. ",
            "4": "Evans had the pass interference gaffe, but otherwise had an outstanding afternoon. He reeled in seven of his 11 targets for 124 yards and two touchdowns. Jackson, meanwhile, snagged six balls for 86 yards, but he really cost his team by dropping that aforementioned pass. ",
            "5": "With Doug Martin out, Bobby Rainey was given most of the workload. He had some decent gains, totaling 87 yards on 19 carries. He also had a 34-yard reception on a screen, but the Buccaneers couldn't capitalize because of a missed 55-yard field goal. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "I've caught some flak for using big words like Pyrrhic, but that's the only word appropriate enough to describe this victory for the Eagles. They managed to beat the Texans by 10 points, but they lost two key members of their team in the process. The worse injury was suffered by DeMeco Ryans. The stud inside linebacker tore his Achilles and will be out for the season. The more-prominent player to go down was Nick Foles, who broke his collarbone. Foles was not off to a good start. He was 10-of-13 for 124 yards and had a touchdown, but he threw a pick-six because of a poor decision and took some bad sacks. One of those sacks resulted in a brutal hit, prompting Foles to walk off into the locker room, where he was diagnosed with his broken collarbone. Mark Sanchez entered the game and instantly drove down the field for a touchdown. He heaved a 52-yard bomb to Jeremy Maclin and then found Jordan Matthews for an 11-yard score. Sanchez did a good job of moving the chains for most of the afternoon, though he did make some mistakes. He threw two interceptions, although one wasn't his fault because it went right off Josh Huff's hands. However, the second pick was bad, as Sanchez tried to force the issue. He also had another potential interception heaved right at the defender. Having said that, Sanchez wasn't any worse than Foles was, finishing 15-of-22 for 202 yards, two touchdowns and the two picks. His numbers could've been much better, but Darren Sproles had a bad drop on what looked like a potential long gain. ",
            "2": "Both Foles and Sanchez threw one score each to Maclin, who once again put together a huge outing. He snagged six of his team-leading seven targets for 158 yards and the two touchdowns. As mentioned, Matthews (3-40) reeled in Sanchez's other score. Riley Cooper (2-26) once again did very little. ",
            "3": "LeSean McCoy had a somewhat disappointing fantasy outing. He managed to eclipse the century mark, gaining 117 yards on 23 carries. However, he had a touchdown vultured by Chris Polk (8-50), while many of the targets went to Sproles, who caught four balls for 46 receiving yards, doing a good job of slipping out of poor Houston tackles all afternoon. McCoy was able to manage just two receptions for six additional yards. ",
            "4": "Foles and Ryans weren't the only major players injured this game. Houston corners Johnathan Joseph and Kareem Jackson left with a concussion and a knee injury, respectively, while Arian Foster hurt his groin. Foster (15 carries, 56 rush yards; two catches, 63 receiving yards, one touchdown) was hobbling all afternoon and was in and out of the game as a consequence. However, he had to permanently leave the field when he got tripped up on a non-contact play, and he threw his helmet in frustration. If Foster can't play, Houston won't have any sort of chance against legitimate competition, as Alfred Blue (7-13) showed zero play-making ability. The Texans need Foster because Ryan Fitzpatrick is terrible. He failed to complete half of his passes against an anemic secondary, going 13-of-27 for 203 yards, two touchdowns and an interception that occurred when he was hit as he released the ball. Besides shoddy accuracy, Fitzpatrick's primary issue is holding on to the ball way too long in the pocket. He took too many horrible sacks as a result. ",
            "5": "Fitzpatrick's touchdowns went to Foster and DeAndre Hopkins, who torched Philadelphia's secondary. He snagged six of his 11 targets for 115 yards. Andre Johnson, on the other hand, had a very disappointing afternoon. He saw seven targets, but was able to reel in only two passes for 12 yards. Johnson had a chance for a deep catch in the third quarter, but Bradley Fletcher did a good job to knock the pass away. ",
            "6": "A big part of this loss was a missed 39-yard field goal by Randy Bullock. It occurred following a big gain from Hopkins, and Houston's inability to score any points off of that play took the wind out of its sails. The Eagles proceeded to march down the field for a quick touchdown drive, and the game was effectively over at that point. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Professional bettors thought this game would be close, but the Jets never really had a chance. The Chiefs effortlessly went down the field for three scoring drives in the opening half, and they even had luck on their side. Kansas City's second touchdown was a tipped Alex Smith pass that popped into the air and fell right into the arms of Anthony Fasano, who was on the ground. Fasano crawled into the end zone and put the Chiefs up by 14. Kansas City never relinquished its lead and held a double-digit advantage for most of the afternoon. Kansas City's defense took over in the second half, preventing the Jets from scoring a single point. Part of that was the quarterback getting hurt, but QBDK wasn't going to lead the Jets to victory anyway. While he made some nice plays - particularly one instance in which he eluded a sack and found Chris Johnson for a big gain - he was just too overwhelmed with pressure. Combine that with some red-zone ineptitude, and it's no wonder that New York didn't score at all following the break. QBDK wasn't awful though, as he went 21-of-28 for 196 yards and a touchdown to Eric Decker (9-63). He got hurt on a fourth-down attempt in the red zone on a play in which his team was flagged for offensive pass interference. He was able to enter the game later in the fourth quarter, but it was too late by then. Still, it was a reminder of how brittle QBDK is, and why teams simply can't rely on him to be a starter. Simms, by the way, did nothing in QBDK's absence, going 3-of-8 for 39 yards. ",
            "2": "Percy Harvin was the primary reason why the Jets were able to move the chains and enter the red zone on some instances. Harvin caught a whopping 11 balls for 129 yards, and he also had a good kickoff return at the end of the first half to set up the team in field goal range. It's obviously very encouraging that Harvin was able to be such a huge part of this offense despite being in New York for only two weeks. ",
            "3": "Chris Johnson complained about his usage this past week, and the Jets' coaching staff obviously listened. Johnson had more carries than Chris Ivory (11-8), and Johnson outgained Ivory, 69-22. CJ0K also caught two passes for 32 receiving yards. He actually looked decent for a change, but his troublesome antics during the week is exactly why bringing him into the team was a huge mistake. He's not nearly the player he once was, so his poor locker room attitude isn't worth it. The Jets, now 1-8, have to regret bringing him in, but it's not like they had the talent to win anyway. ",
            "4": "As for the victors, Alex Smith was very economical, going 21-of-31 for 199 yards and two touchdowns. He didn't make any mistakes, but then again, he didn't really need to force anything into New York's anemic secondary, who left receivers open all afternoon. I already mentioned that Smith somehow found Fasano for a fluke touchdown in the first half. Smith's other score was thrown to Travis Kelce, who led the team with 67 receiving yards off four receptions. Dwayne Bowe, meanwhile, paced Kansas City in both targets (10) and catches (6-55). Bowe logged his 500th-career reception in this contest. ",
            "5": "Jamaal Charles watched Priest Holmes become enshrined in the Chiefs' Ring of Honor at halftime. Charles will be there one day, but on this afternoon, he gained 78 yards and a touchdown on 20 carries. Those numbers don't look great in a vacuum, but they certainly are considering how great the Jets' run defense has been this season. ",
            "6": "Rookie De'Anthony Thomas had a nice afternoon. He had a great kickoff return that went 78 yards, and he also saw his sole carry go for a gain of 26. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "0"
        },
        "comments": {
            "amount": "4",
            "1": "I was told that the Dolphins planned on treating this game like their Super Bowl. It was their opportunity to prove how great they were by beating a highly regarded team, and they were treating the Jacksonville victory like a loss because of the fact that the Jaguars outplayed them and probably would've won if it wasn't for Blake Bortles' interceptions. Sure enough, the Dolphins came out fired up and jumped all over the half-asleep Chargers. They sacked Philip Rivers on the first play of the game and then stuffed the run on a fourth-and-1 attempt by San Diego on the same drive (following some impressive third-and-long conversions by the Chargers). The Dolphins later picked off Rivers, as he couldn't step up in the pocket amid pressure. Rivers' scoring unit was limited to just five first downs in the opening half. Meanwhile, Miami's offense moved the chains very effectively, tallying 282 total yards by intermission. Everyone was playing well, as Mike Wallace hauled in a great catch, while Jarvis Landry made a nice juke to pick up extra yardage on one play. Ryan Tannehill, meanwhile, was 18-of-25 for 208 yards and a touchdown heading into halftime. The Dolphins continued their onslaught after the break and were able to maintain their shutout. They swarmed Rivers' pocket, forcing three turnovers by the San Diego quarterback, who took four sacks and had absolutely no time to throw. Tannehill, meanwhile as pretty much flawless. He misfired on just three throws following intermission, and one of those errant tosses was a Charles Clay dropped touchdown. Tannehill finished 24-of-34 for 288 yards and three touchdowns. He had only one or two poor passes - one of which was a missed heave to Wallace in the end zone - but was very strong overall. He also did some damage on the ground, rushing for 47 yards on four scrambles. ",
            "2": "Tannehill's scores went to Clay (5-65), Landry (5-46) and Rishard Matthews. Wallace and Brian Hartline tied for second with 50 receiving yards each. ",
            "3": "The one dark cloud over this victory was Lamar Miller's shoulder injury. Miller was knocked out during the third quarter. He didn't run the ball very much as a consequence, tallying 49 yards and a touchdown on only 11 carries. ",
            "4": "Some quick stats for the Chargers: - Rivers was an atrocious 12-of-23 for 138 yards, three interceptions and a lost fumble (strip-sack). He just had no chance because his offensive line couldn't stop Miami's pass rush. The first pick occurred when Rivers couldn't step into the pocket amid a fierce pass rush. The second was forced into double coverage. The third was just a careless heave when the game was way out of hand. - Branden Oliver had no running lanes to burst through. He mustered just 19 yards on 13 carries, and many of his runs were negative plays. His offensive line really let him down. - Keenan Allen led the Chargers with nine targets, but caught only four of them for 47 yards. Malcom Floyd (4-60) and Antonio Gates (3-28) were the only other Chargers to reel in more than one reception. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "26"
        },
        "comments": {
            "amount": "6",
            "1": "There was a lot going against the Redskins entering this game. They were coming off an emotional victory over their arch rival on Monday night. There were murmurs that there was dissension in the locker room, as Robert Griffin apparently alienated some players, who wanted Colt McCoy to start again. The Redskins' team bus also got into an accident on the way to the stadium, which must have served as a distraction. Despite all of these factors, it wouldn't be fair to discredit the Vikings, who legitimately won this game. They outgained the Redskins and achieved more first downs. And they managed to pull out a victory despite two horrific calls by official Gene Steratore in the second half. Teddy Bridgewater helped his team overcome Steratore, as he was brilliant in the second half. It was not pretty early on, however, as Bridgewater missed a wide-open Cordarrelle Patterson downfield by a mile, prompting Patterson to raise his arms in frustration as a result. Bridgewater then couldn't connect with an open Patterson yet again, but this time it was an underthrow. Bridgewater was nearly picked after that, as cornerback David Amerson bobbled the ball while falling out of bounds. Bridgewater then didn't show enough awareness when he failed to realize that he could run for a first down deep in Washington territory. Instead, he threw it out of bounds on a fourth down. I was prepared to compare Bridgewater to Matt Leinart or Brady Quinn again, but the Louisville product was unstoppable following intermission. He was 9-of-14 for 120 yards in the second half, and he also picked up 20 yards on the ground. He came up with big throws while leading his team down the field on three touchdown drives after the break. Bridgewater was 26-of-42 for 268 yards and a score overall. The touchdown went to Chase Ford (5-66) following a Robert Griffin interception. Greg Jennings (6-76) was the only Viking with more receiving yardage than Ford. He should've picked up a defensive pass interference, but there was no call even though he was being tackled before the ball reached him. ",
            "2": "Meanwhile, Patterson failed to do anything all afternoon, reeling in just one of his seven targets for nine yards. As mentioned, Patterson's struggles weren't really his fault (excluding a drop); Bridgewater just couldn't connect with him on some potential big plays downfield. Bridgewater will need to convert those passes if he wants to take the next step. ",
            "3": "Before moving on to the Redskins, I have to say that I feel sorry for Jerick McKinnon fantasy owners. McKinnon gained 54 yards on 14 carries and watched Matt Asiata vulture a whopping three touchdowns. Asiata plodded for 26 yards on 10 attempts. ",
            "4": "As for the Redskins, Griffin had an up-and-down afternoon in his first game back since Week 2. He started by impressively by escaping a sack and completing a pass for a nice gain. He then found DeSean Jackson for a 45-yard gain in double coverage. Griffin followed that up with a poor decision when he fired a pick off his back foot. There was more of the same from Griffin in the second half. He led some scoring drives, though he was aided by a horrible call on Harrison Smith, who was flagged for hitting Griffin as he slid feet-first. Smith, who had a tremendous performance, barely even touched Griffin. It was a truly awful penalty that allowed Griffin to keep the drive alive and ultimately lead his team into the end zone. However, Griffin took some bad sacks and couldn't get anything going on the team's final drive as a consequence. He was also hesitant to run on a crucial fourth-and-6, hurling a low throw instead, turning the ball over on downs. Griffin finished 18-of-28 for 251 yards, one touchdown and a pick. He also picked up 24 rushing yards on seven scrambles. The important thing is that he finished this game unscathed, but there was a scary moment in the first half when he was sacked. He was bent backward awkwardly and limped around for a bit. He was fine, however. ",
            "5": "Griffin's sole aerial score went to DeSean Jackson, who totaled four catches for 120 yards. Jackson made a great reception in double coverage during the first half. Pierre Garcon (3-15) struggled once again. ",
            "6": "One player who must be happy that Griffin is back on the field is Alfred Morris, who was able to find some running room for a change. With the Vikings concerned about Griffin running around, Morris was able to rush for 92 yards and two touchdowns on 19 carries. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Rams",
            "Points": "13"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The 49ers are playing like crap. Of course, that goes without saying, based on the final score, but they put together an absolutely dog performance against the Rams. This was actually a big test for San Francisco. With a week off, the team had an opportunity to shore up all of its issues. The offensive line has been a big problem, yet the coaching staff couldn't fix the unit. In fact, the front even looks worse than it did before. Colin Kaepernick was sacked on eight occasions, including a whopping six times in the first half. The fifth sack that he took, by Robert Quinn, resulted in a lost fumble. Kaepernick simply had no chance with zero protection in front of him. In addition to the poor blocking, the 49ers hurt themselves with a complete meltdown in the fourth quarter. They were flagged for a personal foul on a punt return. Following a pair of false starts that pinned them inside their own 3-yard line, Kaepernick took a sack that was nearly called a safety. Andy Lee then shanked a punt, setting up the Rams for their game-winning field goal. Despite all of this, San Francisco still had a chance to win this game at the very end. Kaepernick moved the team inside the St. Louis 5-yard line, thanks to a tough catch by Anquan Boldin. Michael Crabtree caught a pass that appeared to be a touchdown, but Jerome Boger didn't rule it to be so because he isn't aware of what the NFL rules are. Crabtree clearly had possession over the goal line, but Boger was too incompetent to realize that. Boger then screwed up again; Kaepernick fumbled the snap on an attempted quarterback sneak, which was recovered by James Lauriniaitis in the end zone for the game-sealing touchback. However, replay showed that Kaepernick's elbow was down. Boger once again botched the call. Boger was once again an embarrassment - it seems like he screws up every week - but that doesn't excuse the 49ers for losing. They were a double-digit favorite, and if they were any good, they would've taken care of business. They'll get some defenders back soon, but if they can't block for Kaepernick, it won't matter at all. ",
            "2": "Kaepernick went 22-of-33 for 237 yards, a touchdown and two lost fumbles. Those numbers aren't bad, but they would've been so much better if he had decent protection. That said, Kaepernick had a couple of close calls on potential interceptions, including one in the first quarter when he telegraphed a ball that was dropped by LaMarcus Joyner. Kaepernick's score went to Boldin, who had a big game. He was one of the few outstanding San Francisco players on this side of the ball; he reeled in six of his seven targets for 93 yards and the touchdown. Crabtree (5-40) and Vernon Davis (2-19) both disappointed. ",
            "3": "I mentioned that Boger screwed up San Francisco's chances late in the game. Boger was an equal-opportunity incompetent official Sunday afternoon, as he completely botched a call in the second quarter. Frank Gore (14-49) clearly fumbled the ball, which was recovered by the Rams and taken the other way for a touchdown. However, Boger's crew ruled the play dead and incorrectly said that Gore's forward progress was stopped. Jeff Fisher looked like he wanted to murder the refs with his bare hands. ",
            "4": "I'm sure Fisher feels better now that his team won. This was despite some very shaky play by Austin Davis, who went 13-of-24 for only 105 yards, one touchdown and two interceptions. Davis' picks were both underthrown, as he panicked in the pocket while under pressure. He was better in the second half, completing 6-of-9 attempts, but for only 31 yards. Davis looked like he would have to leave the game early when he came up hobbled after sliding awkwardly, but he was fine. ",
            "5": "Tre Mason and Benny Cunningham split touches. Mason handled most of the carries (19-65), as Cunningham was given just four attempts for 10 yards. However, Cunningham was the primary pass-catching back. He actually led the team with three catches and 38 receiving yards. Kenny Britt (2-32) caught Davis' sole touchdown. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "When Sal Paolantonio was doing his pre-game report in the falling snow and gusting wind Sunday morning, it was definitely a sign that things wouldn't go well for Peyton Manning. The future Hall of Famer has never done well in frigid weather and snow, and he has owned an abysmal record in Foxboro. The Patriots, who were field-goal underdogs entering this contest, triumphed with a blowout victory, as Manning most definitely did not play his best game, as expected. Tom Brady, conversely, was mostly flawless. Things didn't look promising for him early, as he passed behind Brandon LaFell and then overthrew an open LaFell for a potential touchdown. LaFell paid Brady back by dropping a score. However, Brady turned into a machine afterward, effortlessly completing passes for decent gains against one of the NFL's top defenses. Brady finished 33-of-53 for 333 yards, four touchdowns and an interception - outstanding numbers considering the wind he was battling. The pick came in the third quarter in what was a rare mistake; Brady panicked in the pocket amid pressure and heaved a high pass that was snatched by rookie corner Bradley Roby. The Broncos bounced back with a touchdown after that, and it appeared as though Denver would have a chance to get back into the game, but the Patriots responded with 10 unanswered points, going up 37-14, which Denver simply couldn't recover from. ",
            "2": "Brady's four touchdowns all went to different players, and all four saw 10-plus targets each thrown their way. Rob Gronkowski was the team's leader in receiving, registering nine catches for 105 yards. Gronk was a monster, and the Broncos, who have struggled against tight ends this year, had no answer for him. One of the highlights of this game was a Gronkowski reception in the fourth-quarter, which was a one-handed catch on a pass thrown way behind him. Gronkowski landed at the 1-yard line, and following a failed challenge by Bill Belichick, Brady hit Gronkowski fo a touchdown, as the big tight end beat Von Miller. Brady's other three scores went to Julian Edelman (9-89), LaFell (6-53) and Shane Vereen (5 catches 38 yards). LaFell just missed out on a huge statistical outing, as Brady missed him for a long touchdown, and then he dropped a pass in the end zone. He also let a pass fall through his hands in the second half. Edelman, meanwhile, also had a score on an 84-yard punt return. He nearly had a second offensive touchdown, but the ball slipped out as he rolled on the ground. ",
            "3": "The Patriots didn't run the ball very well despite their massive lead throughout the evening. Jonas Gray (12-33) couldn't get anything, while Vereen (11 carries, 29 rush yards), did most of his damage in the passing game. ",
            "4": "Denver couldn't establish much of a ground attack either. The team ran all over New England last year, but that wasn't the case in this matchup. Ronnie Hillman couldn't even get two yards per carry, as he was limited to just 16 yards on 10 attempts, though he did score a touchdown. A runner of Knowshon Moreno's ability and talent is sorely missed. ",
            "5": "With no ground attack to support him, Manning struggled to cut the ball through the fierce wind. He threw a touchdown early, but needed a ticky-tack pass interference in the end zone on third down to do so. After that, Manning heaved an interception right to Rob Ninkovich and followed that up with a near-pick that Wes Welker had to break up. The Broncos opted to go for it on fourth down on their next possession, but Akeem Ayers sacked Manning. Manning picked up some garbage yardage late in the game. His second interception wasn't his fault, as it bounced off Welker's hands. Welker got hurt on the play, as it looked like a bit of karma after he knocked Aqib Talib out of the AFC Championship with what Bill Belichick called a very dirty hit. Manning ultimately finished 34-of-57 for 438 yards, two touchdowns and a pair of interceptions. Once again though, a bulk of his yardage came late when the game was out of reach, as John Fox foolishly left his starting offense in the game too long. He's very fortunate that Welker was the only offensive player of his to get hurt. ",
            "6": "Manning's two touchdowns went to Hillman (7 catches, 47 rec. yards) and Julius Thomas (2-33). Thomas saw just two targets go his way, as Belichick made it a point to shut down Denver's athletic tight end. ",
            "7": "Two Denver wideouts eclipsed the century plateau: Emmanuel Sanders (10-151) and Demaryius Thomas (7-127). Manning missed Sanders on some long completions, while Thomas was standing on the sideline during one drive during the second quarter, which was very strange. That was obviously temporary, as 83 of Thomas' 127 yards came after intermission. Welker, meanwhile, saw eight targets go his way, but managed to reel in only three of them for 31 yards before leaving the game with a back injury. ",
            "8": "Not that it mattered in terms of the result, but the Broncos' new kicker, Brandon McManus, whiffed on a 41-yard field goal, which doinked off the right upright. McManus, now only 6-of-9 on the season, has hardly been an adequate replacement for Matt Prater, who probably shouldn't have been released several weeks ago. ",
            "9": "Adding more injury to insult, Broncos' linebacker Nate Irving was knocked out of the game with a knee injury. It did not look good, as he had to be helped off the field. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "Editor's Note: How convenient that the Raiders were able to get the backdoor cover in the second half. No one possibly saw that coming! ",
            "2": "Beating the Raiders by six could be another sign that Seahawks are not the championship caliber team they were a year ago, but keep in mind that last year, Seattle won in overtime at home against a winless Tampa Bay team in the middle of the year. This win saw Seattle improve to 5-3, but the Raiders showed a lot of heart as they made a big comeback to almost knock off the Seahawks in Seattle. ",
            "3": "The Raiders ripped the Seahawks in the preseason, and this contest started well with Derek Carr and Darren McFadden (13-20 rushing, 4-47 receiving) leading a field goal drive after the opening kickoff. The Seahawks came back with some runs to Marshawn Lynch. A 36-yard pass interference penalty on D.J. Hayden set up the Seahawks at the Raiders' 6-yard line. Lynch finished the drive with a power run, moving a pile from three yards out for a touchdown. The Seahawks added to their lead when linebacker Bruce Irvin tipped a pass up in the air. He came down with the ball and sprinted down the field for a 35-yard touchdown. Carr gave the ball right back as Richard Sherman picked off a back-shoulder throw intended for Andre Holmes (2-28). That spotted Seattle a field goal. Just before the half, the Seahawks drove down the field again. They were aided by a taunting penalty on Hayden, and Lynch scored from five yards out. The Seahawks had a 24-3 lead at the half. In the third quarter, Hayden dropped an interception that should have been a pick-six as he jumped a route. On the very next play though, Denico Autry blocked a punt and the ball rolled about 25 yards into the end zone before Brice Butler recovered it for a touchdown. The Raiders got going with a punt return by T.J. Carrie to the Seahawks' 30-yard line. A 23-yard pass to McFadden moved the ball inside the 10. On fourth-and-goal at the 1-yard line, Mychal Rivera (8-38) made a tremendous leaping catch for a touchdown. And just like that, Oakland was surprisingly down by just seven. The Seahawks responded with a 39-yard pass play to Lynch, who rumbled down the field, but the drive stalled, and Seattle had to settle for a field goal. Doug Baldwin then returned a punt 38 yards. Wilson scampered for 19 to convert a third down to set up another field goal. The Raiders got a drive going thanks to a face mask on Michael Bennett and a pass to Maurice Jones-Drew inside the 10-yard line. On third-and-goal just after the 2-minute warning, Carr connected with Rivera (8-38) for another touchdown off a play-action bootleg. It was close, but Seattle recovered the onside kick to preserve the victory. ",
            "4": "Wilson finished completing 17-of-35 passes for 179 yards. Marshawn Lynch had a huge day as Seattle's leading rusher with 21 carries for 67 yards and was the leading receiver with five receptions for 76 yards. The Seahawks' receivers gave them very little, as Doug Baldwin (5-38), Paul Richardson (3-12) and Jermaine Kearse (1-4) were all held in check. ",
            "5": "Carr completed 24-of-41 passes for 194 yards with two scores and two picks. ",
            "6": "Defensively, Seattle got big games from K.J. Wright (13 tackles, 1 pass batted), Cliff Avril (1 strip sack), and Richard Sherman (1 interception, 1 forced fumble, 3 tackles). For the Raiders, rookie defensive tackle Justin Ellis was impressive along with Sio Moore and Khalil Mack. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers were out to prove that their stunning victory over the Colts last week wasn't a fluke, all while trying to avenge their humiliating Week 2 loss to their arch rivals. Mission accomplished. Pittsburgh absolutely dominated this contest, outgaining Baltimore by more than 100 net yards in meaningful action and averaging greater than a yard per play. The score was 36-17 before a late Baltimore touchdown in garbage time following a Ben Roethlisberger fumble snap, though Pittsburgh came back with a late score of its own. Speaking of Roethlisberger, Pittsburgh's quarterback was on fire once again. Things looked bleak early when he was constantly under siege - he was even sacked on three consecutive plays - but things began to click in the second quarter, when Roethlisberger threw three of his six touchdowns of the evening. He went 25-of-37 for 340 yards and the six scores overall. It's amazing how well Roethlisberger is playing right now. In the past two weeks, he's a combined 65-of-86 for 862 yards and 12 touchdowns. That's utterly ridiculous, and credit needs to be given to a young receiving corps that has stepped up. Markus Wheaton has been better (2 catches, 62 yards, TD), but Martavis Bryant has been the catalyst. The 6-foot-4 wideout has become a great end-zone target, and he scored twice more Sunday night. He logged three catches for 44 yards in addition to the two touchdowns. ",
            "2": "Of course, Antonio Brown was once again unstoppable. With top Baltimore corner Jimmy Smith out, Brown wreaked havoc on the opposition, accumulating a whopping 11 receptions for 144 yards and a touchdown. He also drew a pass interference flag. Brown's score was a thing of beauty, as he got into space and made several Ravens miss. ",
            "3": "The Steelers did not run the ball very well. LeGarrette Blount and Le'Veon Bell each had 10 carries for 23 and 20 yards, respectively. Bell made up for it with five catches for 38 receiving yards and a touchdown. Blount, meanwhile, had an eventful evening. He had a minimal gain on a short carry in the third quarter when Terrell Suggs made a horribly dirty hit, going for the back of the big back's knees. A fight ensued, and Suggs was whistled for a personal foul. Blount later drew another flag of the same sort of Elvis Dumervil, prompting the official to stop the game and threaten both coaches that they would eject players. This calmed everyone down until Raven tight end Crockett Gilmore spiked the ball after a touchdown that made the game 36-23 with three minutes remaining, prompting the crowd to chant Ravens suck! Ravens suck! And as if there wasn't enough bad blood, Pittsburgh ran up the score when Roethlisberger went play-action and hit Matt Spaeth for a touchdown, up 13 with just two minutes remaining. This incited yet another skirmish that resulted in more personal-foul flags. It was a classic Baltimore-Pittsburgh battle. ",
            "4": "While Pittsburgh's offensive has made great leaps recently, the defense looked improved in this contest. The unit was able to put great pressure on Joe Flacco. It sacked him four times, but that number easily could've been twice as much. James Harrison, who was retired slightly more than a month ago, was a monster Sunday evening, registering two sacks. Unfortunately, the Steelers lost Ryan Shazier and Troy Polamalu to injuries. Flacco was able to compile some junk yardage to make his numbers look better - 30-of-45, 303 yards, two touchdowns, one interception - but he struggled to complete half of his passes during meaningful action. In fact, he was just 9-of-17 going into halftime. Flacco simply had no time to throw; his pick came when he was under pressure. He heaved up a desperate pass that was picked off, and the Steelers capitalized with one of Roethlisberger's aerial scores. ",
            "5": "With the pressure he was facing, Flacco had to constantly dump the ball off to Justin Forsett, who led the team with 67 receiving yards off five catches. Torrey Smith was next (4-63), and he snared one of Flacco's touchdowns. He also drew a pass interference. Meanwhile, Steve Smith didn't do much (5-36), though he saw eight targets go his way. ",
            "6": "Forsett didn't nearly have as many rushing yards, as Pittsburgh's front did a great job of stuffing the run. Forsett mustered just 38 yards on nine carries, but on the bright side, he received a goal-line carry late in the game. He didn't convert, but he was at least given an opportunity, which bodes well for the future. Lorenzo Taliaferro (7-21) lost a fumble in the second quarter, which, in addition to a play in which Baltimore's defense committed three penalties, helped spark the Steelers to get on the scoreboard for the first time. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Colts",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Giants got off to a slow start this season because they couldn't stop shooting themselves in the foot with mistakes. They cleaned things up during their winning streak, but their problems resurfaced Monday night in a massacre that wasn't nearly as close as this final score indicates. The Colts led 40-10 at one point, and they could've named whatever score they wanted to had they not taken their foot off the gas. New York probably could have been competitive if it didn't wreck itself with horrible errors all evening. These included: - Numerous drops. Preston Parker had three himself. Odell Beckham and Rueben Randle both had drops as well. All of these occurred in the first half, which would explain why Eli Manning was able to complete just 9-of-23 attempts by intermission. - The Giants surrendered their first touchdown of the game because they weren't prepared for Indianapolis' snap. Coby Fleener made a reception along the sideline that eventually hit the ground. Tom Coughlin waited too long to challenge, as he had to bend all the way down and reach into his sock. He tossed the flag, but it was after the Colts ran their play. Andrew Luck was consequently able to find a wide-open Coby Fleener for a touchdown. - Manning, who was partly responsible for a delay of game following a kickoff, lost a fumble in the second half amid heavy pressure. The Colts recovered the ball and returned it to the 5-yard line, and this was followed by a Luck-to-Dwayne Allen touchdown. - Andre Williams also fumbled, but was lucky to have his teammates pounce the ball deep in his own territory. - Antrel Rolle dropped a potential Luck interception in the second quarter. ",
            "2": "Adding injury to insult, the Giants lost a couple of key players in this game. Prince Amukamara left with a torn bicep and is likely done for the year. This hurt an already-thin secondary that didn't have Dominique Rodgers-Cromartie at full strength. Guard Weston Richburg had to be carted off with an ankle injury in the second half. ",
            "3": "The Colts also had their issues early on. For example, Hakeem Nicks, making his return to New York, dropped a pass on a third down, and then Ahmad Bradshaw had a ball slip through his hands on a screen. Luck, meanwhile, had issues with the Giants' blitz schemes. He was uncharacteristically inaccurate in the first half, going 17-of-31 prior to the break. He dealt with heavy pressure, particularly from Robert Ayers, who had a monster of a game. Luck ended up 25-of-46 for 354 yards and four touchdowns overall. He continued to miss some passes in the second half he'd normally hit, and he also didn't see Ahmad Bradshaw, who was open for a potential score, so the Colts need to do a better job of protecting him. ",
            "4": "Luck's four touchdowns all went to different players: Fleener (4-77), T.Y. Hilton (3-71), Reggie Wayne (4-70) and Allen (4-48). The Hilton touchdown was most impressive. It appeared as though Rodgers-Cromartie had an interception in the end zone, but the shorter Hilton jumped up, grabbed the ball in mid-air and wrestled it away from the Giants' corner, who could do nothing but shake his head in disbelief. Nicks, meanwhile, had three catches for 44 yards in his first game against his former team. ",
            "5": "Nicks wasn't the only former Giant who made his first return to the Meadowlands. Bradshaw led the team in rushing with 50 yards despite getting only seven carries. He had some impressive runs, and as mentioned, he could've had an aerial score had Luck seen him completely wide open after he leaked out of the backfield. Trent Richardson, meanwhile, tallied 33 yards on seven attempts. He didn't look bad, but Bradshaw was the superior player. ",
            "6": "Some quick numbers for the Giants: - Manning finished 27-of-52 for 359 yards, two touchdowns and the lost fumble, but don't be fooled by those numbers. Most of his positive stats came in garbage time when the Colts played a relaxed prevent. - Andre Williams looked terrible once again. Gaining 22 yards and a touchdown on 12 carries, Williams is nothing but a slow plodder. He showed some explosion on a rare reception that went for 24 yards, but that was pretty much his only positive play. The Giants really need Rashad Jennings back. - Beckham dropped a pass early, but had a big second half. He reeled in eight catches for 156 yards. All but one reception came following intermission. He's the one silver lining in this loss, as it's apparent that he's going to be a big-time receiver. - Randle, meanwhile, snared just four balls for 49 yards. Vontae Davis, who was knocked out early against the Steelers, shut him down. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "13"
}