{
    "year": "2014",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "The Chiefs entered this game as one of the hottest teams in the NFL. However, they were coming off a huge victory over the defending Super Bowl champion Seahawks and had the Broncos on the horizon. This game had trap written all over it, as the two anchors on Pardon the Interruption even spent a couple of minutes discussing the possibility of Kansas City having a letdown. As it turns out, the Chiefs came in cocky and overconfident. They didn't take the Raiders seriously whatsoever. They looked sluggish and dropped a game as a touchdown favorite as a result. They're now 7-4, so if they don't beat Denver next week, they'll be in an extremely tough bind in terms of contending for a wild card spot. ",
            "2": "Kansas City was especially sluggish in the first half. Alex Smith was 8-of-19 for only 48 yards at one point, while the defense was miserable, surrendering a 90-yard touchdown run to someone named Latavius Murray. The Chiefs are actually lucky that Murray suffered a concussion and had to leave the game in the second quarter because they had no answer for the explosive back, who tallied 112 yards and a pair of scores on just four carries. The Chiefs had more success getting the Raiders off the field once the two aging running backs, Darren McFadden (12-29) and Maurice Jones-Drew (3 carries, -1 yards), started touching the football. Kansas City consequently came back from a 17-3 deficit, as Alex Smith caught fire, completing 10 passes in a row. However, some bad coaching - Jamaal Charles didn't touch the ball once during a drive in which his team kicked a field goal instead of scoring a touchdown, and then Andy Reid didn't challenge a Derek Carr sneak that was short of the first-down marker - as well as a drive lasting 7:21 featuring strong running by Marcel Reece (8-37), allowed the Raiders to re-take the lead and win their first game of the season. ",
            "3": "Smith was very inconsistent. As mentioned, he was horrible early on. His throws were low and behind his targets, and Kansas City, as a result, averaged a hideous 3.3 yards per play during the first half. Smith, however, finished 20-of-36 for 234 yards and two touchdowns. He was on fire during a portion of the second half, but his limitations were pretty prevalent on a failed final drive despite that the Raiders began celebrating early, allowing a big return and nearly getting whistled for being way offsides prior to the final play of the game. ",
            "4": "Charles didn't have the big game everyone was expecting. He touched the ball only 23 times, which is simply unacceptable. He had 19 carries go for 80 rushing yards, but he at least scored a touchdown as a pass-catcher, logging four grabs for 42 receiving yards. Charles also should've drawn a pass interference in the end zone at one point during the second quarter, but the officials inexplicably didn't throw a flag. ",
            "5": "Yet another week, and yet another game in which no Kansas City wideouts scored a touchdown. Dwayne Bowe (3-42) led the group in yardage. Travis Kelce (4-67) outgained him, while Anthony Fasano (2-30) reeled in Smith's other touchdown. ",
            "6": "As for the Raiders, this was a Pyrrhic victory for them. They should have lost, as they have a better strength of schedule than the Jaguars. Many teams will be dying to trade up for Marcus Mariota, and now the Jaguars will be the fortunate franchise to acquire a boatload of picks. Check out my 2015 NFL Mock Draft for more. ",
            "7": "At least Oakland has its franchise quarterback, right? Jim Nantz exclaimed that the Raiders finally found their guy in Carr once this game was over. I wouldn't be too sure about that. Carr made some very nice throws in this contest, but he could have been picked at least five times. The Raiders were very unfortunate that the Chiefs dropped all of those potential interceptions, as a loss would have really helped them. Carr finished 18-of-35 for 174 yards and a touchdown. ",
            "8": "Carr's score went to James Jones (5-47). Oakland's leading receiver was Andre Holmes (5-55), while Mychal Rivera (1 catch, 8 yards) was a huge disappointment for his fantasy owners. ",
            "9": "Some Raider defenders worth mentioning are Sio Moore (12 tackles, 1 sack) and Khalil Mack. Both were part of a strong pass rush that put lots of pressure on Smith. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Browns",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "When Mike Smith blew a victory against the Lions in London, there was some speculation that he would be fired. The Falcons opted to keep Smith on, which seemed like a good decision amid Atlanta's winning streak. However, Arthur Blank and Thomas Dimitroff could be lamenting not letting Smith go in the wake of this latest defeat, as Smith once again bungled time management at the end of the game. The Falcons took over near midfield following a Brian Hoyer's interception with a couple of minutes remaining, and they were able to move into field goal range to attempt what appeared to be a game-winning kick. However, Smith inexplicably used timeouts instead of letting the clock bleed. The Browns, consequently, were able to preserve all three of their timeouts, which allowed them to easily move down the field and set up what turned out to be the true decisive field goal on the ensuing possession. The Falcons could easily be 6-5 right now, but Smith's horrible gaffes at the end of the Detroit and Cleveland games have really cost his team. Fortunately for him, the rest of the division sucks, so Atlanta is alive and well in the NFC South race. ",
            "2": "The Browns, meanwhile, had some coaching mistakes themselves. Mike Pettine screwed up right before halftime; he had his kicker attempt a 60-yarder, which would've been returned by Devin Hester had Mike Smith not called a timeout to ice the kicker (a strategy that has been proven futile; I guess Smith never got the memo). Seeing this, you'd think Pettine would either concede or have Brian Hoyer throw a Hail Mary, but he tried a 60-yarder again. It fell short for the second time, and Hester nearly took it back for the touchdown. Pettine also misused his third timeout at the very end of the game, but it didn't matter because Cundiff was able to seal the victory. Pettine, however, needs to make a decision on his starting quarterback, as Hoyer was terrible once again. He deserves credit for leading his team on the final drive, but the Browns shouldn't have even been in that position, as Hoyer threw two horrific interceptions late in the game. The first occurred in the red zone when Hoyer inexplicably drifted back 15 yards in the pocket and forced it to Josh Gordon. The second, which was also forced to Gordon, was carelessly lobbed downfield despite the fact that Hoyer was nursing a lead with only a couple of minutes remaining. Hoyer finished 23-of-40 for 322 yards and three interceptions (the other was underthrown in the first half). Johnny Manziel might be the better option, as Hoyer has been very sloppy with the football lately. He's a limited player, so he needs to be smarter and stop being so sloppy with the football. ",
            "3": "The big story entering this game was that Gordon would be on the field for the first time this year. Hoyer tried to get Gordon involved early by taking a deep shot to him, but he overthrew his No. 1 wideout. Gordon, however, converted a third down deep in his own territory and then proceeded to dominate. He was targeted a whopping 16 times. There were some good moments for him - he caught eight balls for 120 yards - but Hoyer's two second-half picks came while trying to force the issue to him. ",
            "4": "Gordon returning opened things up for the other players. Andrew Hawkins (5-93) and Miles Austin (6-64) both had solid outings, while both Isaiah Crowell (12-88, 2 TDs) and Terrance West (14-62) were able to run well. ",
            "5": "The Browns suffered another big blow to their defense in this game when safety Tashaun Gipson was carted off. Gipson led the NFL in interceptions heading into this weekend. ",
            "6": "Some quick stats for the Falcons: - Matt Ryan went 27-of-43 for 273 yards, two touchdowns, an interception that was forced into tight coverage, and a lost fumble. Ryan was under pressure all afternoon, as the three sacks he took is not indicative of the heat he faced. Paul Kruger had two sacks and a forced fumble, bringing Ryan down once for a loss of 12. - Ryan's touchdowns went to Julio Jones (5-68) and Jacquizz Rodgers. Roddy White led the team in receiving, catching nine balls for 96 yards. - Steven Jackson scored once, but he wasted his other 12 carries, finishing with just 34 yards. It's amazing that Mike Smith continues to waste downs by feeding the ball to such a decrepit player. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "If I didn't have a four-unit wager on the Buccaneers going, I probably would've had a kick watching this game. These two terrible teams took turns making dumb mistakes, as each appeared to be trying to upstage each other. Here's the rundown: Bucs: Kyle Fuller nearly picked Josh McCown on the first drive because of a miscommunication. However, he was actually intercepted, as he was ultimately picked as he threw the ball. Chris Conte made a one-handed grab. Tampa followed that up by giving Chicago a free first-and-10 by roughing the kicker (even though William Gholston rolled into the punter and barely touched him). Bears: Jay Cutler was strip-sacked, which led to a Tampa touchdown. Bucs: Speaking of that Tampa score, Mike Evans was whistled for taunting, which gave the Bears a very short field. Bears: Chicago did nothing with the short field position, as there was a dropped interception. Robbie Gould followed that up with a missed field goal, albeit from 54 yards. The Bears then allowed a completion to Vincent Jackson on a third-and-23. Bucs: McCown, who was nearly picked a second time just prior to halftime (a FOX announcer said, He better get down on both knees and be thankful that wasn't intercepted), lost a fumble on a strip-sack and then fired a pick on a high throw to Charles Sims. Both turnovers led to touchdowns. Thanks to a Vincent Jackson fumble (a terrible call by Walt Coleman, who failed to overturn it via replay because he was too senile to remember where he was) and several awful sacks by McCown allowed Chicago to clinch this win and cover. ",
            "2": "McCown had a miserable performance for the ages, going 25-of-48 for 341 yards, one touchdown, two interceptions and a lost fumble against one of the worst defenses in the NFL. His play made Jay Cutler look like a quarterback god even though he struggled as well. Cutler, who went 17-of-27 for 130 yards, a touchdown and a lost fumble, was booed heavily throughout the entire afternoon, particularly when Tampa dropped a potential interception of his on third down. He had some bad incompletions that weren't even close, and he was only able to generate 204 net yards of offense on just 3.6 yards per play. Chicago would have lost this game had its opponent not self-destructed. ",
            "3": "With Cutler struggling, Brandon Marshall (3-32) and Alshon Jeffery (3-22) struggled to get yardage, though the latter reeled in a touchdown. Martellus Bennett (4-37) led the team in receiving yards. ",
            "4": "Matt Forte was the only Chicago skill-position player to produce much, gaining 89 yards and two touchdowns on 23 carries. He also caught five balls for 23 receiving yards. ",
            "5": "As for the Buccaneers, two receivers eclipsed the century mark, and neither was Mike Evans. Jackson (5-117) and Murphy (6-113) were the players, though Evans (3-47) reeled in McCown's sole touchdown. ",
            "6": "Doug Martin returned to the lineup, but the Buccaneers still struggled to run the ball. He mustered just 27 yards on 11 carries, while Sims (6-22) didn't have much more success. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "1",
            "1": "Andy Dalton finally overcame his demons. Well, sort of. He still needs to win in the playoffs, but he at least was able to finally beat the Texans after dropping two postseason games to them earlier in his career. Dalton was stellar in this game despite several injuries to his offensive line. Andre Smith went out early with what appeared to be a torn tricep. His replacement, Marshall Newhouse, also left the game. This didn't bother Dalton at all, who continued to bounce back from that dismal Thursday night performance, going 24-of-35 for 233 yards, one touchdown and an interception. The pick was his only blemish, as he stared down his receiver, allowing to Johnathan Joseph to pick off the pass and take it back for six. Dalton appeared shell shocked by this... "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "The Colts blew out the Jaguars, marking their 11th-consecutive victory over a divisional foe, but there has to be some concern. That's because Indianapolis could have easily lost this game if its opponent had any semblance of offense. Indianapolis has major offensive line problems. The team couldn't block the Jaguars at all, which would explain why it mustered just 148 net yards of offense in the first half. Luck took five sacks, which is a very high number considering his mobility. Chris Clemons registered three of those sacks, taking full advantage of right tackle Gosder Cherilus' absence. Cherilus was clearly missed, but it's not like he had been playing very well this season either. Luck, consequently, had his 300-yard streak snapped at eight. He struggled immensely early, going 10-of-17 for just 112 yards in the first half. The Colts, however, managed to figure things out during the break, as they were able to actually sustain drives following intermission. They generated 241 net yards in the second half. Luck managed to finish 21-of-32 for 253 yards and a touchdown to go along with eight scrambles for 49 rushing yards. He turned the ball over twice, however, on a pair of fumbles, one of which occurred because he held on to the ball for an eternity. His second was even more inexplicable, as he drifted back about 20 yards in the pocket before losing the ball. This led to Jacksonville's only score of the game, which was a field goal. ",
            "2": "Luck's sole touchdown was a 73-yard bomb to T.Y. Hilton in the third quarter. Hilton, who led the team with 122 yards on four catches, cradled the ball like a baby, which was a celebration in honor of his new-born baby daughter just hours prior to kickoff. In fact, there was some speculation that Hilton could miss this game, but he managed to arrive minutes before this contest began. ",
            "3": "As for Luck's other targets, Coby Fleener (2-28) and Reggie Wayne (3-10) both disappointed. Luck and Wayne simply couldn't connect, as the veteran wideout drew nine targets. Luck had him for a big gain late in the contest, but just missed him late. Wayne also dropped a touchdown. ",
            "4": "Adam Schefter said to look out for Dan Herron as a replacement for Ahmad Bradshaw. Sure enough, Herron led the team in rushing with 65 yards on 12 carries, though he did fumble at the Jacksonville 7-yard line. He also caught five balls for 31 receiving yards. He's a must-add in all formats. Unfortunately, Trent Richardson still had more carries (13). He predictably had fewer rushing yards (42), though he did score a touchdown. ",
            "5": "The Jaguars, meanwhile, couldn't get anything going offensively. Blake Bortles had a horrific afternoon. His final numbers - 15-of-27, 146 yards, one interception - were even inflated by garbage time. By the time the Colts went up 20, Bortles was just 8-of-17 for 60 yards and the pick, which was a forced throw early in the game that led to an Indianapolis field goal. He also dropped the ball on a shotgun snap. Despite the miserable numbers, Bortles doesn't deserve tons of blame because he doesn't have much of a chance. He couldn't take any shots downfield because of his awful offensive line. He also took four sacks. The Jaguars desperately need to upgrade their offensive line this upcoming offseason. ",
            "6": "Denard Robinson couldn't run behind his offensive line, mustering just 25 yards on 14 carries. Toby Gerhart actually led the team in rushing (4-31), but that was because of one long gain (23 yards) when the Colts stopped paying attention in the second half. ",
            "7": "Nothing to see in terms of Jacksonville's receivers. Marqise Lee paced the group with three grabs for 52 yards. Marcedes Lewis didn't do much in his return, catching one ball for minus-5 yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "9"
        },
        "comments": {
            "amount": "9",
            "1": "The Patriots are a machine, and they can't be stopped. The Lions came in and looked prepared to take down the hottest team in the NFL with their top-five defense. They did a good job of limiting New England to no first downs in the first 10 minutes - though a Rob Gronkowski drop helped their cause - but Tom Brady eventually got into a rhythm and began dissecting Detroit's vaunted stop unit. By halftime, Brady generated 233 passing yards on 21-of-27 passing, as the Patriots held a 24-6 lead. Brady had a couple hiccups in the second half when he fired an interception in the red zone on a forced pass and then overthrew an open Brandon LaFell for a potential score. However, he got things together and continued to shred Detroit's overwhelmed secondary. He finished 38-of-53 for 349 yards, two touchdowns and an interception. With Gronkowski healthy, and a strong running game in support, it's difficult to imagine Brady slowing down anytime soon. ",
            "2": "Speaking of the powerful ground attack, it was someone completely different this week. Jonas Gray rumbled for 201 yards and four scores Sunday night against the Colts, but he was nowhere to be seen in this game. Gray didn't even have a single touch despite being active, as Bill Belichick wanted to teach him a lesson for showing up late for practice. Gray may have lost his job permanently, as LeGarrette Blount was very effective, gaining 78 yards and two touchdowns on just 12 carries. Gray, who said his cell phone ran out of power, will regret not buying a new charger, as his missed practice may have ruined his entire NFL career. ",
            "3": "Only five Patriots caught passes, but all of them had five or more receptions. Julian Edelman led the team with 11 grabs for 89 yards, while LaFell (9-98) paced the team in yardage. The two tight ends were also involved; Gronkowski had five catches for 78 yards, while Tim Wiright (5-36) secured both of Brady's touchdowns because the defense was so focused on Gronk. Shane Vereen (8-48) was also a big contributor in the passing game, though his eight carries went for only 12 rushing yards. ",
            "4": "The Lions, meanwhile, seemed like they were going to hang around early on. They lost the yardage battle by only 50 in the first half, as they were able to generate some solid-looking drives until they stalled deep in New England territory. Jim Caldwell, however, made two curious decisions at the Patriots' 35. He punted on fourth-and-3 at that spot late in the second quarter. The Patriots were going to score anyway, so why not try to move the chains? Later in the game, when his team was down 21, Caldwell opted to attempt a field goal with his shaky kicker. Granted, it was fourth-and-long, but trimming the deficit from 21 to 18 was meaningless; Detroit still needed three scores to win, so Comatose Caldwell effectively waved the white flag despite there being 14 minutes remaining in regulation. He didn't even try an onside kick following the conversion, which was even more puzzling. It's like he was coaching in the preseason and wanted to see if Matt Prater could drill a deep attempt. ",
            "5": "Matthew Stafford had a miserable performance, going just 18-of-46 for 264 yards and an interception. He had only a few good moments, including one instance in which he shook off a couple of sacks and found Calvin Johnson for a 16-yard gain on a third-and-6. Stafford also should've had touchdowns to Joseph Fauria, who dropped the ball, and Corey Fuller, who didn't see the pass coming in the sunlight. However, Stafford, who was under siege all afternoon, had accuracy issues. He was nearly picked several more times in addition to his real interception (he was hit as he threw late), and he made a huge mental mistake, sliding feet-first near the first-down marker on fourth down. Had he dived head-first, he would've picked up a fresh set of downs. ",
            "6": "It didn't help Stafford that Brandon Browner put the clamps on Megatron. Browner limited the All-Pro wideout to four grabs for 58 yards, but even that came in garbage time; Johnson had just one catch for 16 yards by halftime. ",
            "7": "With Megatron smothered, Golden Tate led the Lions with 97 receiving yards on four catches. Darrelle Revis, who nearly had an interception, didn't do as well as his teammate for a change. ",
            "8": "The Lions tried to establish the run early with Joique Bell, but that didn't work out very well. The tough runner managed just 48 yards on 19 carries. ",
            "9": "Detroit center Dominic Raiola could be facing a suspension. He dived at the feet of a New England backup nose tackle and admitted he did so intentionally after the game because he was upset about a New England garbage-time touchdown. Raiola admitted malicious intent, so he could be in trouble. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "43"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Different week, same result. The Eagles were able to benefit from great special-teams plays and turnovers to defeat a bad team, just as always. However, this loss seemed to illustrate why Philadelphia doesn't have much of a chance to advance deep into the playoffs. The first and primary reason is Mark Sanchez. The backup quarterback would have given this game away had the Titans been remotely competitive. Sanchez, who has thrown six interceptions in 14 quarters, was responsible for a pair of picks in this contest, and he nearly had a couple of others. Both were terrible, and they were inexcusable because Sanchez forced the issue despite having a massive lead. The second interception was especially bad, as it was a terrible overthrow. Sanchez, who went 30-of-47 for 307 yards, one touchdown and the two picks, is now 2-1 as Philadelphia's starter. However, two of his victories have come against a pair ofmiserable teams (Carolina, Tennessee) at home. The one loss was a demolition at Green Bay, indicating that the Eagles won't stand a chance against the elite teams if Sanchez continues to be sloppy with the football. Meanwhile, there's a second reason why the Eagles probably won't go very far if they make the playoffs, and that would be their secondary. The defensive backs allowed Zach Mettenberger to complete many deep passes, which was not a good sign because the sixth-round rookie is one of the worst starting quarterbacks in the NFL. We saw what Philadelphia's secondary looked like against Aaron Rodgers last week, but it has to be disconcerting that Mettenberger was able to throw for 345 yards and two touchdowns (on 20-of-39 passing) and an interception. ",
            "2": "The one good sign for the Eagles is that LeSean McCoy finally got on track. He has struggled in most of his games, but he was able to burst for 130 yards and a touchdown on 21 carries, thanks to a 53-yard gain in which he impressively juked a defender. Then again, he did this against a Tennessee stop unit that looked completely helpless against Le'Veon Bell on Monday night. McCoy has another easy matchup coming up at Dallas, so he'll have to take advantage of that as well to keep Sanchez from throwing the ball to the other team. ",
            "3": "Jordan Matthews continued to be Sanchez's favorite target. He tied Jeremy Maclin for the team in catches (6) but outgained him, 77-59. Sanchez's sole touchdown went to James Casey, however. Darren Sproles (6 carries, 25 rush yards; 3 catches, 14 rec. yards) also scored, doing so on the ground. ",
            "4": "The Titans, meanwhile, could have made this a game if they didn't turn the ball over. They gave the ball away three times. One was a Mettenberger pick. The second was a Brian Schwenke fumble; the center caught the ball off a deflection and managed to cough it up. The third was a Bishop Sankey fumble near midfield. Sankey gained just 37 yards on 10 carries, and he was vultured once by Shonn Greene (6-15). ",
            "5": "Nearly half of Mettenberger's yardage went to Delanie Walker, who returned from a concussion. Walker hauled in five of his nine targets for 155 yards. Justin Hunter (4-64) and Dexter McCluster reeled in Mettenberger's touchdowns. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Packers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "Editor's Note: Thank the seven gods for backdoor covers. ",
            "2": "While the Packers didn't score 50 points for the third-straight game, they controlled this contest from start to finish as they cruised over the rival Vikings. The score was closer than the actual play on the field, but Minnesota can feel good about the way that Teddy Bridgewater battled against a hot team while going head-to-head with the top quarterback in the NFL. ",
            "3": "It isn't a surprise that Green Bay got the scoring started with how well the team has been playing the past few weeks. On a third-and-10, Aaron Rodgers threw a perfect pass to Randalll Cobb (5-48) to beat good coverage from Captain Munneryln for a gain of 29. After a pass to Andrew Quarless (2-50) moved the ball inside the 10, Eddie Lacy dove over the top at the goal line for a touchdown. Minnesota answered with a nice drive that featured a critical holding call drawn by Cordarraelle Patterson (2-18) and a fourth-and-short conversion by Jerick McKinnon (15-54). Bridgewater found an open Charles Johnson (3-52) for a 22-yard score after he ran by Tramon Willims to get open. After Green Bay punted, Bridgewater made a bad mistake throwing a pass up for grabs off his back foot. Packers safety Micah Hyde went up to intercept the pass close to midfield. A great run by Lacy was taken away by a penalty, but Rodgers hit Andrew Quarless for a 34-yard reception to the one-yard line. For the next play, Rodgers lobbed a pass to a wide open Richard Rodgers for a touchdown. Bridgewater had a drive going in the third quarter, but missed a few opportunities for big plays on some inaccurate and dropped passes. Minnesota still turned the possession into points with a 51-yard field goal from Blair Walsh. The Packers answered with a 48-yard field goal from Mason Crosby. In the fourth quarter, Rodgers came up with a critical drive featuring a clutch run of 18 yards on a third down. A nice run by Lacy set up a 10-yard touchdown pass to the power back. Bridgewater had an impressive response to lead a long drive that ended with a short touchdown pass to Greg Jennings (4-38) and a two-point conversion to Charles Johnson. The Packers got the ball with three-and-a-half minutes on the clock, but the Vikings' defense couldn't stop Lacy as he rolled up a few first downs to run out the clock for Green Bay. ",
            "4": "Rodgers finished completing 19-of-29 passes for 209 yards with two scores. Lacy was the leader for the Green Bay offense, as he ran for 125 yards on 25 carries with two receptions for 13 yards. Jordy Nelson chipped in 68 yards on eight catches. ",
            "5": "Bridgewater was 21-of-37 for 210 yards with two scores and an interception. He also ran for 32 yards on five carries. Kyle Rudolph came back from injury and contributed three receptions for 50 yards. ",
            "6": "Bridgewater got zero help from his offensive line, as Minnesota's front was atrocious. Matt Kalil's terrible season continued; he was called for three holding penalties. Mike Neal, Julius Peppers, and Mike Daniels (one sack) were constantly in the face of Bridgewater. Hyde (one sack, one interception, four tackles) had a good game. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "49ers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Editor's Note: I think a new betting angle could be wagering on teams that appear to be in turmoil. The Bears (last week) and Redskins (this week) both managed to cover. ",
            "2": "With the Seahawks getting a win over Arizona, along with other NFC wild-card competitors, the 49ers had to beat the Redskins to keep in striking distance of the postseason. San Francisco couldn't afford a letdown, as the team fell behind in the fourth quarter, but the 49ers made enough plays on offense to get a late touchdown. San Francisco's defense was the star of the game; the unit completely shut down Washington's passing attack. Robert Griffin III didn't do enough to quiet the talk of him not being the future at quarterback for the Redskins, but to be fair, his terrible offensive line didn't give him a fighting chance. ",
            "3": "The 49ers marched down the field with Colin Kaepernick ripping the ball through the Washington secondary on their first possession. Kaepernick then hit Anquan Boldin for a 30-yard touchdown after he got open on a corner route against Brandon Meriweather. The Redskins got going as Alfred Morris ripped off a 23-yard run, but Chris Borland and Justin Smith dropped Griffin for no gain on a third-down run to force a punt. That refrain repeated itself with a good run by Morris, but the drive ended courtesy of a Ray McDonald sack. Meriweather forced a fumble from Carlos Hyde that let the Redskins took over at their own 40, but they did nothing with the possession. Washington finally got a nice drive going thanks to passes to Andre Roberts and Pierre Garcon (3-34). Morris (21-125) charged hard with 11 yards to the one-yard line. He then finished the drive with a plunge into the end zone. Just before the half, the 49ers moved the ball with a tremendous 25-yard catch by Michael Crabtree (5-58) to set up a 41-yard field goal by Phil Dawson. Kaepernick threw a ball up for grabs in the third quarter that was picked off by Greg Ducre. The Redskins didn't get anything out of that possession, but on the next drive, they moved the ball with an 11-yard run by Morris and a 31-yard pass to DeSean Jackson (2-39). Aaron Lynch sacked Griffin, but a helmet-to-helmet penalty moved Washington inside the San Francisco's 20-yard line. The Redskins tied it at 10 with a short field goal. Early in the fourth quarter, Trent Murphy punched the ball out of Frank Gore's (13-36) hands and safety Philip Thomas recovered the ball to set up the Redskins at the 49ers' 36-yard line. That led to a 46-yard field goal for Kai Forbath. The 49ers answered with a 29-yard pass to Boldin. Ryan Clark added a 15-yard penalty on the play with his helmet-to-helmet hit. That moved ball inside the Redskins' 20-yard line. A pass to Boldin (9-137) moved it to the 4-yard line before Hyde (7-16) darted into the end zone for the game-winning touchdown. The Redskins got two more possessions, but the 49ers' defense slammed the door as Lynch came up with a clutch sack on the first possession and Justin Smith beat Morgan Moses for a strip-sack that was recovered by Ahmad Brooks to end the game. ",
            "4": "Kaepernick finished completing 20-of-29 passes for 256 yards. The 49ers were unable to run on the Redskins and couldn't really string drives together. ",
            "5": "Trent Williams was out with an injury, and on the second play of the game, Aldon Smith beat Morgan Moses for a coverage sack. That set the tone for the day, as Washington's offensive line was dominated by San Francisco. Smith later beat Moses for another sack. The Redskins' offensive line was abysmal, and it killed the team's passing attack as all of the linemen were beaten. Griffin completed only 11-of-19 passes for 106 yards. ",
            "6": "Washington's defense played well with turnovers and pressure on the quarterback. Ryan Kerrigan beat Jonathan Martin for a sack, and Jason Hatcher got by Mike Iupati for one as well. Rookie Trent Murphy and linebacker Keenan Robinson also played well for the Redskins. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "The Chargers stopped their downward spiral last week with a close victory over the Raiders. They once again pulled through with a win, improving to 7-4, but they are very fortunate that they aren't 6-5 right now. The Rams easily could've prevailed in this contest. They had a whopping three touchdowns that were negated by penalties. The first was a 49-yard touchdown by Kenny Britt, who beat Brandon Flowers. That was brought back by a very questionable penalty on a lineman. Much later, Stedman Bailey made an awesome catch over Shareece Wright in the end zone, but an illegal hands to the face wiped that out. And if that wasn't enough, Tavon Austin took a punt return to the house to give his team the lead with barely any time remaining in regulation, but a very bogus hold nullified that. Jeff Fisher was completely furious, but Carl Cheffers and his crew could do nothing but shrug their shoulders. Despite these blown opportunities, the Rams were still in position to win the game, or at least tie it. Shaun Hill drove the team down to the San Diego 4-yard line, but even though he could have settled for a field goal to send the contest into overtime, Hill forced a poor throw into the end zone that was picked off. The Chargers escaped with their seventh victory of the season. ",
            "2": "Both the officials and Hill spoiled a potential upset. Hill was also responsible for a San Diego touchdown, as he lost a fumble that was returned for a score. He struggled, going 18-of-35 for 198 yards, one touchdown and two interceptions. The Rams would probably be a top-10 NFL team if they had a legitimate quarterback. I still can't get over how ridiculous Hill's pick was. I have no idea what he or offensive coordinator Brian Schottenheimer were thinking. ",
            "3": "As for Hill's counterpart, Philip Rivers misfired on just six occasions, going 29-of-35 for 291 yards, one touchdown and an interception. The pick looked like it was going to prove to be costly, as it went 99 yards the other way in the second quarter. Rivers misread the coverage and fired a ball toward Keenan Allen in the end zone. Janoris Jenkins snatched it out of the air and recorded a pick-six. Rivers relied on mostly short throws to move the chains, as Mike McCoy wisely compensated for his offensive line's poor matchup against St. Louis' ferocious defensive front. ",
            "4": "Allen also cost his team. He lost a fumble while fighting for extra yardage in the red zone. He made up for it though with six catches for 104 yards and a touchdown. Antonio Gates (2-14) had another dud outing. ",
            "5": "Ryan Mathews handled most of the workload despite missing 20 minutes of action with a shoulder injury. Mathews burst for 105 yards and a touchdown on only 12 carries. Branden Oliver (6-17) wasn't much of a factor on the ground, though he had some nice gains as a receiver, catching four balls for 23 receiving yards. ",
            "6": "As for the Rams, Stedman Bailey had a huge performance, catching seven balls for 89 yards and a touchdown. As mentioned, he had another score wiped out by a penalty, though his touchdown came on the same drive. Still though, Bailey was huge, coming up with clutch grabs on fourth and third down of that possession. Kenny Britt (2-37) also got screwed over by the officials, as written earlier. ",
            "7": "Tre Mason handled most of the workload, gaining 62 yards on 16 carries. Austin found the end zone on the ground in the fourth quarter, rushing thrice for 27 yards on the ground. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks may have won this game to keep their playoff and divisional-title hopes alive, but the crowd certainly wasn't happy about it. The 12th Man constantly booed a sluggish offense that made mistakes and kept the Cardinals in the game. Fortunately for Seattle, the Cardinals couldn't take advantage of these errors because Drew Stanton proved to be a liability. Seattle's offensive line did not have a good showing. The unit surrendered three sacks in just the first 19 minutes of the game. Russell Wilson took two sacks in the red zone during the first quarter. Following a third sack and a short pass on third down, the fans expressed their displeasure for the first of many occasions. A bit later in the second period, an illegal block downfield took away a Wilson scramble to the Arizona 1-yard line. Following two more sacks - giving the Cardinals five in the first half alone - the Seahawks had to settle for another field goal. Seattle's poor red-zone efficiency continued throughout the afternoon - a false start and another sack foiled an opportunity following a blocked punt - but the tide turned, as the Cardinals began making errors late in the game, adding to some they made earlier. For instance, Jaron Brown dropped a touchdown. There was that blocked punt, a missed field goal from 49 yards, an Andre Ellington drop and a poor interception by Drew Stanton. As a result, the Seahawks prevailed, giving themselves a legitimate chance to win the NFC West, since they play the Cardinals again in Week 16. ",
            "2": "Wilson went 17-of-22 for 211 yards and a touchdown to go along with 73 rushing yards on 10 scrambles. He took seven sacks in total, including three from Calais Campbell. It's quite evident that Seattle missed stud center Max Unger. ",
            "3": "Unger was also missed in the ground game. The Seahawks struggled to run without him at Kansas City, and that continued in that contest, as Marshawn Lynch mustered just 39 yards on 15 carries. Granted, it's tough to pound the rock against the Cardinals, but Lynch would've had much better numbers had Unger been snapping the ball. ",
            "4": "Wilson's sole aerial score went to someone named Cooper Helfet. Neither Jermaine Kearse (1-19) nor Doug Baldwin (2-6) did much. Seattle's leading receiver was Ricardo Lockette (48 yards) caught only one pass. ",
            "5": "As for the Cardinals, Stanton struggled mightily, going 14-of-26 for 149 yards and the aforementioned pick. There were some drops, including one by Jaron Brown in the end zone, but Stanton's passes were all over the place, and he was overwhelmed by Seattle's pass rush. Stanton missed Larry Fitzgerald, who couldn't recover from the knee injury he sustained last week. He had just two reliable targets as a consequence, and one of them - Michael Floyd - didn't haul in a single reception. Rookie John Brown led the team with 61 receiving yards on three grabs, one of which was an impressive, 32-yard catch made as he tapped his feet along the sideline. ",
            "6": "Ellington couldn't run the ball once again (10-24), but he was a factor in the passing game, catching five balls for 39 receiving yards. He made a great snag on a ball thrown behind him for a gain of 15. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "36"
        },
        "comments": {
            "amount": "8",
            "1": "The Dolphins needed a late touchdown to make this a three-point deficit, but make no mistake - they dominated this game early on and maintained two separate 11-point leads, one of which was in the second half. They were up 28-17 in the fourth quarter, but a weird Ryan Tannehill tipped interception and injuries that depleted the defense spoiled a potential huge victory for the team. Peyton Manning also had something to do with it. Manning bounced back from a poor performance at St. Louis, torching Miami's top-five defense by going 28-of-35 for 257 yards and four touchdowns. Manning didn't even have Julius Thomas at his disposal, though he was fortunate to have Emmanuel Sanders back in the lineup. He shredded the Dolphins mercilessly, though he made one mistake when he missed an open Sanders for a deep touchdown. Manning also should've had another score, but offensive pass interference negated a Demaryius Thomas touchdown. To be fair to the Dolphins, they didn't have much of a chance because of the injuries they sustained. Jared Odrick was knocked out in the second quarter with a rib injury. He managed to return, but Miami's run defense wasn't the same after that. Cornerback Jamar Taylor also exited, but he didn't come back into the game. His absence was painful, as the Dolphins were already missing Cortland Finnegan. They were so thin at corner and didn't stand a chance against Manning and his two stud wideouts. ",
            "2": "Thomas and Sanders both had stellar performances. They each saw 13 targets, with Sanders reeling in nine balls for 125 yards. He should've had a long touchdown, but Manning missed him. He did, however, making a diving catch on third-and-20 in the 2-minute drill at the end of the first half, getting open because of a fantastic double move. Thomas, meanwhile, hogged all of the scores. He found the end zone thrice on his 10 receptions for 87 yards. ",
            "3": "As mentioned, the Broncos ran the ball especially well in the second half once Odrick got banged up. C.J. Anderson pounded for 167 yards and a touchdown on 27 carries. He had 114 yards on 17 attempts following intermission. He also contributed in the passing game, snaring four balls for 28 receiving yards. ",
            "4": "The one dark cloud over Denver's victory was that kicker Brandon McManus missed another field goal. This one was from 33 yards, which prompted the crowd to boo heavily. I can't imagine they understand why their team let go of Matt Prater, who drilled a 50-yarder for Detroit today. ",
            "5": "This loss spoiled a strong outing by Ryan Tannehill. He went 26-of-36 for 228 yards, a career-high four touchdowns (three passing, one rushing) and an interception, which really wasn't his fault, as the ball was tipped. He also scrambled four times out of the read-option for 15 rushing yards. Tannehill made some great throws as he was hit, but was guilty of a couple of mistakes, including a sack in which he was tackled 11 yards behind the line of scrimmage. Tannehill has an issue where he runs backward to avoid pressure, which often results in huge losses. ",
            "6": "Two of Tannehill's aerial scores went to the emerging Jarvis Landry, who saw a team-high 11 targets go his way for seven catches for 50 yards. One of Landry'sreceptions was an awesome, one-handed snag which went for 20 yards. Mike Wallace (4-35) had the third touchdown. ",
            "7": "Lamar Miller disappointed his fantasy owners, gaining 59 yards on just 12 carries. His best play, aside from a 22-yard burst, was something you won't find on the stat sheet. Rishard Matthews lost a fumble on a promising Miami drive, but Miller alertly pounced on the ball to negate a potential turnover. ",
            "8": "The Dolphins weren't the only ones who watched key defenders get hurt. Aqib Talib was knocked out early with a hamstring injury. He tried to play through it, but that didn't work out very well. He exited for good shortly afterward. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "A new star is born. The Giants lost, but all anyone is talking about is Odell Beckham. The rookie wideout has been highly impressive ever since taking over for Victor Cruz as Eli Manning's No. 1 target, but what he did in this game took it to another level. Beckham caught two touchdowns, one of which was what Cris Collinsworth referred to as the greatest catch he's ever seen. If you haven't watched it yet, your TV must not work because every network has replayed the reception about five billion times, give or take a hundred grand. Beckham, who was being dragged down by a helpless Brandon Carr, somehow snatched the ball behind his head with three fingers, as he extended one arm to retrieve the pass and used his other arm to help him fall inbounds and into the end zone. Something like that shouldn't be humanly possible, and there's real potential that Beckham is some sort of football cyborg. Beckham finished with 10 catches (on 11 targets) for 146 yards and two touchdowns, and he should've even had a much better performance. Beckham sprinted past the coverage and was wide open downfield late in the third quarter on what would've been an 87-yard touchdown, but Manning inexplicably didn't see him. Beckham left the game briefly with an injury, but he turned out to be fine. ",
            "2": "Manning, despite that blemish, had a strong rebound performance off his five-interception outing. He completed 29-of-40 attempts for 338 yards, three touchdowns and a pick, which was a high throw hurled to Preston Parker in the red zone. Manning was also nearly intercepted on an early drive when he passed late across his body, but he got away with it and followed that up with his first touchdown to Beckham. ",
            "3": "The Giants played their hearts out, and Manning was solid, so it has to be very discouraging for them that they lost this game. The Cowboys were just a bit better, though the Cowboys appeared to be unfocused early on. Tony Romo had some issues in the opening quarter, carelessly heaving a pass into triple coverage and then nearly getting picked in the end zone because he didn't see Antrel Rolle. However, Romo got his act together eventually and misfired only three times in the second half, showing no signs of injury. Thanks to unbelievable protection, Romo was able to lead his team to a game-winning drive with about a minute remaining in regulation. He finished 18-of-26 for 275 yards and four touchdowns. ",
            "4": "Two of Romo's scores went to Dez Bryant, who reeled in seven of his nine targets for 86 yards and two scores. He also had a 39-yard grab that was negated by a Tyron Smith hold. Jason WItten (4-30) and Cole Beasley (2-66) also found the end zone. ",
            "5": "DeMarco Murray ran well again, mustering 121 yards on 24 carries. He also caught two balls for 22 receiving yards. ",
            "6": "Some quick notes on the Giants: - Rashad Jennings didn't run very well (19-52), but he caught eight passes for 68 receiving yards. The Giants sorely missed his ability in the passing game. Unfortunately for his fantasy owners, Andre Williams (10-35) vultured a touchdown. Williams appeared to lose a fumble inside the Dallas 5-yard line, but the officials couldn't tell for sure upon review. - Larry Donnell also screwed over his fantasy owners. He reeled in just two receptions for 24 yards, and he dropped a pass. He spent most of the evening blocking. - The Giants lost several offensive linemen throughout this contest. William Beatty and Adam Snyder went down with various injuries to go along with Justin Pugh, who was ruled out before this game. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Bills",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "4",
            "1": "So much for being distracted by all of the weather implications. Teams have often struggled upon being displaced, so credit the Bills for being completely prepared for this game despite the lack of practice time. They were much more focused than their miserable counterparts, and they were able to obliterate them as a consequence. The Jets made this extremely easy for the Bills. Their quarterback play was some of the worst of the season, as QBDK could've been intercepted half-a-dozen times (I counted three occasions in the first 17 minutes alone). He somehow tossed only one pick throughout the evening, but he took seven sacks. Mario Williams was an unstoppable force up front, as New York had absolutely no answer for him (though it didn't help that they had two tight ends trying to block him at times.) Williams and his teammates up front forced so many errant throws in addition to notching all of those sacks. Williams recorded two of them and even intimidated Breno Giacomini into a false start. Thanks to Buffalo's dominant front, QBDK went just 7-of-19 for 76 yards and the pick. He took a crushing hit while throwing the interception and left the contest as a result. Geno Smith stepped in and was much more impressive (10-12, 89 yards), though only by default against a prevent defense. This could be the last game of QBDK's career, by the way. Smith will probably be the starter to close out the season, and given how QBDK has mailed in his opportunity to play for the Jets, he doesn't exactly appear to be a quality backup. He's done, anyway. ",
            "2": "QBDK wasn't the only Jet player to go down, as there was a much more serious injury earlier. Muhammad Wilkerson hurt his toe in the first quarter and remained out for the entire contest. New York stood no chance without its best player. With him out, the Bills ran better than they normally would have, while Kyle Orton had all the time he needed in the pocket, taking just one sack on the evening. Orton misfired just eight times, going 24-of-32 for 230 yards and two touchdowns. What's odd is that he didn't rely much on Sammy Watkins, who caught only three balls for 35 yards. Orton's main target was Robert Woods, who reeled in nine of his 11 targets for 118 yards and a score. Woods made a sick catch in the second quarter, pinning the ball against his helmet while running out of bounds for a gain of 27 yards. ",
            "3": "Orton's other touchdown was thrown to Scott Chandler (3-28). He was one of four Bills to catch more than two passes. The others were Woods, Watkins, Chandler and Fred Jackson (3-13). Speaking of Jackson, he split carries evenly with Anthony Dixon. Jackson gained 32 yards and a touchdown on 10 carries, while Dixon (12-54) broke free late for a score. Dixon, who was stuffed on a fourth-and-1 try near midfield in the first half - that had Rex Ryan so excited he nearly punched an official in the face - also blocked a punt for a touchdown in the third quarter, which Manny Lawson recovered. That ended any sort of chance New York had of winning this game. ",
            "4": "Here are some quick stats for the quitting Jets: - Chris Johnson and Chris Ivory shared carries evenly, with each getting seven attempts. Johnson outgained Ivory, 40-31. - Percy Harvin did absolutely nothing. He had just one touch, which was a 2-yard reception. - Eric Decker saw the most balls go his way. He had eight targets, but hauled in half of them. His four catches went for 63 yards. - New York's leading receiver was Jeremy Kerley (5-66), who had a nice punt return. The Jets did nothing with that, however. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "Several weeks ago, the Saints were coming off an upset win over the Packers and a demolition victory in Carolina. Improving to 4-4, the Saints had three home games on the horizon, and they were expected to win all of them, given how dominant they've been in the Superdome during Drew Brees' tenure. Two inexplicable losses later, and the Saints were reeling at 4-6. This one seemed like it could be different, given that New Orleans had been especially potent in home night games. The Saints almost instantly drove down to the Baltimore 1-yard line, but a failed attempt on fourth down in which Mark Ingram was stuffed on the goal line was an immediate indication that this would be yet another New Orleans disappointment. The Saints, who had similar issues last week against the Bengals, just don't seem to have the same sort of confidence they possessed in previous years. Something is just off with them, as they constantly make mistakes that kill them. These include: - The failed Ingram fourth-down try, which was preceded by a lost fumble of his that was overturned. With Brees and Jimmy Graham available, you have to wonder why Sean Payton would dial up a run with an inferior player against a ferocious Baltimore ground defense. - Speaking of Graham, the athletic tight end dropped a couple of passes, including one in the end zone. Fortunately for his fantasy owners, Graham caught six balls for 47 yards and two touchdowns. - Brees (35-of-45, 420 yards, three touchdowns, one interception) targeted Graham on a pass in which he was pick-sixed. The pass was late and behind Graham. Brees had pretty numbers, but he wasn't highly effective, as he was under siege quite frequently. He was sacked four times, which is a high number for a quarterback who releases the ball so quickly. - Graham wasn't even on the field on some plays near the goal line on one possession in the second quarter, which is just crazy. Payton once again tried to run the ball with Ingram, but failed. Ingram, who had 27 yards on 11 carries, was completely ineffective, and it's puzzling why the Saints didn't involve Pierre Thomas more. Thomas, who was making his return after a four-game absence, caught six balls for 37 receiving yards, but should have been a bigger part of the offense, as there was no hope of running against the Ravens. ",
            "2": "While the Saints made plenty of offensive mistakes, they just had no hope considering how poorly their defense played. Losing nose tackle Brodrick Bunkley to an injury didn't help, as his replacement, John Jenkins, was pushed around quite easily, but Baltimore simply beat up New Orleans in the trenches. Justin Forsett, as a result, had a monstrous evening. The journeyman running back, who has finally found a home with the Ravens, rushed for 182 yards and two touchdowns on just 22 carries. Forsett had huge holes to burst through all evening, and he was further aided by some of the linebackers and safeties who either took bad angles or whiffed on tackles. Kenny Vaccaro and David Hawthorne were some of those who were guilty. ",
            "3": "Speaking of Vaccaro, Steve Smith was extra motivated in this game because, as he revealed afterward, the Saints' safety had a cheap hit on him the last time they played. Smith, who tries hard infrequently, can still dominate if he wants some sort of revenge. That was the case in this contest, as he caught four balls for 89 yards and a touchdown. He also drew a personal foul on Vaccaro, who threw a punch in frustration. Torrey Smith, meanwhile, led the team in receiving with five grabs for 98 yards. ",
            "4": "Joe Flacco had a great night for the most part, as he misfired just six times. He went 18-of-24 for 243 yards and the touchdown to Steve Smith. Flacco should have been pick-sixed by Hawthorne in the first half, but that was his only blemish of the evening. He did a great job of keeping drives alive by finding open receivers all night, as Baltimore converted 9-of-13 third downs. ",
            "5": "The Saints need to fire Rob Ryan. That's the only solution I see. The personnel is mostly the same from last year when New Orleans had a top-10 defense, so Ryan is to blame. Payton isn't even pleased with Ryan; he yelled at him on one instance in which the Saints' defense inexplicably had just 10 men on the field. They had to burn a precious second-half timeout as a result. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "15"
}