{
    "year": "2014",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "It's been seven months since the Super Bowl, yet it doesn't appear as though the Seahawks have skipped a beat. Some special-teams gaffes aside, they looked as dominant as ever, and based on the way they played, it shouldn't surprise anyone if they became the first repeat champions since the Patriots in 2003-04. What's scary is that the Seahawks might be even better in 2014 because they'll actually have Percy Harvin making big plays on offense. Harvin was dominant in this contest, catching a team-high seven passes (no one else had more than three) for 59 yards and also rushing for 41 yards on four carries. Seattle used Harvin in every way imaginable, so this team could be frightening if the former Viking lasts all 16 games. ",
            "2": "Russell Wilson's numbers don't show it, but he was at the top of his game as well. Wilson went 19-of-28 for 191 yards and two touchdowns. He also scrambled seven times for 29 rushing yards (includes three minus-1 kneeldowns). Wilson had a pick dropped off a tip, and he had a couple of passes batted down at the line of scrimmage, but he controlled this game for the most part. The play that stood out most was when he used a read-option fake with Marshawn Lynch to hook up with Ricardo Lockette for a 33-yard score. Ha Ha Clinton-Dix was beaten on the play. Lockette (2-38) and fullback Derrick Coleman (1-15) were the two Seattle players who caught Wilson's touchdowns. Zach Miller led everyone but Harvin with three grabs for 42 yards. His highlight was an excellent diving catch that made everyone realize he was still in the league. ",
            "3": "Marshawn Lynch looked awesome against the Packers. It was if he had didn't have any offseason issues at all. He nimbly eluded tacklers all evening, rushing for 110 yards and two touchdowns on 20 carries. Forum member Body Burner, who was over watching the game, asked me if I regretted listing Lynch as a <a href=/fantasy2014busts.php>fantasy football bust</a>. I don't. I never doubted Lynch's talent; my issue with him is that the workload he's shouldered over the past few years will cause him to miss some time this year. ",
            "4": "Some Seattle defenders worth mentioning: Richard Sherman wasn't thrown to at all, causing Jarrett Boykin to come away with zero receptions. Earl Thomas needs to stop playing special teams. A muffed punt of his led to a Green Bay touchdown. Michael Bennett, meanwhile, had a strip-sack of Aaron Rodgers when he beat right tackle Derek Sherrod. The play resulted in a safety, and it's what completely put the Seahawks in command. It was a 20-10 contest at that point. The safety and the ensuing drive, which saw Seattle begin with good field position, allowed the Seahawks to go up 29-10. They never looked back after that, as the Packers had no chance to mount a comeback because of Circadian rhythms. ",
            "5": "The Packers nearly lost more than this game. Left tackle Bryan Bulaga aggravated the same knee he had surgery on to repair an ACL tear last year. Fortunately, it was just a sprain. He might be ready for Week 2 because he'll have 10 days to heal. Aaron Rodgers will want Bulaga against the Jets' defensive line. Rodgers went 23-of-33 for only 189 yards with one touchdown, an interception and the lost fumble that resulted in a safety. Rodgers made some nice downfield throws - he drew a 44-yard pass interference - but struggled with pressure overall. He took three sacks and easily could've had more. Rodgers' touchdown went to Randall Cobb (6-58), but Jordy Nelson was the primary target. Seeing Byron Maxwell for most of the night, Nelson snagged nine balls for 83 yards. Jarrett Boykin, meanwhile, was completely blanked because he was matched up against Sherman all evening. ",
            "6": "Eddie Lacy rushed for 34 yards on 12 carries before leaving the game with a concussion. This is a great time to buy low on Lacy; he didn't run poorly at Seattle, as he simply had no holes versus a ferocious run defense. The Packers couldn't do anything against Seattle's defense, so Lacy will definitely bounce back soon, and he'll have 10 days to get cleared from his concussion. ",
            "7": "For more of this game, check out my <a href=/blog2014kickoff.php>Live Kickoff Blog</a>. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "34"
        },
        "comments": {
            "amount": "6",
            "1": "It looked for a while that the Saints were going to run away with a big victory. They were up 20-10 late in the second quarter, and they were a couple of plays away from having an even larger lead. Drew Brees nearly connected on a couple of long throws, but members of the Atlanta secondary made great plays to negate those completions. Meanwhile, the Falcons bungled their own chances, as their only trip to the end zone came because official Bill Leavy threw a very late, bogus flag for pass interference, perhaps because he thought the Atlanta crowd was going to lynch him. Meanwhile, Julio Jones bungled his team's chances by fumbling in the red zone. This did not look like it was going to be Atlanta's day. And then Matt Ryan's second half happened. Ryan was 20-of-27 after intermission for a whopping 263 yards and two touchdowns. His overall numbers were also excellent (31-of-43, 448 yards, 3 TDs), as his yardage was the most in Atlanta history for a single game (and sixth-most by anyone on opening weekend). He did a phenomenal job leading his team to a pair of field goal drives at the end of regulation and in overtime, though he was helped greatly by a Marques Colston fumble in the extra session. What's really impressive about Ryan's performance is that he did it against what was supposed to be a stellar defense (though they had about a billion missed tackles), all while being without first-round rookie left tackle Jake Matthews for most of the contest. Matthews left in the first half with a foot injury and never returned, meaning Ryan was missing both starting tackles, as Sam Baker was also injured. ",
            "2": "Julio Jones atoned for his first-half fumble. Despite catching just one pass prior to intermission, he finished with seven grabs for a team-leading 116 yards. Devin Hester also had a big game. Meanwhile, Roddy White (5-72), Antone Smith and Levine Toilolo came up with Ryan's other scores. ",
            "3": "The Falcons' four running backs all made contributions in this victory. Steven Jackson paced the group with 52 yards on 12 carries. Jacquizz Rodgers (6-34) and Smith scored. Fourth-round rookie Devonta Freeman did the least (2 carries, 15 yards; 2 catches, 18 rec. yards), but he made a crucial first down by refusing to be tackled. ",
            "4": "Speaking of breaking tackles, Mark Ingram did plenty of that in this game. Ingram, who had a stellar preseason, rushed for 60 yards on just 13 carries. He also scored twice. Khiry Robinson (6-28) also found the end zone. ",
            "5": "The three rushing touchdowns screwed over Drew Brees fantasy owners, who watched their quarterback do most of the work in between the 20s. Brees went 29-of-42 for 333 yards, one touchdown and a pick. The Falcons did a good job of pressuring him in the second half, doing just enough to slow him down a little bit, giving themselves a chance to pull out the victory. Brees was hot in the first half. He and Brandin Cooks looked like they'd have an amazing afternoon, as the rookie wideout hauled in six balls for 68 yards (as well as an 18-yard carry) and a touchdown by intermission. However, Cooks finished with only seven grabs for 77 yards, as he barely did anything following halftime. ",
            "6": "Brees' leading receivers were the usual suspects. Jimmy Graham had the most receptions (8-82), while Colston led the way in yardage (5-110), but once again, he really cost his team in overtime. He also hurt his team with some drops. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "To say that the Ravens' offense was out of sync in this game is an understatement. You might be able to tell that if you noticed that they were the last team to score in the early-afternoon games, but this unit was unbearably dreadful to watch. Baltimore couldn't do anything for most of the game. At one point, late in the third quarter, Joe Flacco was 13-of-31 for 95 yards and an interception. He was hurt by some drops, particularly by Steve Smith, but he was off the mark for the most part. It didn't help him that the offensive line couldn't pass protect or run block, or do anything correctly, but Flacco looked like one of the worst quarterbacks in the NFL for most of this contest. Flacco ended up 35-of-62 for 345 yards, one touchdown and an interception. That stat line is misleading, though Flacco did get into a rhythm in the second half. However, he screwed up on numerous occasions and took unnecessary sacks. A sack actually ended the game, but the play that most sticks out occurred just prior to intermission. With limited time remaining on the clock, Flacco scrambled to avoid pressure. The coaches yelled at him to throw the ball away, but he ran around like an idiot instead. Time ultimately ran out, as Baltimore screwed up a chance to kick a field goal. ",
            "2": "Flacco's sole score went to Steve Smith, who found the end zone on an 80-yard touchdown where he muscled defenders away. Smith finished with seven grabs for 118 yards, though those numbers are bogus because most of them came on one play. Smith was highly inefficient for most of the afternoon. ",
            "3": "Torrey Smith was a mild disappointment, snagging three balls for 50 yards. Dennis Pitta led Baltimore with 10 grabs for 83 yards. ",
            "4": "Bernard Pierce was a huge disappointment. He absolutely bombed in his chance to take over as the starting running back; two strong performances against the Bengals and Steelers may have convinced the coaching staff to roll with him instead of Ray Rice. Instead, Pierce was benched after fumbling in the first half. He finished with 14 yards on just six carries. ",
            "5": "As for the winners, this was a bit of a Pyrrhic victory for the Bengals, as they lost Tyler Eifert in the first half with a very nasty elbow injury. Eifert dislocated it, so he'll be out for a while. The Bengals struggled to score following intermission without Eifert. They let a 15-0 advantage completely slip away, but Andy Dalton managed to hit A.J. Green with a 77-yard bomb. Green snagged it off a deflection and ran into the end zone for what turned out to be the decisive score. Dalton finished 25-of-38 for 301 yards and that touchdown, though he was just 7-of-14 following intermission. Green, meanwhile, made six catches for 131 yards and the score. ",
            "6": "Giovani Bernard rushed for 48 yards on 14 carries, and he also paced the team with 10 targets, catching six of them for 62 receiving yards. His fantasy owners must have been thrilled to see Jeremy Hill receive just four carries. He won't be much of a fantasy factor unless Bernard gets injured. ",
            "7": "With Marvin Jones out and Tyler Eifert banged up, Mohamed Sanu is worth an add. He caught four passes for 36 yards. He dropped a pass in the fourth quarter, but it's not like Dalton has many other options. ",
            "8": "While Baltimore's offense is decrepit, the defense has to be a major concern as well. There was zero pass rush in this game; Andy Dalton wasn't sacked at all, and I can't even remember him even getting hit once. As for Cincinnati's stop unit, Vontaze Burfict suffered a concussion. His absence was a major reason why Flacco was able to get his act together. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bills",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Of all the opening-week insanity, this was the craziest result. The Bears were favored by a touchdown, and no one seemed to give Buffalo a chance. The Bills, after all, looked absolutely dreadful in the preseason. With fights during training camp and dissension in the front office, Buffalo seemed doomed to have a miserable season. That looked like it would be the case early on. E.J. Manuel, who struggled to complete routine passes in exhibition contests, threw behind his tight end on his first attempt on what turned out to be a scoreless opening drive. However, Manuel fired just five incompletions for the remainder of the game. He finished 16-of-22 for 173 yards, two touchdowns (one passing, one rushing) and an interception that he tried forcing into Marquise Goodwin. It wasn't a great performance, but Manuel actually looked like a functional quarterback for a change. Of course, this outing should be taken with a grain of salt because it came against one of the two worst defenses in the NFL. It's unbelievable how inept Chicago's stop unit is. ",
            "2": "The Bears actually had more issues with the Buffalo running backs. Fred Jackson (7-61), C.J. Spiller (15-53) and Anthony Dixon (5-60) combined for 174 rushing yards, which is just ridiculous. Chicago is going to allow premier runners to have some record-setting performances this year. ",
            "3": "Only one Bill logged more than 36 receiving yards. That would be Robert Woods (4-78), who made a great, leaping catch in the fourth quarter. Sammy Watkins didn't do much, registering three grabs for 31 yards. ",
            "4": "This loss wasn't completely Jay Cutler's fault, but the Chicago quarterback could have played better. Cutler went 34-of-49 for 349 yards, two touchdowns and a pair of interceptions. One of the picks was terrible, as he heaved it late across his body. Cutler always seems to have at least one of these #yolo throws every game, and it usually doesn't turn out well. It's disappointing that he hasn't learned his lesson yet. To be fair, Cutler had some issues with pass protection. He also missed Alshon Jeffery, who was sidelined for most of the second half and overtime with a hamstring. It's a shame for Jeffery, as he looked like he was going to have a huge outing. He recorded five grabs for 71 yards in slightly more than a half of action. His biggest play was a 44-yard gain in which he beat Leodis McKelvin. ",
            "5": "Brandon Marshall also missed some time with an ankle, but he was able to reenter the game. He saw a team-high 12 targets, catching eight of them for 71 yards and a touchdown. However, he fumbled the ball while fighting for yardage on one play in the first half. Martellus Bennett (8-70) hauled in Cutler's other score. ",
            "6": "Matt Forte had a nice outing, registering 82 yards on 17 carries and catching eight balls for 87 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Texans",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "6"
        },
        "comments": {
            "amount": "8",
            "1": "<i> Editor's Note: </i> Charlie's handling this write-up, but I'm not sure if we learned anything about the Texans in this victory. The Redskins might be one of the worst teams in the league, so a 17-6 home win might not be very impressive. ",
            "2": "Everybody knew the Texans' defense had the potential to be good, but the Houston stop unit was awesome in the season opener. J.J. Watt was completely dominant, plus the Texans got a massive performance from safety D.J. Swearinger. No. 1 overall-pick Jadeveon Clowney was disruptive in the first half and played well before a sprained MCL knocked him out at halftime. Even with a new coaching staff, it was a similar story for the Redskins, as crushing mistakes and turnovers gave the game away. Robert Griffin III had no time to throw the ball, and turnovers inside the Texans 10-yard line took away critical points from Washington. ",
            "3": "In the first quarter, both teams struggled to move the chains. After a good 26-yard punt return from Andre Roberts, the Redskins got some good Alfred Morris runs that took Washington from midfield to the goal line, and that set up a short touchdown run for fullback Darrel Young. Houston came back right back as DeAndre Hopkins (4-89) got wide open in busted coverage for a 76-yard touchdown. A few plays later, Texans rookie running back Alfred Blue blocked a punt and scooped it up to return it a few yards for a touchdown. Houston was up 14-6 at the half. ",
            "4": "The Redskins self-destructed during the third quarter. Morris (14-91) fumbled a handoff inside the Texans 10-yard line and Watt recovered the ball. Shortly later, Washington had a pass play of 47 yards to Niles Paul inside Houston's 10-yard line, but Swearinger stripped the ball out for a Texans' recovery. Houston returned the favor as one of its few good offensive drive ended when Arian Foster fumbled the ball away inside the Redskins' 10-yard line as he was stripped by Ryan Kerrigan. Foster (27-103) and Andre Johnson (6-93) moved the ball for a field goal drive to ice the game for Houston. The Texans' defense did the rest and slammed the door on Washington. ",
            "5": "Griffin was 29-of-37 for 267 yards with no touchdowns and no interceptions. Pierre Garcon (10-77) and DeSean Jackson (8-62) were kept from making any long pass receptions. The big regret for Washington has to be not giving Morris more carries, as he had 91 yards on only 14 attempts. ",
            "6": "You can't say enough about Watt. He was absolutely dominant with a sack, a blocked extra point, a fumble recovery, a batted pass, a tackle for a loss and a ton of pass pressures on Griffin, plus drew an intentional grounding penalty. Swearinger notched eight tackles with a sack, forced fumble and other good blitzes for pass pressure. Linebacker Brooks Reed was very good with five tackles - some of them for a loss - and a sack, plus some plays in the backfield. ",
            "7": "The Redskins' defense played well and put a lot of heat on Ryan Fitzpatrick. The Texans' starter was 14-of-22 for 206 yards and a touchdown. Jason Hatcher had a sack, while Keenan Robinson and Kerrigan played well. ",
            "8": "Finally, Washington's special teams were a mess. Not only did that unit have the blocked punt for a touchdown, but it also committed a hilarious play on a punt return where a Redskins blocker rocked his own punt returner out of bounds to cancel out a return with plenty of room to run. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Titans",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "<i> Editor's Note: </i> I chided an NBC employee for calling the Titans one of the worst teams in the NFL this summer. That has been confirmed as a moronic statement, as Tennessee played well at times last year despite barely having Jake Locker. The Chiefs, meanwhile, are in lots of trouble. ",
            "2": "In the preseason, the Tennessee Titans' defense looked like it was going to struggle, but apparently defensive coordinator Ray Horton was hiding what he planned on doing because the Titans' stop unit played superbly against the Chiefs. Tennessee shut down Jamaal Charles to disappoint his fantasy owners. Charles ran for only 19 yards on seven carries with four catches for 15 yards. Chiefs' head coach Andy Reid abandoned the run when the Titans established a lead before halftime. Tennessee got an efficient game out of quarterback Jake Locker to earn an impressive road win at Arrowhead. ",
            "3": "Kansas City got on the board first with a field goal drive before missing another field goal. Locker remained poised after a slow first quarter and moved the ball down the field to set up a five-yard touchdown pass to Delanie Walker (3-37). With 30 seconds left before halftime, Andy Reid made a horrible play call as he had Smith throw a deep ball from the Chiefs' own 1-yard line, and Jason McCourty went up over Donnie Avery to intercept the pass in Chiefs territory. That led to a Tennessee field goal before the half. ",
            "4": "To open the third quarter, Locker drooped in a perfect pass to Justin Hunter (3-63) for 39 yards. Locker kept moving the ball down the field before a 6-yard touchdown pass to Kendall Wright (6-46) on third-and-goal. Midway through the same quarter, Smith threw a mirror image of his first interception that was picked off by McCourty again. Locker then moved the ball for a field goal. The Chiefs had one drive that ended with Anthony Fasano catching a five-yard touchdown, but that was all the Kansas City offense could muster. Locker led another field goal drive to ice the win. ",
            "5": "Locker completed 22-of-33 passes for 266 yards with two touchdowns. Fantasy owners of Bishop Sankey (6-25) have to be worried as the Titans favored Shonn Greene (15-71) and Dexter McCluster (9-29). Perhaps Sankey will get a bigger role as the year wears on, and he flashed in the second half with a 12-yard run. Greene is clearly a limited player. ",
            "6": "Smith completed 19-of-35 passes for 202 yards with a touchdown and three interceptions. He ran for 36 yards on six carries, too. The Chiefs' wide receivers predictably struggled, as Donnie Avery (7-84) and tight end Travis Kelce (3-49) led the team. The receivers were terrible at getting open, while the offensive line was also ineffective. The interior of the Chiefs' line struggled, as did left tackle Eric Fisher at times. Kansas City missed Dwayne Bowe, but with the offensive line, it could be a rough season for Smith and Charles. ",
            "7": "The Titans' defense played fundamental, disciplined football. Jurrell Casey was disruptive. Wesley Woodyard, Sammie Lee Hill, Karl Klug and Coty Sensabuagh recorded sacks. McCourty was excellent, and Michael Griffin added an interception. ",
            "8": "A bright spot for Kansas City was the play of safety Eric Berry. He was all over the field and recorded 14 tackles. The Chiefs' pass-rushers also had some production as Justin Houston had two sacks. Allen Bailey and Tamba Hali also got after the quarterback. ",
            "9": "Some bad news hit the Chiefs, too. Inside linebacker Derrick Johnson went down with an Achilles injury that looks serious. Defensive end Mike DeVito also had to be carted off the field with a serious injury. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Dolphins used to be dominant in September home games when they started them at 1 p.m. They opted to schedule those contests at 4:15 (and subsequently, 4:25) about a decade ago for some strange reason, and consequently lost their dominant homefield advantage. Perhaps this victory will convince them that they need more 1 p.m. home starts on their slate. With near-100-degree temperatures and high humidity, the Patriots, wearing their navy-blue jerseys, looked completely gassed by the end of the game. Of course, the conditions weren't the only reason Miami pulled off this big upset. Miami dominated the line of scrimmage and pushed New England's pedestrian offensive line around. ",
            "2": "There will be many questions for Bill Belichick. Why did he trade Logan Mankins when he barely had any other talent in the interior, especially with Tom Brady showing signs of major decline the year before? Brady took four sacks and was stripped twice by Cameron Wake, who absolutely dominated Sebastian Vollmer. Brady went 29-of-56 for 249 yards and a touchdown, but he was much worse in the second half, going 10-of-27 for 62 yards. Both the pressure and the heat were too much for Brady, who had major issues with his accuracy as the afternoon progressed. ",
            "3": "Brady's touchdown went to Rob Gronkowski, who caught four balls for 40 yards. Gronkowski saw a team-high 11 targets, but was on a snap count. Julian Edelman, meanwhile, led the Patriots with six receptions for 95 yards. ",
            "4": "New England's offensive line also struggled to run block. Stevan Ridley did nothing on the ground, mustering just 21 yards on eight carries. Shane Vereen did more with less (7 carries, 36 yards, touchdown) and also hauled in five catches for 35 receiving yards. I found it interesting that Vereen got the goal-line carries on the team's second drive. This has to be a major concern for Ridley fantasy owners. ",
            "5": "The Dolphins were dominant offensively in the second half, and they could have won this game by much more if they didn't shoot themselves in the foot prior to intermission. The team had three careless turnovers. The first came from Mike Wallace, who fumbled because of a massive hit by stud linebacker Jamie Collins. The second was an inaccurate downfield delivery from Ryan Tannehill, who was a bit off the mark in the opening half. The third was a Lamar Miller fumble. Miller screwed up later, stopping his route and causing an incompletion on third down. I wondered why Miller was being used instead of Knowshon Moreno at that moment. Joe Philbin and his staff apparently had the same thought. Moreno was used much more after that, as his 24 carries for 134 yards and a touchdown dwarfed Miller's 11 totes for 59 yards, though Miller did score on a receiving touchdown (4 catches, 19 yards) and had another score wiped out by a holding penalty. Moreno was awesome though. He simply wouldn't go down on some plays. Having him healthy is a huge boost for this offense. ",
            "6": "Tannehill, meanwhile, went 18-of-32 for just 178 yards, two touchdowns and the aforementioned pick. Tannehill was solid overall, but did have some accuracy issues. He also endured some drops, including one by Dion Sims in the end zone. Tannehill's two scores went to Miller and Mike Wallace, who finished with seven grabs for 81 yards. If you're surprised that Wallace wasn't shut down by Revis Island, don't be; Bill Belichick used Darrelle Revis to scheme against Charles Clay, who didn't do much as a consequence (2-27). <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Jets",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Derek Carr looked so impressive in the preseason finale against Seattle's starting defensive unit that the Raiders didn't waste much time naming him the starter over the banged-up Matt Schaub. It appeared to be the correct decision, but maybe Oakland shouldn't have been as aggressive. Carr had a dreadful performance and didn't appear as though he was ready to start in the NFL. Carr finished 20-of-32 for 151 yards and two touchdowns. That stat line doesn't seem too bad, but consider that he was nearly picked off a few times (rookie Calvin Pryor dropped an easy one). Also, most of Carr's yardage came on the team's final offensive drive of the game in which the Jets were playing prevent because they were up 19-7. Carr barely attempted anything downfield. In fact, the Raiders' offense had 85 yards on 43 plays with three minutes remaining in regulation. At that time, Carr had thrown downfield more than 15 yards only once. He tried to dink and dunk the either contest, and that proved to be a poor strategy. ",
            "2": "Carr's dinking and dunking didn't work because the Raiders couldn't establish the run at all. The Jets' ferocious run defense made sure that didn't happen. Maurice Jones-Drew and Darren McFadden were completely bottled up, gaining 11 and 15 yards, respectively. Of Jones-Drew's 11 yards (9 carries), 12 came on one play, so the veteran was stuck in negative territory for most of the afternoon. ",
            "3": "Carr's primary targets were Denarius Moore and Rod Streater. Moore led the team with eight targets, but caught only two of them for eight yards. Carr simply missed Moore repeatedly, throwing behind him on a couple of occasions. Rod Streater was more efficient. His seven targets turned into a 5-46 line along with a touchdown. James Jones (3-34) caught Carr's garbage-time, backdoor score, but hurt his team with a false start in the fourth quarter. ",
            "4": "As for the winners, I'll admit that the Jets should have won by more despite wagering heavily on Oakland. The backdoor cover is an obvious indication of that, but the Jets simply shot themselves in the foot with mistakes. For instance, Willie Colon ruined the first drive with a hold. NewYork committed four penalties in the first seven minutes of the game. Geno Smith then tossed an interception that he telegraphed and followed that up with a lost fumble on a hard hit in the red zone. The backup quarterback, QBDK, then missed an open Eric Decker for a touchdown on a trick play. All of this was just in the first half. The Jets were much cleaner following intermission. Smith made just one mistake, as he took a bad sack to put the team out of field-goal range. He was otherwise flawless, completing every single pass in the second half (8-of-8, 67 yards). Overall, he was 23-of-28 for 221 yards, one touchdown and the aforementioned pick. ",
            "5": "Smith's sole score was a flip to Chris Johnson (5 catches, 23 yards), who was actually outgained on the ground by Chris Ivory. Of course, most of Ivory's yardage came on a 71-yard touchdown in which the Raiders seemingly did everything wrong. They tackled each other, plugged the wrong gaps, etc. It was awful, as Ivory should never have gains of 71 yards. Johnson, meanwhile, registered 68 yards on 13 carries. That was more of Oakland struggling than Johnson looking good. This could be his best performance of the season. ",
            "6": "Only one Jet was targeted more than five times. That would be Eric Decker, who hauled in five of the six balls thrown his way for 74 yards. As mentioned, QBDK missed him for a touchdown. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "Is it fair to argue that Gus Bradley cost the Jaguars this victory? Bradley had the opportunity to name Blake Bortles as the starter after the No. 3 overall pick had a strong preseason. Bortles outplayed Chad Henne by a light year, so if Bradley followed his former mentor's mantra, he would have started Bortles, much like Pete Carroll once went with Russell Wilson over Matt Flynn. Bradley's decision looked like the right one early on, as Chad Henne lobbed bombs to Allen Hurns. However, Henne struggled to do anything in the second half, as his mediocrity was greatly exposed. It's no guarantee that Bortles would have enjoyed better results, but it's likely that he would have. Bortles is the superior talent by a wide margin, and he probably would have actually been able to complete routine passes, whereas Henne had issues doing so. Henne was 12-of-17 for 167 yards and two touchdowns in the opening half, but was just 12-of-26 for 99 yards following intermission. Credit the Eagles for making the proper adjustments, but this was more about Henne's ineptitude more than anything. He had players open, but simply missed them. He naturally capped it off with a strip-sack returned for a touchdown that allowed the Eagles to cover the spread. That was absolutely brutal because it seemed as though Jacksonville would cover the entire afternoon. The Jaguars maintained a 17-0 lead as 10.5-point underdogs for most of this contest, so they were the right side. ",
            "2": "At any rate, there were a couple of reasons why the Jaguars controlled this game for most of regulation, but the primary factor was Nick Foles' poor play. Foles was anemic early on, going just 12-of-24 for 139 yards and an interception in the opening half. He missed open receivers at an alarming rate. He overthrew his tight ends down the seam on numerous occasions. He sailed a pass miles over Jeremy Maclin's head. He also had an open Maclin downfield, but he didn't see him and consequently got sacked. Philadelphia's offensive line had major issues with Jacksonville's pass rush; Jason Peters even surrendered two sacks in the opening half, while All-Pro guard Evan Mathis exited with a knee injury. Foles played better as the game went on, however, finishing 27-of-45 for 322 yards, two touchdowns and a pick. His scores went to Maclin (4-97) and Ertz (3-77). Maclin led the team in targets with 10. Riley Cooper, meanwhile, barely did anything, hauling in four balls for 29 yards. ",
            "3": "LeSean McCoy had a nice outing - 21 carries, 74 rush yards, six catches, 41 rec. yards - but he wasn't the Philadelphia running back who found the end zone. That was Darren Sproles, who gained 71 yards on 11 carries. His touchdown scamper was a 49-yarder, which was actually the longest touchdown carry of his career. ",
            "4": "Getting back to the Jaguars, undrafted rookie Allen Hurns made some noise early. He caught four balls for 110 yards and two touchdowns in the opening half, but had zero receptions afterward. I briefly had Hurns on my <a href=/fantasy2014sleepers.php>Fantasy Football Sleepers</a> list, but took him off when Cecil Shorts seemed to return to health. Hurns will get all of the attention, but I'd rather have Marqise Lee on my fantasy roster. Lee had more targets than Hurns, 10-9, and caught more passes, 6-4. Lee's receptions went for 62 yards, and he would have scored if Henne hadn't missed him in the end zone. Lee will be a big producer once Gus Bradley stops sabotaging his season and finally decides to start Bortles. ",
            "5": "Toby Gerhart was predictably unspectacular. He rushed for just 42 yards on 18 carries. He had a nifty, 11-yard run, but plodded for minimal yardage otherwise. Granted, Philadelphia has a stout rush defense, but Gerhart doesn't have much talent and will be a big disappointment for anyone expecting an RB2 this year. An ankle injury that hampered him didn't help his cause. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "It's amazing how different the two halves in this game were. The Steelers established such a big lead at intermission that I even began writing my recap during the break. Here's what I was going to start off with: <i> There was one play that completely epitomized this game. I'm sure most of you have seen it. Antonio Brown, returning a punt, jumped in the air and karate kicked Cleveland's punter in the head on what turned out to be a big gain that set up an eventual touchdown. The score put the Steelers up 27-3 in a game that was completely dominated by Pittsburgh. The Browns, who look like the worst team in the NFL, were absolutely humiliated. </i> I guess the Steelers simulated to their Thursday night game because Cleveland were just as dominant in the second half as Pittsburgh was in the first. The Steelers were completely gassed defensively, as they had no answer for Brian Hoyer. The Cleveland quarterback couldn't do anything to open the game. He was 4-of-11 for 57 yards by the break, and I wondered if Mike Pettine would bench him in favor of Johnny Manziel. However, Hoyer was 15-of-20 for 173 yards the rest of the way, ultimately finishing 19-of-31 for 230 yards and a touchdown. Hoyer did have a dropped interception by Ike Taylor, but the Steelers otherwise were helpless to stop him, as he constantly moved the chains. There were some exceptions - rookie linebacker Ryan Shazier had a great afternoon - but it's a very dubious sign that most of the Pittsburgh defenders were so exhausted by the end of the game. It's not a good sign going forward, especially with a game coming up on Thursday. ",
            "2": "You might be wondering whom Hoyer threw to, considering that his receiving corps is so depleted. Jordan Cameron, the only prominent name, caught only two balls for 47 yards, though he would've scored a touchdown in the first half if he didn't stumble over his own two feet. Cameron left the game in the third quarter because he aggravated his AC joint. Andrew Hawkins actually dominated the targets and receptions. He saw 10 balls thrown his way, and he snagged eight of them for 87 yards. No other Brown recorded more than two catches. ",
            "3": "While Hawkins is worth an add, the No. 1 player who should be picked up in Week 1 is rookie running back Terrance West. Ben Tate was running well early - six carries, 41 yards - but he hurt his knee and left the game. Shocker. West took over and was dominant, tallying 100 yards on just 16 carries. He has lots of talent, so he needs to be added in all formats. ",
            "4": "Ben Roethlisberger had a great stat line - 23-of-34, 365 yards, touchdown and an interception - but those numbers are slightly misleading because some of Roethlisberger's big, first-half gains came on screens. For instance, an Antonio Brown 41-yarder on the opening drive came on a slip screen. Roethlisberger also struggled in the second half, going just 7-of-12 for 87 yards following intermission. Having said that, Roethlisberger made several great plays to lead his team to victory, which was capped off by a game-winning drive at the very end when Cleveland had all of the momentum. What stood out most was when he escaped out of two potential sacks and found Brown in the end zone for a 35-yard touchdown. It should be noted that part of the reason Roethlisberger struggled after the break was because the offensive line couldn't block Cleveland at all. ",
            "5": "Brown paced the Steelers in receiving yardage with 116 on five catches. Le'Veon Bell (6 catches, 88 yards) and Markus Wheaton (6-97) tied for the team lead in catches. Rookie cornerback Justin Gilbert struggled to cover Wheaton. ",
            "6": "I mentioned Shazier earlier. The No. 15 overall pick had a terrific regular-season debut. He made a huge hit on Terrance West, stuffed another running back for a loss and made a pass break-up in the first half, nearly coming away with an interception. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "It didn't look like either team was going to do much offensively early on, as this game was stuck at 6-0 Vikings for what seemed like the longest time. The Vikings had some issues early, especially with Matt Cassel, who was having problems with his helmet radio. He had to keep going to the sidelines for the plays, as the surprising crowd noise caused a disruption. Cassel and the Viking coaches finally got on the same page, and the veteran quarterback ultimately put together a nice outing. He finished 17-of-25 for 170 yards and two touchdowns. It was an economical sort of day, but he should be happy with that considering the tough defense he was battling. The Rams, however, lost Chris Long to an ankle, adding injury to insult. ",
            "2": "Adrian Peterson is the face of the Minnesota franchise, but he wasn't much of a statistical factor in this victory. He rushed for 75 yards on 21 carries, failing to come through on his promise to score a touchdown on his first touch. However, it would be foolish to dismiss Peterson's impact, given that the Rams were so focused on stopping him that they seemingly forgot about the other Vikings. One such player whom St. Louis couldn't completely focus on was Cordarrelle Patterson. If you haven't looked at the box score, you might be surprised to learn that Patterson actually outrushed Peterson, gaining 102 yards on three carries. He scored on a 67-yard rush, which came directly out of the backfield. Patterson didn't do much as a receiver, however, grabbing three balls for 26 yards. ",
            "3": "Only one Minnesota player logged more than 26 receiving yards. That would be Greg Jennings, who snatched six passes for 58 yards and a touchdown. Jennings was a huge disappointment last season, but perhaps some quarterback stability will allow him to come somewhat close to meeting expectations. ",
            "4": "The Rams, meanwhile, were a mess offensively. Shaun Hill went 8-of-13 for 81 yards and an interception in one half of action. He was benched during halftime on what was first reported to be a coach's decision. Jeff Fisher, who spent most of the time yelling at his players like a deranged lunatic, appeared to make a very curious choice to go with practice-squad fodder Austin Davis. However, it was later revealed that Hill endured a thigh malady. Either way, Hill didn't look too pleased. He stood on the sidelines and shook his head the entire second half. Davis went 16-of-23 for 192 yards and a pick, but most of that was against prevent. Davis didn't look like a functional quarterback. In fact, Dick Stockton, who called the game, had some fun with Davis' ineptitude, citing that he was lofting dying quails to his receivers. ",
            "5": "Some quick numbers on St. Louis' crappy offense: - Zac Stacy struggled to find running room, gaining just 43 yards on 11 carries. Benny Cunningham, whom some see as a threat to Stacy's job, had a 5-carry, 21-yard afternoon. - Kenny Britt didn't log a single reception. He did play, but failed to haul in any of his three targets. With the Rams enduring a dubious quarterbacking situation, Britt can be dropped. - The Ram receiver who is worth rostering is Brian Quick. Coming off a strong training camp and preseason, Quick saw a team-high nine targets. He caught seven of those balls for 99 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The 49ers had a miserable offseason. It began with a strange story from an unreliable source that San Francisco was trying to trade Jim Harbaugh. There were plenty of arrests, injuries and holdouts. The preseason saw the offense completely struggle, and that was followed up by a report Sunday morning that Harbaugh lost the players. So much for that. San Francisco completely dominated this game from start to finish. The defense made some big plays, the offense performed well, and it certainly didn't seem like Harbaugh lost the locker room whatsoever. Having said that, it's difficult to tell whether or not San Francisco's defense was responsible for limiting Dallas' supposed high-powered offense to 17 points. That's because the Cowboys committed many turnovers, constantly shooting themselves in the foot. It happened immediately when DeMarco Murray was strip-sixed on the opening drive. Tony Romo then took over as the player who ruined Dallas' offense. Romo made some nice throws throughout the contest - he went 23-of-37 for 281 yards and a touchdown - but he was responsible for three interceptions, and he easily could've had several more. Romo's first pick was carelessly thrown in triple coverage. He then tossed a pick in the end zone. He had someone open, but threw the ball late. This ended up being a poor decision because he forced it in, and Patrick Willis easily snatched ball out of the air. Romo's final pick was also late, and he sailed it into double coverage. A potential fourth pick was dropped by a San Francisco defensive back in the second half. Romo has been careless with the football before, but this was much different. He didn't seem like he was prepared for this game. He constantly made late throws and didn't appear to see the field clearly. Thus, I don't know if I can suggest if his second back procedure had to do with his poor performance. I'm sure it was somewhat of a factor, but Romo's issues seemed more mental than anything. ",
            "2": "It didn't help Romo's cause that Dez Bryant missed some time on a couple of occasions. He took a big hit and had to briefly exit the contest during Romo's first pick. He came back but then had to leave again because of dehydration. Bryant ultimately finished with four catches for 55 yards. ",
            "3": "Romo's sole score went to Terrance Williams, who saw a team-high seven targets go his way. Williams hauled in four of those balls for 50 yards. ",
            "4": "Thanks to a depleted front seven, DeMarco Murray ran well. He gained 118 yards and a touchdown on 22 carries, but he did have that aforementioned fumble returned for a score. ",
            "5": "As mentioned earlier, San Francisco's offense clicked despite looking very sluggish in the preseason. Colin Kaepernick misfired on just seven occasions, going 16-of-23 for 201 yards and two touchdowns. He was clearly the superior signal-caller in this matchup, making several impressive throws, particularly on his first drive. Fifteen of Kaepernick's 21 attempts went to Anquan Boldin (8-99) and Vernon Davis (4-44). Davis scored twice. Michael Crabtree wasn't as much of a factor, as he tallied two grabs for 25 yards. He was hampered by a calf injury. ",
            "6": "It helped Kaepernick that his team ran the ball extremely well. Frank Gore was solid (16-63), while Carlos Hyde looked like the real deal. The second-round rookie rumbled for 50 yards and a touchdown on just seven carries. He has a very bright future as a potential fantasy RB1 once Gore moves on. For now, he's just a bench stash because Gore will continue to start. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The Buccaneers were bet heavily throughout Sunday because it was announced that Cam Newton wouldn't be playing this game. After all, how could Derek Anderson possibly be victorious, on the road, with a depleted offensive line and receiving corps, against a team that was a rebound candidate this season? Well, it turned out that Anderson would actually be the superior quarterback in this game, and it wasn't even close. Josh McCown was atrocious. It's crazy because the Buccaneers brought in McCown to be a veteran presence at the signal-caller position, yet McCown played like some clueless rookie. He repeatedly threw the ball when he was getting hit. Like, literally when he was going down and taking a sack. This worked out once when he successfully flipped a reception to one of his targets, but it hurt him more than it helped him; one of McCown's two picks occurred as he was going down. Mccown finished 22-of-35 for just 183 yards, two touchdowns and the pair of picks. Extremely poor pass protection really hurt him all afternoon - Logan Mankins left the game in the second quarter with a knee injury - but McCown deserves a large amount of the blame for either holding on to the ball too long or doing stupid things like lofting careless passes while falling to the ground. McCown did have a nifty 13-yard scramble in the fourth quarter to put his team in the red zone, but he also lost a fumble due to poor pocket awareness. ",
            "2": "Tampa's inability to run the ball hurt McCown. Doug Martin managed just nine yards on nine carries, as he was constantly in and out of the game with a leg injury. He also dropped a pass. Losing Mankins in the second quarter was a huge blow. Martin's replacement, Bobby Rainey, cost his team a victory by fumbling on the team's real final offensive drive. ",
            "3": "As you can imagine, Vincent Jackson was hurt by McCown's ineptitude. Jackson hauled in four balls for just 36 yards. Mike Evans outgained him by the minimal amount (5-37), though he had a touchdown wiped out because the officials ruled that he stepped out of the back of the end zone. ",
            "4": "As mentioned, Derek Anderson was infinitely superior to McCown. A sober Anderson went 24-of-34 for 230 yards and two touchdowns, while Cam Newton watched from the sideline while he wasn't running into the huddle during TV timeouts. Anderson made just two mistakes in this contest. The first was missing Greg Olsen for a touchdown in the second half. The other was hurling a ball that should have been intercepted at the end of the fourth quarter. Safety Dashon Goldson inexplicably had the ball sail through his hands. Had he caught it, there was a great chance he would've run the ball back for six. The Buccaneers did force a punt, but Rainey fumbled on the ensuing possession, effectively ending the game. It helped Anderson's cause that he had a superior receiver to throw to. Kelvin Benjamin had an excellent debut, hauling in six of his eight targets for 92 yards and a touchdown. The Buccaneers had no answer for him. Benjamin looks like he's going to be a stud. Meanwhile, Greg Olsen paced the team with 11 targets, snagging eight of them for 83 yards and a score. ",
            "5": "The Panthers ran the ball extremely well, registering 72 yards on 14 carries. Jonathan Stewart (9-20) was much less effective. Mike Tolbert was used in short-yardage situations, but he constantly failed to convert. ",
            "6": "I have to mention something annoying that Panthers' head coach Commander Adama did during this contest. The Buccaneers completed a 4-yard pass in the third quarter that looked a bit shaky (it was one of the times when McCown threw a pass while going down). Adama wasted no time in throwing the challenge flag. I don't know why he would waste everyone's time by asking for a review of such an insignificant, 4-yard play. There weren't even any Cylons involved, so it's not like Adama had an alternative reason for challenging. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "The Broncos left the door open for Andrew Luck. They led this game by double digits for most of regulation, yet some second-half offensive ineptitude allowed Indianapolis to come back. The Colts somehow had the ball, down seven, with a couple of minutes remaining. It seemed like this would be yet another Andrew Luck comeback, but Indianapolis failed on fourth down when rookie corner Bradley Roby broke up a pass intended for Reggie Wayne. Denver escaped with a victory. It was shocking to see Luck fail on a fourth-quarter comeback attempt, but there were two other major take-aways from this game: 1. Peyton Manning looked done in the second half. I never thought I'd be typing that after his brilliant first half - 16-of-22, 199 yards, three touchdowns - but he struggled to complete routine passes after the break. Manning was just 6-of-14 for 70 yards in the second half. He did endure a couple of drops, but he had receivers open and couldn't hit them. This includes a pair of major overthrows to his targets when he was trying to run out the clock near the end of regulation. I have no explanation for what happened. Manning was battling a defense mostly devoid of talent. He was so sharp prior to intermission, so I don't know why he looked like Josh McCown near the end of the game. 2. Denver's defense might just be able to carry this team. The Broncos did allow some scores late, but that was bound to happen against an exceptional quarterback like Luck. Besides, there were a couple of fluky instances, including one play in which the entire defense assumed Dwayne Allen went out of bounds when he tip-toed the sideline for a 41-yard, fourth-quarter touchdown. DeMarcus Ware led the Broncos' pass rush with 1.5 sacks. The pressure he applied allowed Rahim Moore to come away with a pair of interceptions. Nate Irving (5 tackles, 1 sack) played well, but got hurt at one point. Roby, as mentioned, made the game-ending break-up on Wayne. ",
            "2": "Wayne ended up leading the team with nine receptions for 98 yards, but it was Allen (4-64) and Hakeem Nicks (5-36) who caught Luck's touchdowns. T.Y. Hilton (5-41) dropped a fourth-quarter pass. ",
            "3": "Luck finished 35-of-53 for 370 yards, three touchdowns (two passing, one rushing) and a pair of picks. Both interceptions were overthrows, though Coby Fleener should have hauled in one of the passes despite it being a bit too high. Luck was also nearly picked on another occasion and was stuffed on fourth-and-goal at the 1-yard line, but he caught fire toward the end of the game. ",
            "4": "It should come as no surprise that Trent Richardson struggled to run the ball. Richardson gained just 20 yards on six carries. Ahmad Bradshaw predictably looked better, mustering 15 yards on three carries while serving a big role as a pass-catcher; Bradshaw logged five catches for 70 receiving yards. Bradshaw did have a blemish though, dropping a pass in the second half. ",
            "5": "Getting back to Manning, his final numbers were 22-of-36 for 269 yards and three touchdowns. He was nearly picked in the first half, though that was because Demaryius Thomas fell down in the red zone. Thomas struggled, catching four passes for 48 yards. He dropped a ball late in the game. ",
            "6": "Unlike Demaryius Thomas, Julius Thomas had a dominant outing. He caught seven balls for 104 yards and three touchdowns, all of which occurred prior to intermission. This prompted my editor to comment, I think Julius Thomas has crashed ESPN's fantasy servers. Thomas made a couple of errors in the second half, however. He fumbled a ball, which made a lucky bounce right into a teammate's arms. He then dropped an onside kick recovery, but that didn't end up hurting the Broncos because Luck threw a subsequent interception. ",
            "7": "Elsewhere for the Broncos, Emmanuel Sanders notched six balls for 77 yards. Montee Ball, meanwhile, rushed for 67 yards on 23 carries, but managed to find the end zone on a very tough run. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Lions",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "The final score says this game was lopsided, but it could have been so much worse. The Lions could have easily won by five or six touchdowns, but they spent more than half of this contest shooting themselves in the foot. Of course, this is nothing new, as Detroit has always found a way to screw up over the years. It's discouraging that the Lions were sloppy once again, but on the bright side, they cleaned up their act for the most part after intermission. Here were several of the many errors Detroit made throughout the evening: - An impressive Calvin Johnson reception was wiped out by illegal touching. - The Lions forced a punt, but were whistled for roughing the punter. Following a pass-interference penalty, they surrendered a touchdown. - A second-quarter Golden Tate reception that would've made it first-and-goal was wiped out by Dominic Raiola's hands-to-the-face infraction. - Rookie kicker Nate Freese was wide left from 43 yards out. Where's Kickalicious when you need him? - Several passes were dropped, including two by Calvin Johnson. One was in the end zone. ",
            "2": "Despite all of these errors, Detroit easily prevailed, thanks to Matthew Stafford, who was excellent. Stafford has worked hard this offseason to improve his conditioning, and it definitely showed, as he used some impressive pocket mobility to connect on some passes downfield. His first score, for instance, occurred because he brushed off a pass-rusher and found Calvin Johnson deep for a touchdown. Two Giant defensive backs collided into each other, allowing Megatron to be wide open. Stafford finished 22-of-32 for 346 yards and three touchdowns (two passing, one rushing). He would've had an even bigger night if he hadn't endured some drops from his receivers, including one in the end zone by Johnson. Stafford's new-found athleticism is very impressive. ",
            "3": "Calvin Johnson had those two drops, but he was still able to enjoy a big night. He caught seven passes for 164 yards and two touchdowns. He could have easily gone over the 200-yard barrier had he not let some balls fall through his hands, however. ",
            "4": "Only two other Lions caught more than one pass. They were Reggie Bush (6-49) and Golden Tate (6-93). Bush looked good as a pass-catcher, but mostly struggled as a runner. He did a good job of being patient on a run that secured a first down in the red zone, but all of his other carries were ugly. He gained 15 yards on nine tries, while Joique Bell had more success (15-51, TD). ",
            "5": "As for the Giants, nothing changed from their disastrous preseason. Eli Manning was a complete train wreck in the exhibition, resembling a rotting carcass. Manning wasn't any better in this contest, going 18-of-33 for 163 yards, one touchdown and two interceptions. The first pick was a low throw, while the second was telegraphed. Manning was extremely fortunate to get out of this game with just those two interceptions; he was nearly picked off on so many other occasions. The new offensive coordinator will get lots of blame, especially from the media which is afraid of criticizing a member of the Manning family. It's true that there were plenty of communication issues with his receivers, but Manning was often guilty of throwing wide of his targets, even on routine passes. He just looks done. I currently have the Giants selecting a quarterback in my <a href=/draft2015.php>2015 NFL Mock Draft</a>, which will be updated tomorrow. ",
            "6": "Manning's sole score went to tight end Larry Donnell, who was targeted multiple times in the end zone. Victor Cruz, meanwhile, caught just two balls for 24 yards. Cruz's stats will take a major dive this season because of Manning's ineptitude. ",
            "7": "The Giants didn't run the ball enough with Rashad Jennings. The former Jaguar and Raider gained 46 yards and a touchdown on 16 carries. He also chipped in with four catches for 50 receiving yards. Jennings looked much better than the sluggish Andre Williams (5 carries, 9 yards). ",
            "8": "At one point, it appeared as though the Giants were going to suffer more than just a regular-season loss. Jason Pierre-Paul was on the ground, yelling in agony at one point in the first quarter. Losing him would've been devastating, but the athletic pass-rusher was able to return to the lineup later in the opening half. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "The second ESPN Monday night game has typically featured at least one dud team, but this was a superior matchup in which both participants could qualify for the playoffs. It was a tough defensive battle, but Arizona ultimately prevailed, as San Diego blew opportunity after opportunity as the night progressed. Here are some examples of the Chargers getting in their own way throughout the evening: - Eric Weddle dropped a potential Carson Palmer interception in the first quarter. - The Chargers were granted great field position, thanks to a Jeremiah Attaochu blocked punt, but couldn't do anything with it and had to settle for a field goal. - Dwight Freeney inexplicably whiffed on two potential sacks in the second quarter, as Carson Palmer somehow transformed into Ben Roethlisberger, magically eluding numerous tackles. - The Chargers dropped plenty of passes. Antonio Gates, Eddie Royal and Keenan Allen were all guilty of this throughout the game. - Speaking of Royal, he screwed up on a route, allowing the Cardinals to intercept a Philip Rivers pass. This led to an Arizona field goal just before intermission. - A poor snap by the backup center - Nick Hardwick suffered an injury early on - ruined a drive in the middle of the fourth quarter. - The Chargers inexplicably couldn't get the snap off on time on a fourth-and-2 with less than two minutes remaining in regulation. They were forced to burn a precious timeout. ",
            "2": "Rivers ended up going 21-of-36 for 238 yards, one touchdown and the aforementioned pick. Rivers made some terrific throws, including a 34-yarder to Gates on a third-and-13 as he was getting hit. However, Rivers was also off on some passes. He was nearly intercepted on the first drive, as he began the game slowly. He got hot late - save for a Tony Jefferson interception that was wiped out by a bogus hold - but his team just made too many mistakes for him to overcome. ",
            "3": "Rivers' lone score went to Malcom Floyd (4-50). Keenan Allen didn't do much - five catches, 37 yards - because Patrick Peterson was draped all over him. ",
            "4": "So much for Ladarius Green. The athletic tight end snagged two balls for 24 yards, but this was the Antonio Gates show. Gates was targeted more than any other Charger (10 times) and finished with a team-high six grabs for 81 yards. I wrote this summer that it was absurd that Green was being drafted before Gates in some leagues. Rivers won't stop throwing to Gates anytime soon. Green is just a stash at best. ",
            "5": "Ryan Mathews didn't look like he was going to do much versus Arizona's stout run defense, but he broke free for a 20-yard touchdown in the second half. Mathews finished with 40 yards on 12 carries and the score. ",
            "6": "As for the Cardinals, Palmer went 24-of-37 for 304 yards and two touchdowns. As mentioned, Palmer pulled a Houdini by somehow escaping out of multiple sacks. That would explain the 29 rushing yards he generated on four scrambles. Palmer played well for the most part, but he made some mistakes. He had a couple of interceptions dropped, and he was wide of some open receivers, including Larry Fitzgerald for a crucial two-point conversion. ",
            "7": "Speaking of Fitzgerald, he had just one catch for 22 yards. He wasn't even targeted in the opening half, and his sole reception came with four minutes remaining in regulation. The Chargers simply did a great job of taking him away, so Palmer focused on Michael Floyd, who continued to be the more-productive Arizona wideout. He hauled in five of his seven targets for 119 yards. ",
            "8": "Andre Ellington shocked everyone by starting in this game, but he didn't look like himself. He lost a fumble deep in San Diego territory and just didn't have the same burst for the most part, though he did make a one-handed catch in the flat, and he also managed to break free for an 18-yard gain in the fourth quarter that helped set up a touchdown. ",
            "9": "As mentioned, both defenses were dominant. Jeremiah Attaochu was a stud. On top of making several big special-teams plays, he also registered a strip-sack. Meanwhile, the Cardinals, despite missing lots of personnel, looked like they were a top-10 stop unit. Unfortunately, John Abraham was knocked out with a concussion in the third quarter. San Diego's offense finally got on track when he left the game. ",
            "10": "Chris Berman and Trent Dilfer called this game. I like Berman in the studio, but he just doesn't seem all there as a play-by-play person. He just misses stuff and doesn't recognize things until it's too late. The prehistoric references don't help. Berman especially confused me on one instance when he kept wondering if the Chargers would get the ball on one Arizona third down, yet San Diego never even obtained possession, even after the whistle. I considered the possibility that I was going insane, but when I didn't see my walls bleed, I figured that Boomer was just having a senior moment. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}