{
    "year": "2014",
    "week": "18",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "9",
            "1": "With all of Arizona's offensive issues, including the fact that the team was starting a third-string quarterback, it needed everything to go right on defense and special teams. Instead, the opposite occurred. The Cardinals surrendered some big plays on the defensive side of the ball, while the special teams killed the Cardinals' chances with some terrible mistakes. The Panthers, meanwhile, prevailed in what was Cam Newton's first playoff victory, but there are definitely concerns going forward. Newton, who was terrific down the stretch of the regular season, did not look completely healthy. It took him a while to get up when kneeling down, and he was constantly wincing in pain. Newton also missed numerous open receivers throughout the contest. Had he connected on some routine passes, this game wouldn't have been close. Newton did have some impressive scrambles to convert several third-and-long situations right after halftime, but he did not have a very encouraging performance. Newton barely completed half of his passes, finishing 18-of-32 for 198 yards, two touchdowns, an interception and a lost fumble. The pick was nearly returned for six by Antonio Cromartie, but Newton managed to chase him down. Newton nearly had a couple of other interceptions, including one play in which he appeared to throw a backward pass that was nearly picked off by an Arizona defensive lineman. The Panthers got away with that one, as it was just one of about a dozen terrible calls by Ed Hochuli and his crew throughout this contest, but I'll get to that later. ",
            "2": "Newton's two touchdowns went to Mike Tolbert and Fozzy Whittaker. The latter was a bit fluky in terms of Newton's stat line, as Whittaker caught a short pass and went 39 yards into the end zone because of some of the worst tackling you'll ever see. ",
            "3": "The Panthers were able to pick up some big runs in this game, as Arizona's defense had tackling issues throughout the evening. I mentioned Newton's scrambles - he had 35 yards on seven attempts - but Jonathan Stewart picked up most of the yardage on the ground. He gained 123 yards and a touchdown on 24 carries. Tolbert vultured a score away in the second half, but those who used Stewart in daily formats weren't disappointed, as the big back has been tremendous since the team's Week 12 bye. The Cardinals will need to spend some early-round picks on defensive players, including a pass-rusher and a cornerback if Cromartie leaves via free agency. ",
            "4": "Other Carolina stats: Greg Olsen caught three passes for 37 yards, and he was robbed of a 20-yard reception because of a Byron Bell hold. Kelvin Benjamin (4-33) had issues getting open against Patrick Peterson, and he didn't help his cause with a dropped pass in the red zone during the second quarter. ",
            "5": "As for the Cardinals, they had a historically bad offensive performance in this game. That's not an exaggeration. They posted the fewest net yards of any team in playoff history. They had a laughable 78 yards from scrimmage, averaging a pathetic 1.7 yards per play. In other words, they needed nearly six plays, on average, to achieve a first down. If it wasn't for a muffed punt, a near-pick-six and an intentional safety, Arizona would've been shut out. And yes, if you didn't watch this game, Ryan Lindley was that anemic. He went 16-of-28 for just 82 yards, one touchdown and two interceptions. The score was just a 1-yard pass to an open tight end, and sadly, it was one of Lindley's best throws of the evening. He was terrible every step of the way. He began by missing an open Larry Fitzgerald for a touchdown. He dropped a third-down snap and just threw the ball away, as he was fortunate to get away with an intentional-grounding infraction. The two interceptions were especially brutal, as they both came in the red zone, and the Cardinals could've won this game if they had converted deep in Carolina territory. The initial pick was telegraphed, while the second was forced to Fitzgerald in double coverage. It's puzzling why Bruce Arians didn't yank Lindley at some point. Lindley was clearly not getting the job done, and Logan Thomas, who was on the field for one snap, could've run some read-options, at the very least. Thomas also should've been used on a Hail Mary try at the end of the first half; instead, Lindley's noodle arm was only able to get the ball to the Carolina 25 from his own 42. It was one of the worst deep attempts you'll ever see on any level of football. Thomas has a better arm and should've thrown the pass. Arians simply screwed up. ",
            "6": "Lindley would've sucked anyway, but part of the reason why he struggled was because Arians insisted on running the ball so frequently on first down. The Cardinals weren't getting anything on the ground - Kerwynn Williams led the team with 23 yards on 10 carries - yet they continuously put Lindley into dreadful second-and-long situations, where the struggling quarterback absolutely had no chance against a Carolina pass rush that dominated the line of scrimmage. ",
            "7": "Neither Fitzgerald nor Michael Floyd could do anything. The former reeled in just three of his eight targets for 31, while Floyd caught just one pass. Fitzgerald should've scored a touchdown, but Lindley overthrew him by a mile. John Carlson (3-25) had a big drop on third down. ",
            "8": "As mentioned, Arizona's special teams were a disaster. Punter Drew Butler was simply awful, averaging 34.8 yards per attempt, as he constantly gave the Panthers great field position. Carolina took advantage of this with 10 early points in the opening quarter. The special teams were also responsible for seven other points in the second half when Ted Ginn foolishly took the ball out of the back of his own end zone and lost a fumble. Carolina recovered inside the 5-yard line and easily scored a touchdown. This took the differential from six to 13, putting the game out of reach. ",
            "9": "Last thing: I need to discuss the officiating. Hochuli put on one of the worst performances by a ref I've ever seen. Based on how poorly he and his crew botched this game, it wouldn't surprise me if the NFL fired him, especially when he was heard saying, I got the word from Jungle Boy that was a good call on his mic at the beginning of the second half. The odd remark aside, Hochuli threw numerous terrible flags for defensive holding and pass interference. He then inexplicably stopped calling them when they should've been whistled. The Cardinals got away with a hold, but the worst instance was when Floyd's arm was grabbed and no flags were thrown. It got worse after that. Newton threw what appeared to be a backward pass, but it was ruled forward following replay. That may have been the right call, but it should've been intentional grounding. Hochuli announced there was a receiver in the area when there was no wideout within 20 yards of where the ball landed. This had Twitter up in arms, and my favorite tweet was from Ross Tucker, who said, In the area... does he mean in the stadium? "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Too much was made of Baltimore's secondary issues, and not enough was said regarding Le'Veon Bell's absence. The conventional wisdom said that the backup rushers would be fine, given that the running back position is usually interchangeable, but Bell does more for Pittsburgh's offense than most people realize. The fact that Bell was missing was huge. The Steelers couldn't run the ball, particularly in the red zone, but it was way more than that. Bell is fantastic as a pass-protector and a receiver out of the backfield. Ben Tate and Josh Harris are fine runners, but they can't do what Bell is capable of on third downs. As a consequence, Ben Roethlisberger was under siege more than usual. Roethlisberger has enjoyed a clean pocket most of the season, but that wasn't the case Saturday night. He had time to throw on occasion, but the Ravens, particularly Haloti Ngata and Terrell Suggs, were able to harass him quite frequently. Meanwhile, Pittsburgh's secondary was worse than Baltimore's beleaguered defensive backfield. The Steelers couldn't cover the Baltimore wideouts, as Joe Flacco was able to dissect Pittsburgh's stop unit, including on third-and-long situations; Flacco converted several of those with impressive passes, keeping Roethlisberger off the field. The Steelers definitely have to address the secondary early and often, which is what I have happening in my 2015 NFL Mock Draft. ",
            "2": "Flacco finished 18-of-29 for 259 yards and two touchdowns. He was sharp for most of the game, with his only blemish being a dropped interception in the second half. As mentioned, Flacco was fantastic on third-and-long situations, and he even converted a key fourth-and-1 near midfield with a sneak. ",
            "3": "Steve Smith must have wanted revenge on someone on Pittsburgh in a rubber match, so he was in one of his psychopathic modes. Smith was snatching everything out of the air and spinning the ball with fervor after being tackled. He caught five balls for 101 yards and just missed out on a touchdown when Flacco overthrew him in the second quarter. Torrey Smith, meanwhile, snatched just two passes for 28 yards, but came down with one of Flacco's scores. He nearly had a second when he got just one foot inbounds in the end zone. The other touchdown was passed to Crockett Gillmore. ",
            "4": "With Bell out of the game, Justin Forsett was the top runner on the field. Forsett struggled down the stretch of the regular season, but that's because he was injured. Forsett managed just 36 yards on 16 carries, but had some nice bursts. He lost a fumble, however, which appeared to give the Steelers some life early in the fourth quarter, as they capitalized with a touchdown. Forsett was vultured on the goal line by Bernard Pierce. ",
            "5": "Speaking of running backs, Harris and Tate combined with 44 yards on the ground. Tate (5-19) ran well on the first drive, but fumbled the ball near midfield. He was fortunate Antonio Brown managed to jump on the ball and keep the possession alive. Harris (9-25) saw most of the workload after that, but save for one eight-yard burst, he didn't do much with his opportunities. ",
            "6": "Roethlisberger, meanwhile, had a mixed outing. He finished 31-of-45 for 334 yards and a touchdown, but also threw two interceptions. He was under pressure more than he's used to, and he made some nice plays, including one in which he muscled out of sack and found Heath Miller (6-76) for a big gain on third-and-10. However, Roethlisberger was brought down five times, and one Baltimore defender was able to hit him as he was releasing the ball, which resulted in a tipped pick by Suggs, who somehow caught the ball in between his legs. On the very next Pittsburgh drive, Suggs forced a hold that nullified a Roethlisberger touchdown to Dri Archer. Roethlisberger appeared to be concussed late in the fourth quarter when he took a big hit, and he had to miss a few plays. Mike Tomlin put him back in, which I thought was a big mistake. Roethlisberger naturally threw an interception on the first play. Miller, meanwhile, also got knocked out with a head injury. Like Roethlisberger, he reentered the game and made an error, losing a fumble. The game was pretty much decided at that point, but Tomlin shouldn't have risked the longevity of two of his key players, especially considering the game was in doubt. ",
            "7": "Antonio Brown was his usual dominant self, catching nine of 14 targets for 117 yards. He picked up an early first down with a great spin move on Lardarius Webb. He also appeared to score a 45-yard touchdown, but the replay review showed that he was down inches short of the goal line. That wasn't the first time Brown just missed out on a score; he hauled in a Roethlisberger pass in the second quarter, but was pushed out and could get only one foot inbounds. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Colts",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Another year, another playoff failure for Andy Dalton. The Bengals entered this game with the superior running game and defense, but it didn't even matter because of the huge quarterbacking disparity. Andrew Luck engineered an impressive opening touchdown drive, while all Dalton could do throughout the entire afternoon was heave inaccurate passes to his terrible supporting cast. If A.J. Green and Jermaine Gresham being out wasn't enough, the Bengals were hurt by injuries to two of their key defenders, Rey Maualuga and Dre Kirkpatrick. Maualuga was carted into the locker room in the second quarter, while Kirkpatrick got hurt right after halftime. The Bengals had limited Indianapolis to just 13 points in the opening half, but missing Maualuga and Kirkpatrick proved to be too much, as Luck moved the chains effortlessly following the break. Indianapolis generated 482 net yards of offense, moving the chains 22 times, and they would've won by much more if it wasn't for some miscues in the red zone. ",
            "2": "Luck finished 31-of-44 for 376 yards and a touchdown. Despite the early scoring drive, Luck had issues connecting with T.Y. Hilton early on. Hilton couldn't quite come up with a touchdown over Terence Newman on the initial possession and then dropped a long pass despite beating Leon Hall. Luck then overthrew Hilton, but the two got into a rhythm after that when Luck hit him on consecutive passes for a combined 47 yards, though Hilton later dropped a first-down reception in the red zone. Luck also had a touchdown to Coby Fleener wiped out by an illegal block in the back. As you can tell, Luck could've had a much better stat line. The Bengals simply didn't have an answer for him, as they couldn't generate any sort of pass rush. They sacked him just once. Cincinnati really missed Michael Johnson this year, so the team is expected to select pass-rushers early and often this April, which is what I have happening in my 2015 NFL Mock Draft. ",
            "3": "As for Hilton, he still managed to accumulate 103 receiving yards, but reeled in just six of his 14 targets. He would've hurt his team with his mistakes had the Bengals been remotely competitive on offense. Elsewhere, Hakeem Nicks (3-59) caught a 45-yarder, his longest with the Colts, while Donte Moncrief (3-54) reeled in Luck's sole touchdown. ",
            "4": "The Colts ran the ball well with Maualuga out. Dan Herron had a big game, gaining 56 rushing yards and a touchdown on 12 carries and also served as a reliable pass-catcher out of the backfield, hauling in 10 balls for 85 receiving yards. However, Herron fumbled twice throughout this contest, losing one, and he was ultimately benched in favor of an alien being named Zurlon Tipton, who also had success on the ground (11-40). ",
            "5": "As for the Bengals, I already said that Dalton was anemic. His numbers indicated that, as he finished just 18-of-35 for 155 yards, and he turned the ball over yet again, losing a fumble. Dalton is now 0-4 in the playoffs. This defeat wasn't all on him because he was missing Green and Gresham, but his passes were all over the place. He heaved a terrible throw to Mohamed Sanu on a third down during the second quarter. He then opened the second half with two awful throws, one of which was almost intercepted. Dalton was so bad that the Bengals didn't achieve a first down following halftime until there were 11 minutes remaining in the fourth quarter. I really didn't understand Cincinnati's offensive game plan. I liked that the team came out with some effective trick plays to Rex Burkhead, which included a 23-yard end-around, but the Bengals didn't involve Jeremy Hill or Giovani Bernard nearly enough. Those were the only two play-makers Cincinnati had with Green and Gresham both out, so they should've had a combined 35 touches at the very least. Instead, that number was only 24. Hill carried the ball 13 times for 47 yards and a touchdown. The Colts clamped down on the run with Green out, but the Bengals didn't try hard enough to establish the ground game. In fact, Hill had just four attempts following halftime. Bernard, meanwhile, caught eight balls for 46 receiving yards, but most of that came in garbage time. Granted, he had a long reception on a screen wiped out by a Russell Bodine hold, but Bernard should've been used in space more. Instead, the Bengals had Dalton repeatedly fire futile passes downfield to Sanu and Brandon Tate that had no chance of being completed. ",
            "6": "A couple of other notes for Cincinnati: - Excluding Bernard, no Bengal had more than three catches. A trio of players had those three receptions: Ryan Hewitt (3-37), Burkhead (3-34) and Sanu (3-31). - Mike Nugent hit just one field goal, but it was a 57-yarder, which he doinked off the upright just prior to halftime. This cut the deficit to 13-10, and it appeared as though the Bengals had a chance heading into intermission, but the Colts limited Cincinnati to just 98 net yards in the second half. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "Jerry Jones said that this year was different, and that appears to be the case, for at least one playoff game. The Cowboys won their first close postseason game in the Tony Romo era, and the first overall since 2009, albeit amid officiating controversy. All everyone is talking about is a call made in the middle of the fourth quarter. The Lions were driving past midfield, when Matthew Stafford fired a pass toward Brandon Pettigrew. The tight end was clearly interfered with by linebacker Anthony Hitchens, as the two announcers plus Mike Pereira pointed out. The flag was thrown, and official Pete Morelli announced that there was pass interference. At that moment, Dez Bryant ran onto the field without his helmet on, which was going to be a 15-yard unsportsmanlike penalty. And then the crowd began cheering. That's because Morelli told the fans that there was no flag for pass interference. He didn't give an explanation to the crowd or Jim Caldwell. He simply picked up the flag after making the initial announcement. Pereira was so flabbergasted that he was speechless. There's never been anything like this in recent NFL history, and the poor Lions couldn't have done anything about it, as Morelli was likely signaled by the league office to disallow the call, given that the NFL wanted a matchup between Green Bay and Dallas next week for ratings purposes. Thus, it was no surprise that the Cowboys got all of the penalties from that point on. Following a 10-yard shank by the punter, Dallas drove down the field and scored the game-winning touchdown, with the assistance of two crucial defensive flags that kept the possession alive. I hope the league compensates the Lions in some way because they were epically screwed by some of the worst officiating in NFL history. Detroit should've had the ball on the Dallas 19-yard line with the potential to go up two scores; instead, all a teary-eyed Caldwell could do was mutter not good enough during the post-game press conference. ",
            "2": "I suppose Romo deserves some credit for that game-winning drive. He got a ton of help from the officials and the league office, but he didn't choke for a change. The forces around him didn't allow him to gag, but he still played fairly well when he needed to. He finished 19-of-31 for 293 yards and two touchdowns despite the fact that he was sacked six times. Ndamukong Suh and Detroit's fierce pass rush had their way with Jerry Jones' heralded offensive line, disrupting plenty of drives. The Lions were so dominant in the trenches early on that they limited the Cowboys to just six first downs in the opening half. Both of Romo's touchdowns went to Terrance Williams. The initial score gave the Cowboys some life early on; they had 80 yards of offense in the first half otherwise. Williams benefited from Cassius Vaughn falling down and James Ihedigbo taking a bad angle. The second touchdown, which sealed the victory, came after Williams dropped a score. Williams wouldn't have needed that touchdown if Romo hadn't missed an open Gavin Escobar a play earlier. Romo missed some other targets throughout the afternoon, and he also was strip-sacked. Luckily for him, one of his teammates pounced on the ball. ",
            "3": "If you're wondering about Dez Bryant, the Lions did a great job of smothering him. Bryant was limited to just three catches for 48 yards, and most of that came on a 43-yard reception, which happened because he was matched up on linebacker DeAndre Levy. Bryant fumbled early on when Rashean Mathis leveled him with a huge hit, but again, Dallas recovered the loose football. ",
            "4": "The Lions had the top run defense in the NFL, so it's not a surprise that they limited DeMarco Murray to just 75 yards and a touchdown on 19 carries. Murray did nothing early - 30 yards in the first half - but he finally broke free for an 18-yard burst when the Lions were up 20-10. ",
            "5": "Detroit's offense, meanwhile, was hot early with 14 first-quarter points. The Lions were able to go up big early because of a 51-yard Golden Tate touchdown reception and a 99-yard drive comprised of a running-into-the-punter penalty, a Stafford scramble for a first down, and some nice runs by Joique Bell and Reggie Bush. The Lions, however, struggled after that despite having the luxury of Rolando McClain out of the game with an obscure injury. Stafford was nearly intercepted in the red zone at the end of the first half when he carelessly flung the ball into double coverage. He was then picked right after the break because of a tipped pass by Jeremy Mincey. Stafford topped that off with two fumbles on the final drive of the game. He was fortunate to get the first back because the Dallas defender also coughed up the ball, but he didn't have the same luck the second time. ",
            "6": "Stafford finished 28-of-42 for 323 yards, one touchdown, the interception and two lost fumbles. As mentioned, he was hot early on, but was just 11-of-18 for 132 yards and three turnovers following halftime. Much like Romo has done in the past, Stafford choked down the stretch. ",
            "7": "Stafford's sole score was the 51-yarder to Tate, who led the team with 89 receiving yards on six catches. Calvin Johnson (5-85) fell just short of the team lead. ",
            "8": "The Lions ran the ball well early on, but Bell mustered only 10 yards after halftime. Bell finished with 43 yards on just 12 carries. Bush (8-37) scored once. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "4"
}