{
    "year": "2014",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "The Chargers had control of their own destiny for the sixth seed in the AFC, so I might as well begin there. All they had to do is beat the Chase Daniel-led Chiefs to reach the playoffs. After winning in Baltimore and San Francisco, prevailing in Kansas City against a backup quarterback seemed easy. A bit too easy, apparently. The Chargers mustered just seven points, as the Chiefs upset San Diego, according to the talking heads on TV, who were oblivious to the fact that Kansas City was a three-point favorite. The Chargers were expected to win because of Philip Rivers, who had a heroic comeback against the 49ers on Saturday night. Rivers, however, couldn't do much because his offensive line let him down. Rivers was swarmed on most of his attempts, as the Chiefs accumulated seven sacks, including four by Justin Houston, who was just one sack short of breaking Michael Strahan's single-season record. Unfortunately for Houston, he didn't have Brett Favre on the other side to take a fraudulent sack. Rivers finished 20-of-34 for 291 yards and two interceptions. Only one pick was his fault, as he foolishly threw into double coverage. The second interception came on a desperation heave on the final play of the game. Rivers' protection really needs to improve this offseason, so an early-round pick should be used on an offensive lineman. ",
            "2": "It didn't help Rivers that he was missing his top wideout in Keenan Allen. With Allen out, Eddie Royal (4-95) led the team in receiving. Royal, however, dropped two touchdowns on the same drive in the fourth quarter. The ball barely hit the ground the first time, and the officials ruled it incomplete upon reviewing the play. ",
            "3": "Three other Chargers logged more than two receptions: Dontrelle Inman (5-79), Antonio Gates (4-67) and Malcom Floyd (3-29). ",
            "4": "Ryan Mathews was also missing. Branden Oliver and Donald Brown shared carries, with the former outgaining the latter, 71-39. Oliver also scored. Brown, meanwhile, was stuffed on a fourth-and-1 try in the final quarter. ",
            "5": "As for the Chiefs, they nearly broke their streak of games without a touchdown to a receiver. Dwayne Bowe caught a pass and appeared to cross the goal line, but fumbled. It was ruled that Bowe didn't score, but luckily for the Chiefs, Travis Kelce was right there to recover the ball for the touchdown. ",
            "6": "Chase Daniel proved to be a true facsimile of Alex Smith, as he threw short, quick passes to his targets. Daniel was guilty of holding the ball too often on a couple of occasions and took some sacks as a consequence, but he was still able to complete more than half of his passes, finishing 16-of-27 for 157 yards and what should've been a touchdown to Bowe. He began the game 9-of-9 for 72 yards, but couldn't maintain his success, though some of that was because of a couple of drops, including one by Albert Wilson in the red zone. ",
            "7": "Kelce turned out to be Daniel's leading receiver, hauling in seven balls for 84 yards. Bowe was next with just three grabs for 30 yards. Wilson was a major disappointment, failing to log a single reception. ",
            "8": "Another week, another game in which Jamaal Charles didn't touch the ball enough. Charles had just 13 carries, which he turned into 54 yards. He caught only two passes. I don't understand why Andy Reid wasn't utilizing Charles very much prior to this contest, but there was at least an explanation this week, as Charles hobbled off the field in the first half. ",
            "9": "Daniel deserves some credit for this win, but Kansas City's defense was most responsible. Several defenders were awesome, including Houston. Husain Abdullah was also terrific; he broke up a potential touchdown pass thrown toward Antonio Gates in the final quarter and then stuffed Brown on a fourth down. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "With the Chargers losing to the Chiefs throughout the afternoon, the sixth-seed door was wide open for Baltimore. However, it didn't seem like the Ravens would be able to enter. They were tied with Cleveland at three by halftime and trailed by a touchdown entering the fourth quarter. It appeared as though Baltimore was primed for a classic, Week 17 letdown, but the team rallied in the fourth quarter and ultimately won by 10 points. Joe Flacco was dreadful in the early going. He had so much pressure in his face, thanks to both of his offensive tackles being out, that he just didn't have enough time in the pocket to find his receivers downfield. He was sacked only once, but the Browns brought plenty of heat and forced many errant passes. As a restult, he was 11-of-18 for just 97 yards heading into halftime. Just prior to the break, he was stripped of the football, which bounced backward and took the team out of field-goal range. Flacco wasn't any better in the third quarter, as he was nearly picked in the red zone. However, something finally clicked in the final frame, as he found Torrey Smith for a 53-yard bomb and then connected with the quick wideout for a touchdown. Flacco then had another touchdown to Kamar Aiken to put the game out of reach for the offensively challenged Browns. In the fourth quarter alone, he was 8-of-9 for 161 yards and the two scores. Flacco's final numbers were 22-of-36 for 312 yards and two touchdowns. As noted, most of that came in the fourth quarter. This was a nice win for the Ravens, but they'll need Eugene Monroe back in the lineup if they want to pull the upset next week. ",
            "2": "Both Smiths shined for the Ravens. Torrey Smith (4-83) had one of Flacco's touchdowns, while Steve Smith (8-90) led the team in receiving, though he dropped a pass on the opening drive of the game. ",
            "3": "Justin Forsett was able to rebound off two poor performances. Looking healthy for the first time in a few weeks, Forsett dashed for 119 yards on just 17 carries. Cleveland's ground defense has been pathetic recently, though it held up well on one play when it stuffed Forsett on a fourth-and-goal try at the 2-yard line in the opening half. John Harbaugh made a mistake by not taking the points in what was projected to be a low-scoring game, but it didn't end up mattering. ",
            "4": "Meanwhile, the Browns showed some fight despite starting Connor Shaw. Conny Football opened with a 30-yard pass to Jordan Cameron, but followed that up with a lost a fumble on a botched snap near the red zone. Conny Football went 14-of-28 for 177 yards and a late pick, which was a weak throw while rolling out of the pocket. Shaw handled himself well considering the circumstances, and perhaps showed that he could be a No. 2 quarterback in this league. He just missed out on a touchdown when Andrew Hawkins was tackled at the 2-yard line. The Browns ran into the end zone on the next play. ",
            "5": "Mike Pettine has been guilty of some odd decisions regarding the quarterback position this year. The same goes for the running back job. A week after Terrance West didn't carry the ball a single time, the Towson product tallied 94 yards and a touchdown on 18 attempts. He also had a 15-yard gain that was negated by a Mitchell Schwartz hold. Isaiah Crowell, who handled the workload last week, was given just four carries, which he turned into six yards. ",
            "6": "With Josh Gordon getting into trouble again regarding his substance-abuse issues, the Browns will need to address the wideout position this offseason. Their leading receiver in this contest was Taylor Gabriel (3-66). Jordan Cameron caught three balls for 41 yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jets",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "Rex Ryan was the coach on his way out in this matchup, but perhaps the one who should be fired is Joe Philbin. Ryan reportedly spent the entire week cleaning out the items in his office, so there was no incentive for him to game plan for this meaningless contest. The Dolphins, on the other hand, were coming off a victory and had a chance to clinch a winning record. That didn't happen, as Philbin didn't seem to have his team prepared to play this contest. The defense especially looked lost. How bad was the Miami stop unit? Well, Geno Smith just had the best game of his career. He opened the contest 8-of-8, and then followed that up with a 40-yard bomb to Eric Decker, who beat Cortland Finnegan. Chris Ivory was then wide open for a touchdown when he leaked out of the backfield. The bewildered Dolphins didn't look like they knew what hit them, and it wouldn't get any better. The Jets generated 494 net yards of offense and gained a whopping eight yards per play. Smith finished 20-of-25 for 358 yards and three touchdowns. His only blemish on the afternoon was a fumble that occurred because of terrible ball security. Granted, the Dolphins were extremely lethargic, but Smith had an amazing performance. Perhaps it'll give the Jets some optimism that he can turn into a decent quarterback with some good offensive coaching. They better hope so, as they'll probably be out of position to take either Marcus Mariota or Jameis Winston, as you can see in my <a href=/draft2015.php>2015 NFL Mock Draft</a>. ",
            "2": "It helped Smith that Eric Decker came alive. The former Bronco didn't produce numbers anywhere close to what he posted in Denver, but his season finale was exceptional. He caught 10 of the 11 targets thrown his way for a whopping 221 yards and a touchdown. Decker caught a number of deep bombs, including a 74-yarder where he easily beat coverage, and a 50-yarder, which he snagged over Brent Grimes, who just couldn't do anything because of the height advantage. ",
            "3": "The Jets wouldn't have produced any points if they failed to throw the ball. That's because they struggled to run. Ivory had a receiving touchdown, but he mustered only 29 yards on the ground on 13 carries, including one attempt in which he was stuffed on a fourth down. Chris Johnson (10-20) couldn't do anything either. It was a complete reversal from the prior meeting; Ivory and Johnson trampled the Dolphins then, while Smith couldn't throw at all. The opposite was the case in this contest. The running back position will have to be addressed this offseason. ",
            "4": "New York ran some trick plays in this contest. Ryan Quigley threw a 38-yard pass to Zach Sudfeld. Chris Owusu ran an end-around into the end zone. Jeremy Kerley threw a pass to Geno Smith, but the pass was short and kicked off the quarterback's shoe for a pick-six. The officials, however, ruled it incomplete in what was a close call. ",
            "5": "The Dolphins, meanwhile, looked better on offense, though only by default. Ryan Tannehill began slowly when he overshot Mike Wallace for about seven yards, but was sharp throughout the duration of the opening half, going 15-of-20 for 161 yards and a touchdown prior to the break. However, the Dolphins couldn't get anything going offensively following the break; Tannehill completed just seven of his 18 attempts in the second half, finishing 22-of-38 for 245 yards and a score. ",
            "6": "The errant pass to Wallace was the only one the speedy wideout saw, as he wasn't targeted for the rest of the afternoon. The reason was because he was benched for quitting on the team, telling Philbin that he no longer wanted to be on the field. Brian Hartline (5-94) led the team in receiving, while Charles Clay (5-45) reeled in Tannehill's only touchdown. ",
            "7": "The one bright spot for the Dolphins was Lamar Miller, who ran for a 97-yard touchdown in what was the longest play from scrimmage in the NFL this year. Miller finished with 178 yards and that score on just 19 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "9"
        },
        "comments": {
            "amount": "4",
            "1": "The Vikings prevailed by just four points, but it easily could've been by a greater margin. Prior to a Jay Cutler scramble on the final drive of the game, they had the Bears outgained by 100 net yards and were averaging 1.5 more yards per play than the Bears were. A few plays made this a fake close contest. One was a Greg Jennings dropped touchdown in the first half. Another was a near-interception returned for a touchdown by Kyle Fuller off a deflection that gave Chicago a field goal. A third was a big kickoff return that allowed Chicago to put three more points on the scoreboard. A fourth was an eschewed field goal at the end of the game that would've covered (or pushed) the spread. The Bears, otherwise, were outplayed by a large margin. Outside of a couple of poor passes - the aforementioned interception by Fuller and a near-pick on an attempted screen - Teddy Bridgewater had a quality performance. Most of his throws were accurate, and he showed nice velocity and touch on his passes. Bridgewater finished 17-of-25 for 209 yards, one touchdown and an interception. He also picked up 14 yards on a scramble. He should've had a second score, a 35-yarder to Jennings, but the ball barely scraped the ground. ",
            "2": "No Viking caught more than three passes. Jennings (3-45) was second in receiving, trailing only Adam Thielen (3-68), who secured Bridgewater's only touchdown. Charles Johnson (2-22) disappointed in the finale. ",
            "3": "Matt Asiata had nice gains in this contest, tallying 91 yards on 19 carries. However, he was stuffed on consecutive plays inside the 5-yard line with three minutes remaining. Had he converted, the Bears wouldn't have had one final opportunity to take the lead. Of course, that implies that the Bears could've mustered anything offensively without a fluke play. Chicago once again looked dysfunctional when it had the ball, especially early on. Cutler, starting this game for the concussed Jimmy Clausen, had to waste an early timeout on a third-and-1. Following a false start, the Bears were guilty of a delay of game. This happened again later on, disrupting what looked like a promising drive. Cutler should really be happy that he avoided turning the ball over. He was lucky to get away with a pick on a third down at the end of the opening quarter. He finished 23-of-36 for only 172 yards, as he once again threw nothing but checkdowns and screens. The Vikings' pass rush overwhelmed Chicago's decrepit offensive front, so Cutler didn't have time to look downfield. ",
            "4": "Cutler appeared to throw a touchdown to Alshon Jeffery, but the athletic receiver could only get one foot inbounds. Jeffery managed just two receptions for 34 yards because of Xavier Rhodes' fantastic coverage. The only Bear who had more yardage than him was Martellus Bennett (8-59). "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bills",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "Bill Belichick had a great track record of winning in Week 17 games, regardless of whether or not he needed a victory or not. Thus, even though Belichick opted to sit Rob Gronkowski, Julian Edelman, Dont'a Hightower and several other starters, this result was definitely a big surprise. The Bills just wanted this one more despite the fact that they were eliminated from the playoffs a week ago. They hadn't won in New England in more than a decade, so that's no longer the case. This win obviously will have an asterisk next to it, given that the unusually lethargic Patriots didn't play all of their starters for the entire game, which includes Tom Brady, who was on the field for just a half. ",
            "2": "Kyle Orton opened the game on fire, hitting Sammy Watkins for a 43-yard gain and then ultimately leading the team into the end zone. He had a fantastic opening half, going 11-of-15 for 143 yards and a touchdown prior to the break. His only blemish in the first half was a strip-sack that allowed the Patriots to kick a field goal. Orton, however, looked like his usual self following intermission. He was just 4-of-8 for 33 yards in the second half, meaning he finished 16-of-23 for 176 yards and a touchdown. The Bills need a quarterback, but they're not in position to take one during the draft. They'll have to use a second-rounder on one. ",
            "3": "Buffalo also needs a new running back. Fred Jackson (18-58) won't be able to play much longer, while C.J. Spiller (5-17) probably won't be back next year. ",
            "4": "Watkins didn't do much following his initial long reception. He did lead the team in receiving though, snagging three balls for 57 yards. Robert Woods (4-39) reeled in Orton's sole touchdown. ",
            "5": "Brady, as mentioned, played a half. He looked terrible without his dominant tight end, though the immense pressure he had in his face didn't help. The pass rush forced Brady into many errant passes, which would explain why he went just 8-of-16 for 80 yards. Jimmy Garoppolo took over in the second half. He showed some nice scrambling ability - he ran four times for 16 rushing yards - but the pressure bothered him as well. He went 10-of-17 for only 90 yards. ",
            "6": "New England's leading receiver was Brandon LaFell, who had four grabs for 70 yards. Tim Wright (1-15) and Danny Amendola (4-24), starting for Gronkowski and Julian Edelman, respectively, were disappointments. <brr> ",
            "7": "LeGarrette Blount had a nice 34-yard run that he broke outside, but didn't do much otherwise, struggling to find lanes despite the absence of Marcell Dareus. He gained 62 yards on 10 carries. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "26"
        },
        "comments": {
            "amount": "6",
            "1": "With the Eagles eliminated from the playoffs, there was some speculation that Matt Barkley would start this game. Why not? With Mark Sanchez headed for free agency, Chip Kelly probably should've discovered if Barkley could function as his backup signal-caller. Kelly, however, was more interested in padding his offensive stats in a meaningless game. He accomplished this, thanks to another fluky special-teams score, which was a blocked punt returned for a touchdown. Kelly went with Sanchez, who had a solid outing in his final game with the Eagles, for the most part. Sanchez went 23-of-36 for 292 yards, two touchdowns and an interception. The pick was a bad one, as he stared down his receiver, and it led to a New York field goal. Sanchez hurled two other potential interceptions. One was actually snatched out of the air, but it was negated by a poor pass-interference penalty. Another errant pass was heaved into double coverage, but New York failed to come away with the turnover. Sanchez, however, did enough to move the chains consistently, opening the game with a 44-yard touchdown to Jordan Matthews in which the defenders took some terrible angles. He converted 7-of-16 third downs and managed to accumulate 23 first downs. Many of his attempts were once again intermediate throws to the usual suspects. ",
            "2": "Matthews ended up leading the Eagles in receiving, as he hauled in eight of his 10 targets for 105 yards and a touchdown. Zach Ertz (4-56), Jeremy Maclin (3-49) were next. ",
            "3": "The Eagles managed to run the ball well, though LeSean McCoy was one yard shy of hitting the century mark, finishing with 99 yards on 17 attempts. Perhaps he would've gotten there had Chris Polk not vultured yet another touchdown. ",
            "4": "As for the Giants, they actually accumulated more yardage and averaged more yards per play than Kelly's heralded offense, but weren't the fortune beneficiaries of a blocked punt. New York registered 505 net yards of offense and averaged 6.5 yards per play compared to Philadelphia's numbers of 426 and 5.9. Eli Manning, who often had lots of time in the pocket, hit some big plays to his receivers, but had issues with accuracy. He had an interception dropped in the end zone by Cary Williams, and his attempts were all over the place in general. Manning was finally picked off in the fourth quarter when he carelessly heaved the ball off his back foot. He finished 28-of-53 for 429 yards, one touchdown and the interception. ",
            "5": "Odell Beckham once again proved to be unstoppable. He abused Philadelphia's miserable secondary, snatching 12 balls for 185 yards and a touchdown. Rueben Randle also had a good game with six grabs for 158 yards. The player with the next-most receiving yardage was tight end Larry Donnell (2-26), who just missed out on a score when Manning overshot him in the end zone. ",
            "6": "Rashad Jennings returned from injury, but saw Andre Williams handle more of a workload. Williams mustered 43 yards and a touchdown on 15 attempts, while Jennings (10-33) didn't do much on the ground, though he caught three balls. Neither back had much of a chance versus Philadelphia's stout ground defense. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Despite being locked into the No. 4 seed, Chuck Pagano told the media that he would be using his starters in a meaningless Week 17 finale. The question was how long Andrew Luck and company were going to play. It ended up being a half, but it didn't matter because Tennessee was too incompetent to take advantage of the Indianapolis backups. The Colts still sustained some injuries despite being half-safe. Reggie Wayne, who was already nursing a triceps issue, hurt his groin. However, this could actually be a blessing in disguise, as Wayne has been extremely ineffective since getting banged up, so forcing him out of the lineup could be a good thing. A.Q. Shipley also went down with an injury, but he was just a backup prior to this week. He started at left guard for some reason though, so perhaps this ruined some future plan Pagano had for a questionable offensive front. ",
            "2": "Andrew Luck went 10-of-16 for 160 yards and two touchdowns in just one half of action, so he could've had a monstrous fantasy performance had this been a regular game. The Titans just had no answer for him, so on top of finding a franchise quarterback - which I have them addressing in my <a href=/draft2015.php>2015 NFL Mock Draft</a> - they need to obtain defensive personnel who can generate a pass rush and also cover on the back end. ",
            "3": "Prior to getting hurt, Wayne nearly scored on an 80-yard pass, as he was tackled just short of the goal line. The play featured something odd. If you watch the replay, George Wilson dived out of bounds to get out of Wayne's way for no apparent reason. He wasn't pushed or anything; he just leapt out of the way. Perhaps ownership told him to make sure the Colts scored enough so that they could have a shot at the first-overall selection. Wayne led the team with two catches for 91 yards. T.Y. Hilton didn't catch a pass, as he sat out the second half. ",
            "4": "Coby Fleener scored twice on five catches for 56 yards. One of the touchdowns came from Luck, while the other was thrown by Matt Hasselbeck. Jack Doyle reeled in Luck's other score. ",
            "5": "The Colts once again struggled to maintain any sort of rushing attack despite battling an incompetent defense. Dan Herron led the way with just 35 yards on 10 carries. Trent Richardson (6-11) was worse, as usual. ",
            "6": "It's worth noting that Adam Vinatieri missed his first field goal of the season. He was wide left on a 46-yard attempt. ",
            "7": "Just some stats/notes for the Titans: - Charlie Whitehurst was awful. He failed to complete half of his passes (12-of-28) and he managed just 72 yards, though he did throw a touchdown. - Delanie Walker was Tennessee's leading in receiving yardage with 43. He caught seven passes. Kendall Wright (2-9) had Whitehurst's lone score. - Shonn Greene handled most of the workload, gaining 94 yards on 11 carries, though most of it came on a 52-yard burst. Bishop Sankey (4-18) didn't do much. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Saints",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "With the Titans trailing for most of the afternoon, the Buccaneers appeared as though they were in danger of relinquishing the No. 1 pick in the 2015 NFL Draft. Tampa had the lead throughout, as it even took a 20-7 advantage into the fourth quarter. I was ready to criticize the Buccaneers for mortgaging their future for just some meaningless victory over the Saints, and I was armed with numerous Mons Jameis jokes, but Tampa conveniently lost its lead in the final quarter, with the Saints prevailing with a three-point victory. The Buccaneers will be selecting a quarterback in April. I have them taking Marcus Mariota in my <a href=/draft2015.php>2015 NFL Mock Draft</a>, but they could choose Jameis Winston if they fall in love with him. I'd be concerned about Winston with the famous Tampa strip clubs and party scene, though he's the superior talent. ",
            "2": "As for Tampa's current quarterback, Josh McCown handled himself well early on, albeit against a terrible defense. McCown went 14-of-23 for 115 yards, one touchdown and an interception. His score went to Mike Evans (5-54), who made some spectacular catches throughout the afternoon. Evans looked elated when he reeled in the touchdown, perhaps not realizing that his future could've been in jeopardy with a victory. Luckily for him, the Buccaneers lost their two-touchdown lead in the final frame. ",
            "3": "The Buccaneers haven't been able to run the ball all year, but that changed in this matchup. The disgraceful New Orleans defense had no answer for Doug Martin (19-108) or Charlie Sims (18-69), who scored a touchdown. ",
            "4": "Vincent Jackson had just one catch for 11 yards because he left the game in the middle of the first quarter with a groin injury. ",
            "5": "Drew Brees nearly gave this game away with some poor quarterbacking. He threw three interceptions, two of which were thrown into the end zone. Both were forced and happened to be poor decisions. The third pick was tipped. Brees went 24-of-38 for 281 yards, one touchdown otherwise. Most of his production came after intermission; he was 14-of-22 for 184 yards, two scores and a pair of interceptions in the second half. ",
            "6": "Brees' touchdown was thrown to Marques Colston (2-51), who tied Kenny Stills (5-82) for second on the team with seven targets. Jimmy Graham saw nine balls throw his way, but managed six catches for only 54 yards. ",
            "7": "Both New Orleans running backs scored touchdowns. Mark Ingram (14-57) outgained Khiry Robinson (7-15) on twice as many carries. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Save for a tie in the Cardinals-49ers game, the Cowboys had no control of their playoff seeding. A victory in this contest essentially meant nothing, so there was some question about how long Tony Romo and the rest of the starters would play in this contest. As it turns out, Jason Garrett via Jerry Jones allowed Romo, DeMarco Murray and all of his other first-stringers to stay on the field throughout the entire afternoon. I'm all about keeping momentum going, but Garrett and Jones took a major risk by keeping Romo and Murray on the field for the entire game. They're extremely fortunate that they came out of this game unscathed in what ultimately proved to be a blowout victory. Revenge for the Monday night loss apparently served as Dallas' motivation. The Cowboys were so hyped up to win this game that they attempted (and successfully recovered) an onside kick while leading 20-7 in the second quarter. ",
            "2": "Murray looked great, which is the big take-away from this game. Murray didn't play well against the Colts last week, as he was favoring his hand while averaging fewer than three yards per carry. He looked like a completely different player in this contest, gashing a normally strong Washington ground defense for 100 yards and a touchdown on 20 attempts. Murray, who broke Emmitt Smith's single-season rushing record with the Cowboys, was robbed of even more yardage when the officials incorrectly blew a play dead because they thought he was down. ",
            "3": "Tony Romo was also sharp, though he made a couple of mistakes. He finished 22-of-34 for 299 yards, two touchdowns and an interception. He also nearly threw a second pick, but Keenan Robinson dropped a pass in the red zone. It really helped Romo that he had tons of time in the pocket. He wasn't even touched in the first quarter. Romo had some issues after the break, completing just 6-of-14 attempts for 74 yards and an interception, but the game was effectively finished by then with the Redskins constantly shooting themselves in the foot. ",
            "4": "Both of Romo's touchdowns went to Dez Bryant (4-99), who impressively got both of his feet inbounds on one of the scores. Cole Beasley (6-57) had the most receptions and targets. Jason Witten, meanwhile, had a disappointing stat line considering what Zach Ertz did to this Washington defense last week. Witten finished with just four grabs for 49 yards. All of his catches came in the first half. ",
            "5": "The Redskins, meanwhile, had chances to make this a close game, but lost because of stupidity by both the coach and quarterback. Jay Gruden made a dumb decision when he didn't call timeout at the end of the first half with a Dallas punt upcoming. The Redskins could've tried for a block or a nice return, but Gruden's not capable of this sort of sharp thinking. Griffin, meanwhile, was absolutely terrible. He had some long completions that were actually short or intermediate passes that his receivers took for big gains. That includes DeSean Jackson's 69-yarder, where he grabbed the ball and zoomed by defenders. It also includes Pierre Garcon's 47-yarder, which came on a slip screen. Griffin finished 27-of-41 for an inflated 336 yards, one touchdown and two interceptions. His big issue were turnovers in the red zone. Both picks occurred there. He stared down his receiver on the first one, while the other was a tipped pass. Griffin also had a lost fumble returned for a score. ",
            "6": "Jackson (2-86) and Garcon (2-53) both had high yardage totals because of those big plays, with the former securing Griffin's sole touchdown. Jordan Reed (9-70) was targeted heavily. ",
            "7": "Alfred Morris couldn't expose a Dallas run defense that has improved lately. Morris managed just 43 yards on 12 carries, and half of that production came on a 22-yard burst in the first half. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Texans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "<i> Editor's Note: </i> Andre Johnson said afterward that there's something wrong with the NFL if J.J. Watt isn't voted MVP. Eh, I don't think so. Watt is incredible, and he's in the conversation, but how valuable can he be if he couldn't lead his team into the playoffs? He's not even the most valuable player in his own division. That would be Andrew Luck. ",
            "2": "The Texans needed a win over the Jaguars - with Cleveland beating Baltimore and San Diego losing to Kansas City - to make the playoffs. The Texans and Chiefs did their part, but the Ravens' comeback win sent the Texans home for the winter. Still, Houston improved from two wins in 2013 to nine wins this year while having a rash of injuries at quarterback and dealing with poor play at times from the signal-caller. Bill O'Brien and his coaching staff did a tremendous job and have the Texans going in the right direction. ",
            "3": "Houston got the scoring started on its first possession. The Texans had a beautiful drive that started with Case Keenum hitting Andre Johnson on a slant for a gain of 29 yards. Damaris Johnson (3-33) then took a shovel pass for a gain of 34 yards. A screen pass to Foster (5-23) from 10 yards out went for a touchdown. The Jaguars answered with a nice drive led by runs from Jordan Todman and Blake Bortles. J.J. Watt put an end to that by burning Luke Joeckel for a strip-sack that was recovered by the Jaguars, and a few plays later, Watt beat a running back for another sack. That forced Jacksonville to settle for a 53-yard field goal from Josh Scobee. Houston moved the ball into Jacksonville territory again, but Keenum threw behind DeAndre Hopkins (2-5). Dwayne Gratz caught a deflection and raced down the field for a 55-yard pick-six. It got worse for the Texans, as Foster went down with an injury and hobbled into the locker room. Even without having to defend Foster (5-23), the Jaguars' defense continued to get gashed, as Houston moved the ball down the field before Alfred Blue (17-39) scored a short touchdown. The Texans took a 14-10 lead into the half. Todman (7-52 rushing, 5-46) got the Jaguars moving in the third quarter with a 34-yard run into Houston territory, but Scobee missed a 51-yard field goal. Keenum and the Texans' offensive line started breaking down as the fill-in signal-caller turned the ball over on a coverage strip-sack by Brian Davis. The Jaguars went to a trick play on the next snap as Cecil Shorts (5-47) took a lateral and threw to a wide-open Todman for a 23-yard touchdown after Brian Cushing blew the coverage. However, the Texans answered with a long drive, as Johnson had his way with the Jaguars' secondary. The drive finished with Johnson beating Gratz for an 8-yard touchdown to give Houston a 21-17 lead. Midway through the fourth quarter, Watt burned Joeckel and the left guard with a spin move to get a safety of Bortles. Bortles had to get rid of the ball, yet held on too long. Jacksonville had one more chance, and Bortles converted a clutch fourth-down pass to get into Houston territory. He then took off on a 34-yard run to the Texans' 10-yard line. Houston's defense though came up with a goal-line stand to clinch the victory. ",
            "4": "Bortles finished completing only 14-of-33 passes for 117 yards. Until the final drive, he really didn't play well. The rookie was extremely inaccurate and dreadful on third down as he didn't convert a single third down all game (0-for-11). Bortles seemed scared to push the ball downfield and got lucky as Houston's defense dropped three would-be interceptions. Johnathan Joseph dropped two of them - one would have gone for a pick-six. Despite a lot of positive press about Bortles and the Jaguars' regime, the jury is clearly still out on whether the organization is actually headed in the right direction. ",
            "5": "Keenum was 25-of-35 for 250 yards with two touchdowns and one interception. Andre Johnson had maybe his best game of the season with 10 catches for 134 yards and a touchdown. Jonathan Grimes (11-45) led Houston on the ground with Foster out. ",
            "6": "Watt finished with three sacks, a safety and a forced fumble. It was another tremendous performance that illustrated that he's worthy of being considered of the MVP award. ",
            "7": "The Jaguars' 2015 season could have already suffered a serious hit, as Pro Bowl alternate defensive tackle Sen'Derrick Marks walked into the locker room during the second quarter with an injury to his right knee. Marks was excellent for Jacksonville this year, and hopefully the injury won't be serious. A torn ACL or other significant ligament damage could cause him to miss a solid chunk of time next year. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "<i> Editor's Note: </i> It was weird to see Shaun Hill outplay Russell Wilson in the first half. Things were back to normal in the second half, however, which preserved my sanity. After losing four units to the Seahawks in Week 16, I don't think I could have lived with myself if they hadn't met expectations at home against the Rams. ",
            "2": "Facing a tough St. Louis defense, the Seahawks did their part to land home-field advantage throughout the playoffs, thanks to some huge plays from their defense. Seattle's stop-unit came up with a touchdown, two interceptions and a clutch goal-line fumble to make the road to the Super Bowl run through Seattle and the 12th Man in the NFC. ",
            "3": "The Rams got on the board first with a short field goal drive. They put tons of pressure on Russell Wilson throughout the first half, which eventually paid off with Wilson scrambling and overthrowing in the middle of the field. The ball sailed to St. Louis cornerback Marcus Roberson for the interception. However, the Seahawks' pass rush stepped up to knock St. Louis backward and get the ball back. The Rams' defense took it right back after Alec Ogletree stripped Marshawn Lynch (14-60) and T.J. McDonald recovered the fumble. Greg Zuerlein kicked a 52-yarder to produce points from that turnover. Wilson moved the ball into St. Louis' territory just before the half, but Aaron Donald sacked Wilson to knock the Seahawks out of field goal range. The Rams took 6-0 lead into the half. The Seahawks got moving in the third quarter with a great leaping grab by Paul Richardson (5-60) over Janoris Jenkins that went for 32 yards. That led to a field goal before Seattle tacked on another three-pointer to tie the game. St. Louis started moving the ball into Seahawks territory with Shaun Hill completing a clutch third-down conversion to Jared Cook (3-37), but Seattle's defense came up with a huge play as defensive tackle Jordan Hill made a diving interception when Shaun Hill was trying to throw a screen pass into the turf because the play was covered. Wilson took advantage with a gain to Kevin Norwood (2-34) for 31 yards, as the Rams had busted coverage with Jenkins leaving Norwood completely uncovered. On the next play, Lynch ran into the end zone from nine yards out. The Seahawks' defense finished the Rams off when Lance Kendricks was stripped of a reception by Bobby Wagner. Bruce Irvin caught the ball in mid-air and raced down the sideline for a 49-yard score. It was scored a pick-six for Irvin, but it really was a fumble by Kendricks that was returned for a score. The Rams moved the ball inside Seattle's 10-yard line, but Cook dropped a touchdown pass. Benny Cunningham (4-10 rushing, 7-57 receiving) then fumbled the ball out of bounds into the end zone for a Seattle touchback. Cunningham was trying to extend it for a score, but Earl Thomas slapped the ball free before it reached the goal line. ",
            "4": "Wilson completed 17-of-25 for 239 yards with an interception. The Rams' pass rush kept Wilson from really getting into any groove. ",
            "5": "Shaun Hill was 26-of-37 for 243 yards with two interceptions. ",
            "6": "Jordan Hill had a big game for Seattle with a sack and the interception. Michael Bennett, Cliff Avril, Kevin Williams, and Earl Thomas all played well for the Seahawks. Aaron Donald was impressive for the Rams. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "The Panthers, who clinched the NFC South with this victory, are entering the playoffs with a 7-8-1 record. They're way more than some losing team, however. They've won four consecutive games for a multitude of reasons. Primarily, Cam Newton's health has sparked this incredible surge. Newton was highly ineffective earlier in the year because he was nursing numerous injuries. That's not the case anymore, as Newton has been running circles around his opponents recently. The Falcons looked completely inept trying to stop him, as he basically did whatever he wanted to in this divisional title game. Newton threw just 16 passes, but completed 10 of them for 114 yards and a touchdown. He also scrambled six times for 51 rushing yards and a second score. On one play, the Falcons had him dead to rights, but he was able to wiggle out of a couple of sacks and sprint for a first down. We saw the Newton of old in this contest, running read-options and scrambling without hesitation, all while confidently doing his trademark Superman celebration. ",
            "2": "Newton's sole score went to Ed Dickson. Kelvin Benjamin, meanwhile, disappointed with only one grab for nine yards, thanks to a big drop in the early going. Greg Olsen (2-27) nearly led the team in receiving, trailing Philly Brown by just one yard. These numbers are meager because the Panthers didn't need to throw very much because they were ahead the entire time. ",
            "3": "Jonathan Stewart has also sparked the Panthers recently with numerous 100-yard outings. Stewart managed just 49 yards in this contest, but only had 13 carries. Being way ahead the entire time, Carolina was able to rest Stewart and feed the ball to Fozzy Whittaker and Mike Tolbert. ",
            "4": "Another reason why Carolina has thrived lately has been some defensive changes it has made since the bye. Some new secondary members and an improved pass rush have been instrumental. Matt Ryan was not prepared for this, as he had a terrible performance in a failed attempt to compete in what was anticipated to be a high-scoring affair. Ryan finished 29-of-47 for 260 yards and two interceptions, both of which were taken back for touchdowns. The first was an overthrow, while the second was a telegraphed pass. Ryan also had a third pick-six nullified by a defensive penalty. It wasn't all Ryan's fault though, as his offensive line really let him down. Also, Patrick DiMarco dropped what should've been a touchdown, forcing the Falcons into a field-goal try. ",
            "5": "The Panthers kept Julio Jones wrapped up pretty well, limiting him to just four catches for 58 yards. Roddy White led the team with eight grabs for 104 yards, but he hurt the Falcons with a lost fumble that led to a Carolina touchdown. ",
            "6": "Steven Jackson missed this contest with an injury, forcing Mike Smith to split carries between Jacquizz Rodgers (9-44) and Devonta Freeman (6-13). The latter was a disappointment. ",
            "7": "Speaking of Smith, there's speculation that he could be fired shortly. This disastrous season wasn't all Smith's fault, as the Falcons have dealt with an unreal amount of injuries, but they would've had the division clinched already had he not bungled the end of the Detroit and Cleveland games. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "Don't be fooled by this final score. Peyton Manning is not healthy, nor is he back to his former self. He continued to throw weak ducks and had issues with pass protection. Denver was able to distance itself from Oakland late in this game, thanks to its strong rushing attack and defensive dominance over Derek Carr. Manning made some decent intermediate throws, but he does not look like the same quarterback who used to crush weak competition during the regular season. Manning finished 21-of-37 for 273 yards. He once again failed to throw a touchdown, though he could've had one if Demaryius Thomas didn't drop a back-shoulder throw in the end zone. He also was credited with a lost fumble returned for a score, but that was a lateral pass that was tipped by a Raider, recovered and returned for six. ",
            "2": "Thomas couldn't help his fantasy owners by reaching the end zone, but he still had eight catches for 115 yards. However, Manning targeted Thomas 17 times, so it's troubling that the pair couldn't connect on half of their attempts to each other. Emmanuel Sanders (6-73) was the only other noteworthy receiver, as Julius Thomas was a no-show once more. He played, but couldn't come up with a single catch. ",
            "3": "C.J. Anderson was exceptional once again. He scored thrice while rushing for 87 yards on 13 carries. It was curious to see Ronnie Hillman out-touch him (15-56), and that wasn't just a byproduct of garbage-time opportunities; Anderson had just one more attempt than Hillman by halftime. ",
            "4": "The Raiders were in this game entering the final quarter, but they curiously waved the white flag with a minute remaining in the third frame. THey had a fourth-and-4 on the Denver 39, down 30-14 - in other words, two scores - but Tony Sparano foolishly decided to punt the ball. The Broncos took over deep in their own territory, but were able to drive down the field and add to their point total to go up three scores. And just like that, Oakland's hopes evaporated. ",
            "5": "This was not a pretty game for Derek Carr. It was ugly early on, as a pass toward Mychal Rivera early on hit a Denver defender in the back; it would've been an interception had the Bronco turned around. Carr then took a sack because held the ball too long. By halftime, Carr was just 4-of-10 for 34 yards. He put together a nice drive in the third quarter, but didn't do anything positive otherwise. Carr completed just half of his passes, finishing 18-of-36 for 158 yards, one touchdown and a late interception that was floated weakly toward the sideline. Carr needs help, perhaps with Amari Cooper in the 2015 NFL Draft. ",
            "6": "The Raiders may want to add another running back as well, though perhaps just someone to complement Latavius Murray, who had a strong finish this season. Murray mustered just 37 yards on 10 carries in this contest, but made up for it by leading the team in receiving, catching four balls for 60 yards. ",
            "7": "Save for Murray and Marcel Reece, Rivera was the Raiders' leader in receiving yardage, hauling in just two of his eight targets for only 26 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Packers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Packers had a huge scare in the second quarter of this game. Enduring some earlier red-zone troubles, an issue that has been lingering, Aaron Rodgers decided to end that by stepping up in the pocket and firing the ball to Randall Cobb for a touchdown. However, Rodgers foot planted awkwardly, and he collapsed in pain. He stayed down and was on the field for a while and ultimately had to be helped to the sideline, where he was then carted off to the locker room. Matt Flynn took the field at the beginning of the second half, and Green Bay's 14-0 lead quickly disappeared. The Lions eventually tied the game, but Rodgers came back to save the day. He still was a bit gimpy, but it didn't affect his play. In fact, Rodgers was better in the second half than he was in the first, going 11-of-13 for 129 yards and two touchdowns following intermission, with one of the scores being a quarterback sneak. Rodgers finished 17-of-22 for 226 yards and three touchdowns (two passing, one rushing). He sealed up the MVP award with this performance, as Flynn's presence on the field was a reminder of how poor this Green Bay team is without Mr. Discount Double-Check. ",
            "2": "Both of Rodgers' aerial scores were thrown to Cobb (4-80), though the team's leading receiver was Jordy Nelson (6-86). Richard Rodgers (5-40) and Eddie Lacy (3 catches, 26 rec. yards) were the only Packer players to catch passes. ",
            "3": "Speaking of Lacy, he was able to reach the century mark, gaining an even 100 yards on 26 carries. However, he lost a fumble in the red zone and was stuffed on multiple tries at the goal line, as the Packers failed on seven tries from the 1-yard line in the first quarter, as Lacy was ultimately stymied on a fourth-and-goal try at the 1-yard line. ",
            "4": "The Lions were playing, so of course, there was some controversy. A week after Dominic Raiola was suspended for stomping on a player's foot, Ndamukong Suh backed into Rodgers and stepped on his ankle twice. It'll be difficult for the league to determine intent, but Suh appeared to have put pressure on Rodgers' ankle with his foot the second time. Suh is not a first-time offender, so it's hard to trust him. I don't think Suh will be suspended for next week's playoff tilt at Detroit, but I won't blame the league if they gave him a one-game ban. ",
            "5": "Of course, Suh's suspension may not even matter if Matthew Stafford doesn't improve. Stafford, who has a terrible track record against winning teams on the road, sailed passes all over the place. He was highly inaccurate, and the only reason this game was close at all in the third quarter was because Rodgers missed some time with his injury. Stafford failed to complete half of his passes, going 20-of-41 for 217 yards, though he did throw three touchdowns. His accuracy was an issue - he overthrew Calvin Johnson for a score - and his offensive line let him down, even being responsible for pressure that caused a safety on an intentional grounding call. Stafford's protection has been shoddy all year, and it may have gotten worse with Larry Warford getting knocked out of the game with a knee injury. ",
            "6": "Despite being missed for a long touchdown, Calvin Johnson still reeled in two scores. However, he was able to haul in just four of his 11 targets for 39 yards, as many of Ser Stafford's attempts were off the mark. Golden Tate (3-45) led the team in receiving, while Theo Riddick (5-34) had the other touchdown. ",
            "7": "Joique Bell had a big game last week, but he let his team down with a lost fumble following a blocked field goal in the second half. He managed 60 yards on 13 carries. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "49ers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks trailed the Rams in the third quarter, so the Cardinals appeared to have a chance to win the division. Unfortunately for them, things didn't go their way in Seattle or San Francisco. The Seahawks came back, while the 49ers were able to prevail by a field goal, thanks to sub-par quarterbacking from Ryan Lindley. If there's a silver lining, it's that Lindley wasn't terrible. Unlike last week, he didn't struggle to complete routine passes. He moved the chains with intermediate throws to Michael Floyd and John Brown. He even had a touchdown off a flea-flicker in the first quarter. The problem is that Lindley is so unbelievably careless with the football. It looked like he was playing blindfolded, carelessly heaving passes into coverage. He fired three interceptions, all of which were telegraphed passes, and he easily could've had a few more. Floyd and Larry Fitzgerald actually had to serve as defensive backs to break up interceptions on the same drive in the second quarter. Lindley finished 23-of-39 for 316 yards, two touchdowns and three picks. Again, he did a good job of moving the chains on occasion, and he was even screwed by a big John Brown drop in the fourth quarter, but he needs to be a lot more careful with the football to give the Cardinals any sort of chance in the playoffs. ",
            "2": "Floyd and Brown saw way more targets than any other Cardinals. Floyd reeled in eight of the balls thrown to him for 153 yards and two touchdowns. Brown, seeing nine targets, caught four balls for 51 yards. Fitzgerald, meanwhile, continued to struggle off his injury, catching just two passes for 29 yards. ",
            "3": "Stepfan Taylor handled the workload last week, but he gave way to Kerwynn Williams in this contest, gaining 67 yards on 17 carries. ",
            "4": "Meanwhile, the 49ers said goodbye to Jim Harbaugh, who will likely be wasting his time in college next year. Colin Kaepernick bid farewell to the main reason why he's been a functional quarterback over the past few years. Kaepernick, who has regressed, won't even be nearly as good as he was this season without Harbaugh. Kaepernick's issues have come in the passing game. His passes were inaccurate, and he doesn't go through his progressions when he can't throw to his first read. He just seems overwhelmed, and things won't be any easier without the offensive mastermind who patrolled the 49er sidelines throughout the past several seasons. Kaepernick finished 15-of-26 for 204 yards and two touchdowns, but he at least did well on the ground again, scrambling seven times for 63 rushing yards. ",
            "5": "Kaepernick's scores went to Anquan Boldin (2-81) and Bruce Miller. Boldin snatched just two of his nine targets for 81 yards, as Kaepernick just struggled to connect with him. One of Boldin's receptions was an awesome, one-handed catch. He also had a touchdown that was nullified by a chop block. Meanwhile, Michael Crabtree (4-41) didn't do much, while Vernon Davis caught just one of the passes thrown to him for nine yards despite the fact that Arizona has struggled to defend tight ends all year. ",
            "6": "Kaepernick's rushing opened things up for Frank Gore, who averaged nearly six yards per carry. Gore tallied 144 yards on 25 attempts. He's heading for free agency in March. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers were able to sweep the Bengals to win the AFC North, but the biggest story in this game was what happened to two of the key players in the second half. Le'Veon Bell went down with a knee injury on a nasty, but legal hit from Reggie Nelson to his knee, which sparked a shouting match between Mike Tomlin and the safety during the post-game handshakes. Bell was down, but was able to trot off with a limp. It's been reported that he has a hyperextended knee. It's unknown what his status is for next week, but he's lucky he escaped without any sort of ligament tear. Later during a comeback attempt, A.J. Green caught a pass in Pittsburgh territory, but fumbled the ball. He was hit on the head during the play, and he was forced out of the game with a concussion. Green will need to be cleared for Cincinnati to have any sort of chance in Indianapolis next weekend. ",
            "2": "As for this actual game, the Steelers had a pre-game scare of their own when Ben Roethlisberger missed his usual warmups with flu-like symptoms. His weapons looked like they had the flu early on, as Heath Miller, Antonio Brown and Matt Spaeth were all guilty of dropped passes, while Maurkice Pouncey snapped the ball before anyone was ready, resulting in a fumble recovery for Cincinnati. The Steelers got their act together after that, as Roethlisberger was 8-of-12 for 126 yards, a touchdown and an interception following halftime. His pick occurred because of a miscommunication, but Roethlisberger made up for it with a 63-yard bomb to Brown with a few minutes remaining in regulation, which helped cover the spread. It appeared as though Pittsburgh was trying its hardest to beat the number, as Tomlin was unusually aggressive at the end of the contest, even trying an unnecessary fake punt that was intercepted. Roethlisberger finished 24-of-38 for 317 yards, two touchdowns and the pick. He would've had an even bigger day if it wasn't for those drops. Roethlisberger had a clean pocket for most of the night, as the Cincinnati pass rush was a big disappointment. ",
            "3": "Brown once again had a monstrous game, catching seen balls for 128 yards and a touchdown. He nearly had another score, but Roethlisberger missed him in the end zone. It seemed like he and Big Ben had trouble getting in rhythm early on, but the 63-yard score to clinch the cover made things right. Martavis Bryant (1-21) snatched Roethlisberger's other touchdown. ",
            "4": "As for the two injured players, both were having good games before leaving the field. Bell was able to muster just 20 yards on eight carries, but caught all six balls thrown to him for 80 receiving yards. Josh Harris and Dri Archer split the workload once Bell was knocked out. Harris, a big back, had a 59-yard gain called back because of a ticky-tack hold. He managed just seven yards on five attempts otherwise. Archer served as a pass-catcher. Green, meanwhile, was the team's leading receiver despite missing the very end. He caught eight of the 13 balls thrown to him for 82 yards. Jermaine Gresham (3-20, TD) also got hurt. He suffered a head injury early, and then he came back and then got banged up on his touchdown. Andy Dalton will absolutely need Gresham on the field if Green can't get cleared. ",
            "5": "Speaking of Dalton, it was another underwhelming performance by the ginger signal-caller. Dalton finished 27-of-38 for 244 yards, two touchdowns and a pair of interceptions. He had a nice completion percentage, but most of his conversions were checkdowns, and he failed to throw for a gain of longer than 19 yards. He had some solid completions,, but the picks proved to be costly. The first wasn't all his fault, as his intended receiver cut off the route. However, the second pick was ugly, as it was a poor overthrow in Green's direction. ",
            "6": "Jeremy Hill handled most of the workload yet again, and he didn't disappoint, gaining 100 yards on 23 carries. However, Giovani Bernard was involved as well, though primarily as a pass-catcher. He was given just three carries (eight yards), but he caught seven passes for 56 yards and a receiving touchdown. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> </brr>"
        }
    }
}