{
    "year": "2014",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "All anyone wanted to talk about prior to this game was the Ray Rice story. It seemed like the only thing Baltimore players did this entire week was answer questions about Rice. With that in mind, I didn't think there was much of a chance the Ravens would be completely focused for this matchup, and I wasn't alone. The Rice hoopla just seemed like it could capsize the team's season. Well, so much for that. If anything, it appeared as though Baltimore was extra focused in an attempt to put the Rice saga behind them. The Ravens won by 20, but they didn't exactly dominate this game. They outgained Pittsburgh by only 21 net yards. The difference turned out to be the constant mistakes the Steelers made throughout the evening, particularly in both offensive and defensive red zones. The Steelers began the game by putting together a promising drive, thanks to a questionable roughing-the-passer call and an 18-yard Antonio Brown conversion on third-and-14. Unfortunately, Brown took a big hit on that play, and he had to leave the field temporarily to get tested for a concussion. While gone, backup wideout Justin Brown lost a fumble in the red zone. Pittsburgh's offense and defense took turns screwing up. The Ravens were able to score on the ensuing drive, thanks to a Cortez Allen pass interference on Torrey Smith inside the 5-yard line. Darrius Heyward-Bey - yes, he's still in the league - then held on a big gain on an end-round by Markus Wheaton. Roethlisberger followed that up by throwing way behind Justin Brown on a third down, which would've been a big play because Brown was wide open. The Steelers had multiple chances to get back into the game in the second half, but committed way too many personal foul penalties. One was bogus, but the infractions allowed the Ravens to register touchdowns, allowing them to put this contest away. The scores were to Owen Daniels, who was wide open on both occasions, thanks to blown coverages. You'd think Pittsburgh would've learned the second time, but its defense is so anemic that it can't really do anything correctly. The nail in the coffin was a Heath Miller lost fumble, setting up a Baltimore field goal to put the host up by three scores. ",
            "2": "Aside from Pittsburgh constantly shooting itself in the foot, the greatest reason why Baltimore was able to prevail was because the Steelers' defense couldn't get off the field. The Ravens converted 25 first downs, as Joe Flacco went 21-of-29 for 166 yards and the two scores to Daniels. Pittsburgh failed to register a single sack against Flacco. Flacco's top option, besides Daniels (5-28), was Steve Smith, who registered six catches for 71 yards. Smith looked decrepit last year, but he's rejuvenated. Not only is he a reliable pass-catcher; he's also to create for himself by making great jukes or managing to out-muscle defenders for extra yardage. His only blemish was a dropped pass. Steve Smith outgained Torrey Smith (1-10) by a wide margin, though the latter Smith drew a long pass interference to set up Baltimore with a first-and-goal inside the 5-yard line. ",
            "3": "The Ravens were splitting touches with Bernard Pierce and Justin Forsett in the first half, but Pierce ended up with way more carries. Pierce gained 96 yards on 22 attempts, while Forsett managed 56 yards on just eight tries. Most of Forsett's yardage came on one 41-yard burst when the game was out of hand. Forsett appeared to land in the end zone, but was ruled inches short. John Harbaugh considered challenging, but opted against it. Forsett was a bigger factor in the passing game - four catches, 16 receiving yards - but it was disappointing to see Pierce utilized much more. It should be noted that Pierce (1 catch, 7 rec. yards) also dropped a pass. ",
            "4": "As for the Steelers, Roethlisberger went 22-of-37 for 217 yards and a garbage-time interception off a tip by Haloti Ngata. The Ravens were able to put considerable pressure on him, which was a bit of a surprise because Andy Dalton was hit only once last week. It's not nearly all Roethlisberger's fault, but the Steelers have just nine points in their previous six quarters. That's just awful. Roethlisberger targeted Antonio Brown more than anyone despite the fact that the speedy wideout missed about a quarter of action. Brown hauled in seven balls for 90 yards. Wheaton (5-38) and Miller (4-35) also contributed. ",
            "5": "The only Steeler offensive player who played a great full game was Le'Veon Bell. The second-year runner wasn't given nearly enough touches, as he gained 59 yards on just 11 carries and also caught five balls for 48 receiving yards. Bell made some terrific moves to avoid defenders, as he looks so much sprier than he did last year. Fortunately for Pittsburgh, it has 10 days to figure out how to get the ball into Bell's hands more frequently. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "There was a ton of excitement around the city of Buffalo leading up to this game. The Bills pulled off a huge upset the previous week. The team is going to remain in Buffalo because of the recent ownership sale. Jim Kelly is in remission. Buffalo fans hadn't been this optimistic in a very long time. And then there was this performance. It was a low-scoring affair for more than two quarters in which the fans were so loud that it was nearly impossible to hear the officials make their announcements, but Buffalo's special teams and defense stepped up and helped establish a big lead. The Bills emerged 2-0, possessing sole ownership of first place in the AFC East for the first time in three years. Having said that, it's almost impossible for the Bills to maintain this because E.J. Manuel is not a good quarterback. Manuel even made some mistakes in this victory in which he went 16-of-26 for 202 yards and a touchdown. For instance, Manuel missed Sammy Watkins for a wide-open touchdown in the first half and then made a long throw to Watkins, who had to dive for the ball instead of being able to keep running for a first down. Manuel just isn't accurate, and he'll continue to be inconsistent, particularly against defenses that aren't missing two starting linebackers. ",
            "2": "Watkins was also responsible for a big mistake. Though he put together a monstrous performance - eight catches, 117 yards, one touchdown - the rookie receiver dropped a 45-yard touchdown in the opening quarter, though Brent Grimes contributed on the incompletion by getting his hand in. Watkins appeared to injure himself, but unlike several other banged-up wideouts this week, he was able to stay in the game. Later, on the touchdown, Watkins appeared to lose control of the ball and then it hit the pylon. The play should've been overturned as a touchback, but the officials didn't bother reviewing it. ",
            "3": "Fred Jackson and C.J. Spiller once again split touches almost evenly, though Spiller outgained Jackson, 69-24 (thanks to a 47-yard burst) with each handling 12 carries each. Spiller also made a huge impact on special teams, taking a third-quarter kickoff return to the house. ",
            "4": "As for the Dolphins, their offensive game plan was almost instantly shot to hell when Knowshon Moreno suffered an injury at the end of the first quarter. Moreno went down after his only carry - for four yards - and held his wrist in pain. He left the game and never returned. Miami was forced to exclusively use the inferior Lamar Miller, who tallied 46 yards on 11 attempts. Moreno was later diagnosed with a dislocated elbow, and he'll be out 4-8 weeks. ",
            "5": "Ryan Tannehill had to throw way more than the Dolphins intended because he was constantly trailing. Tannehill went 31-of-49 for 241 yards one touchdown and a pick, which was inconsequential because it occurred very late in garbage time. Tannehill wasn't terrible, but he struggled with pressure and had some accuracy issues once again. For example, he threw way behind an open Brandon Gibson in the third quarter, which forced a field goal. Spiller scored on the ensuing kickoff. Tannehill's lone score went to Mike Wallace, who led the team in receiving (5-56). However, that touchdown masks the fact that Tannehill and Wallace once again struggled to connect. Rookie Jarvis Landry is also worth mentioning because he was right behind Wallace with five grabs for 49 yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Different year, same Lions. It's unbelievable. It doesn't seem like it matters who the offensive coordinator or the head coach are. It's always the same. They look great at times, but always find ways to screw themselves over with dumb mistakes. This is going to be a weekly occurrence, but here's a list of most of the errors Detroit made: - Rookie kicker Nate Freese missed two field goals in the opening half. As Freese continues to struggle, you have to wonder where Kickalicious is. He didn't miss any tries last preseason. - Joique Bell (10 carries, 36 yards) lost a fumble near the red zone on the team's second offensive drive. This was a role reversal, as Reggie Bush was the one guilty of turning the ball over when the team was melting down late last year. - Calvin Johnson dropped a touchdown. This was followed by one of the botched field goal tries. - Matthew Stafford threw an interception into double coverage while targeting Megatron in the second half. - Kelvin Benjamin made an impressive, one-handed catch along the sideline during one of Carolina's scoring drives. However, it appeared as though his hand touched out of bounds before his knee hit down. Jim Caldwell was unable to challenge the play because he was taking a nap. - The Lions sacked Cam Newton as the Panthers were trying to run out the clock. However, Detroit was whistled for tripping, giving Carolina a first down. Detroit made more mistakes and nearly was guilty of several others, including one play where Donkey Kong Suh hit Newton after the whistle blew. It was a miracle Suh wasn't penalized. Suh was able to make some nice plays, like disrupting a Newton pass on a third down early on. However, Newton had the last laugh with a very impressive performance, going 22-of-34 for 281 yards and a touchdown. He suffered a bit of a scare in the second half when he landed awkwardly on the side of his knee when he fell short of the goal line. He limped around after the play, but seemed fine afterward. ",
            "2": "Newton targeted Greg Olsen and Benjamin more than anyone, as the two saw eight balls each. Olsen was great, logging six receptions for 72 yards. Benjamin hauled in just two passes for 46 yards, but had that aforementioned, awesome sideline snag. He almost caught a touchdown in the first half, but could only get one foot down inbounds. He dropped three passes as well, unfortunately. ",
            "3": "DeAngelo Williams was out, so Jonathan Stewart started and got almost all of the workload. However, all he could muster was 37 yards on 15 carries, and most of his yardage came on just one, powerful, 22-yard attempt. Stewart did score a touchdown to help his five fantasy owners out there. ",
            "4": "As for Stafford, he went 27-of-48 for 291 yards, one touchdown and a pick. Without Greg Hardy out of the lineup, Stafford had a clean pocket to start the game. However, the Panthers managed to get pressure on him as the afternoon progressed, ultimately notching four sacks. As you can imagine, Stafford targeted Calvin Johnson more than anyone, but Megatron managed just six grabs for 83 yards. Bell tied his reception lead and accumulated 61 yards. Golden Tate (5-57) also contributed, while Jed Collins logged Stafford's sole touchdown. ",
            "5": "It was surprising that Reggie Bush wasn't used much at all, especially considering that Bell fumbled. Bush had eight touches, carrying the ball six times for 26 yards and catching two passes for only six receiving yards. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "A 14-point victory may not seem like much, but the Bengals absolutely dominated this game. It was 24-3 until very late, but the Falcons managed a garbage-time touchdown to make this seem closer than it really was. Something else to consider is that the Bengals were without A.J. Green for most of the contest. Green was diagnosed with turf toe, so without him, Tyler Eifert and Marvin Jones, all Andy Dalton had to operate with were Mohamed Sanu, Jermaine Gresham and his two running backs. That was all he needed, apparently, against Atlanta's putrid defense. Sanu, Giovani Bernard and Jeremy Hill had especially monstrous performances. Sanu was targeted only four times, but he hauled in three of those balls for 84 yards and a touchdown, which was a 76-yarder. Sanu also hurled a 50-yard pass to Brandon Tate. Meanwhile, Bernard and Hill both found the end zone. Bernard rushed for 90 yards on 27 carries and caught five balls for 79 receiving yards. Hill, meanwhile, rumbled for 74 yards on 15 tries. ",
            "2": "Dalton's supporting cast was able to carry him to victory. Dalton made some nice throws, but left points off the board when he overthrew his receivers twice in the end zone. Dalton is responsible for the Bengals' red-zone woes, which didn't play a factor in this contest because the Falcons simply couldn't score. ",
            "3": "Atlanta's offense was awful. The team mustered just 98 net yards of offense in the first half, and most of what it did after intermission was artificial because the Bengals were in prevent since they were up by so much. Matt Ryan, for instance, finished 24-of-44 for 231 yards, one touchdown and three interceptions, but he was just 10-of-17 for 60 yards at intermission. Two of Ryan's picks were poor decisions, as he made horrible throws into double coverage. ",
            "4": "Ryan's sole score, which came in garbage time, went to Julio Jones, who made his fantasy owners happy with seven grabs for 88 yards. Roddy White (5-42) didn't do as much. Devin Hester, who posted an impressive stat line last week, had just one reception. ",
            "5": "Like the Ravens last week, the Falcons couldn't run the ball on Cincinnati's impressive front. Steven Jackson (11-46) did nothing outside of a 13-yard carry, while Jacquizz Rodgers (5-23) saw limited touches. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Browns",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "<i> Editor's Note: </i> Are things turning around in Cleveland? The Browns of the past would have missed Billy Cundiff's attempt. Perhaps LeBron James returning to his hometown has changed everything. Or maybe the Browns are just getting their fans' hopes up in an attempt to crush everyone's spirit down the road. ",
            "2": "The Saints have dug themselves a real hole in the NFC South with an 0-2 start and Carolina winning its first two games. New Orleans should have beaten Cleveland, but the Saints' defense had some critical busts while Sean Payton waited far too long to get Jimmy Graham involved. Payton and Rob Ryan did some shouting on the sideline, so you have to wonder if New Orleans will remain together to turn its season around. Cleveland showed some real fight, and Mike Pettine's squad earned an impressive win over a playoff team. Pettine deserves congratulations on his first win as a head coach, while Brian Hoyer is showing that he knows how to win in the NFL. ",
            "3": "The Browns got on the board first when the Saints punted from their own end zone to set up Cleveland in a short field. Led by running back Terrence West, the Browns moved the ball inside the 5-yard line before Hoyer threw a short touchdown pass to Miles Austin (6-44) after he beat Patrick Robinson on a slant. Robinson kept hurting his team when he lined up offsides as the Browns missed a field goal. That gave Cleveland a first down and a shorter field goal for Billy Cundiff. The Browns opened up a lead of 13 when a bad pass from Brees floated to Tashaun Gipson. Gipson jetted down the field for a 62-yard touchdown return, although Cleveland's holder dropped the extra point. In the final minutes before halftime, the Saints finally started to throw the ball to Graham, as Brees worked the ball down the field with his stud tight end. Graham had five receptions for 57 yards and a leaping touchdown catch to close out the half. After intermission, the Saints kept going to Graham, who put them in the lead with a short touchdown catch on a third-and-goal. The Browns regained the advantage with a nice drive that ended with West (19-68) plunging into the end zone. The Saints came right back with passes to Graham setting up a short score for Mark Ingram (11-83). Cleveland had time for one more drive, and Hoyer made some clutch passes with the big one being a 22-yard pass to Andrew Hawkins (6-70), who got wide open in busted coverage. That set up Cundiff's game-winning 29-yard field goal with just a few seconds left on the clock. ",
            "4": "Hoyer was 24-of-40 for 204 yards with a touchdown. Brees, meanwhile, finished having completed 27-of-40 passess for 237 yards with two touchdowns and an interception. Graham notched 10 receptions for 118 yards and two scores, but he went almost the entire first half without a target. Sean Payton screwed up not getting Graham involved immediately, and he easily could have produced a lot more because the Browns had no answer for him. New Orleans' receivers didn't do much. Robert Meachem (3-37), Kenny Stills (3-25) and Brandin Cooks (3-17 receiving, 2-31 rushing) had minimal impact, while Marques Colston had zero receptions. ",
            "5": "Karlos Dansby had an excellent game for Cleveland with 12 tackles and a sack. Paul Kruger had a sack and heat on Brees as well. ",
            "6": "After a rough first quarter, the Saints' defense played better, but the team folded late in the fourth rather than slamming the door on the Browns. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "The Vikings didn't seem like they missed Adrian Peterson whatsoever when they effortlessly marched down the field on the opening drive. They went seven plays and 80 yards into the end zone, capped off by Matt Asiata's 25-yard reception from Matt Cassel, who opened 4-for-4. The Vikings didn't score a single point after that. In fact, they were outgained, 292-137, the rest of the way. Matt Cassel had major issues in this contest, as Bill Belichick seemed to know exactly how to game plan for his former quarterback. Cassel went 19-of-36 for 202 yards, one touchdown a whopping four interceptions. Cassel's first pick was a dying duck heaved at Devin McCourty, who nearly brought it back for six, but was tackled at the 1-yard line. The second was just great coverage by Darrelle Revis, so I wouldn't put that one on Cassel. His third was a forced throw, while the fourth occurred in garbage time. Cassel made some poor throws outside of the picks as well. For instance, he had an open receiver in the red zone during the second quarter, but led his target out of bounds. This forced the Vikings to attempt a field goal, which was blocked and returned for a touchdown. Of course, it didn't help that the Vikings couldn't pass protect at all. Cassel took a whopping six sacks, as Matt Kalil had major problems blocking Chandler Jones. Kalil had an awful game against Robert Quinn last week as well. ",
            "2": "As for Peterson's replacement, Asiata proved to be the plodder he was projected to be. He pounded for 36 yards on 13 carries, but made a positive contribution in the passing attack, snagging five balls for 48 receiving yards and the aforementioned touchdown. ",
            "3": "Those who didn't see this game might be surprised that Cordarrelle Patterson was able to lead the Vikings in receiving (4-56) considering that Revis was on the field. However, Belichick opted to put Revis on Greg Jennings, so that would explain why the veteran wideout caught just one ball for four yards. ",
            "4": "As for New England's offense, the unit wasn't as impressive as the defense or special teams. Tom Brady threw just seven incompletions (15-of-22), but generated only 149 yards and a touchdown. Brady didn't have to do much, so he's fortunate because Minnesota has an underrated secondary. Brady's sole score went to Julian Edelman, who caught six balls for 81 yards. Edelman was the only Patriot to accumulate more than 32 receiving yards. Rob Gronkowski (4-32) and Shane Vereen (1 catch, 0 yards) disappointed their fantasy owners. Aaron Dobson (1-13) barely did anything in his season debut. ",
            "5": "The Patriots moved the chains on the ground. Stevan Ridley failed to convert some short-yardage opportunities early on, but ultimately finished with 101 yards and a touchdown on 25 carries, most of which came after intermission when New England was trying to chew the clock away. Vereen (6-40) didn't get much work in any aspect. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "14"
        },
        "comments": {
            "amount": "3",
            "1": "There was never any news regarding the possibility that Carson Palmer could miss this game until Sunday morning, but a bum shoulder ruled him out in favor of Drew Stanton. The public pounced all over the Giants, betting them frantically, as this spread shifted from Cardinals -2 to Giants -2. As usual, the public overreacted and was wrong. Stanton didn't have a great game, but he was fine enough not to lose it. Stanton led the Cardinals down the field on an opening touchdown drive, thanks to a pair of Giant penalties - roughing-the passer on a hit after the whistle and illegal contact - which ultimately allowed Jonathan Dwyer to find the end zone. The score was almost Stanton's, as a Larry Fitzgerald touchdown was negated because his knee was ruled down inches shy of the goal line. Stanton did struggle a bit in the second half, going 5-of-13 for 52 yards following intermission. He also nearly had a pick when he heaved the ball into double coverage. The problem was that the Giants continuously screwed themselves over with mistakes. There was one killer sequence. Ted Ginn returned a kickoff for a touchdown, and this was followed by a lost fumble on New York's kickoff (leading to a field goal) and then Rashad Jennings followed that up with an unforced fumble of his own (resulting in another field goal). ",
            "2": "Perhaps the one positive for the Giants is that Eli Manning actually played well. Manning was a mess during the exhibition and in the season opener, but he was sharp for the most part in this contest, going 26-of-39 for 277 yards, two touchdowns and a pair of interceptions. One of the picks wasn't his fault because the ball was tipped, but he was responsible for a strip-sack because he didn't recognize the blind-side pressure and held on to the ball too long. Manning's play-makers screwed him over. There were several dropped passes, including one by Rueben Randle on what would've been a big gain with three minutes remaining in regulation. Andre Williams also dropped a pass after Jennings seemed to be temporarily benched following his fumble. This was typical, Tom Coughlin stubbornness, and it ended up costing him because he put an inferior player on the field. ",
            "3": "Some random stats from this game: - Larry Fitzgerald caught six balls for 51 yards, but it could've been a much bigger day. Fitzgerald was tackled inches short of the goal line on the opening drive, as mentioned, and he also had a big gain nullified by a Jared Veldheer penalty. - Michael Floyd didn't do as much, hauling in just one pass for 19 yards. He was thrown to six times. - Andre Ellington rushed for 91 yards on 15 carries, but wasn't much of a factor in the passing game, catching one ball. He also lost a goal-line carry to Dwyer. - Victor Cruz led the Giants in targets (10), but caught only half of them for 60 yards. Larry Donnell paced the Giants in receptions (7) and yardage (81). - Jennings, who had the key fumble, registered 64 yards on 18 carries. Andre Williams (8-12) couldn't do much. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Cowboys aren't going to win many games if they keep killing themselves with mistakes. That's exactly what was happening at the beginning of this contest. DeMarco Murray kicked things off by fumbling again on the second drive. Dallas then had too many men in the huddle, and then an ineligible player downfield overturned a big play. Dez Bryant, meanwhile, who suffered an early injury, returned to the field, only to yell at the coaches on the sideline because he wasn't thrown to on a third down in the opening quarter. It seemed like another one of those days for the Cowboys... and yet they won by 16. The Titans simply couldn't take advantage of Dallas' mistakes because Jake Locker was so inept. The stats don't tell the complete story, but Jake Locker was very inaccurate. He went 18-of-34 for 234 yards, one touchdown and two interceptions. He missed open receivers and was completely rattled at times. He even tossed an interception returned for six by Rolando McClain, but that was nullified by a quick whistle. ",
            "2": "This was obviously a huge disappointment by the Titans, who were seen by many (including myself) as this year's surprise team, especially after their upset victory over the Chiefs in Week 1. Their defense dominated in that contest, but struggled immensely versus Dallas. Tennessee simply couldn't get off the field because it couldn't contain Murray, who atoned for his early fumble by rushing for 167 yards and a touchdown on 29 carries. ",
            "3": "Tony Romo, meanwhile, went 19-of-29 for 176 yards and a touchdown. It appeared as though he'd have a rough afternoon early on. He took a sack from Jurrell Casey and saw Bryant leave the game with an injury. However, Bryant quickly returned, and Romo didn't need to do much because his team had the lead the entire afternoon, while Murray was breaking off big chunks of yardage on almost every carry. Despite Romo's meager yardage, Bryant still had a big afternoon. He saw 14 targets, catching 10 balls for 103 yards and a touchdown. Jason Witten was the only other Cowboy to log more than two receptions (4-32). ",
            "4": "As for the Titans, Delanie Walker was the only offensive player of note. Like Bryant, he snagged 10 receptions for 142 yards and a touchdown. Justin Hunter (2-26) didn't do much, but he saw more targets than any other receiver, including one in the end zone. Locker was just so bad that he couldn't connect with him. ",
            "5": "The Titans couldn't run the ball often because they were behind all afternoon. Shonn Greene led the team with five carries (40 yards). Bishop Sankey (2 carries, 3 yards) wasn't a factor. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "If someone had told me that both Robert Griffin and DeSean Jackson would've both left the game in the first quarter, my initial reaction would've been to confidently say the Jaguars would pull the upset. But then I would've thought about it and changed my mind because both Griffin and Jackson are wildly overrated. I called Griffin Commander Checkdown last week because all he did was toss short passes all while being reluctant to run. Jackson, meanwhile, is as fragile as they come. He's a one-trick pony who doesn't deserve all of the attention he always receives from opposing defenses. Thus, it's no surprise that the Redskin replacements fared better than the starters. Kick Cousins dissected Jacksonville's inept secondary with ease. He wasn't even challenged. It seemed like there were wide-open targets for him on every single play. His first score was to fullback Darrel Young, who was uncovered. Cousins then appeared to launch another touchdown to Niles Paul, who was wide open as well. Paul was tackled inches short of the goal line, but the Redskins found the end zone anyway. These were just examples of how Cousins was able to beat Jacksonville downfield. Cousins finished 22-of-33 for 250 yards and two touchdowns. Griffin was off to a nice start (2-of-3, 38 yards; 2 carries, 22 rush yards), but as Joe Theismann mentioned in the preseason, Cousins is the better passer. Griffin is a walking injury, so Washington should strongly consider going forward with Cousins. Of course, it won't matter in the immediate future because Griffin will be out for a while. ",
            "2": "Cousins helped introduce us to Niles Paul, who had a career performance. He snatched eight balls for 99 yards and a touchdown. Keep in mind that Paul is the second tight end on the roster, so he won't be as big of a part of the offense once Jordan Reed returns. However, Reed, like Griffin, is always hurt, so Paul is worth adding in fantasy if you're in need of a tight end. ",
            "3": "With Jackson out, it was surprising that Cousins targeted Pierre Garcon (1 catch, 12 yards) only four times. Rookie Ryan Grant (5-57) and Andre Roberts (4-57) saw the most targets of the wide receivers. ",
            "4": "The Redskins also ran the ball well. Jacksonville had issues tackling Alfred Morris and Roy Helu, who both ran like giant mammoths trampling tiny insects. Morris tallied 85 yards and two touchdowns on 22 carries, while Helu gained 25 yards on eight attempts before leaving the game with a knee injury. ",
            "5": "As for the Jaguars, the front office should strongly consider firing Gus Bradley. It's mind-boggling how unprepared Jacksonville was for this contest. Bradley also made dumb mistakes like calling a timeout prior to halftime when Washington still had the ball near midfield. Bradley's timeout allowed the Redskins to attempt a Hail Mary when the clock would've expired instead. Nothing happened, but Bradley could've cost his team big time. Bradley's worst offense is not going with Blake Bortles. Continuing to start Chad Henne is inexcusable. Henne was an abomination in this game. He went 14-of-28 for 193 yards, one touchdown and an interception, but those numbers are very misleading because a lot of the yardage came in garbage time. Henne did have a 76-yard touchdown dropped by Allen Hurns on the opening drive, but it wouldn't have mattered because he showed absolutely zero awareness when it came to reading blitzes, and thus couldn't consistently move the chains. The Redskins managed to dominate the line of scrimmage - especially Jason Hatcher and Ryan Kerrigan - but many of the franchise-record 10 sacks Henne took were his fault because he often held on to the ball too long. The offensive line stinks, but a capable quarterback would have taken at least half of those sacks. Henne is pure garbage and should not start another game going forward. Bradley needs to be fired if he doesn't give Bortles the nod in Week 3. ",
            "6": "Perhaps the general manager should be axed as well for signing Toby Gerhart. It's no surprise that the plodder couldn't do anything in this contest. He mustered only eight yards on seven carries. It's embarrassing that the Jaguars are starting him, but they don't have anyone better. ",
            "7": "Jacksonville's top wideout was Allen Robinson (4-75), but most of what he did came in garbage time. Hurns (2-13), as mentioned, killed his team with that awful drop. He was wide open, and he would've easily run into the end zone for a 76-yard score. Adding injury to insult, he left the game on crutches after twisting his ankle. Mike Brown also hurt his team with an early drop that would've moved the chains on a third down. ",
            "8": "Marcedes Lewis (2-71) caught Henne's sole touchdown. the score was all him, but he left the game with an ankle injury in the third quarter. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "21"
        },
        "comments": {
            "amount": "5",
            "1": "No one gave the Chargers much of a chance entering this game. How would they stop Russell Wilson? How would Philip Rivers score on Seattle's dominant defense after struggling Monday night? San Diego had the answers. Rivers would score by throwing right at Richard Sherman. And the defense stopped Russell Wilson by staying on the field for most of the game. And that's not an exaggeration; the Chargers held the ball for more than 42 minutes. Given how hot the conditions were - it was about 120 degrees on the field - the Seahawks, wearing their dark uniforms, melted away in the San Diego sun. They constantly cramped up - Sherman and Earl Thomas were some of the players who had issues - while the Chargers basically did whatever they wanted to against their exhausted opponent. Rivers was unstoppable. He went 28-of-37 for 284 yards and three touchdowns. The kicker is that the Chargers could've had more success on offense, but they committed four penalties in the red zone. Rivers, as mentioned, targeted Sherman because San Diego matched up Keenan Allen and (5-55) and the quicker Eddie Royal (7-69) against Sherman. The All-Pro corner is terrific, but his one liability is covering fast, shifty wideouts like Royal. ",
            "2": "Of course, everyone is talking about Antonio Gates. Formerly the top tight end in the NFL, Gates hauled in all seven targets thrown to him for 96 yards and three touchdowns. He's as healthy as he's been in the past five years, so he's dominant once more. The Seahawks had absolutely no answer for him. ",
            "3": "The dark cloud over this victory was a knee injury Ryan Mathews sustained in the second half. Mathews will have an MRI on Monday, and there's some concern that he has a sprained MCL. Mathews was not having a very good game; he had just 31 yards on 11 carries. Danny Woodhead, meanwhile, was given 12 touches (8 carries, 32 rush yards; 4 catches, 28 rec. yards). ",
            "4": "Keeping Russell Wilson off the field was definitely a major reason the Chargers won. Wilson played well when he had the ball, going 17-of-25 for 202 yards and two touchdowns. Wilson did have some trouble with pressure, however. He was sacked just twice, but was under duress on numerous other occasions. Melvin Ingram, who notched one of those sacks, forced a fumble. Wilson's two scores went to his running backs. Robert Turbin saw four touches near the end of the first half, one of which was an end-zone trip. Marshawn Lynch then scored following intermission, but he didn't get very many carries (6-36) because Seattle simply wasn't on the field very much. ",
            "5": "Seattle's first touchdown was a 51-yard Percy Harvin run. However, Harvin was clearly out of bounds on the play, and it's baffling how the call wasn't overturned. Perhaps karma intervened because Harvin lost a fumble on a second-quarter kickoff return, which helped San Diego stay on the field. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Rams",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "Wow, Austin Davis. Dick Stockton called some of Davis' passes dying quails last week. Stockton once again called the Rams' game, but saw a much more impressive third-string quarterback. Davis went 22-of-29 for 235 yards despite missing Tavon Austin for more than half the game, and he was every bit as good as those numbers indicate. Davis saw some pressure, but displayed great pocket awareness and delivered solid throws to his targets. Perhaps the demise of the Rams has been greatly exaggerated. ",
            "2": "The announcers made a huge deal about Austin being knocked out of the lineup with a knee in the second quarter. Austin had two carries for 21 yards, and while it's true that the Tampa defense didn't have to worry about reverses anymore, Davis' preferred downfield target was Brian Quick. The emerging receiver caught seven passes for 74 yards. Three other Rams - Jared Cook, Austin Pettis, Lance Kendricks - were the only other Rams who logged more than two receptions. ",
            "3": "Zac Stacy seemingly put the running back controversy to rest with a solid performance, though he did lose a fumble near midfield at the beginning of the third quarter. Stacy gained 71 yards and a touchdown on 19 carries, while Benny Cunningham (6-15) wasn't much of a factor. ",
            "4": "As for the Buccaneers, they seemingly played even with the Rams offensively, but they needed St. Louis penalties to move the chains on some of their drives, while the Rams legitimately converted first downs. Still though, Josh McCown played mostly well, though he did heave a hideous interception in the opening quarter when he carelessly threw the ball across his body in the red zone. It was a ridiculous mistake a veteran quarterback shouldn't have made, and it appeared as though McCown would continue being guilty of blunders like he did last week when he was hurling passes while falling down. However, McCown was sound after that, finishing 16-of-21 for 179 yards and two rushing touchdowns. ",
            "5": "Both of McCown's top wideouts snagged a team-high four passes. Vincent Jackson (4-51) made a very impressive catch in the second half when he seemingly leapt 10 feet into the air to secure a reception. Mike Evans (4-49), meanwhile, had a disappointing ending to the night. He suffered an injury on a very hard hit on the final drive of regulation. The Buccaneers didn't have a timeout, so they had to eat a 10-second run-off, which ended the game. ",
            "6": "Doug Martin didn't play, but that didn't prevent the Buccaneers from running well. Bobby Rainey gashed the Rams for 144 yards on 22 carries. He also caught three balls for 30 receiving yards. ",
            "7": "The Buccaneers suffered two big blows on defense when they lost All-Pro defensive tackle Gerald McCoy and solid linebacker Mason Foster in the opening half. McCoy broke his hand, while Foster left with a shoulder and never returned. However, the Rams were moving the chains effectively before they got hurt. ",
            "8": "There was a weather delay in this game that lasted about an hour, thanks to afternoon thunderstorms. That begs the question: Why the hell did this contest start at 4:05? As someone who has vacationed in Tampa on multiple occasions during the summer, I could've told the schedule-makers that this was a huge mistake. Screw the heat; all Tampa home games prior to October should begin at 1. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "It's mind-boggling how many injuries the Chiefs have sustained this season. They already lost Derrick Johnson, Mike DeVito and Jeff Allen among others for the year prior to this game, and it appeared as though Jamaal Charles and Eric Berry would be gone for a while as well. Charles and Berry both sustained ankle injuries at Denver, but both turned out to be mild sprains. Unfortunately, Kansas City's season could be over anyway. The Chiefs put everything they had into the Denver game and battled the Broncos to the very end, but they came up a bit short. They'll be deflated next week in a road tilt at Miami, so if they can't get up for that, they'll be finished at 0-3. The Chiefs were able to stay in this game in part because of Knile Davis. Charles' injury was devastating, but Davis filled in admirably, rushing for 79 yards and two touchdowns on 22 carries and catching six balls for 26 receiving yards. Charles obviously would've been more productive, but Davis proved to be adequate as a replacement. ",
            "2": "Alex Smith also played well. Though he had a hilarious blunder early when he attempted a pass while being five yards past the line of scrimmage, Smith did a good job of moving the chains, going 26-of-42 for 255 yards. He did some of his best work on the ground, scrambling five times for 42 yards. Smith helped the Chiefs maintain possession for more than 36 minutes, as Kansas City did a good job of keeping the ball away from Peyton Manning. However, a few back-breaking mistakes did them in. A holding penalty negated a big gain in the third quarter. Another infraction in the red zone and a missed field goal by Cairo Santos (nice job cutting Ryan Succop) turned a 10-minute third-quarter drive into nothing. Meanwhile, allowing Montee Ball to gain 23 yards on a second-and-30 in the second half robbed the team from another possession. Smith was also strip-sacked near the end of the game, but the officials made a curious call by ruling it an incompletion. ",
            "3": "Excluding Davis, three Chiefs tied for the team lead with six targets. They were Travis Kelce (4-81), Donnie Avery (3-14) and Dwayne Bowe (3-40), who didn't do much in his 2014 debut. ",
            "4": "The Broncos are 2-0, but there's something off with their offense. They just can't put teams away. It looked like the Broncos would when Peyton Manning hurled a 48-yard bomb to Emmanuel Sanders early on, but they just couldn't convert third downs, moving the sticks on just three of eight tries. Manning nearly threw an interception, while the team as a whole was guilty of 11 penalties. ",
            "5": "Sanders (8-108) made an error of his own when he lost a fumble in the second quarter. The officials ruled it an incompletion, but Andy Reid challenged. The call was inexplicably upheld. Reid could do nothing but laugh at the officials' incompetence. Kansas City then had an incorrect call go its way later in the game, so everything turned out even. ",
            "6": "Manning's touchdowns went to Demaryius Thomas (5-62), Julius Thomas (4-39) and Jacob Tamme. ",
            "7": "As mentioned, Ball had a 23-yard gain on a second-and-30 that caught the Chiefs off-guard. Ball otherwise had a pretty averaging outing, tallying 60 rushing yards on 12 carries and catching all three of his targets for 29 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "The Packers managed to avoid an 0-2 start, but there's no way they'll be a legitimate Super Bowl contender this year unless their offensive line improves. Aaron Rodgers had shoddy blocking in this contest. He was sacked twice on his second drive and was constantly under duress. He ultimately took four sacks, a figure that easily could've been greater had he not used his athleticism to scramble out of pressure so often. And of course, the backup center opened the game with a botched snap, which set up an early Jets' touchdown. Despite all of the heat he faced, Rodgers still went 25-of-42 for 346 yards and three touchdowns. He also scrambled six times for 28 rushing yards. Many of Rodgers' incompletions were thrown away to avoid sacks, but he missed a few passes he would've normally made. However, he made up for it with some great throws, including an 80-yard touchdown bomb to Jordy Nelson, which turned out to be the decisive score. ",
            "2": "As for Nelson, he compiled a career-high receiving yardage total. He caught nine of the 16 balls thrown to him for 209 yards and the long score. Randall Cobb (5-39) snagged Rodgers' other two touchdowns. ",
            "3": "Another Packer wideout worth noting is Davante Adams, who was second on the team with seven targets. Adams logged five balls for 50 yards, playing ahead of Jarrett Boykin (1 catch, 6 yards), who was benched after a brutal drop in the second quarter. ",
            "4": "Eddie Lacy has gotten off to a slow start to his season, but it's not his fault. He's battled two tough run defenses, while his offensive line has been brutal. He had just 43 yards on 13 carries. ",
            "5": "As for the Jets, Geno Smith went 16-of-32 for 176 yards, two touchdowns (one passing, one rushing) and an interception that occurred because he got hit. He did his best work as a scrambler, rushing for 26 yards and another score, but he made some impressive throws in the first half. However, he struggled following halftime because Eric Decker pulled his hamstring. Smith finished 6-of-18 for just 73 yards after intermission. Of course, you may have seen the most controversial play of this game when a tying Smith touchdown to Jeremy Kerley was nullified by an illegal timeout called by Marty Mornhinweg. Rex Ryan, who is the only person who could've called a timeout from the Jets' sideline, was completely befuddled that the score was wiped out. He didn't even find out until during the post-game press conference that Mornhinweg was the one who requested the stoppage. Ryan isn't faultless though. He made some blunders of his own, as he had to waste timeouts in the second half for having too many men on the field. Those errors go along with Muhammad Wilkerson's ejection for throwing two punches. Meanwhile, Smith got away with a couple of turnovers after intermission. Smith nearly threw an interception, and he also appeared to heave a backward pass that was inexplicably ruled an incompletion. The reversal even had CBS ref Mike Carey perplexed. ",
            "6": "Smith missed Decker, who snagged a team-high four balls for 63 yards and Smith's lone aerial touchdown. When Decker left the game, Smith had to focus on Kerley and his mediocre tight ends. It's no surprise that New York's offense was stymied against a porous defense in the second half. ",
            "7": "Chris Ivory (13-43, TD) and Chris Johnson (12-21) split carries almost evenly, but the former predictably enjoyed the better outing. Johnson stinks and should not be a major part of this offense going forward. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Texans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "<i> Editor's Note: </i> Raider fans might as well stop watching games and start checking out my <a href=/draft2015.php>2015 NFL Mock Draft</a>. Yay, Marcus Mariota. ",
            "2": "The Texans could be a serious contender in the AFC if they had just a barely above average quarterback. However, Ryan Fitzpatrick limits how high Houston can hope to go this season. The Texans' defense dominated this game from start to finish as Oakland had no chance. The few times the Raiders were able to move the ball, the Texans would come up with a turnover to end the drive. Oakland got two garbage-time touchdowns, but the Raiders really never were truly competitive with Houston. The Texans' offense was led by Arian Foster, as he tore up the Oakland's defense even when it was clear what Oakland was going to do. ",
            "3": "The Texans got on the board on their opening drive. Foster had a 40-yard run to the one-yard line. On second-and-goal, J.J. Watt came in as a tight end and released off the line to get wide open in the back of the end zone for a touchdown catch. The next drive, it was all Foster as he rolled down the field and into the end zone. Oakland got a splash play with a 41-yard run by Derek Carr that caught Houston completely by surprise, but Carr ended the drive by throwing a pick to Kareem Jackson that was returned deep into Oakland territory to set up a field goal. The Raiders had a funny blooper-reel play as James Jones caught a pass downfield and was stripped by Kendrick Lewis. Jones then picked up his own fumble and ran it 20 yards inside the 10-yard line before fumbling again after getting hit by Jonathan Joseph. D.J. Swearinger recovered the ball for Houston. After halftime, the Raiders had a good drive going before Mychal Rivera fumbled the ball away after a hit from Swearinger. Joseph picked up the ball and returned it 50 yards. That set up a 12-yard touchdown pass to DeAndre Hopkins (3-22). Oakland finally scored with a short touchdown run from Darren McFadden (12-37 rushing, 2-31 receiving) early in the fourth quarter. Late in the game, Watt blasted Carr and forced a deflection that was caught by Brooks Reed for an interception. In the final minute, Carr threw a touchdown pass to Jones (9-112). ",
            "4": "Fitzpatrick did his job as a game manager, as he was 14-of-19 for 139 yards with two touchdowns and zero interceptions. Foster ran for 138 yards with a touchdown on 28 carries. Andre Johnson caught six passes for 74 yards. ",
            "5": "Carr completed 27-of-42 passes for 263 yards with a touchdown and two interceptions. The Raiders are in for a long season. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Bears",
            "Points": "28"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Did the 49ers watch too much tape of their victory over the Cowboys last week? While looking at things they did right, they must have somehow gotten themselves confused with Dallas because they did their best impression of America's Team, committing countless mistakes that capsized a potential victory. The 49ers were up 17-0 at one point in this game. They were dominating Chicago, as they had more than double the net yardage in the opening half. However, they could have maintained a bigger lead had they not committed so many penalties. Multiple big plays were nullified by their many infractions, including a 54-yard Frank Gore touchdown. In total, San Francisco was guilty of 16 yellow flags for a whopping 118 yards, and those are just the ones that were accepted. They got away with a blatant delay-of-game infraction on their opening-drive score that inexplicably wasn't called. Those weren't the only unforced errors San Francisco committed. The team wasted timeouts in the second half and was called for a ridiculous delay-of-game penalty on the final drive. Colin Kaepernick was most culpable. He couldn't read blitzes at all and took four sacks as a consequence. He failed to identify open receivers downfield. Kaepernick was also wildly inaccurate. He went 21-of-34 for 248 yards, one touchdown, three ugly interceptions and a lost fumble. He had a couple of possible picks dropped as well. It didn't appear as though Kapernick prepared for this Chicago defense at all. He must have seen the Bills succeed against it and just assumed he could #yolo his way to a victory. That's not how things work in the NFL - unless you're playing the Raiders or Jaguars, of course. ",
            "2": "The only 49er player to record more than 41 receiving yards was Michael Crabtree, who hauled in seven balls for 82 yards and a touchdown. Vernon Davis (3-39) had to leave on the penultimate drive because he bent backward awkwardly while being tackled. Kaepernick tossed a pick a couple of plays later, which wasn't a surprise because he has often struggled without his favorite target. ",
            "3": "It was surprising that the 49ers didn't rush the ball very well. Kaepernick got his scrambling yardage (9-66), but Frank Gore (13-63, TD) and Carlos Hyde (4-0) combined for just 3.7 yards per carry. Gore, as mentioned, had a long touchdown brought back by a questionable hold, but San Francisco still should have gotten more on the ground against a pathetic defense - especially considering that the Bears lost multiple players throughout the course of this game. This includes Charles Tillman, Jay Ratliff and Chris Conte. Tillman's injury was brutal because he re-injured the triceps he tore last year, but the silver lining was that it allowed rookie corner Kyle Fuller to play more snaps. Fuller snatched two of the interceptions Kaepernick threw. ",
            "4": "It's shocking that the Bears won this game considering that both Brandon Marshall and Alshon Jeffery were expected to miss this game. In fact, Adam Schefter said there was a 75-percent change that both would be out. Marshall and Jeffery started and drew 14 combined targets. Jeffery didn't do much (3-47), but Marshall reeled in five balls for 48 yards and three touchdowns, including an amazing, one-handed grab. Martellus Bennett (7-37) secured Cutler's fourth touchdown. Cutler went 23-of-34 for 176 yards and the four scores. He had major issues early on - he was 10-of-20 for just 54 yards in the opening half and had three passes that could have easily been picked - but he caught fire after taking a brutal hit to the sternum just prior to halftime. Cris Collinsworth actually thought Cutler would have to sit out the rest of the game. ",
            "5": "The Bears came into this game determined to run it frequently. They couldn't do so whatsoever. Matt Forte managed just 21 yards on 12 carries. He also caught five passes for 15 receiving yards, but dropped a ball. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "I'm not sure if there's a point in writing about a game that probably was fixed. If it wasn't, the officials were biased for some inexplicable reason. The Colts were driving, up seven and in the red zone. Brandon Boykin had one of the most blatant defensive holds you'll ever see on T.Y. Hilton. The infraction wasn't called, and Andrew Luck's interception stood. On the ensuing possession, Indianapolis was whistled for a horse collar that wasn't even close to being such a penalty. This allowed the Eagles to continue their drive and ultimately score the tying touchdown. As if the officials weren't doing enough to screw over the Colts, the coaching staff made some horrible mistakes after that. They ran the ball twice with Trent Richardson, who did nothing on one of his attempts. Andrew Luck then went incomplete on third down, and the Eagles took over and never relinquished possession. Of course, the Colts may have had some time for themselves if they didn't waste a defensive timeout. The Richardson calls were mind-boggling. Richardon had a couple of nice runs Monday night - he rushed for 79 yards on 21 carries - but there's absolutely no reason he should have been given such important touches in crunch time. First of all, Richardson fumbled twice in this game, losing one, and second, Luck needed the ball in his hands. He's the guy who makes all of the comebacks. He's one of the elite quarterbacks in the NFL. Why in the world did offensive coordinator Pep Hamilton keep the ball away from Luck? It made zero sense, and it's fair to wonder if Hamilton's job should be in jeopardy. ",
            "2": "The Eagles were able to win this game because of the officials, but LeSean McCoy and Darren Sproles also played a huge part. The Colts simply couldn't tackle them. McCoy rushed for 79 yards and a touchdown on 20 carries and also caught four balls for 23 receiving yards. Sproles, meanwhile, had numerous long gains. He generated 178 total yards and a score. He set up the tying touchdown and the decisive field goal as time expired. ",
            "3": "Both McCoy and Sproles bailed out Nick Foles, who once again struggled with accuracy. Foles went 21-of-37 for 331 yards, one touchdown and a pick on an underthrown pass, but those numbers are misleading. Foles missed several open receivers, much like he did in the opener against the Jaguars. He was also victimized by some drops, including one by Brent Celek in the end zone. Foles, who had all evening to find his receivers because of a non-existent Indianapolis pass rush, threw his sole score to Maclin, which tied the game at the very end and made the officials extremely ecstatic. Maclin led the team with 11 targets, but caught just four of them for 45 yards. Foles simply couldn't connect with him, though Maclin was at fault with a couple of drops. ",
            "4": "Zach Ertz (4-86) also had a big outing, as Indianapolis once again struggled to cover the opposing tight end. Jordan Matthews dropped more passes. ",
            "5": "As for the Colts, Luck went 20-of-34 for just 172 yards, three touchdowns and an interception. Luck wasn't at his best, as the Eagles peppered him with interior blitzes that rattled him at times. He still played well enough to win, and he probably would've put his team up 14 had the officials not decided to award a victory to Philadelphia. Both of Foles' touchdowns went to Ahmad Bradshaw, who was the superior running back. Bradshaw gained 70 yards on 13 carries and also snatched five catches for 26 yards. Bradshaw's brilliant performance is yet another reason why Hamilton's late-game play-calling was so ridiculously awful. If he wanted to run the ball, why not use the superior back? You have to wonder if Richardson would even be on the roster had the Colts not traded a first-round pick for him. Richardson is a sluggish, mistake-prone plodder who wouldn't start for any other team in the NFL. He is trash, and if the Colts' general manager had any sort of clue, he would deem Richardson a sunk cost and just cut him. ",
            "6": "T.Y. Hilton paced Indianapolis with 11 targets. He hauled in six grabs for 65 yards. Reggie Wayne (3-28) didn't do much once again. ",
            "7": "Both teams lost a key defender. Colts' defensive end Arthur Jones was carted off with an ankle sprain. Eagles' linebacker Mychal Kendricks then limped off with a calf issue. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    }
}