{
    "year": "2015",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "With no playoff implications, the prominent story in this matchup was that this was Charles Woodson's final home game in his Hall of Fame career. Woodson played well, making some key plays, such as tackling Donald Brown before he could get to the first-down marker and having great coverage on Malcom Floyd on a downfield shot. The Raiders tried to make Woodson the hero by giving him the ball and rolling him out during a trip to the red zone in overtime. Nothing was open, so Woodson took a slight loss, but it didn't matter because Oakland ultimately prevailed. Woodson addressed the fans after the game, thanking them for welcoming him back as if he never left. ",
            "2": "The Raiders were able to win because of a great overtime drive. They couldn't get much going on offense throughout the entire night because Amari Cooper was injured. Derek Carr overcame this in the extra session, leading his team to a close field-goal try. Carr finished 23-of-38 for 204 yards, one touchdown and an interception, which was tipped at the line of scrimmage and caught by Kendall Reyes, which set up a San Diego score. Carr also scrambled four times for 30 rushing yards. He couldn't get anything going in the second half. The Chargers had some nice blitzes dialed up, and as mentioned, Cooper wasn't any sort of factor. ",
            "3": "With Cooper banged up, Michael Crabtree led the way with just six catches for 39 yards and a touchdown, a perfect fade pass from Carr. As for Cooper, he murdered his fantasy owners with just two catches for 10 yards. Jim Nantz mentioned that Cooper would be credited with a reception of minus-20 yards because of a Stanford Band-type play at the end of the first half, but the box score apparently didn't penalize him for this. ",
            "4": "Latavius Murray ran well, gaining 79 yards and a touchdown on 19 carries. He was also second on the team in receiving, catching five balls for 38 yards. Murray became the first Oakland back to rush for 1,000 yards in a season for the first time in five years. However, the Raiders made the mistake of not running the ball nearly enough. They were never down by double digits, so there was no reason to have a 2:1 pass-to-rush ratio. ",
            "5": "As for the Chargers, they once again battled hard, but had nothing to show for it. They had a lead for the majority of the contest, but tight end David Johnson lost a fumble near midfield with about four minutes in regulation, which the Raiders recovered and returned inside the 5-yard line. This set up the Crabtree touchdown that helped send the game into overtime. San Diego appeared to be in complete control before that; they were actually running out the clock at that moment. They also made another atrocious mistake when they were flagged for unnecessary roughness on a second-and-29 in overtime. It's both a shame and a blessing for San Diego. The loss was crushing, but could end up being beneficial, as another victory would have ruined draft positioning. ",
            "6": "Philip Rivers was sharp, going 31-of-49 for 277 yards and a touchdown. Those aren't the best numbers, but consider the following three items: First, Rivers' top options at receiver were Dontrelle Inman and a banged-up Malcom Floyd. Second, stud guard Orlando Franklin was lost to a concussion. And third, Rivers appeared to throw a second touchdown, but the officials ruled that Ladarius Green let the ball hit the ground, so they overturned it even though it was very close. Considering all of that, I'd say Rivers performed well. ",
            "7": "Only three Chargers accumulated more than 35 receiving yards: Inman (8-82, TD), Danny Woodhead (8-53) and Floyd (3-42). The tight ends disappointed; Antonio Gates caught two balls for 11 yards, while Green (2-27) converted just twice on six targets. Some guy named Javontee Herndon (3-16) dropped two passes, including a crucial third down. ",
            "8": "Speaking of Woodhead, he led the team in rushing with 55 yards on 11 carries. Donald Brown had more carries, but mustered only 17 yards. Brown, however, scored the game's opening touchdown. As expected, San Diego didn't miss Melvin Gordon at all. ",
            "9": "I need to note that the officiating in this game was horrendous. Carl Cheffers' crew bungled some plays. They began early by correctly flagging the Raiders for a blatant hold. They then picked up the flag 45 seconds after making the announcement. It was absurd, and Nantz and Mike Carey were both completely appalled while Phil Simms asked himself some more questions. Later, there was an obvious pass interference on an Oakland linebacker, who shoved Woodhead as the ball was being thrown to him. No penalty was called, prompting Mike McCoy to complain. The refs eventually threw a flag - but on McCoy for yelling at them! <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "Jay Gruden made a bold move when choosing Kirk Cousins as his starting quarterback entering this season. Robert Griffin was the high-priced signal-caller Daniel Snyder wanted to command his team, but Gruden knew that giving Cousins the nod was the right decision for his team. Cousins was shaky to begin the year, throwing eight interceptions to just six touchdowns in his first six weeks, but he has improved and has been playing on another level recently. In his previous five contests, Cousins has now thrown 11 scores to just one pick. Four of the touchdowns came in this victory, which allowed the Redskins to clinch the NFC East. ",
            "2": "Cousins was on fire against the Eagles, who looked helpless trying to defend his precise passes. He went 31-of-46 for 365 yards and the four touchdowns. He had only a couple of negative plays. Two potential interceptions were dropped, and Cousins took a knee instead of spiking the ball to stop the clock at the end of the first half. Facebook friend Luke T. hilariously posted, You spike that! You spike that! Cousins' first two scores went to Jordan Reed, whom Philadelphia had absolutely no answer for. Reed ran free down the field throughout most of the contest, and when he was covered, he made great catches over defenders. Reed snatched nine balls for 129 yards and a pair of touchdowns. ",
            "3": "After Reed, Pierre Garcon was the team's leading receiver; he caught seven passes for 80 yards and a touchdown. He made some spectacular receptions. On the score, he was able to impressively tap both feet inbounds before falling out of play, and later on, he scooped in the ball on a diving attempt. Meanwhile, DeSean Jackson (4-40) did nothing of note, though Cousins overthrew him in the end zone once. He also left the field temporarily, but didn't miss much action. ",
            "4": "Matt Jones was a shocking late scratch, so Alfred Morris was expected to have a big game. That never materialized, as he mustered only 49 yards on 17 carries. In fact, Pierre Thomas outgained him; he managed 22 yards on just four attempts, but he also caught seven passes for 67 receiving yards. ",
            "5": "As for the Eagles, they gave themselves no chance by murdering themselves with countless errors. They looked great on the opening drive, establishing a quick 7-0 lead, but they imploded after that. Philadelphia was guilty of numerous drops, including a crushing one by Nelson Agholor in the end zone. Zach Ertz dropped a ball on a third down that would've moved the chains. Riley Cooper dropped a potential 40-yard reception, and then Chip Kelly compounded the mistake by throwing the challenge flag. Drops weren't the only issue. Ertz had a big game - 13 catches, 122 yards - but he lost a fumble in the second quarter that set up the Redskins with a field goal. It seemed like Ertz's shin was down - the two CBS announcers and Mike Carey believed this to be true - but senile official Walt Coleman is too incompetent to overturn anything. The fact that Coleman is still officiating despite being mentality incapable of doing so is a complete embarrassment. At any rate, the Eagles had a sequence where they were flagged for illegal substitution on a special-teams trick play. A 5-yard penalty on an illegal formation pushed them back, and a false start moved them to first-and-20. Sam Bradford followed that up by missing a wide-open Ertz for a touchdown. This was one of two instances where Bradford overshot one of his players for a score. ",
            "6": "Bradford's numbers look nice. He went 37-of-56 for 380 yards and a touchdown. That doesn't tell the entire story, however. As a positive for Bradford, he should've had more success, but the Eagles dropped a half-a-dozen passes. On the flip side, Bradford, as mentioned, missed two open players for would-be touchdowns. He made some impressive throws early on, but turned into an Alex Smith-type dink-and-dunker as the evening progressed. He showed absolutely no desperation when the Eagles were down 21 with about six minutes remaining. He and his team simply quit. ",
            "7": "Bradford's sole touchdown went to Jordan Matthews, who snagged six balls for 104 yards and a touchdown. He's the only viable wide receiver, as Agholor (2-35), Josh Huff (1-8) and Cooper (no catches) dropped numerous passes. The Eagles will need another receiver, and I have them obtaining one at some point in my <a href=/draft2016.php>2016 NFL Mock Draft</a>. ",
            "8": "The Eagles struggled to run the ball. DeMarco Murray led the team with 27 yards and a score on five carries, but he killed his team with a lost fumble returned for a touchdown, which was really a dropped backward pass. Ryan Mathews (4-5) started, but at least salvaged his evening with a score. Darren Sproles did nothing on the ground (5-9), but he did catch seven balls for 56 receiving yards, most of which came in garbage time. ",
            "9": "This concludes another lost season for the Eagles at the hands of the Redskins. Kelly, who has been out-coached in most games, spent all of last offseason depleting the talent on his team. It sounds like he'll be back for another year, meaning Kelly will have yet another chance to destroy the Eagles' franchise. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bills",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "My condolences if you bet the Cowboys in this game. This was a 6-6 affair for most of the afternoon. It was 9-6 with a couple of minutes remaining. The Bills were running out the clock, but Mike Gillislee broke free for a 50-yard touchdown. Suddenly, the score was 16-6, allowing Buffalo to cover the 6.5-point spread in horrific fashion. Also, my condolences if you were forced to watch the entirety of this contest. It was absolutely brutal, featuring horrible passes and tons of offensive gaffes. It was like spending three hours in a dentist's chair. The Bills outgained the Cowboys by 100 yards and averaged 1.2 more yards per play. They just were guilty of too many mistakes. For example, Tyrod Taylor completely missed an open Chris Hogan for a touchdown early on. Taylor, for whatever reason, threw it deep on a fourth-and-3. A bit later, Hogan was uncovered deep, yet Taylor somehow didn't see him. Taylor's struggles continued after that when he hurled an underthrown pass in the end zone that was intercepted. Things didn't get much better for Tayor in the second half, as he got banged up and had to be checked out on the sideline. He turned out to be OK, but he just couldn't get anything going on offense, at least when passing. Taylor's aerial numbers were 13-of-18 for 179 yards and the pick, but he did some good work on the ground, scrambling 14 times for 67 rushing yards. ",
            "2": "Taylor wasn't the only Buffalo player making mistakes on offense. Karlos Williams fumbled the ball near the red zone in the second half. He had a solid game otherwise, gaining 76 rushing yards and a touchdown on just 17 carries. He also chipped in with two catches for 21 receiving yards. Gillislee actually led the Bills in rushing, but only because of that 50-yard score at the end. Gillislee gained 93 yards and the touchdown on nine tries. He nearly had a second score, but replay review saw him down at the 1-yard line, and Williams plunged into the end zone on the next play. ",
            "3": "Sammy Watkins was the only Buffalo player with more than 40 receiving yards. He caught five balls for 84 yards. ",
            "4": "The Cowboys, meanwhile, struggled on offense as well, though the final score of this game was an obvious indication of that. Kellen Moore was awful, despite Jerry Jones' enthusiasm concerning him. Moore looked like a high school quarterback, at least in terms of his arm strength. He completed just 13-of-31 passes for 186 yards and an interception that wasn't his fault; the ball could've been caught, but was deflected. ",
            "5": "To be somewhat fair to Moore and his pop-gun arm, he had no one to throw to. Dez Bryant was out, while Terrance Williams (4-62) couldn't get open. Someone named Brice Butler led the team in receiving (4-74). ",
            "6": "Darren McFadden had a solid game, just falling short of the century mark, though it helped that Marcell Dareus hurt his shoulder. McFadden gained 99 yards on 19 carries. He's just three yards shy of 1,000 on the season. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "32"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "I really thought that I was going to write about how disappointed I was in the Lions. They allowed the 49ers to march down the field on the opening drive. Detroit seemed discombobulated; the team didn't even have enough players on the field in the red zone. I thought the Lions were planning on finishing strong to set up for a strong start in 2016, but it didn't appear as though they were focused whatsoever. And then they outscored the 49ers, 32-10, the rest of the way. The 49ers suddenly became the team that looked unfocused. They had a whopping six neutral zone or offside penalties in the opening half alone, one of which set up a field goal just prior to intermission. They also had countless missed tackles after the break, as they appeared to be completely gassed. In fact, the Lions outgained the 49ers in the second half, 198-57. ",
            "2": "Matthew Stafford performed extremely well, misfiring on just eight attempts. He went 29-of-37 for 301 yards and two touchdowns. Granted, he didn't have much of a challenge against a horrific defense, but he didn't have the luxury of throwing to a healthy Calvin Johnson. ",
            "3": "Speaking of Megatron, the No. 1 wideout struggled to get open in the first half, catching just one ball for eight yards. The Lions made some adjustments at intermission, however, and Johnson was able to be more productive in the second half. He finished with six grabs for 77 yards and a touchdown. Johnson also dropped a pass and had a long completion overturned by replay review. ",
            "4": "Stafford's second aerial score went to T.J. Jones. It was a 29-yarder, which was his only reception of the afternoon. Golden Tate (4-59) didn't have a bad game, but failed to post the fantasy numbers that his owners were looking for. ",
            "5": "The Lions once again divided their touches between their running backs almost evenly. Ameer Abdullah led the way with eight carries for 39 yards, while Joique Bell (7-13) scored a touchdown. Theo Riddick didn't do much on the ground (7-20), but he managed to snag seven catches for 63 receiving yards. ",
            "6": "As for the 49ers, Blaine Gabbert started well, but was guilty of a strip-sack, which led to the Bell touchdown, and then he struggled in the second half, going 10-of-15 for just 71 yards following intermission. His overall numbers were solid - 22-of-33, 225 yards, two touchdowns, one lost fumble - but he didn't play well following a couple of decent drives to start the game. ",
            "7": "Only two 49ers logged more than 30 receiving yards: Vance McDonald (5-61), who scored a touchdown, and Bruce Ellington (3-55). Torrey Smith (2-23) also found the end zone, while Anquan Boldin (5-27) disappointed his fantasy owners, struggling to get open versus Quandre Diggs. ",
            "8": "Shaun Draughn was out, so the 49ers went with a committee of DuJuan Harris and Jarryd Hayne. Harris, who was cut by the Seahawks about a month ago, was excellent, gaining 73 yards on just 11 carries. It was almost inexplicable how well he ran. Hayne (9-27), who is back on the team following Jed York's fax machine mishap, was a bit of a disappointment. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "I wrote in my <a href=/draft2016.php>2016 NFL Mock Draft</a> that the Browns could eschew a quarterback if Johnny Manziel continues to play on a high level. Manziel looked good in some starts against the Steelers, 49ers and Seahawks. However, he appeared as though he was taking a major step backward in this loss to the Chiefs, at least in the opening half. Manziel had numerous questionable passes in the early going. He threw an interception when he telegraphed a pass, allowing Marcus Peterson to jump the route. Peterson nearly picked Manziel again prior to intermission. Manziel also had terrible pocket presence at the beginning of the game. He reacted very poorly to the pressure he saw despite not going up against Justin Houston and Tamba Hali. However, Manziel turned things around in the second half. He made lots of nifty runs to pick up first downs. In fact, he scrambled so much that he appeared to be completely gassed. He did a good job of moving the chains, but ultimately came up short because a couple of mistakes. The three that stood out were a throw to right tackle Mitchell Schwartz, who hilariously took a knee because he knew it would be a penalty; a missed throw to Gary Barnidge in the end zone that could've won the game; and a pass inbounds with about 12 seconds remaining, which ended the game because the Browns didn't have any timeouts remaining. Manziel finished with some ugly passing numbers, going 13-of-32 for 136 yards and the pick. However, he led the team in rushing, scrambling 11 times for 108 yards on the ground. Manziel has had some nice moments recently, so that may convince the Browns to keep him around for one more year. However, he still has a lot of work to do to improve his capability in the passing game. It's fair to question whether or not Manziel will put in the effort this offseason. ",
            "2": "As for the Chiefs, they clinched playoff berth with this victory, though it was yet another underwhelming one. Kansas City once again struggled but won against a poor opponent, which can pretty much describe most of Andy Reid's victories in his tenure with the Chiefs. This team will be in for a rude awakening when it finally battles a superior foe. ",
            "3": "Alex Smith was mediocre as a passer. He went 15-of-22 for only 125 yards, two touchdowns and an interception that was tipped. He made a couple of nice throws, but most of his attempts were once again of the dink-and-dunk variety. In fact, Smith didn't throw a completion longer than 20 yards, and only one of his passes sailed longer than 14 yards. Smith was able to pick up some first downs with his legs - he scrambled six times for 54 rushing yards, more than half of which (29 yards) came when Barkevious Mingo failed to wrap him up for a sack - but Smith's conservative approach won't work against some of the better teams in the NFL. This is obvious, of course, but some delusional fans need to be reminded of this because they think their mediocre team is good. ",
            "4": "Smith's touchdowns went to the usual suspects: Jeremy Maclin (5-49) and Travis Kelce (6-43), who posted average numbers otherwise. Maclin's score came against Tashaun Gipson, who is having a down season. It capped off a drive that was aided by a Paul Kruger offside penalty on a third down that ended up costing the defense. ",
            "5": "Charcandrick West and Spencer Ware didn't split the touches evenly, which was a bit of a surprise. West gained 62 yards on 14 carries, while Spencer Ware handled just five attempts, which he turned into 15 yards. ",
            "6": "Going back to the Browns for a bit, Isaiah Crowell was able to run well versus a tough Kansas City ground defense, gaining 88 yards and a touchdown on 16 tries. Duke Johnson saw half as many carries, managing 26 yards on eight totes. ",
            "7": "Thanks to Manziel's passing ineptitude, Barnidge led the team in receiving with just three catches for 47 yards. Only five players in total caught passes. One was Travis Benjamin (2-20) who missed a drive with an injury. One wasn't Dwayne Bowe, who was named a team captain for this game for some reason. I know he used to play for the Chiefs, but who cares? He saw just one target, but couldn't convert it. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "Poor Colts. They beat the Dolphins, but it didn't matter because the Texans were playing the Titans. That means that Indianapolis' only chance of making the playoffs is if the Texans lose to the Jaguars and a bunch of other things happen to give them the tie-breaker in terms of strength of schedule. In other words, good luck, Colts. Oh, and poor Matt Hasselbeck. The 40-year-old signal-caller was knocked out for the fourth-consecutive game with an injury. Hasselbeck, who was having a decent afternoon, took a bit hit from Jordan Phillips and had to leave the field as a result. He had an arm in a sling in the second half, meaning Charlie Whitehurst will probably have to start if Andrew Luck isn't ready for Week 17. Hasselbeck finished the afternoon going 8-of-15 for 99 yards. Whitehurst, who threw all but one of his passes after intermission, went 9-of-14 for only 78 yards. The Colts were in complete control of this game prior to Hasselbeck going out, but they had to hang on for dear life with Whitehurst at the helm. In fact, the Dolphins had a first-and-goal opportunity to win the contest at the very end, but Ryan Tannehill proved to be too incompetent to get the ball into the end zone. ",
            "2": "Frank Gore was the catalyst for Indianapolis' offense for most of the afternoon. He ripped through the Dolphins' defense, gaining 85 yards and two touchdowns on 15 carries. Miami was guilty of countless missed tackles, which is why Gore was so effective. That said, I'm wondering why Gore had just 15 carries compared to 29 passing attempts from Hasselbeck and Whitehurst combined. The offensive play-calling was terrible, and this has to make you think where the Colts would be had they decided to stick with Bruce Arians as their head coach instead of Chuck Pagano. Then again, as one Hall of Fame running back once said, Hindsight is 50-50. ",
            "3": "Thanks to the horrible passing numbers from Hasselbeck and Whitehurst, only one Colt accumulated more than 40 receiving yards. That was T.Y. Hilton, who logged four catches for 64 yards. Donte Moncrief (2-15) disappointed following his solid Week 15 performance, but only because he didn't play on most of the snaps. Coby Fleener (2-15) was even worse despite posting the same stat line, as he dropped a couple of passes. ",
            "4": "A quick note on Adam Vintarieri, who drilled his 500th field goal of his Hall of Fame career. He became the third kicker ever to reach that mark. ",
            "5": "As for the Dolphins, box-score observers will see that Tannehill went 26-of-38 for 329 yards and an interception. Solid numbers, right? Well, yeah, but that doesn't mean that Tannehill played well. He took a safety at the beginning of the game because he held on to the ball for an eternity. He then threw an awful interception and ultimately took a bad sack for the Colts to the ice the victory. Tannehill did well in between the 20s at times, and he actually had a touchdown to Jordan Cameron eliminated by a late offensive pass interference flag, but this was yet another underwhelming showing on his part. Tannehill doesn't appear to be a great option going forward, though Miami will give him one more season. ",
            "6": "It wasn't surprising that Tannehill targeted Jarvis Landry more than anyone else. Landry accumulated seven catches for 111 yards, including an amazing one-handed grab, but couldn't reach the end zone. The same can be said for DeVante Parker (4-93), who posted solid numbers, but dropped a couple of passes. ",
            "7": "Lamar Miller averaged about just two yards per carry, mustering only 31 yards on 15 carries. However, he scored a touchdown and caught five balls for 36 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "This was a terrific victory by the Jets, but all anyone wants to talk about is the controversy involving the overtime coin toss. The Patriots won the flip, as usual, and were expected to receive during the extra session. However, Matthew Slater told the official that he wanted to kick off. Slater was then enraged that the refs asked the Jets which way they wanted to go. Slater misunderstood the overtime rules, but that wasn't the main take-away. It was that the Patriots, who had an opportunity to drive down the field to win this game, gave New York an opportunity to do so - and that's exactly what the Jets did. With the win, the Jets are now in full control of their playoff destiny. If they win next week, they're in. If they lose, and Pittsburgh is victorious over the Browns, the Steelers will capture the final wild-card spot. Meanwhile, the Patriots once again sustained a serious injury, which has been a theme for them this year. Sebastian Vollmer hurt his ankle in the first quarter and had to be carted off the field. Vollmer is New England's top offensive tackle, so he would be a huge loss going forward. In the wake of this injury, it actually appeared as though Bill Belichick was waving the white flag, conceding this win. That would explain why he allowed the Jets to have possession in overtime. He also didn't push the issue at the end of the first half despite having 1:50 on the clock and two timeouts remaining. The Patriots are infamous for scoring prior to intermission, so it was very telling that Belichick didn't even try to do this. ",
            "2": "That said, the Jets definitely deserve credit for this victory. Ryan Fitzpatrick had some shaky moments throughout the contest - an impressive drive ended with some weak fades in the red zone; he completely missed Kenbrell Thompkins, who was wide open downfield; and he was strip-sacked, which the Patriots returned for a touchdown to keep them in the game - but I would say that the positives far outweighed the negatives. Fitzpatrick went 26-of-41 for 296 yards and three touchdowns. He could've accumulated more yardage, but Quincy Enunwa dropped a pass late in regulation that would've put the Jets in position to kick a game-winning field goal. That would've avoided that entire overtime controversy. Then again, there would have been no overtime, so perhaps the statement about Fitzpatrick accumulating more yardage is incorrect. ",
            "3": "Two of Fitzpatrick's touchdowns went to Brandon Marshall, who abused a secondary missing its two starting safeties. He caught eight of his 10 targets for 115 yards. Eric Decker (3-47) had the third score, which ended up being the game-winner, but was guilty of a bad drop. ",
            "4": "The Patriots struggle with outside runs without Dont'a Hightower, which would explain how Bilal Powell was able to register 56 yards on just seven carries. Powell also snatched five receptions for 34 receiving yards. Chris Ivory (11-38) wasn't as effective on the ground. ",
            "5": "New England's offense struggled to move the chains throughout, converting just 1-of-10 tries on third downs. Without Vollmer, Tom Brady's pass protection was even worse than usual. He took two sacks, a number that could've been much higher if he didn't release the ball so quickly throughout the entire afternoon. Brady had zero time to throw on most occasions. Brady finished 22-of-31 for 231 yards, one touchdown and an interception on a miscommunication that Darrelle Revis was able to secure. Brady's score came at the very end on a short pass to James White, who had nothing but open space around him. At first glance, the Jets simply forgot to cover him, but upon further inspection, White put a nasty juke on David Harris. ",
            "6": "White was just one of four Patriots with multiple receptions. The others were Gronkowski (4-86), Keshawn Martin (7-68) and Brandon Bolden (5-30). Brandon LaFell (1-19) proved to be a disappointment, though I don't know how many owners could've started him in a championship. ",
            "7": "Speaking of Bolden, he led the Patriots in rushing with just 30 yards on nine carries. Steven Jackson saw some action, but was underwhelming; he was limited to 15 yards on seven carries, albeit against a ferocious Jets run defense. Joey Iosefa, last week's hero, was given just one carry. He was stuffed on a short-yardage try for no gain. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "6"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Zach Mettenberger has a future after he's done playing in the NFL. He can sell tapes to aspiring football players on how not to play the quarterback position. This performance was truly a masterpiece. ",
            "2": "Houston maintained control of the AFC South with a win over Tennessee. The Texans look likely to win the AFC South because of their tough defense and star wide receiver DeAndre Hopkins. Once again, the team rode that formula to get a victory as Houston's quarterback carousel continued with both Brandon Weeden and B.J. Daniels seeing action against Tennessee. The Texans hope that Brian Hoyer will return to the field in Week 17. ",
            "3": "On the first drive of the game, Texans cornerback Kareem Jackson forced a fumble from Antonio Andrews and safety Quentin Demps returned the loose ball 32 yards for a touchdown. Shortly later, Alfred Blue forced a fumble from Harry Douglas on a punt return and Houston recovered at the Titans 11-yard line. That spotted the Texans a field goal, and the game was virtually over as Zach Mettenberger was incapable of challenging the Texans' defense. After some anemic drives, Houston starter Brandon Weeden hit DeAndre Hopkins for a gain of 44 yards. A few plays later, Weeden ran the ball into end zone from seven yards out on a third-and-goal. That gave the Texans a 17-0 lead at halftime. To open the third quarter, Hopkins went to work on Coty Sensabaugh to move the ball down the field. To end the drive, he went over Sensabaugh for a 15-yard touchdown. Texans safety Eddie Pleasant soon ripped the ball from Antonio Andrews for an interception at Tennessee's 34-yard line. A few plays later, Weeden threw a well-placed pass to Nate Washington for a 16-yard touchdown. A field goal drive expanded the Texans lead to 34. In the fourth quarter, on a third-and-goal, J.J. Watt strip-sacked Zach Mettenberger and Houston recovered. ",
            "4": "Hopkins caught seven passes for 117 yards and a score. What he's done this year with Houston's four different starting quarterbacks is truly remarkable. ",
            "5": "Weeden was 15-of-24 for 200 yards with two touchdowns and a running score. Daniels was used as a read-option quarterback with six carries for six yards and one completion for seven yards on two pass attempts. ",
            "6": "David Cobb had seven carries for 18 yards and Bishop Sankey had two for 11. Sankey also caught three passes for 43 yards. ",
            "7": "Titans tight end Delanie Walker had nine receptions for 59 yards. Harry Douglas led Tennessee's receivers with six catches for 79 yards. Kendall Wright snagged three passes for 18 yards before leaving with a knee injury. Dorial Green-Beckham was held without a catch. ",
            "8": "The Titans maintain the No. 1 overall pick in the 2016 NFL Draft with this loss. Tennessee leads the NFL with 50 sacks allowed, and building around Marcus Mariota will be critical. Thus, Ole Miss left tackle Laremy Tunsil is making all kinds of sense. On a related note, Titans left tackle Taylor Lewan left the game with a concussion. ",
            "9": "The Texans got a good game out of their secondary with nice performances by their trio of first-round cornerbacks Johnathan Joseph, Kevin Johnson and Kareem Jackson. Watt had four tackles with his strip-sack and drew two holding penalties. In the fourth quarter, however, Jadeveon Clowney was carted into the locker room with a foot injury. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "13"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Oh, hey, Falcons. Thanks for showing up for the first time in months. Nice job spoiling everyone's fun by ruining a perfect season all wanted to see go into the playoffs. You guys were great. ",
            "2": "The Carolina Panthers will not have a perfect season. The Atlanta Falcons made sure of that with a strong defensive performance Sunday. That ended Carolina's bid for a perfect season and left the Panthers at 14-1. Carolina remains in great shape for the playoffs with a first-round bye. But the Panthers came up well short of a perfect season, mainly because their offense was unproductive almost all day. The Panthers finished with just 268 yards of total offense. In a strange way, the loss could be a good thing for the Panthers because they no longer have to strive for perfection. However, they could lose home-field advantage with another loss in Week 17. For the Falcons (8-7), the win means they won't finish with a losing record for the third straight year. ",
            "3": "For the Panthers, quarterback Cam Newton had been the favorite to win the Most Valuable Player award. But this outing didn't help Newton's case. Newton was ineffective in the passing game, completing 17-of-30 passes for 142 yards. Newton also rushed seven times for 46 yards with a touchdown. ",
            "4": "Aside from Newton, Carolina's ground game didn't do much. With Jonathan Stewart out with an injury, Cameron Artis-Payne led the Panthers with five carries for 49 yards. Even though Stewart likely will sit out the regular-season finale, Artis-Payne is not a guy you want on your fantasy team if you happen to play in a league with a Week 17 championship. ",
            "5": "Carolina's receiving corps had a dismal day. Ted Ginn Jr., who had been on a hot streak, was limited to one catch for nine yards. ",
            "6": "Greg Olsen, who had been productive all season, had a quiet day. Olsen was held to four catches for 40 yards. ",
            "7": "For Atlanta, Julio Jones was the fantasy star of the game. Jones won his individual battle with Carolina cornerback Josh Norman. Jones had nine catches for 178 yards and a touchdown. ",
            "8": "Matt Ryan had one of his most efficient games of the season. Ryan completed 22-of-30 passes for 306 yards with one touchdown. ",
            "9": "Roddy White, whom Norman referred to as Atlanta's fifth wide receiver, had one of his more productive days of the season. White had five catches for 67 yards. But he still isn't a guy you want to be using in DFS whatsoever. ",
            "10": "Atlanta running back Devonta Freeman quietly had a productive fantasy day. Freeman carried 22 times for 73 yards and scored a touchdown. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Ryan Mallett had more passing yards and touchdowns and fewer interceptions than Ben Roethlisberger. In other words, you should've started Mallett over Roethlisberger in your fantasy championship. Blegh. Fantasy is great, but does suck sometimes. And speaking of which, Antonio Brown owners were robbed of a touchdown because of a horrible call in this game. My condolences if it ended up costing you the title. ",
            "2": "The Pittsburgh Steelers came into this game with a 9-5 record, having won five of their last six, while the Ravens had dropped their last three, giving up 69 points over the last two games. But when these two AFC North rivals meet, there are few easy wins, and this game was no different. The Steelers only needed to beat the Ravens and the Browns to make the playoffs. Instead, Pittsburgh lost to Ryan Mallett, who had been dumped by the Houston Texans and signed by Baltimore just 12 days ago. How did the Ravens do it? First, they dared the Steelers to run on them, which they did and did well, but as poor as the Steelers' pass defense has been this season, Mallett and company were able to move the ball easily and get a lead, while the Steelers were rendered one-dimensional. Mallett moved the Ravens into Pittsburgh territory early and often. He played within his skill set and didn't force the ball or try to hit the long pass very often. Running back Javorius Allen, fullback Kyle Juszczyk and wide receiver Kamar Aiken all topped five receptions, but nobody on the Ravens passed 66 receiving yards. But the Steelers' defense, even with the knowledge that Mallett wasn't going to try to beat them deep, couldn't keep the Ravens from matriculating their way down the field. ",
            "3": "Chris Matthews (not of MSNBC fame) put up the first points of the day, on a 9-yard touchdown grab in the end zone. Mallet laced it over two Pittsburgh defenders, where only Matthews could make a play on the ball. ",
            "4": "After getting up 7-0 in the first, the Ravens held on to the lead after picking off Ben Roethlisberger and having Justin Tucker kick two field goals to put them up 13-3 at halftime. The expectation remained that the Steelers' explosive offense would eventually be able to throw the ball on the Ravens' pass defense, which statistically, has been one of the worst in the league this season, but Roethlisberger never looked comfortable. ",
            "5": "The Steelers did get their first touchdown in the third quarter, as DeAngelo Williams went in from one yard out to make it 13-10 Baltimore, but Roethlisberger was intercepted again early in the fourth quarter, which set up a short field for Mallett, who hit St. Louis castoff Chris Givens for a 39-yard gain and then Kyle Juszczyk for a 34-yard gain, which set Javorius Allen up for a 3-yard touchdown run and a 20-10 lead. ",
            "6": "Allen was the workhorse for the Baltimore offense, rushing 18 times for 79 yards and a touchdown, while also catching five passes for 35 yards. The Steelers hadn't allowed an opposing running back to total 100 or more yards against them since Week 7 and had allowed only three rushing touchdowns to running backs all season. The Ravens imposed their will on even the best part of the Steelers' defense. ",
            "7": "DeAngelo Williams was easily the best offensive player for the Steelers, as he carried the ball 17 times for 100 yards and two touchdowns. He also caught all six of his targets for 53 yards. Both of his touchdowns were set up by pass interference calls, which were Pittsburgh's main mode of offense. ",
            "8": "Roethlisberger was sacked three times and called what should have been unnecessary timeouts, while completing 24-of-34 passes for 215 yards, no touchdowns and two interceptions. It was a poor performance by him and the offense as a whole. ",
            "9": "The Steelers are still in the playoff hunt, but they no longer control if they get in or not. After the Jets upset the Patriots on Sunday, the Steelers now need to beat the Cleveland Browns in Cleveland (which seemed like a given just last week), and they'll need Rex Ryan to exact some revenge on his old team as his Buffalo Bills will host the New York Jets in what could be a win and they're in game. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bears",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Do you think the Buccaneers could've told bettors and fantasy owners of some of their players that they wouldn't try very hard in this game? That would have been great to know. ",
            "2": "It's not hard to figure out why the Tampa Bay Buccaneers lost to the Chicago Bears on Sunday. It came down to simple mathematics. The Bucs (6-9) turned the ball over three times and didn't come up with any takeaways. Couple that with a mediocre day on offense, and you have a formula for failure. Tampa Bay already was out of the playoff race. But the Bucs have plenty of players playing for a roster spot next year. They didn't have a good showing on either side of the ball. The Bears, meanwhile, improved to 6-9 by playing mistake-free football. They didn't put up big numbers, but they were efficient, and that's why they won the game. ",
            "3": "Tampa Bay rookie quarterback Jameis Winston didn't have his best day. He completed 15-of-29 passes for 295 yards with two touchdowns and one interception. The interception was costly because it came in the end zone. ",
            "4": "Chicago's run defense had a strong outing. Tampa Bay running back Doug Martin was held to 49 yards on 17 carries with a touchdown. Martin, however, fumbled twice. The second turnover got him benched. ",
            "5": "Tampa Bay backup running back Charles Sims had four carries for 45 yards and three catches for 72 yards and a touchdown. ",
            "6": "The Bears did a nice job of containing Tampa Bay wide receiver Mike Evans. He was limited to four catches for 61 yards. He was guilty of a brutal deep drop. ",
            "7": "Chicago quarterback Jay Cutler didn't have big numbers, but he had one of his more efficient games of the season. Cutler completed 20-of-27 passes for 156 yards with one touchdown and no interceptions. ",
            "8": "With Alshon Jeffery out with an injury, Chicago's receivers had a quiet day. Tight end Zach Miller led the Bears with seven catches for 69 yards. ",
            "9": "Chicago rookie running back Jeremy Langford led the Bears with 83 yards on 19 carries. Starter Matt Forte had a quiet day, gaining 54 yards on 11 carries. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Saints",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Much was made of Drew Brees' injury heading into this game. It wasn't clear if he'd play during the middle of the week, and yet he just happened to put together one of his best games ever. Sometimes the NFL is impossible to handicap. And I'd say usually instead of sometimes in my case. ",
            "2": "Just before kickoff, the Jaguars were eliminated from the playoffs after the Texans beat Tennessee, so this game lost any impact on the postseason. The Jacksonville defenders played like they weren't motivated while Drew Brees and Tim Hightower dominated the Jaguars from start to finish. If Sean Payton and/or Brees end up leaving New Orleans after the season, this was one last exciting Sunday of lighting up the Superdome scoreboard for Saints fans. ",
            "3": "On the opening drive of the game, Brees got the ball moving by hitting Brandon Coleman for 21 yards and converted a fourth down to Brandin Cooks with a gain of over 20 yards. To end the drive, Brees threw a dart to Michael Hoomanawanui, who caught the pass around Jonathan Cyprien, for the score. Brees started the next possession on his own 2-yard line. After a few completions, Brees and Cooks burned cornerback Nick Marshall for a 71-yard touchdown as Cooks just ran by Marshall on a go route. The Jaguars had some bad luck as Bortles had a pass deflect off Allen Robinson for an interception by Saints defensive end Bobby Richardson. A screen pass of 27 yards to Tim Hightower took the ball to the Jaguars' 1-yard line, and he dove over the top for a touchdown. With New Orleans up 21-0, Bortles was picked off by Delvin Breaux, and that produced a field goal for the Saints. Late in the second quarter, Bortles ripped the ball through the Saints secondary and hooked up with Marqise Lee (3-26) for a short touchdown. A two-point attempt was incomplete, so the Saints took 24-6 lead into the half. To open the third quarter, Allen Robinson made an excellent catch and run with multiple broken tackles for a gain of 38 yards. Bortles ended the drive by threading a needle to Allen Hurns for a short touchdown. Brees came right back to rip the ball through the porous Jacksonville defense and connect with Travaris Cadet for a 44-yard touchdown. That extended the Saints' lead to 31-13. Bortles answered by torching Brandon Browner with Robinson down the sideline for a 90-yard touchdown. Kenny Vaccaro intercepted the two-point conversion to keep the lead at 31-19 for the Saints. The Jaguars' defense was incapable of restraining New Orleans' offense as they moved down the field before Hightower plunged into the end zone from a few yards out. New Orleans extended its lead to 38-19 early in the fourth quarter. Late in the game, Bortles hooked up with Hurns for another touchdown and hit a two-pointer to conclude the scoring. ",
            "4": "Brees completed 25-of-36 for 412 yards with three touchdowns. It was vintage Brees as Jacksonville's defense was completely inept at defending him. Cooks had five catches for 123 yards and a score to lead the Saints receivers. ",
            "5": "Hightower ran over the Jaguars with 122 yards on 27 carries and two touchdowns. ",
            "6": "Bortles was 27-of-35 for 368 yards with four touchdowns and two interceptions. Generally, he played well, but the Jacksonville defense gave the offense zero support. ",
            "7": "The Jaguars' dynamic receiving tandem of Robinson and Hurns continued to pad their stats. Robinson caught six passes for 151 yards and a score. Hurns had eight catches for 106 yards and two scores. ",
            "8": "There wasn't much defense in this game, and each team illustrated the need to upgrade its stop unit significantly to be any better in 2016. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "8"
        },
        "comments": {
            "amount": "7",
            "1": "Would it be too overly obvious to say that the Packers are in big trouble? They've struggled for a while now, but this result tok it to another level. The final score isn't even indicative of how lopsided this contest was. Green Bay was outgained in the first half, 260-71, and averaged 5.4 fewer yards per play than Arizona. It was complete domination on the Cardinals' part. The Packers struggled in all facets, but the most glaring weakness is the offensive line. Aaron Rodgers took eight sacks in slightly more than three quarters of action. The line was also guilty of some holding penalties, including one that negated a third-down completion early on. The blocking group is in terrible shape. Left tackle David Bakhtiari was ruled out, while guard Josh Sitton, who is usually a great player, is hampered by a bad back. Bryan Bulaga, meanwhile, had to leave the game with an injury of his own, but the contest was well decided even before that. With barely any time to throw, Rodgers went 15-of-28 for 151 yards, one touchdown and an interception. The pick was a killer, as it occurred in the end zone when it appeared as though the Packers would get back into it in the second quarter. Rodgers foolishly forced the issue, heaving a ball that had no chance of being caught. Rodgers later had some turnovers in the second half. He fumbled thrice, losing two of them. Both were returned for scores. ",
            "2": "In addition to poor blocking, Rodgers also didn't get any sort of help from his wideouts. James Jones led the team with five catches for 46 yards, with Davante Adams (3-42) being the only other Packer with more than 30 receiving yards. The corps dropped several passes, including a botched 25-yarder by Jared Abbrederis. No one could get open. ",
            "3": "Even the Packer running backs screwed up. James Starks (3-11) lost a fumble at the beginning of the third quarter, setting up the Packers with a short touchdown. Eddie Lacy, meanwhile, gained 60 yards on 12 carries, but that stat line doesn't indicate how mediocre he was; Lacy simply picked up a big chunk of yardage late to make his numbers look respectable. ",
            "4": "Sitton and Bulaga weren't the only Packers who were injured. B.J. Raji left the game early with a concussion after taking a helmet-to-helmet hit. ",
            "5": "Moving on to the victors, the Cardinals now have something to play for in Week 17. If they win and the Panthers lose, they'll suddenly have control of home-field advantage. Winning in Week 17 is not a given, however, as they have a tough foe in Seattle. ",
            "6": "Carson Palmer finished 18-of-27 for 265 yards, two touchdowns and a fluky interception by a Green Bay defensive lineman. That didn't end up hurting the Cardinals though, as Rodgers followed up with a pick of his own. Unfortunately for Palmer's fantasy owners, the birthday boy (now 36) threw just five passes after halftime because the game was so out of hand. This impacted the receivers as well, but all three posted solid numbers. Michael Floyd had the most yardage (6-111), but didn't reach the end zone and dropped an early pass. Palmer's two scores went to Larry Fitzgerald (4-29) and John Brown (3-25). ",
            "7": "David Johnson continued his spectacular play. He didn't lead the team in rushing, but only because he had just one carry following intermission. His nine tries went for 39 yards and a touchdown, but his best moments came when he caught passes out of the backfield. Johnson snatched three balls for 88 receiving yards, including a 44-yarder where he broke numerous tackles. Johnson is the real deal, and his emergence is a major reason why the Cardinals have a great chance of going the distance. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Rams",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The media and the public are going to make a big deal out of this loss for the Seahawks. I've already heard the NBC crew wondering how the Rams have the Seahawks' number, which is preposterous. If Seattle wanted to beat St. Louis, it could definitely do that. This result was the byproduct of the Rams' motivation and the Seahawks' lethargy in what was a meaningless game for them. They couldn't win the division, so they were stuck with either the No. 5 or 6 seed no matter what. Seattle's indifference prompted a sloppy performance. That was apparent early when a bad snap popped way up into the air and right into Christine Michael's arms. Later on the drive, fullback Will Tukuafu lost a fumble that was returned for a touchdown. Later in the opening half, Russell Wilson threw a 48-yard pass that was wiped out because he was barely over the line of scrimmage when he released the ball, and then he hurled a careless, punt-like interception. Despite all of this, the Seahawks still had a chance to win at the end. However, Wilson lost a fumble in the red zone after picking up a first down on a second-and-13. It looked like a great play at first to give Seattle a first-and-10 in the red zone, but replay review caught Wilson losing control of the ball mere nanoseconds prior to his knee hitting the ground. ",
            "2": "Wilson finished 25-of-41 for 289 yards, two touchdowns, an interception and a lost fumble. Wilson's stat line looks fine, but both of his touchdowns came late, so garbage time definitely enhanced his numbers; Wilson was just 10-of-18 for 92 yards and a pick by halftime. Wilson had been on fire entering this contest, but it looked like he reverted to early-season form. It wasn't really much of his fault though, as the offensive line struggled to handle Aaron Donald and the other St. Louis pass-rushers. Wilson was constantly running for his life, and if he weren't so elusive, he would've absorbed way more than four sacks. ",
            "3": "Wilson actually led Seattle in rushing, picking up 39 yards on six scrambles. The Seahawks struggled to run the ball, as neither Bryce Brown (7-9) nor Christine Michael (6-6) found much room versus St. Louis' stout front. Fred Jackson saw just two carries (11 yards), but was on the field most at the end of the game because of his receiving prowess. Jackson caught five passes for 43 receiving yards. ",
            "4": "It was no surprise that Doug Baldwin went off again. One of the league's hottest receivers, Baldwin caught eight passes for 118 yards and a touchdown. Cooper Helfet was next (4-43), as he was on the field because Luke Willson was knocked out with a concussion. Tyler Lockett (3-33) also left the game with an apparent concussion, but was able to return to the field shortly afterward. ",
            "5": "As for the Rams, they got another solid performance from Case Keenum. He served as a game manager for most of the afternoon, but he was aggressive at times, taking a deep shot to Kenny Britt that resulted in a touchdown. Britt torched Richard Sherman, who looked at the scoreboard in disbelief. Keenum finished 14-of-23 for 103 yards and a touchdown. He has proven himself to be a capable backup, and the Rams may even have him enter the 2016 campaign as their starter, given that they don't really have a promising alternative. ",
            "6": "Keenum will have to continue leaning on Todd Gurley, who rumbled for 85 yards and a touchdown on 19 carries. If you missed the play everyone is talking about, Gurley made a great hurdle over a Seattle defender on a 20-yard gain, but fumbled at the very end. Fortunately for him, center Tim Barnes recovered the ball. This was actually the second time Barnes pounced on a loose ball during that drive; the officials couldn't make up their mind on a prior fumble by Benny Cunningham, ultimately rewarding possession to the Rams, to the chagrin of Pete Carroll, who threw a temper tantrum on the sidelines as a result. ",
            "7": "Britt was the only St. Louis player with more than 16 receiving yards. He caught three balls for 49 yards and a touchdown. Tavon Austin logged three receptions for 16 yards, all of which came early on a play that featured an awesome spin move. Austin nearly reeled in a long reception in the second half, but couldn't stay inbounds. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Vikings had everything to play for, as they control their own destiny in terms of claiming the NFC North. The Giants, on the other hand, were eliminated from the playoffs in the wake of Washington's victory over Philadelphia on Saturday night. Both teams' effort reflected those situations in this contest. Minnesota stomped all over New York. There were some struggles early, but the Vikings eventually got things together and ultimately posted 49 on the scoreboard. The defense was dominant, holding the Giants' aerial attack to fewer than 100 yards until the end of the third quarter when the game was out of hand. They intercepted Manning on three occasions and put heavy pressure on him all evening. The offense, meanwhile, moved the chains effectively beginning in the second quarter. Adrian Peterson and Jerick McKinnon both trampled the hapless Giants, combining for 193 rushing yards. Peterson, seizing control of the NFL's rushing lead from Doug Martin, accumulated 104 yards and a touchdown on 22 carries. There was some concern with him entering this game, but he put those to rest with an impressive early run featuring some sick cuts. Peterson's only blemish on the evening was a dropped pass. Meanwhile, McKinnon took over for Peterson when the game got out of hand. McKinnon tallied 89 yards on just seven attempts. He also ran into the end zone twice; the initial one being his first-ever NFL rushing touchdown. ",
            "2": "Teddy Bridgewater managed the game well, going 15-of-25 for 168 yards and a touchdown. He was clutch, moving the chains on numerous third-down situations. He had a breath-taking 9-yard scramble where he moved left and then reversed field, eluding numerous defenders to pick up the first down. ",
            "3": "Bridgewater didn't need to throw very much, which would explain why just two players had more than 20 receiving yards. Those were Jarius Wright (3-57) and Kyle Rudolph (2-53), who scored a touchdown. Stefon Diggs (4-19) disappointed his fantasy owners. ",
            "4": "If there's one dark cloud over this victory for Minnesota, it's that Matt Kalil left the game with a foot injury. Kalil going out was especially remarkable because he missed the first-ever snap of his career. Linval Joseph also got hurt early on, but he didn't miss much time. ",
            "5": "As for the Giants, they didn't put forth any effort. In fact, on one occasion, Cris Collinsworth said, The only player who's trying for the Giants is Rashad Jennings. The veteran back was the team's entire offense until garbage time, gaining 74 yards on 14 carries to go along with a 50-yard reception that set up a field goal. ",
            "6": "Manning had a horrific evening. Missing Odell Beckham Jr., Manning looked lost, and he was guilty of some Jay Cutler-type #yolo throws. He threw three interceptions and was nearly picked on a couple of other occasions. Manning didn't have much time to throw, but when he did, he often stared down his receivers like a leering drunk, allowing the Vikings to jump the routes of his horrible receivers. One interception was returned for six, while another nearly went back all the way, but the defender stepped out at the Giants' 4-yard line. Manning finished 15-of-29 for 234 yards, one garbage-time touchdown and the three picks. Most of those numbers were bogus, however, as Manning was just 8-of-18 for 98 yards and three interceptions before the game got out of hand. Manning also was credited with a fumble when he botched a shotgun snap on a third down. ",
            "7": "The stats show that Rueben Randle caught two balls for 80 yards and a touchdown, but his 72-yard score came when the Vikings took their foot off the gas. Randle, who dropped a pass in the red zone, is a bum who shouldn't be starting in this league. The Giants need a second receiver, so perhaps look for that in the next <a href=/draft2016.php>2016 NFL Mock Draft</a> update. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Bengals appeared as though they were going to win in a rout. They whipped the ball up and down the field early on, scoring two quick touchdowns. A.J. McCarron was unstoppable, while A.J. Green and Marvin Jones were both hauling in circus catches along the sideline. Everything was going flawlessly until Mike Nugent whiffed on 45-yard field goal, which could've extended the lead to 17-0. The Broncos, taking advantage of this error, scored twice on drives sandwiching intermission to get back in the game. Now, they were the ones who couldn't be stopped on offense. Save for some mistakes on Brock Osweiler's part, including a pass in which he completely missed Demaryius Thomas for a deep touchdown, the Denver quarterback had a solid performance against one of the league's better defenses. Osweiler went 27-of-39 for 299 yards and a touchdown. He nearly had a couple of other scores. I mentioned the errant throw to Thomas, and Osweiler nearly connected with Owen Daniels with a touchdown, but the tight end was crushed on a brutal, but legal hit right at the goal line in overtime. ",
            "2": "Osweiler's one true touchdown went to Emmanuel Sanders (4-67), who trailed only Daniels (5-70) in receiving. Sanders, however, was banged up in the second half and had to limp off the field. Thomas (7-59) saw the most targets (12), but proved to be inefficient again. He made a great, one-handed grab in overtime to convert on a third-and-3, but dropped a pass earlier. ",
            "3": "C.J. Anderson and Ronnie Hillman both saw nine carries, with the former outgaining the latter, 73-35. Most of Anderson's yardage came on a 39-yard burst that resembled his game-winning run against the Patriots, as he broke several tackles early and then dashed right for the end zone. However, Anderson lost a fumble in Cincinnati territory with four minutes remaining in regulation. ",
            "4": "The Bengals, meanwhile, were completely stuck in the mud after that aforementioned missed field goal. Save for a possession at the end of regulation that culminated in a field goal, Cincinnati couldn't move the ball whatsoever. The team accumulated 204 net yards prior to intermission, but had just 90 net yards in the second half and intermission. McCarron, as indicated earlier, started hot. He was 12-of-17 for 119 yards and a touchdown in the opening half, with the score being a very impressive throw to A.J. Green over Aqib Talib. McCarron also did a great job of scrambling for first downs, looking like Alex Smith as a runner. He appeared very poised, and I was highly impressed. Unfortunately for the Bengals, Denver figured out McCarron pretty quickly. McCarron was 10-of-18 for only 81 yards and a lost fumble after the break. His passes were off the mark, as he missed Green for a deep touchdown. The fumble ended the game, with McCarron mishandling the shotgun snap. McCarron actually fumbled on the previous play as well, but the NFL officials botched the replay review. Overall, McCarron went 22-of-35 for 200 yards and a touchdown to go along with four scrambles for 21 rushing yards. There's some promise here. The inconsistency is troubling, but Denver has one of the top defenses in the NFL. ",
            "5": "Green happened to be Cincinnati's leading receiver, catching five balls for 57 yards and a touchdown, though all of this production came in the first half. Tyler Kroft (4-46), starting for the injured Tyler Eifert, was next. Kroft made an impressive play to break a tackle and move the team into field goal range at the end of the fourth quarter. ",
            "6": "Jeremy Hill looked good at times, gaining 63 yards on 19 carries. He outgained Giovani Bernard (8-14), who also caught four balls for 29 receiving yards. ",
            "7": "Vontaze Burfict killed his team in overtime. He allowed the Broncos to advance the ball into Cincinnati territory after he was guilty of a late hit out of bounds on Virgil Green. It was a truly stupid play. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    }
}