{
    "year": "2011",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "13"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Now there's the mediocre Kyle Orton we know and love! Where were these interceptions last week when I bet three units against him!?) ",
            "2": "Having been to a few Chiefs-Raiders tilts in my lifetime, I know the rivalry is littered with thrilling finishes. Topping the list of games I have witnessed live would be the 1997 Week 2 Monday Night Football game won when Kansas City quarterback Elvis Grbac hit Andre Rison, who somehow got behind a defense in prevent mode, for a 33-yard touchdown to secure a 28-27 victory. That one didn't have playoff implications; this one did for both teams. Big plays often define big games, and the Raiders set the tone when Bryan McCann returned the opening kickoff 91 yards to the Chiefs' 14-yard line. Kansas City's defense stood up, however, and the run defense set a tone of its own. After Michael Bush picked up four yards on first down, he was stuffed on second down to force a passing situation. Bush (23-70) was contained all day and had a long run of just 11 yards. The Raiders' running game is totally different without Darren McFadden's speed on the outside to loosen up opposing defenses, and even quick rookie Taiwan Jones (out with a hamstring) might have helped. Instead, Palmer threw incomplete, and Sebastian Janikowski came in to put Oakland up 3-0 very early. On Kansas City's first possession, Thomas Jones went right up the middle for 22 yards on the second play from scrimmage. It was by far the longest run of the game by either team though, and after that, Jones (11-51) and Jackie Battle (14-56) combined for just 85 yards on 24 carries for a 3.54 yard average. In other words, both run defenses stepped up in what felt like a playoff game, albeit a wild card, atmosphere. Jones was stopped on the next play, and two incompletions later, the Chiefs were punting. At least Dustin Colquitt trapped the Raiders at their own 3-yard line. Oakland battled its way out of poor field position, but the always-entertaining Carson Palmer threw while being hit, and his pass went right at Derrick Johnson for the easy interception. Earlier in the drive, Johnson had fallen down to allow a 17-yard pickup by Bush on a screen, so it was a bit of redemption for him. Kansas City small-balled its way on the next drive toward the end zone after starting at the Raiders' 36. All eight plays were for gains, but none covered more than seven yards. The march stalled inside the 10, a familiar failure for this offense all season, and Ryan Succop tied the game at 3. After an exchange of punts took the game into the second quarter, Oakland had a very Oakland sequence. Starting the drive with a penalty for illegal formation was a sign of things to come, but was quickly erased by a 20-yard pickup to Denarius Moore (4-94, TD) whose presence in this offense has been sorely missed. The Raiders overcame another illegal formation penalty caused by using an extra offensive lineman when Brandon Carr was flagged for pass interference. After reaching the Chiefs' 36-yard line, Michael Bush was stoned on a 3rd-and-2. In field goal formation, holder/punter Shane Lechler passed to backup tight end Brandon Myers for an easy touchdown and an apparent 10-3 lead. Unfortunately, it came back because the play clock had expired. With an actual try after the delay penalty, Janikowski's 59-yard field goal attempt doinked off the crossbar, and I am pretty sure Hue Jackson wished he had an IV filled with Pepto Bismol. As hard-fought as this game was, mistakes were plentiful. Both teams had a pair of turnovers and were in double digits for penalties, combining for 180 penalty yards. Kansas City worked the great field position off the long missed field goal and were at the Oakland 13-yard line when Kyle Orton (21-of-36, 300 yards, TD, 2 INTs) was intercepted by Matt Giordano on third down, blowing a chance to take the lead. The long return of the pick set up the Raiders, but the Chiefs quickly forced third down, and Palmer (16-of-26, 237 yards, TD, 2 INTs) squandered a potential long field-goal attempt opportunity by tossing an interception to Javier Arenas. Starting at the two-minute warning, Kansas City again moved the ball with double-digit yardage passes to rookie wide receiver Jonathan Baldwin, Dwayne Bowe and tight end Leonard Pope. Let me backtrack for a moment though, because prior to the Pope gain, the Chiefs were at the the Raiders' 23-yard line. I was thinking field goal, but interim head coach Romeo Crennel was thinking touchdown. Orton threw incomplete and was flagged for grounding (loss of 11 yards). Flags for delay of game and false start seemingly put them out of scoring range, but the pass to Pope salvaged a Succop attempt. Richard Seymour blocked it and the game went to half at 3-3. Remember what I said about big plays? Early in the second half, Oakland's defense forced a quick punt and drove the Raiders drove their way towards midfield. A holding penalty backed them up, but Palmer went deep to Moore for a 61-yard touchdown that changed the complexion of the game. Staked to a 10-3 lead, Oakland's defense was in bend but don't break mode the rest of the afternoon, taking advantage of an offense unable to finish drives. Kansas City's next possession was highlighted by a 43-yard pass to Terrance Copper, who apparently is still in the league. Unfortunately, a first-and-goal from the 6-yard line led to another Succop field goal to make it 10-6. After the Chiefs' defense held, the offense again went to plus territory at the Oakland 35-yard line. Stanford Routt stepped in front of a pass intended for Bowe, ending the march. Even though the Raiders did nothing on offense, their stud punter Lechler changed field position, putting Kansas City on its own 10-yard line. This was crucial because on the next drive Crennel rolled the dice trying to convert a 4th-and-1. Battle was stopped. Oakland took advantage of the short field, marching 30 yards to cash in an easy field goal for a 13-6 advantage. Early in the second quarter, Coach Jackson passed on trying to convert a 4th-and-1, electing instead to punt and play field position. Sometimes conservative works and gambling backfires. Still, with 2:57 remaining, I was tweeting that I expected the Chiefs to tie the game with a touchdown, adding to the legacy of tight finishes in this rivalry. Sure enough, Orton went to Bowe twice for 28 yards to set them up just shy of midfield. Then, Dexter McCluster took a screen pass and almost scored. Giordano tackled him at the 3-yard line after a gain of 49. No matter, Bowe caught a touchdown pass on the next play. The final 1:01 was frenetic. Oakland's offense went three-and-out, allowing Kansas City another chance. Orton hit Bowe for 25 and Copper for 11 to set up a dramatic field goal-attempt from 49 yards out. The Raiders' defense looked stunned, and yet another collapse appeared imminent. There would be no icing timeout and Trevor Scott blocked the field goal to set up overtime. Lechler called tails to win the toss, with Seymour calling for the ball before the coin even hit the ground. On the first play from scrimmage, Palmer dropped a bomb to Darrius Heyward-Bey (4-70) who was quiet most of the day. A raucous crowd at Arrowhead Stadium was suddenly silent, much like the Oakland Coliseum when Grbac hit that pass to Rison back in 1997. After two Bush runs to set up the field-goal attempt, Janikowski kept the AFC West title hopes alive for the Raiders with the game-winning final score, 16-13. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "Who really won this game? The Bills screwed themselves out of draft position. The Broncos just made it more difficult for themselves to reach the playoffs. John Elway was seemingly the only one who benefited from this defeat because he now can spend an early selection on a quarterback. Tim Tebow was absolutely terrible. He was just 3-of-4 for 25 yards in the first half, but his one incompletion was a bad underthrow in which he missed his receiver for a touchdown. Tebow had to pass the ball often in the second half because Denver's defense couldn't stop the Bills. That's when all the turnovers occurred, as Tebow was clearly forcing the issue. He carelessly lobbed balls into double coverage and was picked off four times, one of which went back for six by safety Jairus Byrd. Another interception looked like a fumble and was returned for a touchdown. He finished 13-of-30 for 185 yards and two touchdowns (1 pass, 1 rush) otherwise. ",
            "2": "Tebow's the big story, but he didn't get any help from his stop unit, special teams or the offensive line. He was constantly under pressure and almost had to score on every possession because C.J. Spiller gashed Denver's defense, gaining 111 yards and a touchdown on 16 carries. Ryan Fitzpatrick, meanwhile, went 15-of-27 for 196 yards. Those don't seem like quality numbers, but he made big throws and runs (22 yards on three scrambles) when needed. He also had a touchdown wiped out because of a Tashard Choice drop. Fitzpatrick's long completion went to Steve Johnson (4-92). ",
            "3": "One Bill who shouldn't have a job on Monday is kicker Dave Rayner. He nailed 4-of-6 attempts, but whiffed on a 31-yard attempt in the first quarter and then barely hit a 28-yarder after that. Buffalo's special teams weren't a complete lost cause, however, as Leodis McKelvin had an 80-yard punt return for a touchdown. Eddie Royal had the ensuing kickoff go back to the house for Denver, but that was wiped out by an illegal block in the back. I wish NFL players were smarter so we wouldn't have penalties like that anymore. ",
            "4": "As for the Bronco skill-position players, Willis McGahee notched just 64 yards on 15 carries, as his touches were limited because of Buffalo's big lead. Demaryius Thomas, meanwhile, led the team once again with four catches for 76 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Titans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "I bashed Mike Munchak last week for starting an injured Matt Hasselbeck over Jake Locker, so I have to give Munchak credit here. Hasselbeck had a decent game, going 24-of-40 for 350 yards, one touchdown and two interceptions. Granted, Jacksonville's injury-ravaged defense can't stop anyone right now, and perhaps Locker would have done even better, but Hasselbeck was still able to lead Tennessee to its eighth victory. Hasselbeck's sole score went to Jared Cook. I loved Cook going into this week; as I noted on my Start-Sit page, the Tennessee coaching staff announced that it planned to involve its talented, young tight end more on offense after a big performance last week. Cook hauled in eight grabs for 169 yards and a 55-yard touchdown. ",
            "2": "Hasselbeck's other targets: Damian Williams (8-83) and Nate Washington (4-71). ",
            "3": "While the Tennessee passing attack worked well against the Jaguars, the ground game was really ineffective. Chris Johnson continued to struggle, gaining just 56 yards on 15 attempts. He was playing with a sore ankle, so maybe he can use that as an excuse. ",
            "4": "Maurice Jones-Drew is the more professional running back, so he predictably outperformed CJ20. Despite trailing throughout, Jones-Drew was able to carry the ball 24 times for 103 yards and a touchdown. He also had six receptions for 21 more yards. ",
            "5": "As for Blaine Gabbert, well, the Jaguars were down 10-0 before he even attempted a pass, so I was expecting the worst. He shocked me, however, by going 5-of-5 on the ensuing drive, which culminated in Jones-Drew's aforementioned score. Gabbert didn't suck for a change early on because he had no pressure in his face. The Titans have no pass rush, so this was not a surprise. Gabbert was able to keep his eyes open during his attempts with no defenders threatening to bring him down. Unfortunately for Gabbert, the rest of his afternoon was a nightmare. From that point on, he completed just 16-of 37 passes for 130 yards and an interception (total numbers: 21-42, 198 yards, INT). ",
            "6": "If you're wondering, Gabbert's leading receiver was someone named Jarett Dillard, who had five grabs for 61 yards. Dillard made a great sideline grab to set up a Jacksonville backdoor cover in the fourth quarter. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "Some ESPN personalities have been comparing John Skelton to Tim Tebow. Like Tebow, Skelton has had quite a few fourth-quarter heroics over the past month. Unlike Tebow this week, Skelton came very close to achieving another crazy comeback. The Bengals were up 23-0 in this contest. Andy Dalton was on fire, going 15-of-22 for 136 yards and two touchdowns in the first half. Skelton, meanwhile, was a dreadful 5-of-13 for 63 yards. Cincinnati had way more first downs (16-3) and total yards (218-56) than Arizona. Things were looking so bleak for the Cardinals that they even tried using Patrick Peterson on offense. But Skelton caught fire in the fourth quarter. He finished 23-of-44 for 297 yards, two touchdowns and three interceptions. He should have had a third score - which would have tied the game with a minute remaining on the clock - but Early Doucet, who was wide open in the end zone, fell down when he tripped over his own feet. It's unfortunate, but that's how Arizona's season would conclude. ",
            "2": "Doucet hadn't done anything prior to that anyway (2-24), so maybe that's why the Bengals left him uncovered. Larry Fitzgerald (6-105, TD) and Andre Roberts (6-75) were much bigger parts of the offense. ",
            "3": "Both running backs disappointed. Chris Wells (14-53) and Cedric Benson (16-57) struggled, though the latter was worse because he had two key fumbles in the fourth quarter that gave Arizona a chance. One resulted in a touchdown, while the other led to that Doucet opportunity. ",
            "4": "With a huge second-half lead, Dalton didn't have to do much. I listed his halftime numbers earlier; he finished 18-of-31 for 154 yards and the two scores. For those who don't have nifty Windows calculators, that's just 3-of-9 for 18 yards after intermission. He also had an interception nullified by a penalty. ",
            "5": "A.J. Green had really disappointing numbers, catching just two passes for 25 yards. It's unfortunate for his fantasy owners, but he drew a 21-yard pass-interference penalty on Peterson. ",
            "6": "The star of this game for Cincinnati was Jerome Simpson. I'm sure you've seen it by now. Simpson (5-42, TD) leapt into the end zone and did a somersault in the air, somehow landing on his feet. Jermaine Gresham (5-56) had the other touchdown. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "This game seriously took years off my life. I had the Dolphins +9 as my December NFL Pick of the Month. When they jumped out to a 17-0 lead at halftime, I posted on the forum, This is going to be the worst beat ever if the Patriots cover the spread. That's saying something because in my November NFL Pick of the Month, Carolina blew a 24-7 advantage as a seven-point underdog. Thanks to a Vontae Davis dropped interception and a later injury, as well as a Vince Wilfork recovered fumble on a botched snap, the Patriots roared back to go up, 20-17 in the fourth quarter. I predicted on the forum that New England would score a bulls*** frontdoor cover with 3:43 remaining. I was a minute off. When Tom Brady sneaked into the end zone for the second time, I tweeted (), There won't be any backdoor cover for the Dolphins. This game is over. This is my worst beat yet. Unreal. Thank God I was wrong. ",
            "2": "The Dolphins were pitching a shutout in the first half because the Patriots had major offensive line issues. Matt Light was hurt in pre-game warmups, so Bill Belichick opted to start Logan Mankins at left tackle. Mankins then left the contest with a knee injury. As a consequence, Brady had no pass protection and was really uncomfortable in the pocket. He was 3-of-14 for 37 yards before the 2-minute drill. Matt Moore, on the other hand, was 10-of-19 for 179 yards and two touchdowns at that point despite a couple of Brandon Marshall drops. ",
            "3": "But Belichick is a genius, and he was able to make the correct halftime adjustments. Brady was damn near unstoppable after the break, finishing 27-of-46 for 304 yards and three touchdowns (1 pass, 2 rush). Brady's sole aerial score went to Deion Branch (3-37). Wes Welker (12-138) and Rob Gronkowski (7-78) were the big yardage producers. Chad Ochocinco, meanwhile, had one catch for 15 yards. The crowd gave him a standing ovation when he came up with the grab. ",
            "4": "New England's backfield is worth noting because Stevan Ridley finally had the bulk of the workload. He ran tough, gaining 64 yards on 13 attempts. BenJarvus Green-Ellis (3-10) was nowhere to be found. ",
            "5": "Meanwhile, Moore finished 17-of-33 for 294 yards, three touchdowns and an ugly pick which he hung in the air. His scores went to Brandon Marshall (7-156), Davone Bess (3-39) and Charles Clay (1-1). ",
            "6": "Reggie Bush had yet another 100-yard performance; 113 to be exact on 22 attempts. He suffered a minor leg injury in the second half. Daniel Thomas also got hurt (knee). "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "You can't really say the Ravens really outplayed the Browns in this contest, despite what the score said prior to a late, backdoor touchdown by the latter. Baltimore played well - I'm not taking anything away from John Harbaugh's bunch - but Cleveland could have kept it a lot closer if it didn't beat itself with stupid mistakes. The Browns were running the ball really well on the opening drive with Peyton Hillis. They drove into Baltimore territory and had a 3rd-and-1. You'd think they'd try a safe play like a run with Hillis or a roll out with Seneca Wallace. Nope - Wallace dropped back deep into the pocket, saw pressure, continued to backpedal, and then threw off his back foot. The pass was easily intercepted by Lardarius Webb. At the end of the first half, the Browns once again had the ball deep into Baltimore territory. They had no timeouts and just a few seconds remaining, so they had just enough time to attempt a shot into the end zone before kicking a field goal. So, what do they do? They ran the ball! The clock expired. Again, they had no timeouts left. Pat Shurmur is a freaking idiot. Fortunately, as I mentioned, the Browns eventually covered when Wallace (19-33, 147 yards, TD, INT) found Evan Moore in the end zone with 8:30 remaining. A victory was prevented, however, when Phil Taylor inexplicably jumped offside on a 4th-and-2 in which the Ravens were clearly trying to draw a defender across the line of scrimmage. ",
            "2": "There is only one Cleveland skill-position players of note in this contest: Hillis looked good for the first time in a long while, mustering 112 yards on 24 attempts. ",
            "3": "As for the Baltimore ground attack, Ray Rice and Ricky Williams combined for nearly 300 rushing yards in a meeting four weeks ago. The Browns did a much better job versus the run this time, limiting both backs. Rice had 87 yards on 23 attempts, while Williams tallied 45 yards on 10 tries. Rice was kept out of the end zone on the ground, but scored on a 42-yard reception (most of the yardage came through the air). He had three catches in total for 48 receiving yards. ",
            "4": "Joe Flacco had a pedestrian performance, going 11-of-24 for 132 yards, two touchdowns and an interception. He had just three double-digit-yard completions - the one to Rice, one to Torrey Smith (2-38) and the other to Williams (2-21). Ed Dickson (2-14) caught the other score. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Giants",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "I picked the Giants to win this game, but I thought it would be a Jets' blowout early on. The Giants just inexplicably looked uninterested and flat. They had a delay-of-game penalty on a third down during the opening drive. They were also whistled for having 12 men on the field on the Jets' ensuing possession when they made a stop on fourth down. Later in the first quarter, it seemed like Hakeem Nicks quit on a deep route. Eli Manning was just 2-of-7 for 24 yards after the opening period, and it just seemed evident that the Jets would run away with the victory. The Jets, however, would do stupid things on their own to keep the Giants in the game. Manning hit Victor Cruz for a 99-yard touchdown in the second quarter on what should have been a 10-yard gain or so. Two defenders whiffed on tackles. On the others side of the ball, Dustin Keller was clearly focused on some hot female in the stands because he had a ball hit him in the helmet and then dropped another pass. Nick Folk, meanwhile, whiffed on a 44-yard field goal that was way wide right as the first half concluded. ",
            "2": "Offensive coordinator Brian Schottenheimer also deserves a ton of blame. He didn't run the ball at all against a weak ground defense, with Shonn Greene getting just 14 carries for 58 yards. Instead, Mark Sanchez attempted a career-high 59 passes, finishing 30-of-59 for 258 yards, one touchdown and two interceptions. Those numbers don't tell the whole story, however. Sanchez could have easily been picked off five times. He took a safety and had two lost fumbles overturned by replay. I don't know what Schottenheimer was thinking, but he easily solidified his status as one of the worst offensive coordinators in the NFL. He got Sanchez sacked five times, twice by Jason Pierre-Paul. ",
            "3": "While Sanchez was pretty inept, he didn't really get any help from his receivers. I already mentioned Keller's drops. Santonio Holmes had one as well on a 3rd-and-9 that would have converted a first down at the end of the third quarter. Burress was whistled for offensive pass interference on a touchdown. Keller at least finished with quality numbers (8-77). Holmes disappointed his fantasy owners (4-50), as did Burress (3-34). ",
            "4": "Cruz was definitely the top producer on both sides of the ball. In fact, he was the only Giant with more than one reception. He logged three grabs for 164 yards and a touchdown. Hakeem Nicks (1-20) did nothing. ",
            "5": "It's hard to believe that Eli Manning was able to win by 15 points despite only nine completions. He went 9-of-27 for 225 yards, one touchdown and an interception; his yardage obviously inflated by that 99-yard Cruz strike. ",
            "6": "Ahmad Bradshaw (15-54) found the end zone twice. He saw more than two-thirds of the backfield workload compared to Brandon Jacobs (7-42). <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "It may sound crazy to say that Adrian Peterson's knee injury was the best thing to ever happen to the Vikings, but that's what I initially thought when the All-Pro running back went down when his leg bent backward on the first play of the third quarter. I didn't totally see how bad it was at first, so I figured if Peterson were removed from the game with perhaps some sort of sprain, Minnesota would have a better chance to lose, thus keeping them alive in the Andrew Luck and Matt Kalil sweepstakes. Well, apparently not. Peterson had to be helped off the field and couldn't put any pressure on his left leg. He tore both his ACL and MCL, putting the beginning of next season in doubt. Adding insult to injury (two injuries), Minnesota won this contest. On the very next play, Christian Ponder suffered a concussion. This allowed the superior quarterback, Joe Webb, to enter the game and led the team to a victory. Poor Viking fans can kiss Luck and Kalil goodbye. It's unfortunate, but this victory potentially has set Minnesota's franchise back a couple of years. At least Viking fans will always have this win over the Redskins that they can tell their grandchildren about one day. ",
            "2": "Webb scored three touchdowns in the second half. Two came aerially, where Webb was a solid 4-of-5 for 84 yards. The other came on the ground, as he added 34 rushing yards on five scrambles to his stats. Ponder, meanwhile, went 8-of-13 for only 68 yards. ",
            "3": "Webb's touchdowns went to Percy Harvin (5 catches, 65 rec. yards; 4 carries, 39 rush yards) and Kyle Rudolph (2-23). ",
            "4": "Peterson also scored; he had 38 yards on 12 carries in one half of action. Toby Gerhart gained 109 yards on 11 carries in relief, thanks to a 67-yard scamper. ",
            "5": "The game's leading rusher was Evan Royster, who started in relief of an injured Roy Helu. Royster collected 132 yards on 19 attempts. ",
            "6": "There was some Good Rex and Bad Rex from Rex Grossman in this contest. His overall numbers were solid (26-41, 284 yards, 2 TDs, 1 INT), but he had that pick and a lost fumble. ",
            "7": "Grossman's scores went to Jabar Gaffney (6-77) and Donte' Stallworth (5-59). Santana Moss disappointed his fantasy owners (4-46). "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "(Editor's Note: The Panthers are going to be a really scary team next year. Their defense can't possibly get any worse, so as long as Cam Newton doesn't regress, they're definitely going to be in the playoff hunt.) ",
            "2": "The Panthers started the game in dominating fashion. On their first drive, they pounded the ball down the field. DeAngelo Williams finished the drive by running into the end zone from eight yards out. LeGarrette Blount, meanwhile, fumbled the ball away on Tampa Bay's first offensive play, effectively spotting Carolina three more. Blount was benched for the rest of the first half after the turnover. The Buccaneers answered with a long drive and a short touchdown toss from Josh Freeman to Arrelious Benn. Cam Newton quickly responded with a deep pass to Brandon LaFell. He went up over corner E.J. Biggers to make the catch and raced downfield about 60 yards for a score. The touchdown went for a total of 91 yards. At halftime, Carolina had a 20-10 lead. Freeman threw a pick to start the second half, and that set up a 22-yard touchdown run by Williams. After that, Tampa Bay started to move down the field. Freeman made a nice completion on a trick play to Kellen Winslow, but when the veteran tight end tried to hurdle a defender, it all went wrong. He got hit in mid-air and fumbled the ball away to the Panthers. That started another Carolina scoring drive that culminated with a short touchdown pass from Newton to Jonathan Stewart. The Panthers then piled it on with a 49-yard touchdown run from Newton straight up the middle of the Buccaneers' defense. On the play, linebacker Quincy Black got caught overpursuing, while safety Tanard Jackson looked tentative trying to tackle Newton. Tampa Bay then fumbled the ball to Carolina on the kickoff, and Newton tossed a short touchdown pass to Jeremy Shockey. ",
            "3": "Tampa Bay just doesn't have the talent on its roster to match up and compete in the NFL. Every week, the opposition exploits mismatches throughout the Buccaneers' stop unit. Their run defense is awful due to pitiful gap integrity and bad linebackers. Their secondary is targeted and overwhelmed every week. ",
            "4": "In their two games this season, the Panthers illustrated that there is a huge talent discrepancy between them and the Buccaneers. Carolina has outscored Tampa in two meetings, 86-35. ",
            "5": "Freeman was 28-of-38 for 274 yards with one touchdown and one interception. Winslow led Tampa Bay in receiving with six receptions for 63 yards. ",
            "6": "Newton went 12-of-17 for 171 yards and three scores. He also ran for 65 yards and a score on six carries. Stewart (88 yards) and Williams (66 yards) had only seven carries each. LaFell led Carloina in receiving with three receptions for 103 yards and a score. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "4",
            "1": "Did Ben Roethlisberger start this game? If you ignored the skin color and jersey number of the quarterback, you wouldn't have noticed the difference between Ben Roethlisberger and Charlie Batch. Batch, who went 15-of-22 for 208 yards and an interception, did his best Big Ben impression in the first quarter. He dodged two defenders on a play, scrambled away and hit Rashard Mendenhall along the sideline, for what turned out to be a 35-yard gain. Batch also had a similar move right after halftime. He ducked two simultaneous sacks and hit a receiver for a big pass downfield. Batch was able to put this game away when he hit Mike Wallace for what looked like a 47-yard touchdown pass. Wallace would be ruled down at the 1-yard line following a replay, but Rashard Mendenhall was able to run into the end zone on the next snap. ",
            "2": "All of Pittsburgh's scores came on the ground, all by different players. Mendenhall (18-116), Isaac Redman and John Clay all found the end zone. Clay vultured a score after a 52-yard scamper by Mendenhall. ",
            "3": "Mike Wallace led all Steeler receivers with four catches for 82 yards. Antonio Brown (3-34) wasn't as successful. ",
            "4": "As for the St. Louis offense, it never had a chance. Kellen Clemens completed just nine passes (9-24, 91 yards), with Brandon Lloyd (3-29) as his leading receiver. Steven Jackson ran well (24-103), so it's a shame that another good effort of his was wasted. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Lions",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "(Editor's Note: Way to step up, San Diego defense. Good job playing for your playoff lives. Awesome work. Oh, and can we quit it with all the fade passes in the red zone? They don't f***ing work. Goodbye, Norv Turner.) ",
            "2": "With the ability to clinch a wild-card spot, Detroit played inspired football. On the first play from scrimmage, Matthew Stafford lofted a deep pass into wide receiver Calvin Johnson for 46 yards. That led to Stafford throwing a dart to Brandon Pettigrew, who was covered closely by linebacker Nile Diggs, for a 7-yard touchdown. Detroit's defense was playing well, while the Lions' offense was finding massive openings in the Chargers' zone coverage. Stafford converted a 3rd-and-19 with a 30-yard pass to Nate Burleson to the San Diego 3-yard line. A play later, Stafford tossed a short touchdown pass to Kevin Smith. Just before halftime, Stafford connected with Johnson for a 14-yard score. The first half ended with the Detroit up 24-0. It was utter domination on both sides of the ball by the Lions. The Chargers' offense couldn't get into any rhythm. The line was allowing some pressure while the receivers weren't getting open for Philip Rivers. San Diego's pass rush stank, and Stafford had good time to throw all afternoon. The Chargers' secondary was pitiful with receivers running wide open constantly. Apparently, Norv Turner turned over a table or two in the locker room, because the Chargers played with better execution and a sense of urgency in the third quarter. Their offense was finally able to move down the field. A beautiful one-handed catch by Antonio Gates was called back by a penalty, but Rivers kept advancing the ball. He finished the drive with an 11-yard touchdown pass to Malcom Floyd. San Diego then caught the Lions' special teams napping with an onside kick that was recovered by Eric Weddle. Rivers hit Floyd for a gain of 30 to the Detroit 3-yard line after he beat Chris Houston running downfield. Houston bounced back to break up a pass in the end zone on third-and-goal so the Chargers had to settle for a field goal. The Lions answered by moving the ball down the field and Smith running into the end zone from six yards out. Detroit was up 31-10 entering the fourth quarter. San Diego followed up with another promising drive, moving the ball down the field. However, Houston had another good pass breakup in the end zone. The Lions' stand forced a fourth-and-goal from the three that fell incomplete. Houston would kill another drive by intercepting a jump ball at the goal line. He returned it 43 yards and the pick sealed the win for Detroit. ",
            "3": "Stafford finished the afternoon 29-of-36 for 373 yards and three touchdowns. Pettigrew (9-80), Johnson (4-102) and Nate Burleson (6-83) all had good games. For San Diego, Rivers completed 28-of-53 passes for 299 yards with one touchdown and two interceptions. Floyd (6-95) led the Chargers in receiving with Gates (4-40) contributing. He became the franchise's all-time receptions leader in this loss, passing Charlie Joiner. ",
            "4": "It was a huge win for the Lions as they clinched their first playoff appearance since 1999. Congratulations to the long-suffering Lions fans who finally get to see their team play in the postseason after a long drought. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: The Seahawks really need a new quarterback. They can't afford to roll with Tardvaris Jackson again next year. He's a bum. Seriously, way to fumble the ball away near field-goal range near the end of the game, loser.) ",
            "2": "This matchup might be defined by being the What's your deal? Bowl, a reference to the head coaches when they met at midfield following Jim Harbaugh's Stanford team dismantling Pete Carroll's USC team. It is becoming a grudge match. The Seahawks won the division last year, Carroll's first as head coach, and the 49ers have taken it this year, Harbaugh's first. Momentum was on Seattle's side early and its raucous home crowd was in playoff mode on the opening drive. Two plays in, Tarvaris Jackson hit Ricardo Lockette for a pickup of 44 yards. Jackson would find three different receivers on the march, capping it with a score to rookie Doug Baldwin for an early 7-0 lead. Unfortunately, Jackson (15-of-28, 163 yards, TD) would throw for just 89 yards the rest of the afternoon, completing fewer than half his throws. San Francisco answered as it had most of the season, with a steady, methodical drive. Just two plays went for more than four yards, a 7-yard scramble to open the drive by Alex Smith and a 12-yard pass to Michael Crabtree, but the 49ers worked to field goal range. One of their many MVPs this season, kicker David Akers, couldn't make good from 52 yards out though. Ray McDonald set the Seahawks back with a sack to open the next drive, but Marshawn Lynch (21-107, TD) was in Beast Mode. He ran for 23 yards on the next two plays to put Seattle in plus territory and move the chains. Two incompletions by Jackson ended the threat, but Jon Ryan's punt pinned San Francisco at its own 9-yard line. On the drive, Frank Gore and Kendall Hunter took turns picking up first downs rushing to get the ball to midfield. The combination of Gore (23-83 yards, TD) and Hunter (12-73) worked to the tune of rushing for 10 first downs on the afternoon against a stiff run defense. A 13-yard pass to Gore put the 49ers in scoring position and even a sack from Leroy Hill on third down couldn't push them out of it because David Akers hit from 53 yards out to make it 7-3 as the second quarter started. The Seahawks had another steady drive with good gains, but going backward with an offensive pass interference penalty on Ben Obomanu and sack by Navarro Bowman wrecked the drive before the team made it past midfield. Again, Seattle's punter put the opponent in a tough spot, pinning San Francisco at its own 5-yard line. This time, the 49ers' possession resulted in a quick punt, and the Seahawks started in plus territory thanks to C.J. Spillman popping Leon Washington, who had called for a fair catch. Seattle wasn't able to take full advantage of the field position due to the unreal run defense of San Francisco. Set up with second-and-goal from the three, Lynch went up the middle for two yards. The Seahawks had a bit of a busted play on third down and as Jackson rolled to his left, it looked like they would luck into a touchdown. Cornerback Carlos Rogers had other ideas, knocking Jackson into 2012 and forcing a field goal attempt to put Seattle up 10-3. San Francisco tried to answer in the 2-minute drill thanks to a 24-yard run from Hunter putting them close to midfield, but two incompletions and a pass short of the sticks forced fourth down. Harbaugh rolled the dice, but Smith threw another incompletion to turn the ball over on downs. Jackson wasn't able to make him pay in the final 21 seconds of the half though, throwing incomplete three times sandwiched around a 12-yard pickup to backup running back Justin Forsett. Speaking of Forsett, did anyone else notice how many players on Seattle's offense have a Bay Area connection? Lynch and Forsett both were running backs for UC-Berkeley where backup tight end Cameron Moorah and reserve lineman Mike Gibson also went. Fullback Michael Robinson played for the 49ers, while starting left tackle Pat McQuistan, left guard Robert Gallery and tight end Zach Miller were drafted by the Raiders. Undrafted rookie wide receiver Doug Baldwin went to Stanford. Kind of ridiculous isn't it? In the third quarter, it looked like San Francisco was going to ice this game. The first possession went 74 yards on 8 plays, highlighted by a 27-yard pass to Michael Crabtree (5-85) on the first play of the half and a 17-yard pickup to Vernon Davis (4-54). Gore cashed in the touchdown from four yards out to tie the game at 10. The defense forced a quick punt and Kyle Williams had a big punt return for 36 yards to change field position and set the 49ers up in Seahawks' territory. Gore and Hunter runs did most of the work on the drive while Smith missed on his only pass attempt and scrambled for an 11-yard gain. An illegal block by Braylon Edwards on third-and-goal took away any shot at a touchdown. Harbaugh protected Smith by running the ball and called another field goal for the 13-10 lead. Akers has been like his ATM this season and would set a single-season NFL record with 42 field goals in this game. The next two drives were like watching instant replay. San Francisco's defense held, and when the 49ers got the ball back, they pounded the running game to set up a field goal when Smith threw incomplete on third down. Akers connected from 44 yards out to make it 16-10 just a couple minutes into the fourth quarter. As the saying goes, the Seahawks were hanging around down by just one score. First, San Francisco cornerback Tarrell Brown was flagged for a very questionable pass interference penalty to put the ball near midfield. Two plays later, rookie phenomenon Aldon Smith registered a sack to force a 3rd-and-15. Jackson almost bailed Seattle out, hitting Obomanu a yard short of the marker. Carroll resisted the urge to go for it against a stout defense and wisely chose to play field position. It looked like a bad decision when the punt went out of the end zone and Smith hit Davis for 17 yards on the first play of the drive. Just like that, all the Seahawks had gained from the kick was eight yards of field position. However, the defense stood tall from there, forcing a punt that was blocked by Heath Farwell. Seattle took over at the 49ers' 4-yard line and Lynch delivered the first rushing touchdown of the season against San Francisco to put the Seahawks up 17-16. Suddenly trailing, the 49ers caught a break when Robinson was flagged for unnecessary roughness after hitting defenseless kickoff returner Kyle Williams. Set up at their own 39-yard line, everything was looking good for San Francisco, and then Edwards was flagged for pass interference to start the drive. However, two plays later, Smith (14-of-26, 179 yards) connected on a deep ball good for 41 yards to Michael Crabtree. It was a huge play for Smith, who did what he has all season - protect the football and not screw it up. A ready and able Seattle defense held tough on three consecutive rushing plays, including a straight run on 3rd-and-6 that didn't exactly ooze confidence in Smith's arm. Yet another field goal from Akers put the 49ers ahead, 19-17. It looked like the Seahawks would respond. Lynch alternated rushing and receiving on the next four plays for a total of 33 yards, putting them just past midfield with 1:07 to play. Then Tarvaris Jackson did what bad quarterbacks do in tough spots. On 3rd-and-3, he was trying to scramble for a first down and had the ball knocked out from behind by linebacker Larry Grant, who would spend an inordinate amount of time doing Skittles-related celebrating over the next half hour or so. Donte Whitner recovered and it looked like the game was over. However, San Francisco's offense stalled with Alan Branch sacking Smith on third down. Unable to stop the clock with just 41 seconds to play, Jackson threw complete to Forsett, who failed to get out of bounds. Jackson then misfired on three consecutive throws, the last of which looked like he was throwing it away - on fourth down. The 49ers kneeled down on the final play to secure the 19-17 win to remain in position to secure a bye week by winning at St. Louis next week. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "There's no point delving into this game. It was useless. When the Giants prevailed over the Jets, the Eagles were eliminated and had no real reason to play hard. I thought the Cowboys would win easily, but Tony Romo suffered an injury on his first possession when he banged his hand on a defender's helmet. If you didn't see a shot of Romo's hand, it was completely swollen and had to be wrapped up. It'll be a surprise if Romo doesn't go next week, however. The x-rays were negative, and he didn't break any bones. That's really good news because Stephen McGee is not equipped to win an NFL game. He was terrible. McGee finished 24-of-38 for 182 yards and a late touchdown. The completion percentage is nice, but McGee's misfires weren't even close. He sailed a number of passes out of bounds and didn't give his receivers a chance. He missed Martellus Bennett in the end zone by throwing completely behind him. ",
            "2": "It's a shame for fantasy owners, but because of Romo's injuries, Dez Bryant (6-62), Jason Witten (4-24) and Laurent Robinson (1-5) all had dismal statistical outings. Miles Austin-Jones (4-40, TD) at least found the end zone. ",
            "3": "Because the Giants won, the Cowboys were able to rest Felix Jones. Sammy Morris (13-29) couldn't find any running room, as Philadelphia did not respect McGee's throwing ability after going up against him in a Week 17 tilt last year. ",
            "4": "QB Dog Killer had a great game against a porous Dallas secondary. He went 18-of-32 for 293 yards and two touchdowns. He was robbed of a third score when Jason Avant's touchdown was overturned and ruled a fumble in the end zone, which resulted in a touchback. ",
            "5": "QBDK's scores went to Jeremy Maclin (5-72) and Brent Celek (2-52). DeSean Jackson also played well (5-90). ",
            "6": "Romo wasn't the only star who suffered an injury in this contest. LeSean McCoy went out with an ankle malady. He had 35 yards on 13 attempts. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Packers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "The Packers looked like they were going to blow the game open early when they scored on their first drive. In just nine plays, Green Bay went up 7-0 when Aaron Rodgers hit Jermichael Finley for a 2-yard touchdown. With Josh McCown on the other side, the Bears didn't seem to stand a chance. But that's why divisional rivalries are so fun. Chicago's offense moved the ball effectively with tough runs by Kahlil Bell, and short, accurate throws from McCown. The defense, meanwhile, buckled down and forced Green Bay into three consecutive three-and-outs. Unfortunately, it wasn't enough. The Bears killed themselves with stupid mistakes (penalties, missed field goal, two interceptions), while Rodgers caught fire, continuously torching beleaguered cornerback Zackary Bowman. Rodgers was ultimately pulled when the score was 35-10. ",
            "2": "Rodgers went 21-of-29 for 283 yards and five touchdowns. He was sacked only once, which is key because of what happened in Kansas City last week. The Packers as a whole played a perfect game, committing no turnovers and zero penalties. ",
            "3": "Rodgers' threw a pair of scores to Jordy Nelson (6-115) and James Jones (4-50). The fifth, as mentioned, went to Finley (3-20). ",
            "4": "The Packers didn't really try to run the ball at all. But when they did, Ryan Grant (8-44) had more touches than James Starks (6-13). Starks screwed up on two assignments, resulting in busted plays where Rodgers had to scramble for short gains. ",
            "5": "As mentioned, the Bears moved the chains pretty effectively, mostly on the ground. Both Kahlil Bell (23-121) and Armando Allen (11-40) found huge holes, as Chicago's offensive line dominated Green Bay's front. The Packers really miss five-tech Ryan Pickett, and they'll be much better versus the run when he returns from his concussion. That being said, Bell really impressed me. He had a good number of yards after contact, displayed great vision and patience, and picked up his blocking assignments well. He made two mistakes though, one of which was a fumble at the goal line that was luckily picked up by guard Edwin Williams for a touchdown. I feel for fantasy owners who were counting on that Bell score. ",
            "6": "Bell's other mistake was in pass protection. He failed to chip Clay Matthews, which resulted in McCown tossing the ball right into the Pro Bowl linebacker's gut. McCown would be guilty of a worse interception later on an overthrow, but was otherwise pretty solid. He was accurate and even showed off surprising scrambling ability. He gained 38 yards on the ground on eight scrambles to complement his quality passing numbers (19-28, 242 yards, TD, 2 INTs). All in all, McCown looked like the second coming of John Elway compared to the brutal Caleb Hanie. It makes you wonder why Lovie Smith didn't turn to him earlier. ",
            "7": "McCown's leading receiver was Roy Williams, who had eight grabs for 81 yards. Williams, however, didn't seem like he put forth much effort most of the time; on one occasion, a McCown pass skipped to Williams because he was too lethargic to come back to the ball. Why is he still in the league? ",
            "8": "McCown had a chance for a backdoor cover at the end of the game, but the Bears opted to kick a field goal on a 4th-and-6 inside the red zone with a minute remaining, putting them one stinking point short of the spread. It seemed apparent that Mike McCarthy had money on Packers -13 because he challenged a Dane Sanzenbacher (4-51) catch despite being up 17 points with two minutes remaining. The Sanzenbacker reception would have given the Bears a first down near the Green Bay 10-yard line and a great chance to cover the spread. The call was overturned, however, and Green Bay would go on to beat the number. So, congrats to Coach McCarthy, who earned some extra Christmas bonus cash. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "14"
}