{
    "year": "2011",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "15"
        },
        "comments": {
            "amount": "5",
            "1": "Josh Freeman broke free for a 25-yard scamper on a third-and-long during the opening drive. He tried to do the same thing on the next play, but lost a fumble. The Cowboys quickly scored off the turnover, finding the end zone on four of five of their possessions in the first half. Game, set, match. This result isn't indicative of how lopsided this contest was. The Cowboys led 28-0 at halftime. At the time, they had 19 first downs compared to just one by Tampa (the Freeman run). The Buccaneers' second first down didn't come until there was 4:50 remaining in the third quarter. At that point, Freeman was a miserable 2-of-4 for 14 yards; the low number of attempts because he kept taking sacks behind his anemic offensive line. Tony Romo, meanwhile, was prolific. He torched a lethargic Tampa secondary, going 23-of-30 for 249 yards and four touchdowns (3 passing, 1 rushing). His one error came on a strip-six in the third quarter that gave the Buccaneers life. But as Charlie Campbell pointed out on the forum, Before Dekoda Watson's touchdown, the Bucs had given up 69 straight points going back to the second quarter against the Jaguars last week. In other words, Tampa had life, but it was still in the ICU. ",
            "2": "Raheem Morris needs to be fired. The Buccaneers flat-out quit on him. Some of the NFL Network analysts believed that was because of the news that broke this week about Morris perhaps being fired, but the team has been mailing it in since losing to the Packers. The players are just taking after their leader. Morris doesn't work nearly as hard as other head coaches. Thus, it's no surprise that the team often quits and gets whistled for stupid penalties. ",
            "3": "It doesn't help Tampa that it has no explosion on offense. I mean, Kregg Lumpkin paced the team with five catches for 50 yards. Mike Williams, meanwhile, didn't log a single reception. Terence Newman was draped all over him in a nice rebound performance. ",
            "4": "Since the Buccaneers were down the entire time, LeGarrette Blount carried the ball just nine times for 21 yards. Dallas, conversely, ran it extremely well. Felix Jones tallied 108 yards on 22 attempts, while Sammy Morris (12-53) served as a solid change of pace. ",
            "5": "As mentioned, Romo shredded a Buc team that put forth little effort. His offensive line dominated and gave him plenty of time throughout. On one of his touchdowns, he seriously had 15 seconds in the pocket. Romo's scores went to usual suspects Miles Austin-Jones (5-53), Dez Bryant (4-40) and Laurent Robinson (3-29). Jason Witten didn't find the end zone, but he led his squad with 77 receiving yards off four receptions. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "Uh oh. Here we go again. Giant fans better be prepared for another classic meltdown, because it seems like that's where this is going. This was really unbelievable. If you were to tell me that Rex Grossman would have two interceptions on the first three drives of the game, I wouldn't have bet three units on the Redskins. But as bad as Grossman was early on, Eli Manning and the offense were far worse. Manning started this contest 0-for-6, but he wasn't entirely to blame. Hakeem Nicks dropped a 50-yard touchdown when he lost the ball in the sun. The Giants dropped a total of four balls in the first half, including one that was picked off on a strange deflection. The dumb errors continued after the break. Manning (23-of-40, 257 yards, 3 INTs) tossed a horrible pick into double coverage in the third quarter. He later had a touchdown to Hakeem Nicks wiped out by a David Diehl hold. On the next play, Manning was sacked on a fourth down. ",
            "2": "New York's ineptness was limited to the offense. Outside of the two Grossman interceptions, the defense played disgracefully. Grossman (15-of-24, 185 yards, TD, 2 INTs) basically did whatever he wanted, converting a high number of third- and fourth-down tries (9-of-17), and torching Prince Amukamara relentlessly. The secondary had no answer for Jabar Gaffney, who caught six balls for 85 yards. Santana Moss (2-40) hauled in Grossman's lone score. ",
            "3": "The Redskins didn't run the ball too well overall, which is why they had trouble maintaining possession in the second half. However, when they had to get the yardage on short situations, it seemed like Roy Helu (23-53) and Evan Royster (10-36) were able to get whatever they needed most of the time. Helu was in and out of the game with some sort of leg injury. ",
            "4": "Part of the reason the Giants struggled so much on defense was because they couldn't pressure Grossman. The Redskins surrendered only one sack to Jason Pierre-Paul, who had 16 tackles. He needs to be added to the Pro Bowl since he's not on the ballot. ",
            "5": "As for New York's skill players, Ahmad Bradshaw (10-58, TD) and Brandon Jacobs (8-53) split carries pretty evenly. The same applies to the reception totals by the receivers: Hakeem Nicks (5-73), Victor Cruz (5-44) and Mario Manningham (3-57) had decent yardage, but couldn't find the end zone. As mentioned, Nicks had an opportunity for two scores, but it just wasn't meant to be. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "14"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Greg Jennings' absence had a huge impact on this game. The Packers had four drops and two offensive pass interference penalties - both by Jordy Nelson - in the first half. Jennings will be back, but the concerning thing is the defense. It was pathetic against Kyle Orton, Jackie Battle and the other crap players Kansas City has on its offense. If the Packers can't stop them, they have no chance against the elite offenses. Aaron Rodgers will have to be perfect, which will be a huge challenge given how bad the offensive line is.) ",
            "2": "The Chiefs pulled off one of the biggest upsets of the year, ending the Packers bid for a perfect season. Green Bay had a generally crappy game on both sides of the ball. Every team has an off day, and the Packers definitely were not themselves against Kansas City. The Chiefs had a nice drive to start the game, but it ended with a 19-yard field goal. Kansas City then stopped the Green Bay offense, but a stupid roughing-the-punter penalty gave the Packers the ball at their own 48-yard line. Fortunately for the Chiefs, Mason Crosby missed both a 59-yard field goal, as well as a re-kick from 54 yards out after a 12-men-on-the-field penalty on Kansas City. This left the Chiefs with good field position which they converted into another Ryan Succop field goal. Aaron Rodgers was off on some passes, but he also was throwing some darts that his receivers were dropping. Tamba Hali was whipping Green Bay offensive tackle Marshall Newhouse, among others, from start to finish. Meanwhile, Kyle Orton was spreading the ball around and moving down the field with some precision passes and some runs. The Packers defense finally came up with a stop on a fourth-and-goal that was busted by B.J. Raji. Green Bay's offense was off throughout the first half and had only five first downs, for zero points. In the third quarter, it got worse for the Packers when right tackle Bryan Bulaga went out with a knee injury and went into the locker room. Rookie Derek Sherrod replaced him for a time before he had to be carted off the field with a lower leg injury in the fourth quarter. Rodgers finally got in scoring position after lofting in a 41-yard pass to tight end Jermichael Finley. The athletic tight end beat his initial defender while Chiefs safety Sabby Piscitelli was late coming over the top (before being cut, Tampa Bay fans referred to him as Saba-stinko Suck-atelli). Piscitelli gets significant playing time, and needless to say, Kansas City is greatly missing injured safety Eric Berry. That pass set up a short touchdown toss from Rodgers to Donald Driver. The Chiefs answered with a field goal to take a 9-7 lead. Orton tossed a 39-yard pass to tight end Leonard Pope and a 17-yard pass to Jonathan Baldwin to set up the score. The Packers' offense continued to struggle even as Piscitelli dropped an interception. In the interim, Orton tossed a perfectly thrown corner route to Pope for a 33-yard gain to Green Bay's 2-yard line. The Packer defense came up with another stand to force yet a fourth field goal. Orton kept coming as the Green Bay pass rush was horrendous which gave the signal caller all day to throw the ball (and furthermore, not even be sacked). A big pass to tight end Anthony Becht set the Chiefs up at the 5-yard line, and Jackie Battle charged into the end zone. The Packers answered with a late fourth-quarter drive and a short touchdown run from Rodgers. Green Bay's onside-kick attempt failed, and Kansas City was able to run out the clock. Interim Chiefs head coach Romeo Crennel wants to be the permanent head coach, and he led a great performance for his resume. His defense played a superbly against the Packers' potent offense. Hali had three sacks and a forced fumble in a dominant performance. Rodgers was held to 17-of-35 for 235 yards and one touchdown. Finley (5-83) led the Packers in receiving while Ryan Grant ran for 66 yards on 12 carries. Green Bay has to be worried about their defense heading into the post-season. Kansas City left a ton of points on the field. If the Packers allow the likes of Orton and Pope torch them downfield, what will Drew Brees and Jimmy Graham do? Orton was 23-of-31 for 299 yards. Pope (2-72) led the Chiefs in receiving as 10 different players logged receptions. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Saints",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Vikings appeared to play the Saints tough in the first half. They led 3-0, and were down 7-6 and 14-13 at times. But Minnesota had nothing to do with that; it was just New Orleans getting in its own way. The Saints had a turnover at the beginning of each of the first two quarters. The first was a Jimmy Graham fumble, and the second was a premature snap that was made when Drew Brees was calling out an audible. ",
            "2": "New Orleans was unstoppable otherwise. By the time the score was 42-13, the Saints compiled a ridiculous 513 yards of total offense, compared to 98 by the Vikings. The first-down count was 32-5 in favor of the visitor. Brees was sick. He went 32-of-40 for 412 yards and five touchdowns. At one point in the first half, he completed 15 consecutive passes. He also had a sixth touchdown (a 40-yarder to Robert Meachem) nullified by a Jed Collins hold. Brees is now at 4,780 yards this season. He's just 304 yards short of Dan Marino's single-season record. He could easily pass Marino next Monday night. ",
            "3": "Two of Brees' scores went to Lance Moore (5-91). The others were to Darren Sproles (5-79), Graham (7-70) and John Gilmore. Marques Colston didn't find the end zone, but he led the Saints with eight catches for 91 yards. ",
            "4": "Pierre Thomas didn't see the bulk of the carries with Mark Ingram out. Thomas had just eight attempts (44 yards) compared to Chris Ivory's 18 for 74. Thomas scored, however. ",
            "5": "As for the Vikings, the return of Adrian Peterson (10-60) didn't really help. Peterson was actually bottled up except for a 39-yard scamper. To the chagrin of his fantasy owners, Toby Gerhart scored twice on receptions. ",
            "6": "Christian Ponder has really gotten worse each week following a solid start. His stat line doesn't look too bad (14-of-31, 120 yards, 2 TDs, 1 INT; 3 carries, 34 rush yards), but he was really inaccurate all afternoon. The bulk of his numbers came in garbage time. ",
            "7": "I'd like to know where Percy Harvin was in this contest. The Collard Kector caught three passes for just eight yards after several weeks of amazing production. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "3",
            "1": "This was the only matchup in the early afternoon slate in which both teams had a shot at the playoffs. But because it featured a quarterback battle between Tardvaris Jackson and Cannon Ball Caleb Hanie, the game still sucked. Compared to Hanie, Jackson looked like the second coming of Johnny Unitas. Jackson, who went 19-of-31 for 227 yards and a touchdown, did a good job of converting third downs despite not having Sidney Rice. He caught fire in the second half, finishing 15-of-19 for 176 yards after the break. Jackson's top receiver was Golden Tate (4-61). Doug Baldwin, who had a huge outing Monday night, caught just one ball for 13 yards. As for Hanie, well, it's safe to say that no one in the NFL lost more money than him in the past four weeks. Hanie was brutal yet again, going 10-of-23 for 111 yards, one touchdown and three interceptions. All of his picks were horrible (two were taken back for scores), and most of his yardage came via dump-off passes to his running backs. Kahlil Bell led the team with five receptions for 43 yards and a touchdown. Hanie loved throwing to Johnny Knox prior to this contest, but he lost his favorite wideout in the first quarter. That was the most notable thing about this contest. Knox fumbled the ball, and as he was trying to recover it, he was hit and bent over backward. He was down for at least five minutes and was then carted off to the hospital. The good news is that Knox was able to move his arms on the stretcher. Let's hope that he'll be OK. ",
            "2": "The Bears apparently weren't interested in giving Marion Barber much work after he screwed up twice late against the Broncos last week. Barber (11-33) saw just two carries after halftime. He gave way to Bell, who mustered a solid 65 yards on 15 attempts to go along with his receiving totals. ",
            "3": "Marshawn Lynch didn't run well either, managing 42 yards on 20 rushes against Chicago's elite ground defense. However, Lynch found the end zone twice; one score was courtesy of a Chicago leaping penalty on a Seattle field goal attempt. That was really a gift because the Seahawks had a really stupid red-zone sequence before that in which they did dumb things like pitch the ball to Leon Washington. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "23"
        },
        "comments": {
            "amount": "4",
            "1": "(Editor's Note: How much do the Bills suck? They couldn't even beat the Dolphins without their best offensive player, Jake Long. By the way, I wonder if Ralph Wilson is meeting with his legal team to find out if he can sue Ryan Fitzpatrick for stealing millions of dollars from him.) ",
            "2": "Buffalo's collapse reached embarrassing proportions as Miami running back Reggie Bush ripped them for over 200 yards on the ground. The day started on a bad note for Bush when he fumbled the ball away. The Bills got on the board first with a 24-yard touchdown run by C.J. Spiller. The Dolphins answered with a 22-yard touchdown pass from Matt Moore to Anthony Fasano. Miami cornerback Vontae Davis then set up a field goal via an interception to give his offense the ball at the 24-yard line. It should have gone for more but Brandon Marshall dropped his second touchdown of the game. He is one of the league leaders in drops, and his two early in the game looked like they would be costly. His concentration and focus are terrible. If Marshall could get his head straight, he would be a much better receiver. Moore blew a scoring chance in the third quarter when he fumbled the ball away deep in Buffalo territory. A bit later, Marshall made up for his drops with a 65-yard touchdown on a go route. The pass was thrown in perfectly by Moore to Marshall, who made a nice over-the-shoulder catch while burning cornerback Drayton Florence. The reception put Marshall over 1,000 yards on the season for the fifth straight year. The afternoon got very sloppy in the third quarter. Dolphin safety Reshad Jones caught a deflected pass for an interception. On the Bills' next drive, Ryan Fitzpatrick threw his third interception to Davis (for his second) when he out-fought Stevie Johnson on a ball lofted downfield. The Bills made it 23-13 after a short touchdown pass to Spiller. Fitzpatrick threw an interception on the two-point attempt. Late in the third quarter, and then early in the fourth quarter, Bush was running well and moving the ball for the Dolphins. Miami's offensive line was winning the battle up front and doing a good job of opening up lanes and getting to the second level of the defense. Bush sealed the game with a 76-yard touchdown jaunt. He ran through a big hole and broke a tackle from Jarius Byrd to sprint downfield for the score. Bush had a few other highlight-reel runs in the game including an ankle-breaking spin move to juke a defender. He finished with 203 yards on 25 carries with a touchdown. Fitzpatrick attempted a comeback with a short touchdown toss to Derek Hagan. Buffalo then recovered an onside kick and made another field goal. On the next kick, Miami made the recovery and was able to drain the clock. ",
            "3": "Fitzpatrick was 31-of-47 for 316 yards with two scores and three interceptions. Spiller had a very good game for the Bills with 91 yards rushing and 76 yards receiving with two touchdowns, one on the ground and the other through the air. ",
            "4": "Marshall (3-84) led the Dolphins in receiving, while Moore completed 10-of-20 passes for 217 yards and two scores. Even though both teams entered the game way below .500, Miami is clearly more talented and closer to competing with the elite of the conference (or even the division). Buffalo just has way too many injuries and needs to improve its pass rush. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "Wade Phillips missed this game because of a medical procedure. Apparently, the entire Texan team needed to go under the knife. Houston played as though it was asleep the entire afternoon. It began when Arian Foster fumbled the ball on the opening drive. Carolina quickly scored afterward when Cam Newton hit Steve Smith for a 26-yard touchdown, beating top cornerback Johnathan Joseph. After another Carolina touchdown, Owen Daniels dropped a routine catch past the first-down marker on a 3rd-and-7. T.J. Yates then had an awful interception on the next drive The Panthers, meanwhile, went up 21-0 on a crazy Fumblerooski play that caught the Texans completely unawares. ",
            "2": "Houston's defense sucked the entire afternoon, but I'm not sure if it's because this game meant nothing to them, or if it was because Phillips was missing. Cam Newton basically did what he wanted, finishing 13-of-23 for 149 yards and two touchdowns. He also had 55 rushing yards on seven scrambles. The Texans brought him down just twice. ",
            "3": "DeAngelo Williams (15-61, TD) and Jonathan Stewart (11-43) combined to rush for about four yards per carry. Prior to this contest, the Texans hadn't allowed more than 100 rushing yards to an opponent since Week 6. ",
            "4": "Newton's scores went to Steve Smith (5-82) and Jeremy Shockey (2-35). When the latter scored, he did a little too much celebrating. As this happened, I posted on the forum, Shockey TD. Begins trash talking. Forgets that he sucks. ",
            "5": "The Panthers were up 21-0 at the break, but given how terrible they've been at maintaining leads, this contest was far from over. T.J. Yates' ineptness made the victory possible for Carolina, however. Yates (19-of-30, 212 yards, 2 INTs) made a few good throws and was betrayed by his receivers at times, but two mistakes really cost him. I already mentioned the first pick. The second occurred when the score was 28-13 with eight minutes remaining. Houston was in the red zone with a chance to draw within one score. Yates felt phantom pressure, scrambled right and tossed a hideous pick late across his body. Yates still has talent and has the supporting cast to win a playoff game, but this game was a reminder for Houston fans that he's just a fifth-round rookie with only a handful of starts. ",
            "6": "Most of Yates' completions were of the short variety to his running backs. Foster paced the team with five catches and 58 receiving yards. Daniels (2-29) had a poor outing. ",
            "7": "Foster was great outside of that initial fumble, rushing for 109 yards and a touchdown on 16 carries to go along with the aforementioned receiving yardage. I'd say it's a shame the Texans couldn't run more because they were in a hole early, but they screwed themselves with dumb mistakes. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "I'm so glad the Colts won for three reasons: 1. I wouldn't want to see any team playing hard go winless. 2. I had a bet going with my dad that Indianapolis wouldn't go 0-16. 3. Mike Munchak is a freaking idiot. I suppose I should address that last point. I think Munchak's decision to play Matt Hasselbeck was so unbelievably stupid. It was clear on the opening drive that the veteran quarterback wasn't right. He was limping around and struggled to make simple handoffs. He had a good completion percentage (27-of-40, 223 yards), but most of that was the result of short passes and checkdowns to Chris Johnson. Hasselbeck tossed two picks as well, and then gave way to Jake Locker in the fourth quarter. Locker predictably outplayed Hasselbeck, going 11-of-16 for 108 yards and a touchdown. Locker is the better quarterback, so it's inexcusable that Munchak started an injured, inferior option. ",
            "2": "Johnson sucked too. He ripped off a 35-yard burst on a draw, was otherwise bottled up, finishing with 55 yards on 15 attempts against Indianapolis' crap defense. He salvaged his fantasy day with eight catches for 54 receiving yards. ",
            "3": "The silver lining for the Titans is that some of their young skill-position players stepped up. Jared Cook (9-103) and Lavelle Hawkins (8-88) both produced well, though Damian Williams (2-15) didn't do much. Nate Washington (7-62) caught Tennessee's lone touchdown. ",
            "4": "As for the Colts, Dan Orlovsky was a solid 11-of-17 for 82 yards and a touchdown to Reggie Wayne (3-33). Orlovsky isn't any good, but at least he's not committing dumb turnovers like Curtis Painter. ",
            "5": "Most of Indianapolis' yardage came from Donald Brown, who tallied a whopping 161 yards on 16 carries, which includes an 80-yard score in the fourth quarter to seal the deal. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Kellen Clemens didn't commit any turnovers, and for good measure, he threw a bulls*** backdoor touchdown with a minute remaining. Who the hell does he think he is, Kurt Warner? Ugh.) ",
            "2": "It always amazes me how razor thin the difference between losing and winning is in the NFL. This game was a perfect example. The Rams came in at 2-11 and were forced to start quarterback Kellen Clemens who was signed on Dec. 8. They had no reason to fight in this game against a 7-6 Bengals team very much in the AFC wild-card picture. A funny thing happened. This was a dead-even battle almost throughout. St. Louis changed field position on their first drive with a 16-yard pass to rookie Austin Pettis followed by a 12-yard run from Steven Jackson, but lost an opportunity to pin Cincinnati when punter Donnie Jones put the ball in the end zone. The Bengals took advantage of the breathing room with a little help from the Rams' defense. First, a 3rd-and-7 that would have failed when Andy Dalton threw short to A.J. Green was converted when Eugene Sims was flagged for roughing. Then, Green got deep for a 55-yard gain to the St. Louis 2-yard line. However, Cedric Benson (22-76, TD) was stuffed on first down. Two failed attempts to Green later, Cincinnati kicked a field goal to go ahead 3-0. It is worth noting that one of those missed passes was a sweet one-handed catch out of bounds. The offenses were moving the ball a bit in the first quarter, but the scoreboard didn't reflect it. The Rams answered by driving 58 yards with a blend of Clemens passing (33 yards), a little Jackson rushing and a personal foul penalty on Chris Crocker for roughing Dalton. The drive stalled when Jackson couldn't pick up a yard on 3rd-and-1 and was driven backwards. Josh Brown then missed a 45-yard field goal. Still, his defense picked him up. After another long gain to Green (6-115) helped put the Bengals in scoring position, Darian Stewart forced a Cedric Benson fumble which James Laurinaitis recovered to end the threat. Then the defenses really took over. It was surprising to say the least to see St. Louis, the worst run defense in the NFL coming in, contain Benson. Four straight three-and-outs put me into a brief coma. The Rams put the Bengals in poor field position to start drives almost throughout, and it kept them in the game. Meanwhile, St. Louis' four starts in the second quarter were no worse than from their own 39-yard line. The final two marches were six plays apiece, covered a modest 31 and 32 yards but resulted in field goals to put them up 6-3 at halftime. The first of those scoring marches was kick-started when rookie Robert Quinn got a hand on a Kevin Huber punt. The second was the result of Benson being stopped twice with a yard to go to force the ball over on downs. Cincinnati came out strong on its first second-half possession. It was not a dominant drive, but they converted twice on third down and mixed up their play selection. The 51-yard drive resulted in a 41-yard boot from Nugent to tie the score at 6. After an exchange of punts on modest possessions, the Bengals changed the game. First the defense stood tall, quickly ending a possession on a three-and-out when Nate Clements sacked Clemens. Then, Brandon Tate had a huge 56-yard punt return to put Cincinnati's stagnant offense in business. They took care of things from there as backup Bernard Scott set them up with first-and-goal at the 1 with an 11-yard run. He was stopped on his first attempt, but scored the first touchdown on the next play to put the Bengals up 13-6. Against an offense that was not scoring touchdowns, they looked solid heading into the fourth quarter. After Cincinnati's defense quickly forced another punt, their offense finally wore down a spry St. Louis defense. Green, who was limited by an arm injury suffered during the game, picked up 14 yards to start the drive. A couple roughing penalties on Chris Chamberlain helped move the Bengals along with three runs from Benson for 30 yards, including the 4-yard touchdown, which put them in command, 20-6. The Rams had no choice but to put the game on the arm of Clemens (25-of-36, 229 yards, TD). Other than taking three sacks, he played well under the circumstances. Clemens only got a little help from Jackson (18-71) who was going up against Cincinnati's stingy run defense. Following an exchange of punts, Clemens directed a drive to the Bengals' 18, but took a sack on 3rd-and-1 followed by a flag for intentional grounding which ended the threat when Cincinnati brought pressure. The Bengals couldn't close the deal on their next possession, and Clemens took advantage, hitting Danario Alexander twice for 47 yards including a touchdown on what was a four-play, 70-yard scoring drive. A creative onside kick failed, and the 20-13 victory was secured for playoff-hopeful Cincinnati. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Lions",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "27"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Tough win by the Lions. The Raiders had some of their skill players back and were finally home again, so they were going to play really well. Matthew Stafford had two brilliant drives in the fourth quarter to mount a great comeback. The young Lions really grew up in this contest.) ",
            "2": "Both teams came in nursing playoff aspirations and for the most part played like it. A lot of the talk prior to the game was about penalties, and I set the imaginary over/under at 20. The flags were evenly spread between the Raiders (10 for 86 yards) and Lions (9 for 72 yards), but the total came in just under, and thankfully, penalties did not overshadow a great showdown between teams trying to save their respective seasons. The other story was two former No. 1 overall picks leading the way at quarterback. They did not disappoint with Matthew Stafford (29-of-52, 391 yards, 4 TDs) ultimately showing up Carson Palmer (32-of-40, 367 yards, TD). Those numbers don't really tell the whole story, of course. A lot happened in between, too much for this summary actually. Oakland took its first possession to the 24-yard line for a vital early play. On 4th-and-1, the call was a deep pass to Denarius Moore instead of pounding Michael Bush (18-77) and it fell incomplete. The Raiders' defense held, but with Sebastian Janikowski at their disposal, this failure cost them three points they would desperately need later. Oakland's next drive began with a run from Marcel Matchup Nightmare Reece. He rumbled down the sidelines for 56 yards, but stepped out of bounds after 26. Jim Schwartz smartly threw the challenge flag and got back the yardage. When Cliff Avril sacked Palmer, it looked like the Lions would stop the drive, but he was flagged for a horse collar. Chris Houston drew a flag on the very next play for illegal contact, and one play later, Stephen Tulloch was nailed for yet another horse collar. The penalties set the Raiders up at the Detroit 12, and Louis Murphy ran it in for a touchdown on a reverse for the game's first score. The Lions answered with a touchdown drive that started off with small gains and ended with a bomb to Calvin Johnson (9-214, 2 TDs) for the 51-yard tying score. Megatron regularly made big plays against a defense that seemed confused about his status as an elite force of nature. After an exchange of punts, Oakland started to open up the passing game, which was open against a defense weakened by the loss of free safety Chris Harris. Darrius Heyward-Bey had a 35-yard gain to bail the Raiders out of poor field position, and then he caught a 43-yard touchdown to put Oakland back on top 14-7. Heyward-Bey (8-155 yards, TD) broke loose from Chris Houston's attempt to knock him over and sprinted to the end zone. Another exchange of punts, Detroit got its offense in gear again. Johnson was covered by Rolando McClain and responded with a 17-yard reception. Even after Tommy Kelly put the Raiders' defense in a hole with an offsides penalty, Oakland was able to force a third down. Johnson was the man again, this time on a 6-yard reception. One play later, Stafford went deep to Nate Burleson for a 39-yard score to tie the game. I immediately felt that the Lions scored too quickly, leaving a minute for an Oakland defense known for scoring late in halves this season. Palmer threw on six consecutive plays, completing four throws for 45 yards. Bush picked up six more yards on a run right up the middle, and Janikowski's 46-yard field goal put the Raiders up 17-14 at halftime. The third quarter was a mess for both offenses. Oakland struggled to convert third downs (1-of-9) the entire game, and even though Detroit was effective (8-of-17), they did most of their damage on big scoring plays. Kevin Smith (15 rushes for 43 yards) took the rock on four of the next five plays during one drive. He was unable to find room the entire game and was stuffed on 3rd- and 4th-and-1 for a turnover on downs. The Raiders were ready to seize on the change of field position as a 13-yard gain to Kevin Boss putting them in plus territory. Heyward-Bey caught a pass over the middle and looked like he would shake tackles and possibly score until Justin Durant forced a fumble that Alphonso Smith recovered. Once again a scoring opportunity went by the boards. After forcing a punt, the Oakland offense chipped away with a feisty drive featuring a handful of short Bush runs and two modest pass plays to get Janikowski close enough for a 51-yard field goal midway through the fourth quarter for a 20-14 lead. Backed up and trailing, Detroit was in passing mode. Stafford threw incomplete twice and then lost a fumble when Kelly got to him. Aaron Curry picked it up and ran in for what looked like the proverbial dagger. Then, an inexplicable coaching decision changed the course of the game. Hue Jackson sent the kicking team on with a 26-14 lead and 8:04 left in the game. Apparently he was worried about the Lions scoring a touchdown and two field goals in that span to beat him. Instead of trying the two-point conversion to take a two-touchdown advantage, the lead was 27-14. On the subsequent possession, the only run was a Stafford scramble. He was only 4-for-9 on the drive, but put the ball in the end zone to Titus Young, trimming the Raiders lead to 27-21. Oakland tried to run it out with Bush, who had gains of 12, 3, 15, 5 and 2 yards to chew up 2:19 off the clock and eat up precious timeouts. Faced with a 3rd-and-3, the call was a play-action pass down the sideline for Chaz Schilens. It fell incomplete, leaving plenty of time for a final Detroit drive. This time Stafford, who did nothing for the third and most of the fourth quarter, was white hot. He connected with Brandon Pettigrew and Burleson then twice to Johnson on four consecutive plays to pick up 85 yards in a flash. The 48-yard bomb to Megatron was stunning because he was able to beat a secondary protecting a lead deep. After a holding penalty on left tackle Jeff Backus, it looked like the Raiders would weather the storm. However, Stafford went back to Johnson who drew a pass interference penalty on Stanford Routt. After an incompletion, Stafford hit Johnson for the score and 28-27 lead, the Lions' first of the game. The phrase Tebow Time is taken, but with 39 seconds to play it looked like Janikowski Time for Oakland. Palmer connected twice with Kevin Boss for 34 yards to put the ball at midfield. With a timeout in their pocket, the Raiders were in good shape, but Palmer lost all pocket presence and was sacked again by Avril after what seemed like an eternity of trying to find an open receiver. After an incompletion, Palmer hit old friend T.J. Houshmandzadeh for a gain of 6. Janikowski came on for a 65-yard field goal attempt, but it was blocked by Ndamukong Suh, whose presence was quite frankly not felt until that play. Detroit definitely made the plays down the stretch and deserved to win the game, but Oakland head coach Hue Jackson cost his team a chance to seal the game on more than one occasion. His aggressive nature did not pay off on the failed fourth down costing a field-goal opportunity, and after pounding Bush to try to run out the clock, Jackson might have been able to secure the win simply by running him once or twice more late in the game. The decision to kick an extra point while up by 12 midway through the fourth quarter might have been the worst decision though, and hopefully, he will learn from these mistakes for the sake of Raider Nation. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Broncos really robbed us of a potential great fourth quarter because of stupid, unforced mistakes that they committed throughout the contest. Denver lost three fumbles in the opening half, which is a shame because the team piled up a whopping 218 total yards in the first quarter, moving the chains with ease. But the Broncos just shot themselves in the foot when Lance Playa Hatas' Ball, Tim Tebow and Quan Cosby all coughed the rock up. Those fumbles led to 13 New England points. The dumb mistakes continued after intermission, with the most egregious error coming on the defense. The Broncos forced a punt after Tom Brady threw incomplete on a 3rd-and-24 very deep in his own territory. However, Robert Ayers felt the need to shove a hand into the face of a New England lineman, which gave the Patriots a free first down instead of a short field for Denver's offense. ",
            "2": "And if Denver didn't commit all of those errors? Well, I'm sure it would have come down to which team had the ball last. The Patriots had no answer for the run, which the Broncos had to abandon because they fell into a huge hole. Denver's defense, meanwhile, looked completely helpless trying to stop Tom Brady. Brady went 23-of-34 for 320 yards and two touchdowns. Unlike last week in which he looked really lackadaisical, Brady played with a ton of a fire that we often see when he's an underdog. Perhaps someone didn't notify him that he was favored by a touchdown. Brady's scores went to Aaron Hernandez (9-129) and Chad Ochocinco (1-33). Rob Gronkowski (4-53) didn't do much because Denver doubled him on every play. Perhaps John Fox didn't realize that New England has two awesome tight ends. ",
            "3": "And perhaps Bill Belichick finally realized that he has a young stud running back on his bench. Stevan Ridley led the Patriots with 11 carries for 65 yards. BenJarvus Green-Ellis wasted 10 attempts for 17 yards, but found the end zone late in the fourth quarter. ",
            "4": "As for the other star under center, Tebow went 11-of-22 for 194 yards with 93 rushing yards and two touchdowns on the ground. Tebow played pretty well outside of the fumble. He was pressured on almost every play in the second half, which stymied a potential comeback. It was odd to see the Patriots have so much success getting to the quarterback, especially after watching Andre Carter go out with a nasty knee injury. Carter was carted off to the locker room in the first half. ",
            "5": "As mentioned earlier, Denver's ground attack was really effective. In addition to Tebow, Willis McGahee (7-70) and Ball (11-64, TD) both ran really well. McGahee had just seven carries because he suffered a leg injury on the second possession of the game. You have to wonder if this contest would have gone differently had McGahee remained in the backfield. Ball wouldn't have been in the lineup, so he wouldn't have been guilty of that first fumble. ",
            "6": "Only one Bronco caught more than two passes. That would be Demaryius Thomas, who hauled in seven balls for 116 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "This was the toughest game of the week to predict prior to kickoff. If the Cowboys and Giants both won, the Eagles would havebeen eliminated from the playoffs. Since the Giants lost, however, Philadelphia played hard because it still had a chance to win the division. ",
            "2": "Of course, it helped Philadelphia's cause that the Jets killed themselves with mistakes. Santonio Holmes was the main culprit; he had a fumble returned for a touchdown on the opening drive. On the next possession, Holmes deflected a Mark Sanchez pass that was intercepted in the red zone. The Eagles scored seven plays later, giving them a 14-0 advantage and full control of the game. ",
            "3": "Outside of Holmes' carelessness, what really hurt the Jets was the defensive liability in the middle of the defense. LeSean McCoy rushed for 102 yards and three touchdowns on 18 carries, while Brent Celek caught a team-high five balls for 156 yards and a score. With safety Jim Leonhard out for the year, New York is going to have major issues in the middle of the field. McCoy, by the way, broke Steve Van Buren's Philadelphia record for touchdowns in a single season. He has now found the end zone 20 times this season. ",
            "4": "QB Dog Killer had a solid outing, going 15-of-22 for 274 yards, one passing touchdown and an interception. He also scrambled five times for 32 yards and a rushing score - his first of the year. He took some tough shots during the contest and appeared to grimace in pain. There's no question that he'll start next week, however. ",
            "5": "DeSean Jackson did nothing again (2-28), but at least he had the excuse of Darrelle Revis blanketing him. A healthy Jeremy Maclin (3-57) was more productive. ",
            "6": "Sanchez went 15-of-26 for 150 yards, two touchdowns and a pair of interceptions. He really didn't have much of a chance. Playing in a hole the entire game, Sanchez had to deal with a fierce pass rush that tallied four sacks. Jason Babin notched three of them. He now has 18 sacks on the year. ",
            "7": "As with the Eagles, the Jets had their tight end lead the team in receiving yardage (Dustin Keller: 3-73), which is hardly a surprise given how awful Philadelphia's linebackers are. However, Holmes (4-40) and Burress (1-9) snagged Sanchez's scores. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "4",
            "1": "This was one of two games on this week's slate that featured two teams that have no chance of making the playoffs. Wait, don't tell the Cardinals that. They're somehow still alive in the postseason chase at 7-7, even though there are a billion teams ahead of them, including one 9-5 squad. Arizona trailed throughout, but John Skelton played great in the fourth quarter and overtime, going 12-of-20 for 157 yards in that span. His overall numbers were 28-of-46 for 313 yards, one touchdown and an interception. Skelton was all over the place early in the contest. Some of his passes were way off, including one where he missed a wide-open Larry Fitzgerald for a big third-down conversion in the third quarter. He made up for it though by hitting Fitzgerald for 32 yards in overtime. Jay Feely hit the decisive field goal on the next play, which made me extremely happy because Cleveland still covered the six-point spread. Skelton has now performed well in consecutive games. It might be worth it for Arizona to continue sitting Kevin Kolb so it can see if Skelton can be the starter next year. Kolb is owed $10.5 million in 2012, so it's conceivable that he could be a cap casualty prior to March if his backup continues to outplay him. ",
            "2": "The Browns could also be making a quarterback change this offseason. Pat Shurmur said prior to kickoff that he would be using this contest as a litmus test to see how the offense would operate with a different signal-caller under center. Well, Seneca Wallace probably did a better job than Colt McCoy would have done, going 18-of-31 for 226 yards and a touchdown to go along with 21 rushing yards. Cleveland doesn't have much offensive talent, but Greg Little was finally able to have a breakthrough performance, catching five balls for 131 yards and a score. Peyton Hillis (26-99) also found the end zone once. ",
            "3": "As for the Arizona skill players, Fitzgerald finished with meager numbers, catching three balls for 65 yards. Todd Heap (7-69) and Andre Roberts (6-60, TD) were both better on the stat sheet. Meanwhile, Chris Wells rushed for 51 yards and a touchdown on 15 attempts. ",
            "4": "Two young defenders worth noting: Jabaal Sheard and O'Brien Schofield both had two sacks. The latter isn't a rookie, but he is in spirit because he was very limited last year with an injury he suffered in pre-2010 NFL Draft workouts. It's good to see him playing well because he was a really good prospect before getting hurt. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Everyone would have guessed the Chargers would have the better offense in this contest. But the better defense? The Ravens had a big edge on that side of the ball, right? This was just bizarre. I know Philip Rivers has all of his receivers back and heats up in December, but Baltimore's stop unit looked terrible. It couldn't get any sort of pressure on the quarterback or cover anyone downfield. Tackling was also a big issue. Even Ray Lewis whiffed a couple of times. ",
            "2": "Rivers went 17-of-23 for 270 yards and a touchdown. He hit his wideouts repeatedly for long gains downfield. Thanks to a retooled offensive line featuring Jared Gaither, he wasn't even sacked; Rivers was brought down once, but that was negated by a rare illegal slap penalty. Perhaps the Ravens should have tried tackling instead of hitting like little girls. ",
            "3": "San Diego's defense, meanwhile, was outstanding. It took two interceptions from Joe Flacco (a number that could have easily been four or five), and collected a whopping seven sacks. The Chargers limited the Ravens to just 290 total yards (compared to 415 by their offense). Flacco's stat line looks much better than he played; he went 23-of-34 for 226 yards, two touchdowns and the aforementioned picks. His scores went to Torrey Smith (6-77) and Ed Dickson (3-36). Anquan Boldin wasn't much of a factor (2-51). ",
            "4": "Think Raven fans are furious at Cam Cameron? Ray Rice inexcusably carried the ball just 10 times, mustering 57 yards in the process. Rice bailed out his fantasy owners by catching nine balls for 55 receiving yards. ",
            "5": "The Chargers also ran the ball well, but obviously gave their backs more opportunities. Ryan Mathews took 26 attempts for 90 yards and two touchdowns. He fumbled once, but Gaither fell on the ball. Mike Tolbert (8-40), meanwhile, vultured one score away. ",
            "6": "As for Rivers' healthy receivers, Malcom Floyd led the way with five catches, 96 yards and a touchdown. Vincent Jackson (3-84) was also solid, but Antonio Gates (2-31) disappointed his fantasy owners. Randy McMichael was on the field quite often for some reason, and he stole two catches away from Gates. "
        }
    },
    "numberOfGames": "14"
}