{
    "year": "2011",
    "week": "13",
    "Game 1": {
        "Team 1": {
            "Name": "Titans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Poor Bills. When they beat the Patriots back in Week 3, it appeared as though this would be the year that they would finally break through. Injures completely ruined their season, which is now officially over. One of the key injuries was to nose tackle Kyle Williams. Since he went out for the year, the Bills haven't been able to stop the run whatsoever. That was once again apparent in this contest, as Chris Johnson rushed for 153 yards and two touchdowns on 23 attempts. Johnson has struggled for most of this season, but has picked it up the past two weeks against the poor Buffalo and Tampa Bay defenses. He'll once again have an easy matchup next week against the Saints. ",
            "2": "Chris Berman called Matt Hasselbeck one of the top free-agent acquisitions this offseason during <i>Sunday NFL Countdown</i> this week. Hasselbeck went 16-of-25 for 140 yards, but had trouble sustaining drives, converting just 2-of-11 third-down attempts. In fact, Buffalo actually outgained Tennessee, but two fumbles (Ryan Fitzpatrick, Scott Chandler) did them in. ",
            "3": "No Titan wideouts of note; Damian Williams and Nate Washington each led the team with four receptions, for 62 and 40 yards, respectively. ",
            "4": "Tennessee rookie linebacker Colin McCarthy played really well last week in relief of Barrett Ruud. McCarthy had another quality outing, recording nine tackles and a forced fumble. He also recovered two fumbles. ",
            "5": "As for Fitzpatrick, he began the game 0-of-3 on the opening possession, but was able to finish 29-of-46 for 288 yards and a touchdown to Steve Johnson (5-52). However, a good chunk of that yardage came during a garbage-time drive in the fourth quarter. ",
            "6": "The silver lining for the Bills is that C.J. Spiller performed pretty well. He rushed for 83 yards and a touchdown on 14 carries. His score was a bizarre play in which he fumbled into the end zone. He apparently recovered the ball out of bounds, but Chan Gailey challenged and the play was overturned. Spiller also had another touchdown (of 41 yards) wiped out by holding. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "3"
        },
        "comments": {
            "amount": "5",
            "1": "The Chiefs haven't scored an offensive touchdown in a month, and it finally took a prayer. That's what one of the CBS announcers said when Tyler Palko hit Dexter McCluster for a 38-yard Hail Mary score just prior to halftime. Brian Urlacher had an opportunity at an interception, but batted the ball down. Perhaps teams need to rethink this strategy, since we're about a year removed from that infamous Gus Johnson call on the David Garrard-Mike Thomas Hail Mary. It's only fitting that Kansas City would finally score this way. Despite the addition of Kyle Orton, Todd Haley stubbornly named Palko the starter, but benched him early on. Orton's first pass was an underthrown flea flicker, and he injured his finger when he banged it on a Chicago Bear player's helmet. Palko would finish a nondescript 17-of-30 for 157 yards and that score. ",
            "2": "Of course, the big injury was to Matt Forte, who was knocked out when Derrick Johnson's shoulder pad collided with his knee. If Forte's is out for more than two weeks, Chicago's chances of going to the playoffs are severely diminished. Forte was the team's entire offense, and Chicago was completely lost when he left the game. Marion Barber rushed for 44 yards on 14 carries in relief. He's a nice, short-yardage battering ram, but he's incapable of shouldering a full workload at this stage of his career. ",
            "3": "Caleb Hanie was awful again. He went 11-of-24 for 133 yards and three interceptions, one of which was on a desperation Hail Mary at the very end, so that shouldn't really count. However, his first pick was severely underthrown in the third quarter. He also missed a wide-open Earl Bennett for a touchdown just prior to halftime. Hanie should have thrown a score to Barber in the second quarter, but the touchdown was nullified by stupidity. Barber lined up incorrectly on a trick play. ",
            "4": "It's hard to just blame Hanie though because Mike Martz's play-calling was completely idiotic. I have no idea why the hell he continuously asked Hanie to take seven-step drops in long-yardage situations. The easy answer is, It's Mike Martz, but he was better with this when Jay Cutler was still the quarterback earlier in the year. It's almost like Martz has checked out because he knows he'll be coaching in college next year. ",
            "5": "Random stats: Hanie once again targeted Johnny Knox more than any other receiver. Knox caught five balls for 53 yards. As for the Chiefs, Dexter McCluster accounted for nearly half of the team's yardage; he had 61 rushing yards on nine carries and 46 receiving yards with the aforementioned touchdown off four receptions. Dwayne Bowe (4-49) had a really bad drop. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "3",
            "1": "(Editor's Note: A West Coast team playing an early game on the East Coast finally fails to cover, and I don't bet any units on the opposing team. FML.) ",
            "2": "Every so often, a late-season result leaves fans and analysts alike wondering what in the world happened. This was one of those games. The Dolphins have been playing measurably better since their 0-7 start and were rested after playing in Dallas on Thanksgiving. The Raiders are now a winner in one of their past 10 games played in the Eastern Time Zone, so there was evidence an upset (yes, I know Miami was favored) was brewing. From the opening kickoff, it was apparent the Dolphins were going to win this game in the trenches. Their offensive line provided an excellent pocket for Matt Moore. His stats were far from sparkling (13-of-25 for 162 yards, 1 TD), but he was sacked only once and it came when the game was well in hand. I cannot recall him being rushed more than a couple times. The run blocking was also awesome, paving the way for Reggie Bush and rookie Daniel Thomas to pile up 173 combined yards rushing on 35 carries. This was in many ways a repeat of last year's meeting in Oakland, also won by Miami (33-17) although both featured running backs, and the quarterbacks were different. ",
            "3": "Offensively, nothing worked for the Silver and Black. Unlike last week against the Bears, they really missed their speedy skill-position players. Darren McFadden being out has taken the explosion out of the running game, and in this one, Michael Bush was totally bottled up (10-18). In the passing game, Chaz Schilens was the only reliable target (6-89). Earlier in the season, when rookie Denarius Moore was around, along with Jacoby Ford, Schilens was an afterthought. Early on, Miami looked like it would let the visitors hang around. Their first drive featured big plays from Bush and tight end Anthony Fasano (4-66), but stalled when Brandon Marshall slipped and ran a route short of the first-down marker. The long field goal made it 3-0. The defense immediately got them the ball back for another march down the field. This time it was Davone Bess letting a touchdown reception elude him, so Miami settled for three again. Finally, Oakland appeared to do something on offense, but penalties twice pushed them back 10 yards on a bizarre 10-play drive that covered just seven yards. The Dolphins finally finished on offense, hitting Fasano twice early in the drive and Bess for the touchdown. Putting Aaron Curry on him was probably not a great idea, so Miami led 13-0. Two more Raiders drives failed, and the Dolphins' possession in between was killed by a personal foul penalty on Richie Incognito. That was it for the first half, but nothing changed after the break. The kickoff to start the second half was almost housed by Clyde Gates, really deflating any hopes of a turnaround by Oakland. A deep pass to rookie back Charles Clay resulted in a 20-yard penalty setting up a 1-yard plunge from Bush for a 20-0 lead. At this point, all Miami had to do was run the ball, while the Raiders were forced to pass. Still, nothing changed. The Radiers' next possession produced just a single first down, and when the Dolphins got the ball back, they delivered a soul crushing 91-yard journey down the field for a clinching touchdown. At one point, they ran six times in a row with three different players right up the middle and managed 20 yards, while keeping the chains moving. Richard Seymour was ejected for punching Incognito, and the drive concluded with Moore running six yards for the score. If that didn't end it, two plays later, Kevin Burnett intercepted Carson Palmer and took it the distance for a 34-0 lead toward the end of the third quarter. From there, it was all over but the fighting, which there was plenty of. The Raiders managed to get on the board twice against a soft defense, and Palmer finished with decent numbers (20-for-41, 273 yards, 2 TDs, 1 INT). Their first score was a 40-yard deep ball to T.J. Houshmandzadeh. The second was a nice 3-yard toss to Darrius Heyward-Bey who beat Vontae Davis. This was not a game the Raiders were prepared to play, and looking ahead to the games played around the holidays, it would be wise for the Patriots and Jets to take this Dolphins team seriously. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "The Steelers held a 28-7 lead at halftime. Would it surprise you that Cincinnati outgained Pittsburgh by nine yards in the first half? It's true. Pittsburgh didn't outplay its opponent by any means, at least prior to intermission. It was Cincinnati that absolutely killed itself with stupid mental errors. It began almost instantly. An Andy Dalton to Jermaine Gresham touchdown on the opening drive was wiped out by an A.J. Green penalty. Two plays later, a field goal was erased because of a delay-of-game infraction. But five yards wouldn't be a big deal, right? Nope - the retry was blocked. Later in the first half, the Bengals were down 14-0 but were getting the ball back. Brandon Tate fumbled the kickoff return, however, and Pittsburgh would quickly score again. At 21-0, this game was out of reach, and if there was doubt, Antonio Brown scored on a punt return touchdown just prior to halftime, thanks in part to a missed block-in-the-back penalty. ",
            "2": "It was a different story in the second half though. The Bengals mustered just 63 total yards after the break and were able to convert only 2-of-11 third downs overall. Dalton (11-of-24, 135 yards, TD) was knocked out of the game in the fourth quarter because of a hip injury he incurred after a sack. It didn't appear to be serious; Marvin Lewis may have held him out because his team was trailing by four touchdowns. ",
            "3": "Dalton struggled, but at least A.J. Green had a solid fantasy outing. The dynamic rookie wideout had more than half of Dalton's yardage, as he hauled in six grabs for 87 yards and a touchdown. ",
            "4": "There was some concern about Ben Roethlisberger's fractured thumb entering this contest, but it didn't appear to be a factor, as he went 15-of-23 for 176 yards and two touchdowns, both to Mike Wallace (3-38). Antonio Brown (2-67) paced the Steeler receivers in yardage, thanks to a 45-yard reception in the first half. ",
            "5": "Rashard Mendenhall scored Pittsburgh's two other touchdowns in the second quarter. He gained 60 yards on 16 attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "For a while, it seemed like this game would be won by the team that turned it over the least. Though the Jets won by 15, Washington had a field goal advantage in the fourth quarter. This was a battle between offensive ineptitude until the very end. Rex Grossman gave the ball up just twice (19-of-46, 221 yards, 1 INT, 1 fumble), which is a borderline miracle. He had an interception nullified by illegal contract in the first half. He nearly tossed another pick when the ball was tipped around by multiple Jet players in the end zone near the conclusion of the second quarter. Of course, this was to be expected from Grossman. Unfortunately for him, it's not going to get any easier. Sports Illustrated reported Sunday afternoon that Fred Davis and left tackle Trent Williams will be suspended for the final four games of the year because of failed drug tests. Considering that Davis led the team in both receptions and receiving yards (6-99), and Williams has played extremely well in his second NFL season, Grossman is really going to miss them. ",
            "2": "Grossman will really have to lean on Roy Helu and Santana Moss. Helu reached 100 rushing yards and a touchdown on 23 attempts, but lost a fumble. He also had four receptions for 42 yards. Moss, generated 42 receiving yards as well off five receptions. ",
            "3": "As for the Jets, they had yet another special teams fumble, which has been a major issue all year. Jeremy Kerley coughed the ball up in the second quarter. It was recovered by second-year linebacker Perry Riley, who has been great in replacing the ineffective Rocky McIntosh. ",
            "4": "Mark Sanchez didn't have any turnovers, which is a bit surprising considering how wildly inaccurate he was through three quarters. He finished 19-of-32 for 165 yards and one touchdown - solid numbers, thanks in part to a strong final period. ",
            "5": "Sanchez's score didn't go to Plaxico Burress (3-33) for once. Santonio Holmes (4-58) was the one who found the end zone. ",
            "6": "Shonn Greene had a monstrous fantasy performance with 88 rushing yards (22 carries) and a whopping three touchdowns. Greene's final two scores came in garbage time, so don't read too much into this. It's also worth noting that he saw most of the work because LaDainian Tomlinson suffered a knee injury in the first quarter. Tomlinson told reporters that he expects to play next week. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Texans",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The one edge many people thought Atlanta had over Houston entering this contest was at the quarterback position. The play on the field, as well as the stats, say otherwise. Matt Ryan was awful. He went 20-of-47 for 267 yards, one touchdown and two interceptions, but those numbers don't even tell the whole story. Ryan missed a number of open targets throughout the afternoon, including two on the opening drive. He overthrew a wide-open Roddy White by at least five yards on the first play from scrimmage. He did the same thing to Julio Jones two snaps later. Ryan also had a strip-sack nullified by a holding penalty. ",
            "2": "Tony Gonzalez paced the Falcons in both receptions and receiving yards (7-100), while Roddy White (4-51) scored Ryan's touchdown. Julio Jones, however, was a major disappointment. His numbers weren't bad (4-68), but he dropped a game-tying touchdown as time expired. ",
            "3": "Give the Texans major credit for shutting down Michael Turner; the big back rushed for just 44 yards on 14 carries. ",
            "4": "T.J. Yates, meanwhile, wasn't great or anything, but played relatively well in his first start. He went 12-of-25 for 188 yards and a touchdown. He hit Andre Johnson on an impressive 50-yard completion and did a good job moving the chains, converting 9-of-18 third downs. Yates had a lost fumble in the first quarter, but I thought it was a terrible call by the officials, as it was clear to me that the rookie quarterback's arm was moving forward with the ball in hand. However, Yates had a pick-six wiped out by a defensive hold. ",
            "5": "It's worth noting that Yates was just 2-of-7 for 34 yards in the second half, as the coaching staff understandably didn't really trust him. Of course, with a dynamic running game (Arian Foster: 31-111, TD) at his disposal, why would Gary Kubiak air it out with a rookie signal-caller? ",
            "6": "This was a really gutsy win by the Texans. Not only were they missing the top two quarterbacks on the depth chart; they lost Andre Johnson in the third quarter when the All-Pro wideout went down to the ground on a deep route. When he collapsed, the crowd moaned - they knew that it was his hamstring. Johnson's status for the next game or two is in major doubt. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "19"
        },
        "comments": {
            "amount": "4",
            "1": "(Editor's Note: Forum member Simonds noted an exchange between the FOX announcers that basically told the tale of the game for Tampa Bay: Now's the time to take a shot. *Josh Johnson throws a short slant to Kellen Winslow* And there's your shot...) ",
            "2": "Carolina cruised to a win against Tampa Bay's backup quarterback Josh Johnson. The Buccaneers were without starter Josh Freeman because of a shoulder injury. The quarterback change was pretty much irrelevant as the Tampa Bay's defense was incapable of matching up against Cam Newton. The Panthers took the first drive of the game and went 83 yards in seven plays. Running back Jonathan Stewart charged his way through the Buccaneers' defense, and Newton dived over the top of the line for a 1-yard touchdown. The next possession saw another touchdown. Newton had a good run on a fourth-down play to extend the drive. A play later, a nifty double lateral saw Newton run for 27 yards and be stopped just short of the end zone. Stewart finished it with a short run for a touchdown. Newton then threw a bullet to Legedu Naanee for a 19-yard touchdown. Newton ran for another short touchdown in the third quarter. He had an impressive throw downfield to Brandon LaFell, and on the next play, Newton ran for more than 20 yards on an option. In the fourth, it was more of the same as he moved the ball down the field and ran the ball into the end zone from a yard out. With his three rushing touchdowns, Newton set the NFL single-season record for running touchdowns from a quarterback. He also completed 12-of-21 passes for 204 yards with one touchdown, plus ran for 54 yards on 14 carries with those three scores. Stewart had 80 yards on 14 carries and DeAngelo Williams had 29 yards on 11 carries. Brandon LaFell led the Panthers in receiving with three receptions for 64 yards. ",
            "3": "Tampa Bay on the other hand, had a somewhat anemic afternoon. Late in the first, Johnson threw a 38-yard pass to wide receiver Arrelious Benn for the Buccaneers' first first down. It was actually a bad pass as Benn was running wide open down the field and had to stop and wait for the ball. That allowed him to be tackled rather than score. Tampa Bay settled for a 50-yard field goal from Connor Barth. A few minutes before the half, Johnson connected with Mike Williams a nice 42-yard pass, which led to the Buccaneers' third field goal. In garbage time, Johnson tossed a 23-yard touchdown pass to Dezmon Briscoe, who burned Panthers cornerback Chris Gamble. Johnson was 16-of-27 for 229 yards with a touchdown and an interception. He also ran for 45 yards on five runs. Running back LeGarrette Blount ran for 19 yards on 11 carries. Williams led the Tampa Bay in receiving with 93 yards on five receptions. ",
            "4": "The Buccaneers' defense got quality games out of rookie defensive ends Da'Quan Bowers and Adrian Clayborn. They notched sacks in back-to-back plays. That gave Tampa Bay good field position to get one of its four field goals. That was the only highlight of the game for the Buccaneers' defense. They had coverage busts, a plethora of missed tackles and poor gap integrity from start to finish. After a 15-yard unsportsmanlike conduct penalty, Tampa Bay head coach Raheem Morris told second-year defensive tackle Brian Price to go home and sent him into the locker room. The penalty from an undisciplined mental mistake is indicative of the Buccaneers' 2011 season overall and their current six-game losing streak. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "32"
        },
        "comments": {
            "amount": "6",
            "1": "Tim Tebow can't throw the football. -- Keyshawn Johnson. 10-of-15, 202 yards, 2 TDs. -- Tim Tebow's stat line. I can't wait to hear what the excuses are this week. Tebow didn't even run the ball that much (4-13). The defense couldn't stop Christian Ponder. This Denver victory was the result of Tebow's great passing in the second half. But I doubt the stubborn fools on ESPN (Cris Carter, Merril Hoge, Bomani Jones) will want to give Tebow any sort of credit for this victory. So I'll be the one to do so. ",
            "2": "Oddly enough, Tebow didn't look toward Eric Decker. The bulk of his yardage went to second-year Demaryius Thomas, who had four grabs for 144 yards and two touchdowns. If you remember, Thomas and Tebow were drafted only a few picks apart by Josh McDaniels back in April 2010. At least McDaniels got something right. ",
            "3": "Tebow once again was the reason the running game was so effective. His presence really opened things up for Willis McGahee, who rushed for 111 yards and a touchdown on 20 carries. McGahee had a blemish in that he fumbled in his own territory. He also took a safety, but that wasn't his fault. ",
            "4": "As for the other quarterback, Christian Ponder really had an up-and-down day. He finished 29-of-47 for 381 yards, three touchdowns and two interceptions, but was inconsistent throughout. Ponder was terrible early on. He had a horrible fumble, forced by Brian Dawkins, in the red zone. He was pick-sixed later in the first quarter. Ponder then settled down and was really sharp throughout until the game was tied at 32. He tossed a terrible, unnecessary interception, which gave Denver a chip-shot field goal to win the game. But perhaps this was all according to plan, since Minnesota is still in position to draft USC left tackle Matt Kalil. ",
            "5": "Ponder looked toward Percy Harvin early and often. The dynamic wideout had eight grabs for 156 yards and two touchdowns, though one of the scores occurred because a Denver defensive back fell down. Kyle Rudolph had the other score - a 19-yarder that was his only reception of the contest. It was a really impressive grab made over his head amid multiple defenders. ",
            "6": "A silver lining for Minnesota is that Toby Gerhart looked really good for the first time in his career. He rushed for 91 yards on 21 attempts and also had eight catches for 42 receiving yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "I almost want to punch myself in the face as I'm typing this, but at one point in this contest, I thought the Colts were going to win. The Patriots were up 3-0, but Indianapolis had the ball on the New England 1-yard line. The Patriot defense was looking sluggish, and Bill Belichick was doing stupid things like utilizing Kevin Faulk. Dan Orlovsky, meanwhile, was 7-of-7 and looked unstoppable. And then reality set in. Orlovsky overthrew Pierre Garcon in the end zone. Then he underthrew a wide-open Jacob Tamme. A false start and a sack later, and Indianapolis had to settle for a field goal. Orlovsky wouldn't complete another pass until three minutes into the second half. Even more damning is the fact that the Colts had just one total yard of offense in the second quarter. The Patriots, on the other hand, couldn't be stopped once they moved into their no-huddle. They scored touchdowns just prior to and after the half. Up 24-3, they sealed the deal by recovering yet another Delone Carter fumble. ",
            "2": "New England did not seal the cover, however. They allowed cheap touchdowns in the fourth quarter, including one where Orlovsky was getting sacked and just tossed it up for grabs to Pierre Garcon (9-150, 2 TDs). Garcon's second score was more legitimate, but it didn't really matter at that point (save for any poor bettor who had the Patriots in a teaser.) ",
            "3": "Orlovsky went 30-of-37 for 353 yards, the two touchdowns to Garcon and an interception. Don't buy into these numbers though; most of Orlovsky's yardage came in garbage time. ",
            "4": "As for the real quarterback in this matchup, Tom Brady went 29-of-38 for 293 yards and three touchdowns, all to Rob Gronkowski (5-64). Brady's third score was officially a run by the stud tight end, but it pretty much functioned as a pass, so I'll count it as so. ",
            "5": "Gronkowski did all the scoring, but Wes Welker (11-114) and Aaron Hernandez (7-43) both had more receptions. Deion Branch (3-37) disappointed his fantasy owners. ",
            "6": "I have to say that I'm really disappointed in Bill Belichick. Not because he didn't cover the spread - OK, maybe because of that too - but I thought he could take this opportunity to give Stevan Ridley and Shane Vereen more work. Instead, Faulk got touches for some unknown reason. Faulk is done. I don't know what Belichick is thinking here. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Heavy rain poured down on a disgruntled Cleveland crowd throughout this contest. The drops of water might as well have been drops of crap because that's all Browns fans saw the entire afternoon. Cleveland lost by only two touchdowns, but this game was much more lopsided. They were defeated in the time-of-possession battle by 15 minutes. They were outgained in the first half, 271-93. They had just five first downs prior to intermission. The only reason this was so close was because of a late, garbage-time touchdown and two missed field goals by the Ravens. ",
            "2": "Colt McCoy went 17-of-35 for 192 yards, one touchdown and an interception to rookie corner Jimmy Smith where he stared down his receiver. However, McCoy really had no help from his teammates. His offensive line couldn't block the Ravens whatsoever. When McCoy was able to get attempts off, his receivers often dropped passes. You might be able to blame the rain and windy conditions, but the fact remains that Cleveland's receivers absolutely suck. ",
            "3": "The longest reception for McCoy actually went to Peyton Hillis, who leaked out of the backfield and caught a 52-yard bomb downfield. Hillis couldn't really find any running room, however, as he gained just 45 yards on 12 carries. Hillis, by the way, is hurt again. He wasn't in the locker room afterward, and head coach Pat Shurmur told the media that his star running back is dealing with some sort of injury. ",
            "4": "On the contrary, Ray Rice had plenty of running lanes. He compiled a whopping 204 yards and a touchdown on 29 attempts. He missed out on a second score when he took a breather after a 67-yard scamper. Ricky Williams (16-76) vultured the touchdown. ",
            "5": "Joe Flacco didn't have a very good outing amid the nasty weather conditions. He went just 10-of-23 for 158 yards. ",
            "6": "Only one Raven had more than two receptions (Ed Dickson: 3-47). Anquan Boldin (2-32) and Torrey Smith (1-32) disappointed their fantasy owners. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "3",
            "1": "(Editor's Note: How did this Rams team beat the Saints again? Seriously. As my dad said, That game was f***ing fixed!) ",
            "2": "So many times this season, the 49ers have held lesser opponents at arm's length and walked away with victories. This was no exception. The visiting Rams were offensively challenged coming in without starting quarterback Sam Bradford. St. Louis was downright inept here, finishing with just nine first downs and 157 total yards. It's not like San Francisco was moving up and down the field (16 first downs, 389 yards), but they didn't need to because the defense pitched a shutout. The deepest penetration the visitors got was to the 38-yard line, and on the first play from there, A.J. Feeley threw an interception. This was total domination. ",
            "3": "It's tough to even summarize the Rams' offense drive-by-drive. Almost all of their possessions were three or four plays. The 49ers' first possession started with a 14-yard pass to Michael Crabtree and ended when he was unable to haul in a slant that probably would have gone for a score. The 36-yard field goal from David Akers made it 3-0. St. Louis then had what would eventually be their second-longest drive of the game in terms of plays (5) and yards (35). It did not result in points, obviously. San Francisco picked up a couple first downs on the next possession before punting as the first quarter came to an ugly close. The 49ers' defense turned up the heat, with Ray McDonald doing the sack/fumble thing and rookie Aldon Smith, who had a huge game, recovering. From the 6-yard line, Frank Gore tried to do the rest, but three runs came up short. On the second attempt, linebacker James Laurinaitis saved a touchdown, and San Francisco went up 6-0 with a short field goal. Next time out, the 49ers converted a third down with a pass to Crabtree (4-96, TD), but tight end Vernon Davis dropped an easy touchdown pass, forcing the possession to end with yet another field goal. After getting the ball back thanks to a sack from Larry Grant, the San Francisco offense kept its collective foot on the pedal as the half wound down, however Chris Long ended the threat with a sack. To its credit, St. Louis came to play defensively. Following the break, things started to unravel for the Rams. After quickly moving down the field on passes to Steven Jackson and former 49er Brandon Lloyd on an acrobatic play, it looked like they might do something. Then Dashaun Goldson intercepted Feeley on an awful throw. San Francisco's offense decided to get creative on this series, handing the ball off to a wide receiver (Ted Ginn Jr.) and pitching to a tight end (Delanie Walker) for two quick first downs. Then Alex Smith dropped a 52-yard bomb to Crabtree for a touchdown and the 16-0 lead. If St. Louis had any hope, it was extinguished right there. San Francisco overcame a penalty to open their next drive and ended up with a field goal to extend its advantage, leaving it 19-0 at the end of the third quarter. At the start of the fourth quarter, Alex Smith hit Kyle Williams who did all the work for a 56-yard touchdown to make the final margin 26-0. It was another ho-hum day for Smith (17-of-23, 274 yards, 2 TDs), although he was sacked four times. Gore was contained (21 rushes for 73 yards) and a lot of the rushing yardage for San Francisco came on gimmick plays to receiving threats who picked up 55 yards on three attempts. Most importantly, the 49ers did not turn the ball over and played smothering defense. The Rams' running back Steven Jackson and his backup, Jerious Norwood, each had just 19 yards rushing on a combined 21 attempts for a 1.8 average. I think that just about sums up this wipeout. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "I'm still trying to figure out how the Cowboys blew this game. More specifically, I'd like to know why Jason Garrett and Tony Romo tried their hardest to screw over their kicker. It was an odd chain of events. Romo hit Dez Bryant with a deep pass down to the 32-yard line. At this point, there were 25 seconds on the clock, and Dallas had two timeouts remaining. Instead of using one of those stoppages to conserve time and set up Dan Bailey with an easier field goal, Romo lazily took his time and spiked the ball with seven seconds left. Bailey hit the game-winner - only to see it nullified by a Garrett timeout. I don't understand what the hell Garrett was thinking. He asked for the stoppage and then looked sheephishly as he saw Bailey's kick split the uprights. Of course, Bailey's next attept would fail. The Cardinals would win in overtime, thanks to LaRod Stephens-Howling's only reception, which had Cowboy defensive coordinator Capt. Lou Albano bending over in disgust on the sidelines. ",
            "2": "Even if you ignore the field goal, it's still surprising that the Cowboys lost. They dominated early on, as Arizona had just 49 yards in the first half. Kevin Kolb was skittish in the pocket (thanks to five sacks) and missed a wide-open Rob Housler for a possible touchdown in opening quarter. However, the Cardinals really picked up after intermission. Kolb was clutch in the second half and overtime, finishing 16-of-25 for 247 yards and a touchdown. Surprisingly, Larry Fitzgerald (4-55) was not his primary target. That was Andre Roberts (6-111), who had a big game against the Cowboys in this meeting last year. ",
            "3": "Coming off his 228-yard performance at St. Louis, Chris Wells didn't muster a gain longer than nine yards. However, he still compiled 67 yards and a touchdown on 20 carries. ",
            "4": "Wells outgained DeMarco Murray, who really struggled. He tallied just 38 yards on 12 attempts. Felix Jones, meanwhile, notched 36 yards on six attempts. ",
            "5": "Romo went 28-of-42 for 299 yards and a touchdown. Those are solid numbers, but Romo had issues moving the chains, converting just 4-of-12 third downs. His offensive line's inability to block Arizona (5 sacks) definitely didn't help. Neither did rookie corner Patrick Peterson's prolific play in coverage. Peterson has had issues this year, but was absolutely brilliant in this contest. ",
            "6": "Romo's score went to Dez Bryant (8-86, TD). Laurent Robinson (4-72) had decent numbers, but didn't find the end zone, unlike last week. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "35"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: I'm pretty frustrated the Packers didn't cover the spread. Freaking Eli Manning just had to throw that touchdown at the end. Speaking of which, why does it seem like Eli makes his best passes when he's getting tackled and twisting around? He should start doing this even when there aren't any defenders near him.) ",
            "2": "With this game critical to any attempt by the Giants to salvage their season, they jumped off to a great start when Eli Manning hooked up with tight end Travis Beckum for a 67-yard touchdown. He ran a nine route from the slot and beat safety Charlie Peprah to get open deep. In short order, the Packers tied the game up with a 12-yard touchdown pass from a rolling Aaron Rodgers to Jermichael Finley, who fell onto the goal line. New York answered when Manning tossed a 42-yard pass to Victor Cruz to set up a field goal. In the second quarter, each defense stepped up with some interceptions. Green Bay struck first as Clay Matthews jumped a pass in the flat and promptly returned the pick 38-yards for a touchdown. Giants linebacker Chase Blackburn then victimized Rodgers and that set up a short touchdown run from Brandon Jacobs. The Packers struck back as Rodgers put together a drive where he moved the ball with his arm and legs. He capped it by tossing an easy touchdown pass to Donald Driver. He was wide open because of busted coverage, and no defender was within 15 yards of him. Matthews put the Packers in position for more points on a sack-fumble of Manning that was recovered by teammate B.J. Raji. Mason Crosby missed a 43-yard field goal, but Green Bay was up 21-17 at halftime. Early in the third quarter, Rodgers out-executed the New York defense on another drive. He moved the ball down the field with some superb passes. To finish the series, Rodgers lofted in a 20-yard touchdown pass to Greg Jennings, who beat Prince Amukamara on an excellent route. Manning answered with a 51-yard bomb to wide out Hakeem Nicks, who made a tough catch over a defender. A bit later, he made a phenomenal one-handed catch while running to the back corner of the end zone on a fade route. A nice drive by Manning then led to a field goal from Lawrence Tynes, and the Giants found themselves trailing by only one, 28-27. The defenses stiffened and forced some punts. Eventually, the Packers were too hard to contain. Rodgers completed a 21-yard gain to Jordy Nelson, who made a miraculous catch, getting his feet down before going out of bounds at the New York's 10-yard line. Rodgers added to the lead with a touchdown toss to Driver. The Giants responded with a outstanding drive by Manning. He moved the ball down the field and threw a short touchdown pass to Nicks. New York then ran the ball in for a two-point conversion to tie the game at 35 with 58 seconds remaining. Manning left too much time on the clock, however, as Rodgers put the ball in field goal range with good gains to Finley and Nelson. Cosby nailed a 31-yard field goal on the final play of the game. The Packers are now 12-0 with the No. 1 seed in the NFC essentially clinched. The Giants fall to 6-6, but they played tough against the defending champs. Rodgers went 28-of-46 for 369 yards with four touchdowns and one interception. He also ran for 32 yards. Jennings caught four passes for 94 yards and a touchdown. Nelson also had 94 yards, but on four catches. Manning was 23-of-40 for 347 yards with three touchdowns and an interception. Cruz led the Giants with 119 yards on seven receptions. Nicks caught seven passes for 88 yards and two scores. Jacobs ran for 59 yards on eight carries. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Man, I'm really hungry for some turkey. I think I'll finish this recap at my parents' house right before Thanksgiving dinner. Oh, wait... what the hell? It's dark outside. And my computer calendar says it's December. What is going on here!?!?!?!?! It took me 10 minutes to figure it out. Based on how the Lions played in this game, I assumed it was still Thanksgiving. It's amazing how stupid this team is. It's the same thing week in, week out. The Lions really look great at times, but continue to absolutely kill themselves with dumb penalties. They were whistled for a whopping 11 infractions for 107 yards, compared to New Orleans' three for 30. They're just stupid. Really, really stupid. ",
            "2": "It's a shame that Matthew Stafford's great performance (31-of-44, 408 yards, TD, INT) was wasted by this immature and stupid behavior. As Cris Collinsworth noted, Stafford was constantly in 3rd-and-15 situations because his teammates self-destructed. ",
            "3": "Calvin Johnson had six catches for 69 yards. He was outgained by Nate Burleson (5-93), who committed an unbelievable three offensive pass interference penalties. Titus Young (2-60) was benched after a personal foul penalty. Brandon Pettigrew (2-13) chipped in by hitting a ref. ",
            "4": "Kevin Smith looked like he was going to have a big game, but was knocked out with yet another injury. It's unreal how brittle he is. Smith finished with 34 rushing yards (six carries), 47 receiving yards (five catches) and a touchdown in one half of work. ",
            "5": "As for the Saints, Drew Brees was a surgical 26-of-36 for 342 yards and three touchdowns. Brees played games with Detroit's safeties and easily torched a defense missing multiple key players, including Ndamukong Suh. Speaking of Suh, Nick Fairley looked great starting in his place - for one quarter. Fairley left with a left foot injury, which is hardly a surprise. ",
            "6": "At any rate, Brees' touchdowns went to Robert Meachem (3-119), Darren Sprooles (5-46) and Lance Moore (2-23). Jimmy Graham (8-89) and Marques Colston (6-54) played well, but couldn't find the end zone. ",
            "7": "Another player who scored is Mark Ingram, who rushed for 54 yards and a touchdown on 16 attempts. The running game was all Ingram, as Sproles (4-28) and Pierre Thomas (2-10) were seldom involved. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "14"
}