{
    "year": "2011",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "Lions",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "The Dallas Cowboys did their best impression of Texas A&amp;M on Sunday. They opened up a 17 point advantage and led 27-3 in the third quarter. At that point, the Lions started a furious comeback, and like the Aggies, the Cowboys had an epic meltdown. Detroit scored two defensive touchdowns and two Calvin Johnson end-zone grabs with a 51-yard field goal to steal a win from Dallas. It was the biggest collapse in a single game from the Cowboys in team history. The Lions played terribly in the first half, only to be out done by the Cowboys playing even worse football in the third and fourth quarter. ",
            "2": "To start the game, Matthew Stafford threw an interception to Cowboys safety Gerald Sensabaugh. Stafford threw behind Calvin Johnson and the ball flew directly into the stomach of Sensabaugh. Early on, Stafford was struggling and was feeling consistent pressure from the Cowboys front. The normally accurate Stafford was throwing a lot of passes short and heaved a number of passes away rather than pushing the ball downfield. In the first half, the Lions offense produced only three points. Stafford was 9-of-23 for 88 yards and an interception. Javhid Best had 21 yards on only three carries in the first half. Megatron had three receptions for 38 yards with Brandon Pettigrew catching three balls for 20 yards. ",
            "3": "Tony Romo was red hot in the first half. He hooked up with Dez Bryant for a 25-yard touchdown on Dallas first possession. Bryant caught the pass right over the head of Lions cornerback Chris Houston. Romo continued to drive that ball down the field on the Lions' second possession. The Cowboys offensive line was doing a very good job of blocking the Lion defensive line. Romo had time to throw, and they were getting some good runs out of Felix Jones and Tashard Choice. The Cowboys were stopped on the goal line and decided to go for it on fourth-and-goal. Jones was stuffed at the line by Lions linebacker Ashlee Palmer, and Detroit took over. Passing up on three points would come back to hurt the Cowboys. Romo attacked Houston again with a 44-yard pass to Laurent Robinson that got the Cowboys all the way to the Lions' 6-yard line. On the next play, Romo threw a pass up to Bryant who grabbed the ball and fought off cornerback Eric Wright in the front of the end zone. Following that, Romo led a field goal drive midway through the second quarter and just before halftime for a 20-3 halftime lead. Romo picked apart the Detroit defense, completing 19-of-24 passes for 195 yards and two touchdowns. Jones ran for 37 yards on 10 carries. Robinson paced Dallas in receiving with four receptions for 85 yards. Bryant had two catches for 37 yards and two scores. ",
            "4": "At the beginning of the third quarter, Romo didn't miss a beat as he moved the ball downfield and hit tight end Jason Witten for a one-yard touchdown. With the Lions up 27-3, Romo breathed some life into a Lion defense that was bleeding yards and points. Romo threw a terrible pass short of his receiver, and it was intercepted by Lions linebacker Bobby Carpenter. The former Cowboy first-round pick cut in front of a receiver around the 35-yard line. He zig-zagged his way downfield and returned the interception for a touchdown. The next possession was, as Yogi Berra would say, deja vu all over again. Romo threw a slant pass toward Robinson, but it was off the mark. Houston out-fought Robinson for the ball and made the interception. Houston raced down the sideline 56 yards and dodged a few potential tackles for a touchdown. Romo was aided by a dumb facemask penalty on Ndamukong Suh. The Lions kept Suh blocked for most of the game, but Suh hit Romo hard with a hand to the face of Romo. It turned an incompletion on a third down to a first down around midfield. Romo's next play was a 37-yard pass to Witten. That led to a field goal and a 30-17 lead. After the Lion defense got Stafford back in the game, he returned the favor in the fourth quarter when he finally got the ball into the end zone. Stafford threw a jump ball in the end zone for Johnson, and Megatron out leaped two defenders to come down with a 23-yard touchdown catch. After a three-and-out, the Lions moved the ball, but sloppy play and penalties forced Detroit to settle for a field goal to make it a three-point game. Detroit put up 10 more points to narrow it to 30-27. With just over four minutes remaining, Romo was pressured by Suh. He tossed a ball up for Witten that was short of his tight end. Linebacker Stephen Tulloch tipped the ball to himself and secured a huge interception for Detroit. The Lions made Romo pay and took the lead. Some good passes from Stafford to Johnson and hard runs by Best, moved the ball inside the 5-yard line. Stafford finished the drive with a fade pass to Johnson for a 2-yard touchdown toss. Romo didn't have a comeback in him, and Detroit improved to 4-0 for the first time since 1980. Dallas fell to 2-2. ",
            "5": "Stafford ended the game 21-of-43 for 240 yards with two touchdowns and an interception. Johnson had eight receptions for 96 yards and two scores. Pettigrew caught six for 64. Best ran for 47 yards on 11 carries. ",
            "6": "Robinson led the Cowboys in receiving with seven receptions for 116 yards. Witten had seven catches for 94 yards with one score, while Bryant had three catches for 37 yards and two scores. Jones ran for 57 yards on 16 carries. ",
            "7": "For the game, Romo finished 34-of-47 for 331 yards with three touchdowns and three interceptions. The Lions could not have made their comeback win without Romo's two pick-sixes and final interception. It was a terrible meltdown performance from the Cowboys signal-caller. Romo turns 32 next April, so next offseason may be time for Dallas to think of the long-term future at the position. His performance against the Lions and Jets this season have to make them start pondering that. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Saints",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "You knew the Jaguars were going to have a tough time in this game because the yard marker arrows were facing the wrong way. Seriously, how do you screw something like that up? Perhaps Blaine Gabbert was confused about this because he was pretty dreadful. He went 16-of-42 for 196 yards, one touchdown and an interception. The bulk of his yardage came on a wide receiver screen to Mike Thomas (5-73) that went for 47 yards. Outside of that, Gabbert didn't have a completion longer than 18 yards. He was especially bad in the second half; he had just 34 passing yards after the break, as he continuously missed wide-open receivers. ",
            "2": "Drew Brees, conversely, was his usual studly self. He went 31-of-44 for 351 yards, one touchdown and two interceptions (one of the picks was a tipped pass that wasn't his fault). Brees looked often toward Jimmy Graham, who logged 10 receptions for 132 yards and a score. Graham really is becoming unstoppable. It's crazy to think that he hasn't even played football for that long. He could be the NFL's top tight end in a couple of years. ",
            "3": "Marques Colston played for the first time since breaking his collarbone in Week 1. He didn't do much - he caught one pass for eight yards - but he'll be a greater factor each week as the season progresses. ",
            "4": "A disappointing performance for Mark Ingram, whom I thought would be able to have a solid outing with a presumed big lead against Jacksonville's defense. Ingram carried the ball 17 times, but got just 55 rushing yards out of it. He's been a bust thus far, and you have to believe that the Saints regret burning next year's first-round pick on him. ",
            "5": "The Saints' leading rusher was Darren Sproles (7-75). Sproles continued to be a big part of the passing attack (5 receptions, 56 rec. yards), but was also able to contribute on the ground. ",
            "6": "Speaking of running backs, Maurice Jones-Drew tallied 84 yards on just 11 carries. Down 14-0 early, Jacksonville simply couldn't run the ball as much as it wanted to. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "49ers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "2",
            "1": "Nightmare Team is the easy headline, and it fits for the 1-3 Eagles. Free agent signings played a huge role in the upset loss to the 49ers, who suddenly are comfortable leaders in the NFC West. In the early going, the offensive line was protecting well for the Eagles. After all, Michael Vick did throw for 416 yards and rush for 75 more. He generally had time to scan the field for open receivers, and his runs came after realizing no one was open. Their defense was potent in the first half, limiting the 49ers to movement on just two drives which both wound up in field goal attempts. Only one was converted by their former kicker David Akers. When he lined up for his first try, a bit of the crowd actually cheered. They roared when he missed from 44 yards out. He was not the worst kicker in the stadium though. More on that later. Vick's lone interception ended a drive in the first quarter, but the killer turnover came from Ronnie Brown in the second quarter. He was trying to find the end zone on an inside run from the San Francisco 1-yard line. After realizing he would not make it, something froze his brain, prompting a backward pass attempt. He failed according to the refs, and it was ruled a fumble. The turnover basically took three points off the board, assuming they attempted and converted an easy field goal from about the 3. After driving the field at will, Philadelphia led only 20-3 at halftime, but should have been up by much more. The 49ers found some offense to start the second half only to watch King Dunlap block an Akers field goal attempt. A quick drive for a field goal later made it 23-3, and while the Philadelphia crowd was booing, they were still completely in charge of the game. Then the defense came unraveled. It is worth noting that Jason Babin earned his check and then some, constantly harassing Alex Smith. He was a force. The rest of the unit had issues in the second half when the 49ers kept driving the length of the field for touchdowns. Kendall Hunter had a sweet reception for 45 yards to key their first touchdown march. The game was still in their control when Nnamdi Asomugha, signed to be a shutdown corner, let Michael Crabtree beat him for a gain of 32 yards to start a drive that ended in a touchdown to trim the lead to 23-17, which gave the visitors hope. At this point the offense kept moving down the field only to watch their rookie kicker act like a rookie. Alex Henery missed field goals on consecutive drives sandwiched around forcing a San Francisco punt. Suddenly, the 49ers had the ball with the outcome in doubt and 6:28 left. They got big plays from Hunter and the physically limited Frank Gore, who capped the drive off with a 12-yard touchdown scamper. The icing on the cake was Akers striking the extra point to make it 24-23. Still, the Dream Team had a full three minutes to answer the bell. Short passes put them just inside San Francisco territory. A pass to Maclin had them at the 32 and pretty much in field goal range, assuming Henery was up to it. One problem - Justin Smith forced a fumble, and a pack of 49ers was there to cover it and end the threat. Again, it wasn't over until Philly's defense let Gore run for 4, 8, 4, 5 and 5 yards on consecutive plays when it knew what was coming. How do you let an injured running back average over five yards per carry on a drive like that with the game on the line? There is plenty of blame to go around, but clearly this team of stars lacks heart and finishing skills. ",
            "2": "On the other side, San Francisco got decent play from Alex Smit,h whose only turnover was a lost fumble. They have something brewing in the backfield with Gore and Hunter (11 touches for 100 yards). The passing game was littered with big plays from Crabtree, Morgan and tight end Vernon Davis all getting involved. Adding in all up, they hung in there and took a game Philadelphia allowed them to win. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "I have a new appreciation for just how bad the Rams are. The Redskins were in an awful spot, yet St. Louis mustered just 99 total yards of offense through three quarters. St. Louis somehow scored 10 points in the final 15 minutes, but its own ineptness prevented it from making a full comeback. The problems, of course, had to do with Sam Bradford's supporting cast. I was shocked when I looked at the box score and saw that Bradford was sacked only seven times. Key word: only. I estimated a dozen sacks. The offensive line barely gave him any time to throw. On the rare occasions when Bradford (20-43, 164 yards, TD) was able to scan the field without a defender in his face, none of his receivers were able to get open. And then there were the drops. There were plenty of them, including Lance Kendricks' botched try in the end zone. Penalties were an issue too. The Rams had nine of them, and one infraction completely changed the game. Early on, the Rams had a fourth down on Washington's 28. Josh Brown had a makeable field goal attempt coming up. However, beleaguered right tackle Jason Smith committed a personal foul. Set up in a 3rd-and-22, Bradford was strip-sacked, and the Redskins scored two plays later on a short field. Instead of a 7-3 deficit, St. Louis fell behind, 14-0. Game over. ",
            "2": "Steven Jackson was the only Ram to carry the football. The Redskins bottled him up well, limiting him to 45 yards on 17 carries. ",
            "3": "Rex Grossman tried his hardest to give this game away. He went 15-of-29 for 143 yards, one touchdown and two ugly picks. Grossman also missed receivers on third down that would have moved the sticks. Forunately for him, the Rams were too inept to capitalize on those errors. ",
            "4": "Grossman was also bailed out by his running game. Tim Hightower (8-24) was ineffective, so Mike Shanahan opted to go with Ryan Torain, who tallied 135 yards and a score on 19 attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Titans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "3",
            "1": "What a weird season for the Titans. Chris Johnson can barely get anything going on the ground, yet they keep on winning. Matt Hasselbeck has been a great surprise for Tennessee, and it makes you wonder what the hell the Seahawks were thinking when they let him go. Chris Johnson was able to finish with 101 yards on 23 carries, but aside from a 25-yard scamper in the first quarter that probably should have been a longer gain, he wasn't able to do much until late when the Browns gave up. Hasselbeck, meanwhile, went 10-of-20 for 220 yards, three touchdowns and a pick despite not having Kenny Britt for the first time this year. The bulk of his yardage came on an 80-yard touchdown to tight end Jared Cook in which Cleveland defensive back Usama Young took a horrible angle and whiffed on a tackle. ",
            "2": "No Titan had more than two catches. Tied for the lead in receptions were Cook (2-93, TD), Nate Washington (2-62), Lavelle Hawkins (2-38) and Chris Johnson (2-11). ",
            "3": "The Browns could eventually have something good with Colt McCoy. The problem is, we won't know whether that's the case until he gets someone to work with. McCoy once again got absolutely no help from his receivers (or backup running back). Montario Hardesty dropped four passes himself, which was quite an accomplishment. McCoy went 40-of-61 for 350 yards, one touchdown and a desperate, late interception. The Browns were behind for most of this contest, so they had no choice but to throw often. Peyton Hillis was able to carry the ball just 10 times for 46 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "The most exciting part of this game was the broadcast. Gus Johnson called the plays for FOX. You have to wonder though, why did FOX force Johnson to work this crappy matchup? He's their best play-by-play guy. He needs to be calling the top game. The second-most exciting part of this contest was a sideline fight between Todd Haley and Matt Cassel. The two yelled at each other in the first half, and it appeared as though Kansas City was about to come apart at the seams. Instead, Cassel did a good job leading the team to victory, going 18-of-29 for 260 yards and a touchdown, though he did have an interception dropped in the red zone. ",
            "2": "Cassel looked often to Dwayne Bowe, who hauled in five grabs for 107 yards and an impressive 52-yard touchdown in which he broke three tackles. Steve Breaston was productive for the first time all year, catching four balls for 91 yards. ",
            "3": "Kansas City's running game once again was non-existant. Thomas Jones (11-37) and Dexter McCluster (7-26) both struggled to find running room. In a typical Haley move, Jackie Battle (5-22) got the attempts when the Chiefs were trying to run out the clock. ",
            "4": "You can't blame the Minnesota coaching staff for not feeding the ball to Adrian Peterson. Behind for most of the second half, the Vikings gave Peterson 23 carries, who turned those into 80 yards. The running lanes just weren't there. ",
            "5": "Donovan McNabb went 18-of-30 for 202 yards, two touchdowns and a pick. He was better this week - his best throw was a 4th-and-14 conversion to Bernard Berrian - but he fumbled once and was sacked twice by Tamba Hali. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bears",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "29"
        },
        "comments": {
            "amount": "5",
            "1": "First of all, Cam Newton is awesome. The Bears scored what looked to be a bulls*** frontdoor cover touchdown when Matt Forte had a 40-yard run that set up a short Marion Barber score. Newton came back down and threw a meaningless score to Greg Olsen with a few seconds remaining in regulation. The touchdown covered the spread. My reaction on the forum as this happened? <i> ohmygodtouchdownpanthersholy**** </i> Like I said, Newton was awesome. He did make a crucial mistake in the first quarter when he tossed a pick-six into double coverage, but was outstanding otherwise. He went 27-of-46 for 374 yards, one passing touchdown, two rushing touchdowns and that interception. ",
            "2": "Even with that late score bringing the deficit down from 34-23 to 34-29, the Panthers should have won this game. They outgained the Bears, 543-317. They had nine more first downs. But like any young team, they continuously shot themselves in the foot. Here are some examples: - Legedu Naanee dropped an easy catch on what would have been a 30-yard completion on the first drive. - Later in the possession, a long pass to Jeremy Shockey was wiped out by an illegal formation. - The Panthers were guilty of a delay-of-game penalty on a first-and-goal in the middle of the second quarter. - A Jeremy Shockey third-quarter touchdown was called back by a bogus offensive pass interference. - The Bears blocked a 34-yard field goal. - Carolina allowed Devin Hester to return a kickoff 73 yards, which set up a short field for Chicago and a subsequent Matt Forte touchdown. - Minutes later, Hester scored on a punt return touchdown. ",
            "3": "An encouraging sign for the Panthers is that they were able to run well. DeAngelo Williams (10-82) and Jonathan Stewart (8-52) found some running room for the first time all year. ",
            "4": "Some big fantasy numbers: Steve Smith caught eight balls for 181 yards. Matt Forte, meanwhile rushed 205 yards and a touchdown on 25 attempts. ",
            "5": "Jay Cutler didn't have to throw much; he went 9-of-17 for 102 yards and an ugly interception in which he overthrew his receiver. On the bright side, he took only one sack. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Texans",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Steelers are done. Their defense is old and slow. The offensive line can't block anyone. It's a miracle that this game wasn't a blowout. As an indication, Houston won the time-of-possesion battle in the first half, 21:32 to 8:28. In fact, the Steelers didn't even get the ball until there was 4:05 remaining in the first quarter. Pittsburgh was completely helpless against the run; Arian Foster rushed for 155 yards on 30 carries, while Ben Tate, who suffered a groin injury, chipped in with 20 yards on two attempts. That's 5.5 yards per carry. It's amazing that the Steelers' once-vaunted defense that perennially ranked in the top five in grounddefense can't even come close to stopping the rush. The reason why the Steelers were able to hang around? The Texans absolutely killed themselves with penalties. They had eight in the first half alone, including the dumbest block-in-the-back infraction ever on Danieal Manning on Johnathan Joseph's blocked field goal return. ",
            "2": "Houston wasn't the only team to shoot itself in the foot. The Joseph blocked kick return never happens if Maurkice Pouncey doesn't commit a really dumb personal-foul penalty inside the Texans' 10-yard line. There was also the block itself. I would have preferred a 17-13 result over the 17-10 score. ",
            "3": "It doesn't get much better for Pittsburgh on offense. Ben Roethlisberger (16-30, 206 yards, 1 INT) had absolutely no time to throw in this contest. He was constantly under siege; he was sacked five times, and if it wasn't for his pocket elusiveness, he may have taken double that amount. The worst part is that Big Ben suffered a foot injury and left the stadium in a walking boot. ",
            "4": "Since Roethlisberger didn't get much of a chance to find his receivers downfield, Mike Wallace' streak of 100-yard receiving performances came to an end. He was still solid though (4-77). The same could be said for Antonio Brown, who caught five of his 10 targets for 67 yards. ",
            "5": "Speaking of receivers, Andre Johnson (4-36) went down with an injury in the first half. It looked like it could have been a knee at first, but it was just a hamstring. He'll have an MRI soon. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "I'm still trying to figure out how the Seahawks covered this game. They were trailing in the third quarter, 27-7. They had just five first downs in the opening half. Tarvaris Poop Salad Jackson was getting booed off the field, as Atlanta was dominating. Seattle inexplicably mounted a comeback, falling a missed 61-yard field goal short of pulling off the upset. ",
            "2": "Atlanta's offense certainly wasn't to blame. The team won the time-of-possession battle, 40:10 to 19:50, and was able to convert 9-of-16 third downs. Matt Ryan went 28-of-42 for 291 yards and a touchdown despite facing heavy pressure all afternoon. He found Julio Jones 11 times for 127 yards. Roddy White (6-78) and Tony Gonzalez (7-56, TD) were also major factors. ",
            "3": "Save for his 21-yard touchdown run, Michael Turner struggled to find running room against a stout Seattle rush defense. Turner had 70 yards on 26 attempts, but made his fantasy owners happy with two scores. ",
            "4": "I mentioned Poop Salad Jackson earlier. He really deserves some credit for a bounce-back performance, especially after struggling mightily in the first half. Jackson went 25-of-38 for 319 yards, three touchdowns and two picks, as he repeatedly targeted struggling Falcon corner Brent Grimes. The stats are a bit misleading, however, because a 52-yard score of Jackson's came on a desperate heave to Sidney Rice (3-79, TD) when the discombobulated Atlanta defense was offside. Jackson also barely faced any pressure all afternoon. You have to wonder if the Falcons regret breaking the bank on Ray Edwards. Atlanta's defense looks awful. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Giants",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "I'm sure you've all seen the play by now. The Giants were trying to mount a fourth-quarter comeback. On the final drive, Eli Manning hit Victor Cruz for a 19-yard gain. Cruz went down to the turf on his own accord. Untouched, Cruz dropped the ball and ran back to the huddle, thinking that the play was over. However, the Cardinals pounced on what appeared to be a fumble recovery. The officials ruled that Cruz gave himself up. Ken Whisenhunt tried to challenge it, but wasn't allowed to. On the next play, Manning hit Hakeem Nicks for the decisive 29-yard score. Most of the talking heads on TV were pissed off about this and disagreed with the call, but I didn't - until I heard what Cruz said afterward. I thought it was pretty legitimate at first. If you look at Cruz, he glanced to his left and right, decided that he wasn't going anywhere, and dived down on his own. I figured he knew he wasn't touched, and thus gave himself up. Afterward, however, Cruz said that he thought he was touched. If that's the case, then Arizona definitely got hosed. ",
            "2": "What's lost amid the controversy was Eli Manning's fourth-quarter performance. He finished 27-of-40 for 321 yards and two touchdowns in the final four minutes. The top-five quarterback hit Nicks 10 times for 162 yards and Cruz on six occasions for 98 yards. Coming off a concussion, Mario Manningham did nothing (1-10). ",
            "3": "It was pretty surprising to see the Giants struggle to run the ball so much. Ahmad Bradshaw (12-39) and Brandon Jacobs (9-18) both scores, but neither was able to find much running room. ",
            "4": "Meanwhile, Chris Wells had a monstrous performance. Even though Justin Tuck was out, this was even more inexplicable because A) Wells was a game-time decision and B) the Giants ranked 10th against the run entering this contest. Wells tallied 138 yards and three touchdowns on 27 attempts, as he constantly ran left where Tuck was supposed to be. ",
            "5": "Wells' great running didn't help Kevin Kolb very much. Kolb went 20-of-34 for 237 yards and an interception, but was constantly under pressure. He made several inaccurate throws, while his longest gain was all Larry Fitzgerald; the All-Pro wideout leapt up and snagged the ball away from a defender. The silver lining is that with his eight catches and 102 yards, Fitzgerald became Arizona's all-time leading receiver. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The Dolphins were without three starters in running back Daniel Thomas, linebacker Koa Misi and cornerback Vontae Davis. Miami lost quarterback Chad Henne midway through the first quarter to a shoulder injury. It was a broken play, and Henne landed awkwardly on his shoulder while being tackled. He had already thrown an interception in the game on a deep pass intended for tight end Anthony Fasano. Marcus Gilchrist came down with the ball for San Diego. Henne finished the game 3-of-4 for 27 yards. Backup Matt Moore came into the game and handed the ball off a lot as the Dolphins scored a touchdown with running back Lex Hilliard diving over the top. Moore did not play poorly for Miami, but he didn't make the big plays they needed to have a shot at beating the Chargers. ",
            "2": "The San Diego Chargers were without tight end Antonio Gates, but they had enough to move the ball on the Dolphin defense. Early in the game, Philip Rivers tossed a bomb to Vincent Jackson. After beating Shaun Smith and safety Yeremiah Bell, Jackson made a diving catch around the 10-yard line, got up and ran into the end zone for a 55-yard score. They connected again for another long reception on the next drive that set up a field goal. ",
            "3": "In the second quarter, the Dolphins were set up with great field position, but had to settle for a field goal. The reason is because the Miami offensive line stinks, specifically left guard Richie Incognito and right tackle Marc Colombo. Incognito made a mistake in blitz pickup to let Moore get sacked on a rush through Incognito's gap. Colombo gave up a sack to Larry English, who has had made the case for being a first-round bust. English's sack was the big play that forced the field goal. English also recorded his second sack of the season. It was a coverage sack when Moore stepped up in the pocket next to English, and he took a couple steps to the quarterback away from left tackle Jake Long. ",
            "4": "Rivers led a field goal drive just before halftime, and to start the second half, he contributed to a touchdown possession that gave San Diego a 20-10 lead. A 42-yard screen pass to Ryan Mathews overcame a nice sack from Cameron Wake. Mathews showed excellent patience and speed to pick up his blocks and break downfield for a huge gain. Mike Tolbert dived over the line for the score to cap the drive. ",
            "5": "The Chargers got the ground game going in the second half. Mathews ran the ball well although he didn't get a heavy amount of carries. He and Rivers moved the ball and led San Diego to field goal drives in the third and fourth quarter. Rivers was highly efficient completing 21-of-31 passes for 307 yards and one touchdown. Mathews ran for 81 yards on 16 carries with five receptions for 68 yards. Jackson led the Chargers with 108 yards receiving on three catches with a score. ",
            "6": "San Diego sealed its win with an interception by safety Eric Weddle. Moore completed 17-of-26 passes for 167 yards and one interception. His YPA of 6.4 illustrates why Miami couldn't produce more points. ",
            "7": "Running back Reggie Bush led Miami with 50 yards rushing on 13 carries. The Miami offense was clearly missing Daniel Thomas. Wide receiver Brandon Marshall had five receptions for 52 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Denver fans paid for an electronic sign in Denver as a plea for John Fox to start Tim Tebow. It wouldn't have mattered. Aaron Rodgers was on fire against a helpless, Champ Bailey-less Denver defense that simply had no chance. Rodgers went 29-of-38 for 408 yards, four touchdowns and an interception. He also scored twice on the ground. ",
            "2": "Rodgers' scores went to four different players: Greg Jennings (7-103), Jordy Nelson (5-91), James Jones (3-48) and Donald Driver (3-20). The Driver touchdown was cool because he suffered what seemed like a nasty foot injury earlier in the contest, and it didn't look like he would be able to get back out on the field. ",
            "3": "James Starks didn't find the end zone, but he had a great outing, rushing for 63 yards on just 13 carries and catching five balls for 38 receiving yards. Starks ran with great power; he broke tackles and bulldozed over weak defenders. Starks won't lose his job if he runs like this every week. ",
            "4": "As for Kyle Orton, he went 22-of-32 for 273 yards, three touchdowns (two to Eric Decker) and three interceptions. Those are great fantasy numbers, but Orton's weakness was apparent on one of the picks. He fired a weak pass that was taken back for six by Charles Woodson. Orton's passing numbers were a bit of a farce. He threw a 44-yard strike to Brandon Lloyd on a flea flicker that really fooled the Packers. When the Broncos had to move the ball down the field, they often had issues doing so. ",
            "5": "Denver stated earlier in the week that it designed a few plays for Tebow. Well, Tebow had just one carry for minus-1 yard. He didn't attempt a pass. Expect more Te-Bow! chants in Denver against the Chargers on Sunday. ",
            "6": "Willis McGahee was shockingly very productive. He legitimately rushed for 103 yards on 15 carries. ",
            "7": "It was cool to see a highly favored team give it its all against a weak opponent. The Packers were clicking on all cylinders, and even tried (and recovered) an onside kick in the first half. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "19"
        },
        "comments": {
            "amount": "2",
            "1": "Points were supposed to fly in this game, and while 50 wound up being scored, it was not a back-and-forth affair by any means. Oakland capitalized on a kickoff out of bounds to start the game with field position. Tight end Kevin Boss made his presence known right away with a couple catches for 35 yards to set up a short field goal to open the scoring. Smartly, New England came out and operated a balanced offensive attack knowing Oakland's defense was vulnerable in both areas. Stupidly, their former star Richard Seymour was flagged for a pair of 15-yard penalties to fuel their opening touchdown drive capped off by a 15-yard pass to Wes Welker and a 7-3 lead. After an exchange of punts, the Raiders opened a drive with a 41-yard run by Darren McFadden. Jason Campbell rumbled for 17 yards and followed it up with a 23 yard pass to Boss. It took the running game three shots from first and goal, but Michael Bush cashed in to put Oakland back in front 10-7. Welker receptions and a few BenJarvus Green-Ellis runs, including a 1-yard plunge for a touchdown, changed that in a hurry to make it 14-10 New England. The Black Hole was not in panic mode though. Darrius Heyward-Bey picked up 28 yards on a reception, and the return of Jacoby Ford was felt with a trick play run good for 30 yards. The drive ended on an interception I can't even describe. Announcer Solomon Wilcots assumed Campbell was trying to throw the ball away with no Raiders in the vicinity at the New England 6-yard line on second down and goal. I surmised he just delivered it directly to Patrick Chung, who caught it easily even with a hand in a cast. The Patriots drove for a field goal to make it 17-10 at the halftime gun. Wasted yardage, 75 on that drive, was a theme for the Raiders, who piled up 504 while never realistically having a shot to win down the stretch. If it feels like I am jumping ahead ,it is because the Patriots moved the ball at will in this game when they needed to. Welker's receiving and the hard running of rookie Stevan Ridley were unstoppable. Ridley capped the first drive of the second half with a touchdown run from 33 yards out. Oakland did answer with a drive for a field goal, but it took 7:34 to get it done. An offense built to wear teams down running the ball is not going to beat an offense run by Tom Brady with long marches for three points. Already up double digits, New England just kept going to Welker for 9, 19, 6 and 28 yards along the way before hitting Deion Branch for the touchdown to make it 31-13. With the game now in the fourth quarter, it was up to Campbell to make big plays down the field. He really wasn't up to it although he led a drive down to the New England 30 before throwing an interception to Vince Wilfork. Someone on Twitter joked about Wilfork Island since the big boy now has a couple picks in the past three games, but it is more like a continent. There was just some scrapping after that. The Patriots tried to smash in another in your face touchdown and failed. The Raiders found Heyward-Bey for 58 yards and Bush for 35 on consecutive passing plays in the closing moments to set up rookie phenom Denarius Moore, a total non-factor most of the day, for a garbage touchdown. The 31-19 final was secured when Campbell failed to find Chaz Schilens on the two-point attempt. ",
            "2": "The summary here is that New England got enough protection for Brady, thanks to the running of Ridley and Green-Ellis, who combined for 172 yards on 26 carries. Welker was the only receiver targeted, but it didn't matter because the defense couldn't stop him. As expected, Bill Belichick did not allow McFadden to beat him. He did total 123 yards on 18 touches, but 67 of that came on two plays and he failed to score. This is a good, not great Raider team ,and to no one's surprise, the Patriots were not excited about losing consecutive games. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "This was one of the weirdest games I've ever seen. The first half lasted two hours. In perfect weather, the two quarterbacks combined for 21-of-66, 382 yards, no touchdowns, two interceptions and five fumbles. And there were five return touchdowns in this contest, the most in any single game in NFL history. ",
            "2": "The quarterback play was so awful in this matchup that the Bobby Boucher strategy of kneeling down on every play would have ensured an easy victory. NBC's Cris Collinsworth joked about whichever team had its defense on the field more often had the better chance of winning. For the Jets, it was all about the blocking - as in, there was none. Center Nick Mangold's absence was glaring, as backup Colin Baxter continuously botched snaps. Sanchez's protection was awful, as he was under pressure on nearly every single pass attempt. As a result, Sanchez went 11-of-35 for 119 yards, a pick and four fumbles, two of which were returned for touchdowns. The run blocking was non-existent as well. The Jets tried to run the ball, but Shonn Greene (10-23) and LaDainian Tomlinson (3-minus-3) couldn't do anything. ",
            "3": "I can't really explain what happened to the Ravens. Joe Flacco started well, engineering a 59-yard touchdown drive at the end of the first quarter. However, he was 0-of-10 with an interception in the second quarter, and he didn't complete a pass until the final period. ",
            "4": "Only two Ravens caught at least two passes: Ed Dickson (4-45) and Ray Rice (2-64). Rice also had 66 yards and a touchdown on 25 attempts. Torrey Smith, meanwhile, had just one catch for a single yard. Smith had a potentially long touchdown in the first half, but Flacco missed him deep. ",
            "5": "Not that this really affected the outcome, but this game featured some very shady officiating in Baltimore's favor. The refs missed a blatant roughing-the-punter penalty. Plaxico Burress was also hit way late out of bounds on one play, but there was actually a call against Burress for a face mask for a simple stiff-arm to the face. Most prominently, one of Sanchez's strip-sixes was definitely a forward pass. Rex Ryan was so irate by the call that he used a timeout just to yell at Mike Carey. There was a ton of sharp money Sunday morning on the Ravens. If those botched calls had an impact on the result, I'd suggest that Carey, who also made sure Green Bay covered last week, was perhaps influenced by outside sources. But no, that couldn't possibly happen, could it? "
        }
    },
    "numberOfGames": "14"
}