{
    "year": "2011",
    "week": "14",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Let's get through this abomination of a game quickly. The Colts had just four first downs and 59 total yards of offense through three quarters, as this contest was essentially over when Baltimore went up 17-0 in the first half. Indianapolis had a couple of chances to cover because of Baltimore turnovers in the fourth quarter, and like last week, Dan Orlovsky beat the spread - doing so on the final play of the game. Unlike the Patriots, the Ravens didn't decide to leave receivers wide open. They wanted to keep the Colts out of the end zone at all cost. In fact, the crowd was going nuts when their defense made a red-zone stand in the middle of the fourth quarter. ",
            "2": "Joe Flacco went 23-of-31 for 227 yards, two touchdowns and an interception. He had a great game except for that pick, which was a poor decision in the red zone. ",
            "3": "Flacco's score went to Torrey Smith (5-48), who was one of three Ravens to catch at least five balls. The others, as you may expect, were Ray Rice (6-46) and Anquan Boldin (5-57). ",
            "4": "In terms of the ground attack, Ray Rice rushed for 103 yards and a touchdown on 26 attempts. Cam Cameron did a good job of feeding the ball to his best player. Of course, he needs to remember to do this in more important games going forward. ",
            "5": "Orlovsky finished 17-of-37 for 136 yards, one touchdown and an interception, but he wasn't even as good as those poor stats indicate. Like last week, most of his yardage came in garbage time. He also fumbled thrice. Terrell Suggs, who forced all three of them, had three sacks as well. ",
            "6": "The Colts split carries amongst their running backs, but none of them could do anything. Donald Brown led the team with nine attempts for 28 yards. Delone Carter (5-6) was barely over one YPC, but didn't fumble the ball this week. Joseph Addai (2-16) barely got any work. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Texans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "Who the hell needs Matt Schaub when you have T.J. Yates? The fifth-round rookie orchestrated an 80-yard, game-winning drive with about 2:30 remaining and no timeouts. Yates benefited from a pass interference penalty by Pac Man Jones, but what he did in the final 2-and-a-half minutes capped off a brilliant game. He finished 26-of-44 for 300 yards, two touchdowns and an interception to along with 36 rushing yards on five scrambles (including a 17-yard gain on the final drive). The pick was a poor overthrow, but you can also go the other way and point out that Yates should have had a deep completion on the opening drive that was dropped by Jacoby Jones. Another argument is that the Texans probably shouldn't have needed that final possession. Ben Tate fumbled on first-and-goal on the Cincinnati 1-yard line, and the Texans dropped a potential pick-six from Andy Dalton in the first quarter. Houston actually outgained Cincinnati, 412-285. ",
            "2": "What Yates did was incredible when you consider that he didn't have Andre Johnson. Owen Daniels (7-100) and Kevin Walter (6-76, TD) were his top targets. ",
            "3": "I don't want to take anything away from Dalton though, who played well again. He went 16-of-28 for 189 yards and a touchdown. He hooked up five times with A.J. Green for 59 yards, as the rookie wideout once again secured one of his patented jump balls over a defender. Green also drew a deep pass interference penalty on top corner Johnathan Joseph. ",
            "4": "Yates was amazing in the final couple of minutes, but Houston's defense also deserves credit for the comeback. Cedric Benson rushed for 92 yards on 13 carries in the first half. The Texans locked down after halftime though, limiting Benson to one yard on his final eight attempts. ",
            "5": "As for Houston's running game, Arian Foster had just 41 yards on 15 tries. Tate was more effective (8-67), thanks to a 44-yard scamper, but as mentioned, he had that key fumble. ",
            "6": "Oh, and I almost forgot - congratulations to the Texans for making the playoffs for the first time in franchise history! <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jets",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: The Chiefs had four yards of offense in the first half. I have four words for Todd Haley: You sir, are fired.) ",
            "2": "Is it finally time for ground and pound to be a reality again instead of an empty slogan? If this rousing win for the Jets is any indication, yes it is. I'm sure Thomas Jones was hoping this could be his revenge game against his former team, trying to spoil New York's playoff push while also keeping his team's own dimming hopes from flat-lining. Instead, he carried the rock just 5 times for 12 yards as part of a totally inept offensive attack through the first half. I watched an NFL Network show last night detailing a, what else, top-10 list. This one was for southpaw quarterbacks. Suffice it to say Tyler Palko does not have a future spot. Let's just highlight his play on third down, when the offense needed him most. The first nine times on the money down, he threw complete short of the chains four times, was sacked three times, one intercepted and one incompletion, all for obviously no conversions. Palko finally converted with a pass to Dwayne Bowe on the final play of the third quarter with his team behind 35-3. It was an ugly start for the Jets though. They came out for their first play with 10 men, which is not something you see very often. In fact, announcer Dan Fouts has never seen it, and I believe him. After having to burn a timeout, at least, they got the right play called because Shonn Greene (24-129, TD) knifed right up the middle for 31 yards, kick-starting the opening drive. The march covered 77 yards on 11 plays and chewed 6:14 off the clock. Mark Sanchez hit consecutive throws to tight end Dustin Keller for 18 yards, then had a naked bootleg for the touchdown on a well-executed play to take a 7-0 lead. As illustrated above, the Chiefs were unable to do anything on offense, so they were at their opponent's mercy. After a quick exchange of punts, however, a three-and-out did result in a 53-yard field goal by Ryan Succop to pull to 7-3 thanks to nice field position from a Javier Arenas punt return. Ironically, the play that got New York in charge also hurt them. Jets safety Jim Leonhard snagged an interception in plus territory, but injured his knee and is reportedly done for the season. Perhaps it is a case of d?j? vu, since he went down late in 2010, yet the team still rallied to make the AFC Championship Game. New York is going to miss his presence down the stretch, but the turnover led to a quick score. Greene caught a pass and took it 36 yards. After a loss by LaDainian Tomlinson, Sanchez threw to Santonio Holmes for a touchdown and the 14-3 advantage. Then the Jets relaxed and started to really impose their will. Tomlinson and Greene were given three carries each on the next drive with Greene capping the 69-yard touchdown march for a commanding 21-3 lead. The very next drive started at the Kansas City 35 because of a great punt return (26 yards) from rookie wide receiver Jeremy Kerley, who had to return punts in Leonhard's absence. Tomlinson had one of the receiving touchdowns, which was reminiscent of his prime with the Chargers, taking it 19 yards to the end zone, making it 28-3 at the half. There wasn't anything the Chiefs could do after the break, facing a huge deficit. They at least logged a bit of yardage to avoid the poor field position that plagued them in the second quarter, but the Jets went 90 yards for a touchdown to really ice the game. The big plays in that march were all Kansas City penalties. The Chiefs were flagged 5 times for an astounding 81 yards and Sanchez capped the drive with a 3-yard run, and at 35-3, the rout was on. After an exchange of punts, Kansas City's offense finally got something as the game entered the fourth quarter. Palko (16-for-32 195 yards, TD, INT) connected with Steve Breaston and Dwayne Bowe along the way, finishing with a 24-yard score to Jerheme Urban. The scoring was wrapped up when Jackie Battle (10-33) was caught for a safety, making it a 37-10 final. This game was a great illustration of what happens when a struggling offense can't move the ball and the opposing offense takes advantage of field position by cashing in touchdowns. In all, New York mustered up just 314 yards to 221 for the Chiefs, but the outcome was never in doubt. All the Jets had to do was run the ball and keep Sanchez (13-of-21 for 181 yards, 2 TDs) protected from the killer turnover. This is their recipe for success, and running the ball twice as much (42-159) as throwing it makes sense as long as their defense plays like this. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "The Lions are really lucky. They tried their hardest to make enough dumb mistakes to lose this game. In fact, they did so - only the refs didn't spot the last one. There was an unbelievable sequence on the final drive. Down 34-28, Joe Webb was orchestrating an impressive possession, moving his team inside the Detroit 3-yard line. The clock was running down, however, and it looked like the Vikings weren't going to have enough time to do anything. Lions defensive end Cliff Avril took this opportunity to inexplicably jump offsides before Webb could spike the ball, setting up Minnesota at the 1-yard line. The Vikings wouldn't score. Webb fumbled the ball, which was kicked a few times before Detroit mercifully fell on it instead of running it back to cover the spread. The thing is, Minnesota should have had another shot at the 1-yard line; the fumble occurred because Webb was grabbed by the face mask. Unfortunately for the Vikings - or fortunately, because of their draft position - the officials missed the obvious call. ",
            "2": "Webb was so much better than Christian Ponder. The rookie signal-caller went 11-of-21 for 115 yards, two touchdowns, three interceptions and a pair of fumbles. Some of Ponder's passes were really good, but his mistakes were unforgivable. The worst of the bunch occurred on a play-action to no one in the backfield. Ponder rolled right and threw it really late across his body. The FOX play-by-play guy yelled, Ugh! at this happened. Webb, meanwhile, went 12-of-23 for 84 yards and a touchdown. He also had 109 rushing yards, including a 65-yard scoring scamper. Webb showed promise at the end of last season, so Minnesota's decision to spend such a high draft selection on Ponder seems a bit curious right now. I'm not saying Ponder will be a bust or anything, but Webb should have been given a chance, especially with blue-chip quarterbacks like Andrew Luck, Matt Barkley and Robert Griffin presumably available in the <b> </b> ",
            "3": "Despite the quarterback switch, Percy Harvin still had a solid performance, catching a whopping 10 balls for 69 yards and a touchdown. Harvin's emergence as a legitimate No. 1 receiver has been one of the few silver linings for Minnesota this late in the year. ",
            "4": "Toby Gerhart started with Adrian Peterson out. He had another solid outing, gaining 90 rushing yards on 19 attempts. He also had a receiving score. ",
            "5": "As for the Lions, they moved the ball pretty well throughout the entire afternoon. Matthew Stafford went 20-of-29 for 227 yards and two touchdowns, though his receivers dropped a few balls. Brandon Pettigrew (6-57, TD) and Titus Young (4-87, TD) had a drop each, but obviously performed well otherwise. ",
            "6": "What's up with Calvin Johnson? Megatron had a dream matchup against an injury-ravaged secondary that was torched by Demaryius Thomas last week. Megatron caught just three balls for 29 yards, and probably cost thousands of people in their fantasy playoff matchup. ",
            "7": "Maurice Morris was also a major disappointment. With Kevin Smith out, Morris was expected to be a decent flex option, but had just four carries for 13 yards. He suffered a chest injury in the second quarter. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Saints",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The cool thing about this game was a marriage proposal at halftime. The Tennessee cheerleaders were performing some show when a fake Santa came out. The fake Santa took off his hat and beard, got down on one knee and proposed to his cheerleader girlfriend, showing more courage than David Nelson was able to muster about a month ago. Fake Santa made a great decision because the cheerleader is hot and thus obviously has a great personality. ",
            "2": "The crappy thing about this game - if you bet on Tennessee, that is - was the final drive. Jake Locker was mostly impressive in leading Tennessee down the field, but the clock management was ridiculously bad. The Titans had no timeouts, yet they called a running play with less than a minute remaining. Later in the possession, when Tennessee was inside the New Orleans 5-yard line, Locker took a sack, which ended the game. There wasn't any time left on the clock, but he still should have thrown the ball into the end zone. It was simply a rookie mistake. ",
            "3": "Locker was in the game because Matt Hasselbeck (5-of-7, 44 yards) injured his calf on a non-contact play in the second quarter. Locker performed really well, going 13-of-29 for 282 yards and a touchdown, along with 36 rushing yards and a score on the ground. Locker has played well enough in two games against playoff teams (Falcons, Saints) to give his fans optimism. In fact, I would start Locker for the rest of the year because Hasselbeck has been pretty mediocre, despite what Chris Berman says about him being the best free-agent acquisition this past summer. ",
            "4": "The other notable thing about this contest was all the penalties. The teams combined for a whopping 15 infractions prior to intermission (19 in total). The first half was ridiculous. It seemed like there was a false start on every drive. In fact, Tennessee had a 1st-and-35 at one point because of consecutive false start, holding and illegal block penalties. ",
            "5": "The Saints probably should have won this game by a wider margin. They had 60 more total yards and won the time-of-possession battle by 15 minutes. All the penalties were a killer though for Drew Brees, who went 36-of-47 for 337 yards and two touchdowns, both to Marques Colston (7-105). Brees should have had a third score to Jimmy Graham (5-55), but the refs incorrectly ruled him out, even after a replay review. ",
            "6": "It definitely helped New Orleans that Chris Johnson sucked yet again. He rushed for just 23 yards on 11 carries against a team that is abysmal against the run. CJ20 caught five balls for 43 receiving yards, but he also dropped an easy screen pass that looked like it was going to be a huge gain. ",
            "7": "Locker loved throwing to Nate Washington, who hauled in six catches for 130 yards and a touchdown despite a bum ankle. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Dolphins were one of the hottest teams entering this weekend. The Eagles, meanwhile, were pronounced dead after embarrassing themselves at Seattle last Thursday. Naturally, Miami would win, right? That seemed to be the case early on. QB Dog Killer tossed a near interception and was getting sacked on every possession by Jason Taylor; the Eagles had a blocked punt go against them; and Matt Moore threw a beautiful touch pass to Brandon Marshall (4-27, TD) to give the Dolphins a 7-0 lead. And then all hell broke loose. Or rather, things reverted to what people expected back in September. The Dolphins spent the rest of the first half turning the ball over. They had as many give-aways (3) as first downs. The Eagles, meanwhile, had 13 first downs, as QBDK hooked up on multiple long gains to DeSean Jackson (4-59, TD) and LeSean McCoy. ",
            "2": "McCoy carried the ball 27 times, which will make Eagle fans happy. However, McCoy had just 38 yards (though with two touchdowns). He also had three catches for 33 receiving yards. ",
            "3": "As for QBDK (15-of-30, 208 yards, TD, INT), it was an up-and-down afternoon. He made some great throws that Vince Young would have tossed for interceptions. On the other hand, QBDK could have easily been guilty of three picks. His one interception was horrible, as he heaved a pass across his body in the third quarter. ",
            "4": "Moore, meanwhile, was worse. He went 11-of-19 for 95 yards, the aforementioned touchdown to Marshall, and an interception. He also lost a fumble. Moore was pulled in favor of J.P. Losman (6-of-10, 60 yards) because of a concussion. Part of the reason Moore had been so good in recent weeks was that his pass protection improved. That was far from the case today, as Miami's front surrendered a whopping nine sacks. ",
            "5": "Moore's poor outing didn't stop Reggie Bush from having a good game. Bush rushed for 103 yards on just 14 carries. He also caught five balls for 27 receiving yards. ",
            "6": "I mentioned Taylor before. His two sacks moved him ahead of Richard Dent for sixth all time in sacks. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "27"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: As Charlie writes below, there's no way the Patriots are going to win a postseason game if they keep playing crap defense like this. You can't allow Rex Grossman to continuously march down the field without Fred Davis and his left tackle. Horrible.) ",
            "2": "In a hard-fought game, the Patriots struck first with a defensive score. Defensive end Andre Carter sacked Rex Grossman in the end zone and caused a fumble that was recovered by Vince Wilfork for a touchdown. The Redskins answered with wide receiver Donte' Stallworth beating cornerback Devin McCourty for a 51-yard reception on a go route downfield. It was a great thrown from Grossman to drop the ball in to Stallworth and set up a field goal. New England tight end Ron Gronkowksi made an amazing 50-yard reception where he broke about five tackles to get downfield. It set up a touchdown pass from Tom Brady to Gronkowski, writing new a record for touchdowns from a tight end in a season. It was the start to a massive game from Gronkowski. Washington answered with some good runs from Roy Helu and a touchdown strike from Grossman to Jabar Gaffney. Down 14-10, the Redskins pulled off a gadget play. On a reverse to wide receiver Brandon Banks, Santana Moss broke open running downfield. Banks launched a ball up and it fell into Moss for a 49-yard touchdown. New England then got two field goals, but Washington followed that by kicking one to make it 20-20 at halftime. In the third quarter, Brady and Gronkowski hooked up for a beautiful touchdown. After a big pressure, Brady lofted the ball over Gronkowski's shoulder. He caught the ball just past the line of scrimmage and shed a tackle from Ryan Kerrigan to break down the field for a 37-yard touchdown. The Redskins tied it up with a quality drive by Grossman and Helu. It ended in a six-yard touchdown pass to David Anderson. The Patriots got the game-winning score on a 24-yard touchdown pass from Brady to Wes Welker. In the fourth quarter, each defense gave up more yards but caused timely turnovers to keep the offenses from scoring points. A touchdown pass from Grossman to Moss was called back on a push-off penalty by Moss. The veteran coughed up a pass that was intercepted by Jerod Mayo to seal the Patriots' win. Brady finished the game 22-of-37 for 357 yards and three touchdowns with one interception. The interception by Josh Wilson came in the end zone and led to a huge shouting match on the sideline between Brady and coach Bill O'Brien. Welker (7-86) and Gronkowski (6-160) were too much for Washington's secondary to contain. Grossman was 19-of-32 for 252 yards with two touchdowns and an interception. Helu (27-126), Stallworth (4-96), Moss (3-81) and Gaffney (6-92) all had good games against the New England defense. The Redskins' offensive line did well in run blocking, but their pass blocking needs to improve. Carter had another good game for New England. The Patriots' defense has to up their game down the stretch, or the team could make a quick postseason exit. The secondary stinks. When New England faces better teams in the playoffs, they could get killed through the air. If the Redskins' offense can roll up yards (463) and points, then the Patriots have to worry about taking on a balanced team like the Steelers, or if they somehow make it to the Super Bowl, a team like the Packers or the Saints. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "When the Panthers were up 23-7 in the first half, I posted on the forum, Carolina's up 16. If I had seven units on them, they would lose by 14. I'm glad I didn't bet seven units on the Panthers! It's hard to believe that Carolina stopped scoring after its early offensive explosion. Cam Newton tossed two ugly interceptions after the break, allowing the Falcons to make their comeback and cover the three-point spread. The complete 180 (or 360, as Emmitt would say) was remarkable. Carolina outgained Atlanta in the first half, 245-117, while the Falcons had the yardage edge after the break, 277-171. ",
            "2": "I gave Matt Ryan a lot of grief last week for performing poorly - and he did - but I'll give him credit for what he did at Carolina. Ryan went 22-of-38 for 320 yards and four touchdowns. His completion percentage would have been a lot better if it wasn't for all the drops. Julio Jones himself had what seemed like a billion drops in the third quarter. Jones would make up for it though with a pair of touchdowns (17, 75 yards) that gave the Falcons the lead and cover in the fourth quarter. The Falcon rookie receiver made three receptions in total for 104 yards and those scores. Roddy White (84 yards, TD) and Tony Gonzalez (7-82) both hauled in seven grabs. ",
            "3": "Michael Turner had a bit of a disappointing game considering the opposition. He rushed for 76 yards on 21 attempts. ",
            "4": "The Panthers also struggled to run the football. DeAngelo Williams broke off a 74-yard touchdown in the second quarter, but did nothing otherwise (7-87). The same can be said for Jonathan Stewart (8-29). ",
            "5": "Newton was also limited on the ground; he rushed for only 36 yards to go along with his average passing numbers (19-of-39, 276 yards, 2 TDs, 2 INTs). The rookie signal-caller was really erratic in the second half. In addition to those aforementioned picks, he had major trouble with his accuracy, mechanics and reads. He still gave the Panthers a chance to win though, but Olindo Mare whiffed on a 36-yard chip-shot field goal to give his team the lead in the middle of the fourth quarter. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: A great loss by the Buccaneers. They were up 14-0, but gave up the lead because they decided to committ turnovers every five minutes. So, in a sense, they proved that they were superior to Jacksonville but were able to improve their draft position. Great work.) ",
            "2": "Blaine Gabbert was God awful to begin the game. In the first quarter, he threw a terrible interception to Ronde Barber, and fumbled the ball on a sack by Adrian Clayborn. The Tampa Bay offense did enough to take a 14-0 lead with touchdown runs from LeGarrette Blount and Josh Freeman. Buccaneers punt returner Preston Parker kept the Jaguars in the game with two fumbled punts, one of which was returned for a touchdown. Finally, Gabbert made a play in the second quarter. Mercedes Lewis burned safety Sean Jones downfield for a 62-yard pass. Lewis' big catch set up a short touchdown run from Maurice Jones-Drew. After the score, a holding penalty on Parker pushed Tampa Bay back to its own 11-yard line. Jacksonville defensive end Jeremy Mincy and outside linebacker Daryl Smith put on a great tandem rush that produced a sack-fumble at the goal line. Defensive tackle Nate Collins recovered the fumble in the end zone to give the Jaguars a 21-14 lead. Mincy had a phenomenal game against Buccaneer left tackle Donald Penn. With a minute remaining before halftime, Freeman threw a terrible interception to former Tampa Bay cornerback Ashton Youboty. That set up a short touchdown pass from Gabbert to Jones-Drew with only a few ticks left until the half. In the third quarter, Freeman had a pass deflected off a defensive lineman's helmet and it was intercepted by Paul Posluszny. Gabbert made a couple good plays, but then blew an opportunity to break the game open by throwing a stupid interception in triple coverage in the end zone to linebacker Mason Foster. The Buccaneers gave it right back. An amazing run by Blount ended with him fumbling the ball away. Early in the fourth quarter, the Jaguars put a good drive together and Gabbert capped it with another touchdown pass to Jones-Drew. Later on, Jones-Drew scored his fourth all-purpose touchdown of the afternoon with a short run. He rushed for 85 yards on 27 carries and caught six passes for 51 yards and the four scores. Gabbert had the best game of his rookie season, completing 19-of-33 for 217 yards with two scores and two interceptions. The Jacksonville defense played excellent football for the final three quarters, totaling five turnovers, and the Jaguars' special teams caused two turnovers for a total of seven takeaways. Tampa Bay had a meltdown performance, making one of the worst quarterbacks and worst offenses in the NFL look good. The Buccaneers have lost back-to-back games in convincing fashion to three-win teams. Tampa Bay's seven-game losing streak is proof they lack the talent to compete on a weekly basis. They entered Sunday having spent more time playing from behind than any team in the NFL, and their defense struggles to stop anyone. It looks like Tampa Bay is making a run at a top-five pick. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "19"
        },
        "comments": {
            "amount": "5",
            "1": "I was pretty pissed off about this game throughout most of the entire afternoon. I picked the Cardinals to cover 3.5 points because their defense has been playing really well lately, and Kevin Kolb, unlike John Skelton, wouldn't telegraph his passes. Skelton had this issue in a loss at San Francisco back in Week 11. Arizona performed well otherwise in that contest. So, what happened? Kolb suffered a head injury on the opening drive. I thought Skelton would cost his team the game again, and that seemed to be the case when the Cardinals were able to muster just two first downs in the opening half. Well, apparently not. Skelton was solid in relief. He made a couple of bad decisions on a pair of interceptions, but was good otherwise, going 19-of-28 for 282 yards, three touchdowns and the picks. He also showed great mobility, picking up 25 yards on six scrambles. Skelton's second interception was actually challenged by Whisenhunt even though it was painfully obvious that the play wasn't going to be overturned. Whisenhunt should probably be stripped of his red flags because he tried to have yet another clear call reviewed earlier. It was actually a good challenge, but only by accident. The red flag disrupted a San Francisco fake punt that caught Arizona unawares, but the 49ers weren't docked a challenge because the replay equipment malfunctioned for some strange reason. ",
            "2": "Larry Fitzgerald has to be a happy man. He hauled in seven grabs for 149 yards and a touchdown, as Skelton did a great job of finding him downfield for a couple of long gains. Early Doucet (3-73) and Andre Roberts (2-8) had the other scores. ",
            "3": "The 49ers still haven't surrendered a rushing touchdown this year. Chris Wells was limited to only 27 yards on 15 attempts. ",
            "4": "Alex Smith has a number of fourth-quarter comebacks in his career, but couldn't get it done at Arizona. He finished 18-of-37 for 175 yards. You can't really blame him for everything though. There were some drops, while the pass protection was abysmal. He was sacked by five different Cardinals. ",
            "5": "Niner Fantasy stuff: The good was Frank Gore (10-72), who found the end zone on a 37-yard burst. The bad was Michael Crabtree (7-63), who was mediocre in non-PPR formats. The ugly was Vernon Davis (1-32). "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Broncos lost. They lost. After a failed onside kick attempt where the ball seemed to hang in the air for 10 seconds, all the Bears had to do was run the clock out, and the game would be over. Tim Tebow would get possession on his own 20 with about 15 seconds remaining, and not even God himself could give Denver a victory at that point. Well, God couldn't, but Marion Barber could. Matt Forte's replacement idiotically ran out of bounds, giving Tebow 40 more seconds to work with. That was all the time he needed. Tebow drove his team down the field and set up Matt Prater with a game-tying 59-yard field goal with just a couple of seconds remaining on the clock. And if that wasn't enough, Chicago somehow found itself in field goal position in overtime. Barber, of course, coughed it up again. Minutes later, Prater drilled yet another 50-yarder for the win. ",
            "2": "It'll be interesting to hear the excuses from Merril Hoge, Cris Carter and Bomani Jones this week. Tebow was 18-of-24 for 191 yards and a touchdown in the fourth quarter and overtime against a great Chicago defense, which should perhaps dispel the ESPN-contrived notion that he can't pass. Tebow's numbers through three quarters were ugly (3-of-16, 45 yards, INT), but he was really hurt by half-a-dozen drops, including one by Demaryius Thomas (7-78, TD) that would have been a 60-yard touchdown had the ball not gone right through his hands. Eric Decker (3-33) also had a pair of drops that would have went for double-digit gains. ",
            "3": "Tebow led the team in rushing with 49 yards on 12 scampers. Chicago did a great job of limiting the ground attack with Julius Peppers and the great linebackers. Willis McGahee managed only 34 yards on 17 attempts. ",
            "4": "Barber, conversely, ran the ball well aside from those two gaffes. He gained 108 yards and a touchdown on 27 attempts. Denver's defense really missed Brian Dawkins, who left the game with a neck injury. ",
            "5": "If Chicago fans want to find a silver lining, it's that Caleb Hanie didn't turn the ball over, though he came very close when Chris Harris dropped a routine interception. Hanie went 12-of-19 for 115 yards, but took four sacks because Mike Martz had him take too many seven-step drops yet again. ",
            "6": "Only four Bears caught passes: Johnny Knox (3-37), Barber (2-32), Khalil Bell (5-24) and Roy Williams (2-22). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "46"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "16"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: The Raiders have gone down 34-0 in consecutive weeks. You have to wonder if the Rolando McClain arrest had a huge impact on this team. Greg Jennings, meanwhile, might have an MCL tear and could be out for a while. But if there's any team that knows how to play through injuries, it's the Packers.) ",
            "2": "Was I watching a replay of Super Bowl II? It sure felt like it. The Packers came out and simply overwhelmed the visiting Raiders, who were at a track meet without their fastest runners and had no chance of keeping up. At the outset, Oakland's offense moved down the field with consecutive throws to Chaz Schilens and Darrius Heyward-Bey covering 30 yards to enter Green Bay territory. The visit would be short-lived, as two plays later D.J. Smith got the first of the four interceptions Carson Palmer tossed on the afternoon. Aaron Rodgers had a poor showing, relatively speaking, on the stat sheet (17-of-30 for 281 yards, 2 TDs, INT) and had a QB rating below triple digits for the first time in a long time. However, he was on fire when it came to drawing the defense offsides, which slowed down the pass rush. Rodgers did it on the opening play, and the first official play from scrimmage was a 47-yard touchdown romp by Ryan Grant (10-85, 2 TDs). The Packers had a brilliant game plan and were smart enough to take advantage of a porous run defense by utilizing Grant, who is finally healthy. After Green Bay forced a punt, Rodgers quickly showed why he is the MVP of the league, directing a 10-play, 80-yard scoring drive and distributing the ball to five different receivers. The touchdown went to rookie tight end Ryan Taylor who had not caught a pass yet entering today's action. I'm pretty sure while preparing for this game, Oakland's defense was more concerned about stopping any number of other weapons, and quite frankly, they did not let any one particular player hurt them. However, the problem remains that even with no player catching more than four passes and only Jordy Nelson (81 yards) and Donald Driver (75 yards) exceeding 50 yards receiving, all Rodgers does is find the open man and move the ball down the field. It was really a rinse-and-repeat situation for the next several drives. The Raiders went nowhere and the Packers kept scoring. First, Green Bay settled for a field goal on a drive wrecked by penalties to make it 17-0 early in the second quarter. Then they took what they wanted on a quick 84-yard drive covering just six plays. Two passes went to Driver for 28 yards, and the bookend completions were to Nelson who got loose down the sideline for a 37-yard score to start the bloodbath. Well, the rout was really on when Oakland's next drive ended early on a Charles Woodson interception in a clear case of Heisman-Trophy-winner-on-Heisman-Trophy-winner abuse. The Packers took advantage of a long penalty to set up first-and-goal from the 6, and Grant ran it in for a commanding 24-0 advantage. The first stop of the day for the Raiders came when Mike Mitchell took the ball away from Jermichael Finley in the end zone for an interception. The shutout was almost broken up, but after going 66 yards, Palmer connected with Rob Francois on another interception. The second half was just a matter of Green Bay holding on and staying healthy. The drives that mostly ended in touchdowns earlier in the afternoon were limited to field goals in the third quarter, but the points made sure the game stayed well in hand, allowing them to rest Rodgers for the fourth quarter. Meanwhile, Oakland finally got on the board on its first possession of the second half via a very effective 80-yard march with all nine plays going for positive yardage highlighted by a 34-yard pass to Heyward-Bey (5-78). Michael Bush (23-78, TD) finished the drive with a two-yard scoring run. Even though the Packers' offense was less potent, the defense picked up the slack, scoring when Marcel Matchup Nightmare Reece fumbled and Erik Walden housed the recovery to make it 43-7 entering the fourth quarter. Matt Flynn mopped up, and it was a good thing because he was nailed for a safety, and keeping Rodgers healthy is obviously a priority as this team marches towards history. The Raiders took the ensuing possession down the field for another garbage touchdown with Palmer (24-of-42 245 yards 1 TD 4 INT) hitting Kevin Boss for the five-yard score and 46-16 final. Along the way, Oakland got to relive the tuck rule when Rodgers appeared to fumble and Kamerion Wimbley returned it for a touchdown. Well not really, because a clip would have negated it anyway. However, the fumble was ruled an incomplete pass because Rodgers was tucking the ball back in. I'm sure Woodson, who forced that now infamous non-fumble when he was with the Raiders, had to be chuckling when the referee uttered the word tuck after returning from the replay booth to overturn the call. Also of note, Rodgers had a little extra motivation for this one dating back to his college days. He is still bitter about his California Bears being stiffed for a Rose Bowl berth in favor of the Texas Longhorns. Current Raider Michael Huff wore the burnt orange for the team that benefitted from that gross BCS injustice, and it must have been fun for Rodgers to run up the score here even if there were no voters to impress. All of this fluff ties in actually. Woodson and Huff were both first-round Oakland draft picks. They do love to take defensive backs early don't they? Another, Fabian Washington, was the player they took instead of Rodgers in 2005. The funny thing is, he didn't technically fall to him that season. They actually traded up to No. 23, at which time I called my brother, a California alum, to gloat about my Raiders finally getting a franchise quarterback out of the draft. Instead the choice was Washington and, of course, one pick later, the Packers took Rodgers. Two rounds later, the Raiders did land Andrew Walter, who was naturally awesome, and is now out of the league. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "You have one team peaking as usual in December. You have another in the middle of yet another late-season swoon. What kind of idiot would pick the latter to win this game? Ryan Fitzpatrick received a big contract about two months ago, but it should be no surprise if the Bills part ways with him this offseason. I don't think it'll happen, but it shouldn't shock anyone at this point because he's been so dreadful. Fitzpatrick went 13-of-34 for 176 yards and two interceptions. His first pick was a joke. He panicked in the pocket and fired a ball right at the back of a Charger defender. It then ricocheted into the arms of Eric Weddle. ",
            "2": "It wasn't all on Fitzpatrick though. He sucked, but it didn't help that Steve Johnson had more drops. Johnson, however, will not be the scapegoat this week because he hauled in four catches for 116 yards. ",
            "3": "The running game once again wasn't utilized enough. C.J. Spiller had just 12 attempts for 46 yards. He also had only three receptions for 10 more yards. ",
            "4": "The Chargers, meanwhile, trampled Buffalo's pathetic defense, as Ryan Mathews piled up 114 yards on just 20 attempts. Unfortunately for Mathews' owners, Mike Tolbert (6-21, TD) vultured yet another goal-line carry. ",
            "5": "I don't know if it's because he has all of his weapons back, or the fact that he keeps playing crappy defenses, but Philip Rivers was really sharp for the second week in a row. He went 24-of-33 for 240 yards and three touchdowns. He also had a rare rushing score, but that was wiped out by a hold. Rivers' only blemish was a weird unforced fumble where the ball slipped out of his hands and was recovered in the end zone by Buffalo. ",
            "6": "Two of Rivers' scores went to Antonio Gates (7-68). The other was to Patrick Crayton (3-37). Vincent Jackson (5-55) and Mathews (6-34) were also major factors in the aerial attack. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Giants",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "34"
        },
        "comments": {
            "amount": "6",
            "1": "If Dallas rookie kicker Dan Bailey ever has some time off, he may visit Roger Goodell's office, or at least put a flaming bag of dog poop on the commissioner's porch. I don't think anyone wants this lame icing the kicker rule banned more than Bailey at this point. At least Jason Garrett wasn't the one to freeze his kicker this time. It was Tom Coughlin, who called for a timeout milliseconds before the ball was snapped and Bailey drilled a 47-yard game-tying field goal. On the next attempt, second-year end Jason Pierre-Paul blocked the kick to seal the victory for the Giants. Pierre-Paul had eight tackles, two sacks, a forced fumble and the block. As Cris Collinsworth opined, Pierre-Paul needs to be in the Pro Bowl. Unfortunately, he wasn't on the ballot the last time I checked. ",
            "2": "Eli Manning's fourth-quarter performance was incredible. Down 34-22, Manning led his team to two touchdowns in the final four minutes. He went 27-of-47 for 400 yards, two scores and an interception. The pick was a fluky tip that wasn't Manning's fault, though he could have had another interception much earlier when Terence Newman dropped a gift pick-six. Still, Manning was once again unbelievably clutch in crunch time, as he's been for most of this year. Despite all the preseason jokes, he is definitely in elite category. ",
            "3": "Manning is downright scary with all of his receivers. Hakeem Nicks (7-154) and Victor Cruz (7-83) saw most of the targets, though the latter had a couple of drops and a bone-headed personal foul penalty after a score. Mario Manningham (2-62) caught a touchdown in his return from injury, but also dropped a second end-zone ball on New York's final drive. Fortunately for the Giants, they would score later in the possession. ",
            "4": "My condolences if you started Ahmad Bradshaw. The fantasy RB2 was a game-time, first-half scratch because he violated some sort of team rules. Brandon Jacobs saw most of the work and was a bulldozing maniac (19-101, 2 TDs). Bradshaw saw some action after intermission, but barely did anything (8-12). ",
            "5": "Dallas' running back situation was more unfortunate. DeMarco Murray looked like he was going to have a huge game when he tallied 25 yards on five carries. Unfortunately, he broke his ankle and is out for the year. Felix Jones stepped in and performed like I thought he would when he stood out during the preseason. Jones gained 106 yards on 16 attempts to go along with six catches for 31 receiving yards. Oh, what could have been... ",
            "6": "Tony Romo also had a great evening. He went 21-of-31 for 321 yards and four touchdowns. He hit Laurent Robinson (4-137, TD) and Dez Bryant (1-50, TD) on 74- and 50-yard bombs, respectively, as the Giants made critical mistakes in coverage. Romo nearly hit Miles Austin-Jones (4-63, TD) to ice the game, but overthrew him by a few inches. Romo had to release the ball a bit early because of pressure, but as Trent Dilfer correctly pointed out, Austin-Jones lacked a second gear coming off a hamstring injury. "
        }
    },
    "numberOfGames": "14"
}