{
    "year": "2011",
    "week": "11",
    "Game 1": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "8"
        },
        "comments": {
            "amount": "7",
            "1": "Man, the Bills players must not like Ryan Fitzpatrick very much. Fitzpatrick was 9-of-21 for 101 yards and two interceptions in the first half - I'm listing those stats because the rest of his numbers were compiled in garbage time against a prevent defense - but he was not responsible whatsoever for those picks. Both popped out of his receivers' hands, with Brad Smith and David Nelson committing the errors. Last week, I sent Notre Dame receiver Michael Floyd to Buffalo in my <b> </b>. I think that selection will remain the same for a while. ",
            "2": "Fitzpatrick was able to finish 20-of-39 for 209 yards and those two picks. His leading receivers were a tight end in Scott Chandler (5-71) and a running back in Fred Jackson (5-50). Steve Johnson, who was playing hurt, barely did anything (2-16). ",
            "3": "Speaking of Jackson, he couldn't run the ball whatsoever against Miami's surging defense. Jackson rushed for 17 yards on seven carries. ",
            "4": "While Buffalo's offense struggled - the team had just six first downs in the opening half - the Dolphins couldn't be stopped. They moved the chains 13 times prior to intermission, as Matt Moore was a sterling 14-of-20 for 160 yards and three touchdowns. Moore's progression from what we witnessed against the Jets in that Monday night contest to what we're seeing now is remarkable. The Dolphins are winning themselves out of the Robert Griffin, Matt Barkley and Landry Jones sweepstakes, but they won't need any of those quarterbacks if Moore keeps playing this way. Of course, this strategy didn't exactly work out for the Panthers a couple of years ago. ",
            "5": "Moore's touchdowns went to Charles Clay (4-69), Davone Bess (2-25) and Anthony Fasano (2-8). Brandon Marshall made just one catch for five yards, but had a score wiped out after a booth review. ",
            "6": "Reggie Bush also found the end zone. He and Daniel Thomas each had 15 carries, with the latter outgaining the former, 50-32. ",
            "7": "Epic gambling moment: The Dolphins took a safety toward the end of the game after taking over on downs at their own 1-yard line. The seemingly insignificant two points would push the total (43). "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "So, all you have to do is run the ball, eh? Ray Rice had just six carries at halftime (17 yards), while Joe Flacco threw the ball 19 times in the same span amid a close contest. Cam Cameron seemed to be up to his old tricks, so someone must have threatened him during intermission because Baltimore came out running. A 59-yard scamper later, and the Ravens were able to kick a field goal after stalling inside the Cincinnati 5-yard line. The three points made it a two-possession game, which, at the time, seemed to put this game away for Baltimore because the Bengals had issues moving the chains. ",
            "2": "Andy Dalton definitely didn't look like himself early on with A.J. Green out of the lineup. This was extremely apparent when Dalton attempted a 45-yard heave into the end zone during the second quarter. Green caught such a pass for a touchdown against the Steelers, but Andre Caldwell didn't have nearly as much success. Ed Reed picked off the pass. However, Dalton caught fire in the fourth quarter and was able to finish 24-of-45, 373 yards, one touchdown and three interceptions. He made some really great throws and was a Calvin Johnson rule away from tying the game. The Bengals lost both contests against Baltimore and Pittsburgh, but their fan base really has to be thrilled with Dalton. He's just going to get better. ",
            "3": "Dalton's one score went to Caldwell (3-63), but Jerome Simpson was the one who picked up the slack in the wake of Green's absence. Simpson hauled in eight balls for a whopping 152 yards. ",
            "4": "As for the Ravens, Flacco continued to be inconsistent. He led the Ravens to just one first down in the first quarter and had a botched handoff with his running back. The offense as a whole just looked really sloppy. But in the ensuing quarter, he started connecting on deep bombs to Anquan Boldin and Torrey Smith. Flacco's success wouldn't last, however. He fired an ugly interception right before halftime. But when things looked bleak, he hit Torrey Smith (6-165, TD) for a perfect 38-yard touchdown strike. ",
            "5": "Rice finished with 20 carries and was able to churn out 104 rushing yards and two scores. He also caught five balls for 43 receiving yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "This game looked pretty bleak for the Browns early on. The Jaguars scored first after holding the ball on a very impressive 10-minute touchdown. When Maurice Jones-Drew found the end zone, the crowd furiously booed, and it didn't get any better afterward when Cleveland went three-and-out on the ensuing drive. However, the Browns got on track after that and were able to move the chains pretty consistently in the second half, mostly on the ground. Chris Ogbonnaya rushed for 115 yards and a touchdown on 21 carries despite the fact that the Jaguars were eighth against the rush (3.9 YPC) heading into this contest. A barrage of injuries to Terrence Knighton, Matt Roth and Clint Session really helped. ",
            "2": "Colt McCoy played pretty well too. He went 17-of-24 for 199 yards, one touchdown and a poor interception in the red zone where he didn't see safety Dawan Landry. Still, it was a quality performance considering how good Jacksonville has been against the pass this season. Granted, cornerback Rashean Mathis was out, but the Browns will take it. ",
            "3": "Only a pair Cleveland players had more than two receptions: Greg Little (5-59) and Joshua Cribbs (3-20). The latter scored McCoy's sole touchdown. ",
            "4": "As for the younger quarterback, Blaine Gabbert was 22-of-41 for 210 yards. That's a pretty nondescript stat line, but Gabbert was pretty bad. Sure, he hit a few nice throws and led a nice final drive, but most of his passes seemed to sail in random places, as he constantly missed open receivers. He could have heaved a couple of interceptions, including one where Joe Haden dropped what should have been an easy pick. ",
            "5": "You have to wonder why Gabbert had 41 attempts to just 21 Jones-Drew carries when the Browns established their first and only lead in the fourth quarter. And it's not like Jones-Drew was bottled up; he had 87 yards and the aforementioned score. Jones-Drew also caught four balls for 31 receiving yards. The leader in both categories for Jacksonville was Marcedes Lewis (7-64), who actually did something for a change. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "21"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: You really have to wonder how this game would have gone had Adrian Peterson not gotten injured. As you may know, Peterson went out with an ankle injury when the Vikings were up 7-3. Not that they would have necessarily won the game, but his absence completely ruined Minnesota's game plan.) ",
            "2": "The schedule can be a tricky puzzle. One quirk for the Raiders is that this was their first game against the NFC. They will play the rest of the North division (Chicago, Green Bay and Detroit) over the next four weeks, including a Dec. 11 tilt at Lambeau Field. I point this out because just when they have gained control of the AFC West lead, now they have to muscle up against a very competitive division, battling three teams contending for playoff spots as opposed to teams who have mailed in their season. The Vikings could have done just that in this game, but to their credit did not - even when their star running back Adrian Peterson left injured late in the first quarter. A limited Sebastian Janikowski sent the opening kickoff short, and Percy Harvin set up the Vikings in good field position at their 32-yard line. However, left tackle Charlie Johnson forgot that false starts are for visiting teams indoors. The loss was crucial as a pass on 3rd-and-5 to Kyle Rudolph came up a yard short. After a good punt backed the Raiders up, the defense gave up a first down then killed Oakland's first drive with a sack by Chad Greenway. Christian Ponder (19-of-33 for 211 yards 2 TD 3 INT) has a chance to be a good player and his scrambling ability is a big reason why. He ran five times for 71 yards in the game, but came up on the short end because the pass rush was effective in getting him out of rhythm. The Raiders came up with five sacks even with Richard Seymour out of the lineup; not to mention Matt Shaughnessy sitting on injured reserve. Tommy Kelly had the first drive stopped with a sack, but clipped Ponder's face mask while taking him down for a 15-yard penalty. Another personal foul, this one a questionable call on linebacker Aaron Curry, who merely hit Rudolph squarely after a short gain, set up the Vikings in plus territory. Harvin had a sweet 35-yard touchdown run negated by a hold on wide receiver Michael Jenkins, but the drive still ended with a score thanks in part to another 15-yard penalty on Oakland's defense, this one a face mask on Tyvon Branch. Adrian Peterson's 12-yard run made it 7-0 on a drive that covered 77 yards including 45 on defensive penalties, which you knew if you read this paragraph carefully. The Raiders' offense took over with 5:07 left in the first quarter at their own 45-yard line after a great return by speedy rookie running back Taiwan Jones. Three consecutive drives would start close to midfield starting with this one, and all of them resulted in scores. This is when the Silver and Black took this game by the throat, and they needed all of the lead they built up. The first march ended in a field goal and was highlighted by a 20-yard run by Marcel matchup nightmare Reece who ran six times for 45 yards on the game and caught two passes for 16 yards. Leading 7-3, Minnesota was backed up when Desmond Bryant sacked Ponder. Peterson ran up the middle for 12 yards, but left injured. Ponder's long run of 28 yards converted the third down, but this was clearly a turning point as the first quarter ended. Former Heisman runner-up Toby Gerhart ran seven times for just 18 yards in relief of All Day and did not take advantage of a defense giving up a lot of rushing yards this season. On 3rd-and-5 from the Oakland 21, Ponder was intercepted by Matt Giordano on a pass intended for Harvin, who was the only consistent offensive threat for the Vikings. He ran five times for 21 yards and caught six passes for 73 yards and the aforementioned touchdown. The big return by Giordano led to another short field and the Raiders marched right down it. When they were finally forced to third down, Carson Palmer hit oft-injured wide receiver Chaz Schilens for an 11-yard touchdown to give Oakland a 10-7 lead. They would never trail again. Minnesota took advantage of another short Janikowski kickoff and quickly drove to scoring range, but botched a field goal attempt. Michael Bush (30 carries for 109 yards) started and finished the subsequent drive with short runs, the latter of which went for a touchdown putting the Raiders ahead 17-7. A fumble on the kickoff by Lorenzo Booker was recovered by rookie cornerback DeMarcus Van Dyke and really left the Vikings in trouble with just 1:20 remaining in the half. Oakland worked down to the 1-yard line after burning their remaining timeouts and faced a third down. Hue Jackson went for the throat and called a quarterback sneak. Palmer delivered for a 24-7 halftime lead. After the break, the Raiders' offense was a mess, repeatedly coming up short. Fortunately, the defense was able to stop Minnesota consistently in the third quarter. The biggest play was an interception by Kelly, the defensive tackle's first in his career, to put them on a short field. After one first down, however, the drive ended with another Janikowski field goal for a 27-7 lead. Minnesota could have given up here, but struck for a big play covering 42 yards to Devin Aromashodu, and on the first play of the fourth quarter, made it 27-14 on a screen pass that Harvin took to the house, covering 26 yards. Oakland answered with a drive that ended on a scary play when wide receiver Darrius Heyward-Bey lay motionless after coming up short on a third-down reception. Janikowski's field goal was blocked and Heyward-Bey left the game. Another solid Vikings' drive was snuffed when Stanford Routt picked off a hasty Ponder pass into the end zone on third-and-goal. They were still in it, however, when a fourth consecutive run by Bush ended in a fumble recovered by Brian Robison. Ponder quickly hit tight end Visanthe Shiancoe for 37 yards and then found Rudolph for the 1-yard score to make it 27-21. The Raiders couldn't take advantage of defensive penalties giving them consecutive first downs and eventually punted after E.J. Henderson sacked Palmer. With 3:01 left, Ponder tried to rally his team from the shotgun, but went 2-of-5 for 17 yards and the ball went over on downs. Oakland was forced to punt, but one final desperate play ended in a fumble recovery by Curry. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Lions",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "35"
        },
        "comments": {
            "amount": "6",
            "1": "This game was a joke. The Panthers were up 24-7 as seven-point underdogs, yet they didn't even cover. Believe it or not, this is not the worst beat I've ever suffered on a November NFL Pick of the Month in a Lions contest. I had Detroit as a nine-point home dog versus the Buccaneers several years ago. The Lions were up 17-0 in that contest, yet they lost against the spread. Let me try to get through this recap without breaking down in tears or tying a noose around my neck. ",
            "2": "The Panthers and Lions seemed like they were competing to see which team would make the most stupid mistakes early on in this game. They traded dumb penalties and turnovers, including: 1. Lions: Playing with a fractured finger, Matthew Stafford threw an interception on the first drive. 2. Panthers: Cam Newton nearly tossed a pick on a high throw during the ensuing drive. He then heaved an ugly interception on the next play. 3. Panthers: An unnecessary roughness penalty gave Detroit a first down on what would have been a 4th-and-8. 4. Lions: Stafford was picked again in the end zone. 5. Lions: Keiland Williams lost a fumble in his own territory. 6. Panthers: A nice DeAngelo Williams run was negated because of a hold by a receiver. 7. Lions: Detroit surrendered a 102-yard kickoff return touchdown to someone named Kealoha Pilares. Sounds like some workout regimen. 8. Lions: The team gave the Panthers a first down on a 4th-and-4 because of an illegal use of hands penalty. Cam Newton would later score a touchdown as a result. ",
            "3": "As mentioned, Carolina had a 24-7 lead in this game, so how did they blow both the straight-up victory and the cover? Well, they were the only ones making dumb mistakes in the second half. All they did after intermission was drop passes, take sacks, throw picks and miss tackles. It was amazing how much of a 180 this game took. ",
            "4": "Newton was just dreadful after the break. He had a nice, game-tying touchdown drive with five minutes remaining, but his three picks were a killer. He finished 22-of-38, 280 yards, one touchdown and four interceptions to go along with two rushing scores. ",
            "5": "Newton's top receiver was a running back; Jonathan Stewart made six grabs for 87 yards. Steve Smith had five catches for 41 yards and a score, but had a huge deep drop that forced the Panthers to punt in the second half. ",
            "6": "Matthew Stafford threw for 335 yards (28-of-36) and five touchdowns after those two picks, but he wasn't the star for Detroit's offense. That would be Kevin Smith, who used to be the starting running back on this team prior to the Jahvid Best selection. Smith had 140 rushing yards on 16 carries and 61 receiving yards off four catches. He also scored thrice, including the painful front-door cover with two minutes remaining. Credit the Panthers for some of the most atrocious tackling efforts of all time. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "26"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: So, the Lions can score on a bulls*** front-door cover with two minutes left, but the Packers can't do the same thing. Forget bad luck; I'm convinced there's some sort of conspiracy.) ",
            "2": "The heavily favored Packers got going thanks to a crazy play on special teams. The Buccaneers had a punt blocked but Tampa Bay backup linebacker Jacob Cutera missed a tackle on Green Bay punter Tim Masthay who ran for a first down before fumbling the ball out of bounds. Aaron Rodgers took advantage and drove Green Bay down the field before B.J. Raji finished the drive with a one-yard touchdown run. Early in the second quarter, Rodgers tossed a short touchdown pass to tight end Tom Crabtree. After that score, the Buccaneers came alive and started to make a game of it. In the second quarter, LeGarrette Blount had a remarkable run where he ran through seven defenders. He chugged downfield for a 54-yard score. Another Tampa Bay drive led to a field goal cut into Green Bay's 14-10 lead. The Buccaneers got aggressive and had that backfire on them with a surprise onsides kick. The Packers got the ball at Tampa Bay's 38-yard line and that led to a short touchdown catch for Jordy Nelson. In the third quarter, the Buccaneers got a field goal while the Packers' offense had a few drives stall. Green Bay's defense was playing like garbage entering the fourth quarter. Their pass rush wasn't getting to Freeman and their pass coverage was too soft as he moved the ball down the field. Early in the fourth, Freeman hit Mike Williams on a nine-yard slant to make the score 21-19. Then Tampa Bay went for two and had a wide open Kellen Winslow drop an easy pass for a failed conversion. The Packers' offense woke up and started to attack the Buccaneers' vulnerable run defense. Green Bay was aided by some penalties by Tampa Bay, and fullback John Kuhn dove into the end zone from two yards out. After a Rodgers' interception, the Buccaneers got a big play downfield with a long pass from Freeman to Arrelious Benn. That set up a short touchdown pass to wide receiver Dezmon Briscoe. Tampa Bay trailed 28-26 with four and half minutes left. The Buccaneers made a terrible decision to do an onside kick rather than to kick it deep. The Packers recovered the attempt and were set up at midfield in prime position to get a game-clinching score. Rodgers made the Tampa Bay pay with a perfect pass he dropped into Nelson for a 40-yard touchdown. . After a terrible game last week, the Buccaneers dug deep and played the Packers really tough. Rodgers' accuracy was off frequently in the game and he didn't look like his normal self against Tampa Bay. Green Bay's defense is showing some weakness with the amount of yards they are giving up. That could come back to bite them in the postseason. Freeman was 28-of-38 for 342 yards with two touchdowns and two interceptions. Winslow caught nine passes for 132 yards, while Blount ran for 107 yards on 18 carries. Rodgers was 23-of-34 for 299 yards with three scores and an interception. Nelson led Green Bay with six receptions for 123 yards and two touchdowns. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Cowboys won this game, but their fans have to feel really discouraged. Dallas held a 10-0 lead, but nearly blew it to a team that had shown no signs of life in the past month. If Graham Gano would have just hit a 52-yard field goal in overtime, Jerry Jones' club would be 5-5 right now. It's almost inexplicable that the Redskins were able to move the chains so easily because Rex Grossman looked like he was going to give the game away early with his patented stupid interceptions and fumbles. He was guilty of one of each, but had a strip-six overturned by a replay challenge. However, Grossman got into a groove in the second half and was able to finish 25-of-38 for 289 yards, three touchdowns (two passing, one rushing) and an interception. ",
            "2": "What's even weirder is that Grossman was able to do this against Dallas' defense by throwing exclusively to Jabar Gaffney (7-115) and Donte' Stallworth (4-51), of all people. Fred Davis also had a decent outing (6-49). ",
            "3": "So, whom would Mike Shanahan turn to this week at running back? Would it be Roy Helu? Roy Torain? Tashard Choice? How about all of the above? Helu (8-35), Choice (6-7) and Torain (5-4) all split time in the backfield. Helu is clearly the best of the three, but Shanahan either is completely stupid or just hates fantasy football. ",
            "4": "As for Dallas' backfield situation, there was no doubt that DeMarco Murray would be the feature back. He had the first three touches of the contest, and finished with five times as many carries as Felix Jones. Murray couldn't find much running room, however, tallying 73 yards on 25 attempts. Jones' five tries went for 18 yards. ",
            "5": "Tony Romo was tremendous last week, but even though his stat line looks pretty solid (23-of-37, 292 yards, 3 TDs), he really struggled at times by missing open receivers on numerous occasions. ",
            "6": "Romo's scores went to Jason Witten (3-85), Dez Bryant (3-68) and Laurent Robinson (4-34). "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "49ers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Patrick Peterson had the worst game ever. He missed so many tackles and was constantly abused in coverage. He also was whistled for pass interference and fumbled a punt return. But hey, at least the Cardinals have their quarterback situation straightened out.) ",
            "2": "The formula for the San Francisco has been pretty simple this year. Let the defense hold the opponent's scoring down, run the ball as much as possible and do not turn the ball over. It's pretty cool when it works and for a couple months now, it has. So well in fact that the team has not only clinched its first winning season since 2002, but their magic number to win the NFC West is only two. This was no picnic though, starting with the drizzle of rain occasionally falling from the skies. I can summarize the first half pretty succinctly. The 49ers kept trying to kick field goals and the Cardinals kept trying to get a first down. Neither team was very successful in those endeavors. After Arizona punted on its opening drive, San Francisco got the ball to wide receiver Michael Crabtree twice for 51 yards, throwing incomplete twice in the direction of Braylon Edwards along the way. Crabtree had a huge game (seven receptions for 120 yards) and abused rookie cornerback Patrick Peterson in the process. Edwards never did get his hands on a ball, apparently more troubled by the soaked conditions than his fellow receivers. At the end of the drive, David Akers, who was having a terrific season entering this game, got his field goal attempt blocked by Calais Campbell. The Cardinals' next drive ended quickly with Patrick Willis recording an interception on the second play, collecting the ball on a deflection from cornerback Tarrell Brown. The 49ers' offense did nothing and the field goal from 49 yards out was wide right. After forcing a quick punt, they finally got on the board, sparked by a 27-yard pass to Vernon Davis followed by a 14-yard run by Frank Gore. The back was not the punishing force he is when completely healthy and fresh, but did log 24 carries for 88 yards. When the lead was in hand, Anthony Dixon (7 carries for 32 yards) and rookie Kendall Hunter (11 carries for 27 yards) took over, allowing Gore to rest up on a short week for the Harbaugh Bowl. A short field goal from Akers capped the drive and made it 3-0. Yet another opportunity opened up for San Francisco to blow this game open in the first half when the first play by Arizona resulted in a fumble by Beanie Wells, who had just eight carries for 33 yards. Arizona only ran the ball a total of 11 times, never holding the ball on sustained drives to get the running game in a rhythm against a stout defense. The field position resulted in just three points after Alex Smith threw behind Braylon Edwards on third down and Akers connected from 43 yards out. I got a good laugh when Brian Billick referred to him as Fred while making a golf analogy about him getting his swing back. Maybe he thought he was covering Fred Couples at the Masters. The Cardinals had another unsuccessful drive as the first quarter wrapped up, but the 49ers were having trouble putting them away. Smith missed Crabtree for what should have been an easy touchdown and Akers had another field goal blocked, this time by Peterson who did not make his presence felt otherwise on special teams because he only got his hands on a punt return twice. San Francisco quickly got the ball back and drove down the field yet again. This march was highlighted by wide receiver Kyle Williams who slipped by linebacker Sam Acho for a pickup of 10 yards and had another reception for 15. It was somewhat of a breakout performance for Williams with five receptions for 54 yards and (spoiler alert) a touchdown. Since the injury to Josh Morgan, the team has been looking for someone to pick up the slack. The drive ended with Smith throwing to Davis, who came up just short of the first down. Akers hit the field goal, making it 9-0. After yet another failed Arizona drive, the game mercifully went to halftime. Finally, San Francisco asserted itself as the bully, taking the ball right up the field 84 yards capped by the aforementioned touchdown to Williams. Crabtree had two receptions for 44 yards early in the drive which put them up 16-0. At that point it might as well have been 100-0 given the ineptness of Arizona's offense. On the second play of their first possession of the half, John Skelton tried to find Larry Fitzgerald and instead got the ball to Donte Whitner. The 49ers made short work of the short field, needing just four plays capped off by an 18-yard pass to Davis for a 23-0 lead and the rout was on. Dashon Goldson ended the Cardinals' next drive with an interception, ending the misery that was Skelton's day. He finished 6-of-19 for 99 yards with three picks and a 10.5 QB rating. I'm not convinced Red Skelton would have been worse. After San Francisco stalled and punted, Navorro Bowman came up with the fumble by Peterson who definitely played like a rookie. However, Smith was intercepted by Daryl Washington on third-and-goal on a very poor decision. This was a setback game for Smith who had no business throwing a dangerous pass with the game well in hand. Then we got a special treat when Richard Bartel entered to play quarterback. He looks like the kind of guy who enjoys a dip of tobacco and thinks Yeah coach, put me in, I got you while sitting on the sideline looking like a gunfighter from the Wild West. Arizona went to the shotgun, but the drive went nowhere. When they got the ball back on the 49ers' second punt of the game, the Cardinals finally got somewhere thanks to Early Doucet and Goldson mixing it up after the play. Doucet popped Goldson who retaliated with a right hook that missed and a couple more punches that landed him an ejection on a play that actually featured rookie Aldon Smith sacking Bartel. Then Doucet caught a couple passes, veteran Chester Taylor broke off a 34-yard run and Larry Fitzgerald caught the first touchdown pass ever thrown by Bartel. By the way, Fitzgerald went over 9,000 yards receiving in this game. At 23-7, technically, this was still a game. Arizona got the ball back with 4:58 to play and scratched their way to the red zone before San Francisco decided enough was enough. From the 16-yard line, Bartel missed on three straight passes, and when he finally connected with Doucet, it was well short of the first down, and that was that. The 49ers drained the final 3:27 with Dixon running and Smith kneeling. It was a great win because Gore was able to rest a little bit, but Smith (20-of-38 for 267 yards 2 TDs, 1 INT) did not play very well. If not for the defense being dominant and the running game (164 yards) working, this might have been a much different story. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Sam Bradford just doesn't look right. I'm not sure if he's still playing hurt, but that shouldn't make him so skittish in the pocket. He's hurrying his throws and consequently is off the mark on many of his attempts. Bradford went 20-of-40 for just 181 yards, one touchdown and an interception. He also lost two fumbles. With no semblence of a running game to lean on - Steven Jackson rushed for only 42 yards on 15 carries against Seattle's top-five rush defense - Bradford just had major difficulty moving the chains the entire afternoon. The Rams had just 185 total yards of offense. ",
            "2": "Brandon Lloyd caught five balls for 67 yards and a score. He and Bradford have only had about seven practices together, so that chemistry will continue to improve. But that won't matter as long as Bradford is poorly protected in the pocket; he was sacked five times in this contest, thanks to the plethora of injuries to the tackle position. Chris Clemons had three of those sacks with two forced fumbles. ",
            "3": "This was a pretty mixed performance for Tarvaris Jackson. He maneuvered pretty well around the pocket and was able to avoid St. Louis' pass rushers effectively at times. At other times, however, he was really reckless and took big losses on sacks. Jackson finished 14-of-24 for 148 yards, one touchdown and two interceptions. Ironically, top receiver Sidney Rice had the best throw of the contest when he hit Mike Williams on a 55-yard bomb to open things up. What's funny is that Jackson tossed a pick on the next play. ",
            "4": "Rice would find the end zone eventually, as he caught three balls for 35 yards and the touchdown. Williams, meanwhile, made just one other reception for seven yards. ",
            "5": "Marshawn Lynch didn't break the century mark again, but that was a tall task for him considering all the injuries to the offensive line. He rushed for 88 yards and a touchdown on 27 carries. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: What the hell is going on in the NFL this week? The Falcons were up 23-3, yet they failed to cover. I had zero units on Atlanta, but since I got royally screwed in the Carolina-Detroit game, I really feel for anyone who bet heavily on the Falcons. This was just a gambler's nightmare for those who had the right side in either of those contests.) ",
            "2": "The Falcons quickly took control of this game and never looked back. Atlanta moved the ball well early and scored first with a 17-yard touchdown pass from Matt Ryan to Tony Gonzalez. The Falcon defense was really playing well in the first half and forced a series of punts. Atlanta had a 13-3 lead at halftime. In the second half, a miraculous catch along the sideline by Roddy White led to a touchdown run by Michael Turner. White kept up the heat on the Titans' defense with a 32-yard wide receiver screen that led to another Matt Bryant field goal. In the third quarter, Matt Hasselbeck left the game with a sprained right elbow. Rookie quarterback Jake Locker came in the game with his team down 23-3. He quickly got the Titans in the end zone. Locker threw a deep out to Nate Washington about 20 yards downfield on the sideline. He cut back to the middle of the field and ran by a couple defenders for a 40-yard touchdown pass. In the fourth quarter, rookie linebacker Colin McCarthy forced a fumble from Turner when Tennessee was backed up deep in their own territory. That helped keep the Titans in the game. Locker made a big play downfield after scrambling to buy time. He tossed a ball deep for Lavelle Hawkins and the 5-foot-11 wide out caught the pass over a defensive back for a 32-yard gain. It set up Tennessee at the Atlanta four-yard line with four minutes left and down by 13. Locker made a good throw on third-and-goal to Washington for his second touchdown pass. Locker finished the game 9-of-19 for 140 yards and two scores. The Falcons' offense ran out the clock with some tough runs by Turner. Atlanta's offense played a balanced game. Turner ran for 100 yards on 21 carries with a score. Ryan was 22-of-32 for 316 yards and one touchdown. White led Atlanta with seven receptions for 147 yards. It could have been an even bigger game but he dropped a couple of passes. The Falcons' defense really played well. Conversely, the Titans' offensive line played like crap. They weren't winning at the point of attack, and had only 41 yards rushing in the game. They looked very predictable for the Atlanta defense. Chris Johnson totaled 13 yards on 12 carries, and he will get a lot of criticism for this game, but the running lanes were terrible. Falcons defensive tackle Jonathan Babineaux and defensive end John Abraham both played well. Dunta Robinson recorded an interception of Hasselbeck to end a scoring threat. On the other side of the ball, the Atlanta offensive line played well and was able to control Tennessee's front. The terrible line play, and the extension of Johnson's 2011 slump, was a huge hit to the Titans' playoff hopes. The Falcons remain in the thick of the NFC playoff race. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bears",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Two rants prepared for San Diego's idiot head coach and San Diego's idiot quarterback, but first Jay Cutler: If you haven't heard, Cutler is out for the year with a fractured thumb, which is a damn shame because he had a great game. He was 18-of-31 for 286 yards, two touchdowns and an interception that wasn't his fault. He didn't take any sacks, and when he was under pressure, he maneuvered the pocket well and found his receivers downfield. Unfortunately, he's done. The good news though is that the Bears have a pretty decent backup in Caleb Hanie, who performed well in the NFC Championship. ",
            "2": "Cutler's favorite targets were Roy Williams (5-62), Johnny Knox (3-97, TD) and of course Earl Bennett (3-75). Bennett had a touchdown wiped out because of a replay challenge. ",
            "3": "Matt Forte actually wasn't as much of a factor as usual. He rushed for 59 yards on 21 carries and also had 26 receiving yards off four receptions. Norv Turner is so f***ing stupid, I can't take it anymore. He didn't take timeouts at the end of the first half to give Philip Rivers a chance to score before intermission. He continuously had his punter kick to Devin Hester. He wasted timeouts in the second half. Throughout the afternoon, he just stood there bundled up in his puffy coat looking like a moron the whole time. It's sickening that he hasn't been fired yet. Rivers sucks. He's a cocky douche bag who never takes any of the blame for himself. He's physically gifted and is able to make pretty throws when he's not under pressure, but when the game is on the line, he chokes like a female porn star. Whether it's throwing into double coverage or sailing a pass into an opposing player's arms when trying to throw the ball away, Rivers has a knack for doing the perfect stupid thing when his team needs him most. This Charger team is done. Jim Nantz and Phil Simms discussed San Diego still being alive in the AFC West race, but that's just dumb. San Diego is just too dumb and too poorly coached to make any sort of run. ",
            "4": "Let's get through these numbers before I have an aneurysm. Rivers went 21-of-31 for 280 yards, two touchdowns and a pair of interceptions. Despite all the injuries to the offensive line going into this contest, Rivers wasn't under pressure all that much. ",
            "5": "Rivers' scores went to Vincent Jackson (7-165) and Antonio Gates (4-63). Vincent Brown (1-8) did nothing after a brilliant Thursday night performance. ",
            "6": "Ryan Mathews had 13 carries (37 yards) compared to Mike Tolbert's three (14 yards). However, Mathews screwed over his team by fumbling twice. He sucks too. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "10"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: I normally would recap this game, but I was at one of my best friend's wedding. I did watch it when I came home off the DVR machine. No one should be shocked that Vince Young beat the Giants. Andy Reid always wins when the chips are down, especially when he has to start a backup quarterback and utilize guys like Chad Hall and Riley Cooper.) ",
            "2": "In this NFC East grudge match both defenses started well. Giants rookie cornerback Prince Amukamara was playing in his first ever game regular season, and he got off to a fortunate start by intercepting a deep pass intended for DeSean Jackson. Amukamara got lucky because he was beat by Jackson running downfield, but Vince Young threw a horribly underthrown ball that let Amukamara recover to get the interception. Eli Manning returned the favor by throwing a pick to linebacker Jamar Chaney. Philadelphia took the lead with a field goal in the second quarter, but Young threw another pick. The pass was deflected by cornerback Aaron Ross, and safety Kenny Philips tracked down the ball to set up the Giants just past midfield. A short time later, the Eagles took over at their own 2-yard line. Young aired out a deep ball that Jackson ran under for a gain of about 50 yards. After the play, he acted like an idiot, flipping the ball at a New York coach and then taunting the Giants' sideline. That drew a penalty which negated his big catch and put the ball back on the Philadelphia 2-yard line. Just before halftime, Jackson had a massive punt return, and why in God's name did New York kick it to him? The Giants finally forced Jackson to step out of bounds at the 14-yard line. The next play saw Young connect with Steve Smith on a crossing route for a touchdown. New York got a field goal before time ran out and Philadelphia took a 10-3 lead into the locker room. The third quarter saw more of the same - the Eagles' defensive line was whipping the Giants' line. Manning was under constant duress and the run blocking was terrible. New York had its eighth punt halfway through the fourth quarter. Philadelphia started a promising drive, but Young threw a ball up for grabs in the back of the end zone and Ross came down with the interception. After trading more punts, the Giants finally got something going early in the fourth quarter. Manning threw a deep ball for Hakeem Nicks and the wideout rewarded him with a phenomenal catch that went for 47 yards. A couple plays later, Manning scrambled and threw a rope to Victor Cruz who beat Nnamdi Asomugha to get open in the back of the end zone for a 24-yard score. If it weren't for his dumb interceptions, Young would have had a perfect game against New York. In the fourth quarter, he led Philadelphia on a balanced 18-play drive that took nine minutes off the clock. On third-and-goal, Young threw a bullet to Riley Cooper running across the back of the end zone. The Giants got the ball with about three minutes left in the game. On a critical third down, Manning hit Cruz who broke down the field for a 47-yard gain. On the next play, Eagles defensive end Jason Babin ran down Manning from behind and forced a fumble that was recovered by Philadelphia. The Eagles closed out the game with LeSean McCoy breaking off a 60-yard run to the New York 2-yard line. Young finished the game 23-of-36 for 258 yards with two scores and three interceptions. McCoy totaled 113 yards on 23 carries. Jackson caught six passes for 88 yards, while Cooper had five receptions for 75 yards and a score. Manning was 18-of-35 for 264 yards with a touchdown and an interception. The Giants running game was non-existent, and Brandon Jacobs totaled 21 yards on 12 carries. Cruz led New York in receiving with six receptions for 128 yards and a score. "
        }
    },
    "numberOfGames": "12"
}