{
    "year": "2011",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "I don't know how the Cowboys won this game. Tony Romo threw terrible interceptions, the defense surrendered big completions to Matt Moore, and the team committed dumb penalties. It's a miracle that they still somehow found a way to win. Romo was dreadful for three quarters of this contest. He went 22-of-34 for 226 yards, two touchdowns and a pair of horrible interceptions in the first quarter. Romo kept Miami in the game with his poor decision-making, but really made up for it when it mattered most with an impressive final drive to put his team in field goal range. ",
            "2": "Both of Romo's scores went to Laurent Robinson, who was Dallas' most productive receiver by far (7-79), though he had a couple of key drops in the first half. Jason Witten (4-43) and Dez Bryant (3-35) didn't really do anything until the aforementioned game-winning drive. Witten made a few catches, while Bryant had a nice punt return. ",
            "3": "DeMarco Murray had another solid outing. He rushed for 87 yards on 22 carries with 41 receiving yards off four receptions. Felix Jones didn't even get a single attempt. ",
            "4": "As for the Dolphins, Matt Moore really continues to impress. He went 19-of-32 for 288 yards and a touchdown, and his numbers are definitely as good as advertised. He made some really great throws, including 41- and 39-yard strikes to Brian Hartline and Brandon Marshall, respectively. The one criticism is that he had fumbling issues. One botched snap set up Dallas with an easy touchdown right before halftime. Moore's surge really makes me wonder if the Dolphins will pursue one of the four franchise quarterbacks that'll be available in the <b> </b>. If the Dolphins keep winning and Tony Sparano keeps his job, they may decide to keep rolling with Moore next year. ",
            "5": "The touchdown Moore threw went to Marshall (5-103) who made a really great catch with Terence Newman draped all over him. Davone Bess also made a great one-handed reception in the third quarter for a long gain. ",
            "6": "Reggie Bush looked great, rushing for 61 yards on 16 attempts with three receptions and 35 receiving yards. I don't know if the Cowboy defenders just weren't interested, but Bush was able to shed a high number of tackles in this contest. ",
            "7": "I was watching this game with a few relatives. Every single one agreed that the Dolphins should have let the Cowboys score when Dallas was running out the clock to set up the decisive field goal. Of course, Phil My Son is Better than Andrew Luck Simms said that Miami was doing the right thing, and of course, the Dolphins lost at the buzzer. It really didn't make any sense. The Cowboys had at 35-yard field goal set up, at the very worst, with a minute on the clock and a timeout remaining for Miami. Allowing Dallas to score would have given them a six-point deficit, but they at least would have had a chance. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "16"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "Poor Alex Smith. He's going to wake up in a cold sweat for the next month after having nightmares about Terrell Suggs and other Ravens chasing after him. Smith was sacked a whopping nine times in this contest. I know the 49ers had a tough preparation task traveling across the country on three days rest, but this was just inexcusable. Despite all the pressure, Smith did a pretty decent job at times. He went 15-of-24 for 140 yards and had a long touchdown to Tedd Ginn wiped out by a chop block. However, he also was guilty of a terrible interception at the end of the half where he forced a deep pass into the end zone that took a field goal opportunity off the board. ",
            "2": "Only two of Smith's targets had more than two receptions: Michael Crabtree (6-54) and Vernon Davis (4-38). Ginn caught two balls (21 yards), but had an easy drop at the end of the game that turned the ball over on downs. ",
            "3": "Both teams did a great job shutting down the run. Frank Gore (14-39) and Ray Rice (21-59) were both limited to worse than three yards per carry. Rice was also a factor in the passing attack with three receptions for 24 yards, finishing behind only Anquan Boldin (4-63) in each category. ",
            "4": "Joe Flacco went 15-of-23 for 161 yards and a touchdown. Those stats don't look great, but he was able to convert 7-of-15 third downs against one of the NFL's top defenses. This was a good rebound performance for Flacco, who struggled at Seattle and was inconsistent last week against the Bengals. For whatever reason, Flacco plays down to his competition but steps up against elite opposition. I guess that can be a good thing. ",
            "5": "As mentioned earlier, the Ravens notched nine sacks. Suggs had three of them with a forced fumble. Cory Redding (2.5) and Haloti Ngata (2) also chipped in with multiple sacks. ",
            "6": "If you're a Niner fan, I wouldn't read too much into this loss. Traveling on three days rest is no easy task. Traveling across the country on three days rest is ridiculous. This just wasn't fair. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Rams have to be one of the dumbest teams in football. Patrick Peterson beat them in overtime back in Week 9, and he's been dynamic on returns all year, so why the hell would they kick to him in this contest? St. Louis' inept coaching staff clearly didn't learn its lesson and consequently paid the price. Peterson's third-quarter score gave Arizona a 20-10 lead, seemingly putting the game out of reach at the time. St. Louis did a couple of other stupid things in this contest. For instance, the offense had a first-and-goal on the Arizona 3-yard line just prior to halftime. An offensive lineman committed a false start penalty, and then Sam Bradford took a sack from Sam Acho (2 sacks, forced fumble). Much earlier, Bradford was strip-sacked inside the Cardinal 15-yard line. And then there was the run defense. I can't believe how bad it was. Chris Wells has been running on fumes the past six or so weeks after suffering a knee injury, and he was able to muster only 20 rushing yards on 10 carries against this St. Louis squad back in Week 9. But Wells trampled the Rams this Sunday, compiling 228 yards and a touchdown on 27 attempts. ",
            "2": "Despite Wells going off, John Skelton couldn't really capitalize. He was dreadful once again, going 12-of-23 for 114 yards and two interceptions. Most of his attempts were incredibly inaccurate. On one of those throws, I commented on the forum, Great pass by Skelton to the cheerleaders. ",
            "3": "Larry Fitzgerald was the only Cardinal who had more than two receptions. He notched three for 55 yards. ",
            "4": "Brandon Lloyd had a better fantasy day, catching five balls for 74 yards and a touchdown. Despite Sam Bradford's struggles, Lloyd continues to produce. ",
            "5": "Speaking of Bradford, St. Louis' coaching staff clearly didn't show any confidence in him, opening up the game with five consecutive runs, including one on a 3rd-and-9. Bradford once again wasn't very good but didn't have much of a chance behind his miserable offensive line, going 17-of-31 for 203 yards and the score to Lloyd. ",
            "6": "Steven Jackson had lots of work early on, but didn't have much luck running the football, mustering 64 yards on 17 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jets",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "24"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: Maybe I'm in the minority, but I loved Steve Johnson's touchdown celebration. If you missed it, he danced around and pretended that he shot himself in the leg, a la Plaxico Burress three years ago. I thought it was funny. It's not like Burress shot anyone else. If you shoot yourself in the leg, you deserve to be made fun of. Nice job, Stevie - except for all of your terrible drops at the very end, that is.) ",
            "2": "The cliche must-win probably fit for both teams here. The difference between 6-5 and 5-6 is pretty big in the competitive AFC wild card chase. It was tight to start, with the teams quickly exchanging punts. After another punt from the Jets, the visiting Bills went on an epic march spanning 13 plays and covering 90 yards for the opening touchdown of the game. C.J. Spiller, thrust into a featured role now that star Fred Jackson is on injured reserve, immediately became a factor. He had the ball in his hands seven times on the drive and was bottled up other than a 13-yard reception. His biggest impact was when Brodney Pool grabbed his face mask for a 15-yard penalty early in the possession. Ryan Fitzpatrick hit David Nelson for the touchdown and 7-0 lead on a march that took up 8:47 off the clock and nearly put the game in the second quarter. New York had an immediate answer. Shonn Greene saw the ball on three of the first four plays, running twice for eight yards and collecting an 18-yard reception. Santonio Holmes picked up 23 yards on an end-around for the other big gain to put the offense in business. They scrapped the rest of the way down the field and eventually went to wide open tight end Dustin Keller for the 3-yard touchdown to tie the game. Buffalo moved the ball on its next drive, converting a third down when they were put in a second-and-15 situation after a false start by rookie left tackle Chris Hairston. It was done the hard way with Stevie Johnson beating Darrelle Revis on consecutive plays. The drive stalled when just acquired Tashard Choice was handed the ball out of a shotgun on third-and-four. He was swarmed for a loss of five and Rex Ryan laughed at the play call. I might have made the last part up. Brian Moorman pinned the Jets deep with a nice punt. After New York failed to escape the bad field position, their secret weapon Aaron Maybin became a factor. He was a team captain for this one, which had to motivate him going up against the team that drafted him. The former bust made a dumb play on 3rd-and-8 clocking lineman Kraig Urbik to negate a failed play. An offsetting penalty reset the down and Maybin sacked Ryan Fitzpatrick. Then Moorman pinned the Jets again, keeping the offense and erratic quarterback Mark Sanchez out of rhythm. He soon threw an interception to Drayton Florence on a post intended for Santonio Holmes. The Bills took advantage of the great field position at the New York 20 needing just three plays for Johnson to beat Revis again on a 5-yard touchdown for the 14-7 lead. What happened next turned the game around though. Johnson did a touchdown dance mocking Plaxico Burress' shooting incident, pretending to shoot himself in the leg. While it amused a lot of people on Twitter, it cost the Bills 15 yards on the kickoff. Backup kicker Dave Rayner flubbed the kickoff, hitting Emanuel Cook who was up on the front line. It looked almost like he was trying to knock the ball off an unsuspecting player and get a surprise onside kick, but up 14-7 with the half close to ending, it would make no sense. The Jets went to Greene who picked up seven yards on a reception and another 15 was added on a personal foul by rookie Marcell Dareus. All of a sudden, they were at the Bills' 14-yard line as the two-minute warning sounded. After two failed plays, Sanchez found Burress wide open for the tying touchdown pass. Buffalo's answer was two incompletions and another Maybin sack. New York tried to steal a field goal attempt, but couldn't get past the midfield stripe until the final play of the half. The Bills went right back to picking on Revis to start the second half with an 8-yard pass to Stevie Johnson (8-75 yards, TD), who had his fingerprints all over this result. Ex-Jets receiver Brad Smith picked up 17 yards on a reception and another three on an end around as part of a promising drive, but Spiller's inability to find open space ultimately doomed the march, and an awful punt went through the end zone for a touchback. Breathing room really helped New York, which went to the running game with Greene (13-78) and Joe McKnight (4-21), who probably should have been given a few more rushing attempts in this one. The third player to touch the ball on this drive was Dustin Keller, who caught his second touchdown to put the Jets ahead 21-14. Things were looking good for the home team when the defense held, but Antonio Cromartie muffed the punt and Buffalo smartly went right after him throwing to Smith for a 36-yard touchdown to tie the game right back up. He tipped the ball to himself while Cromartie, who has to be wondering what to get all of his kids for Christmas, lost his balance. Sanchez (17-for-35 180 yards, 4 TDs, 1 INT) threw three incompletions to kill the Jets' next drive, distributing his targets (Burress, Patrick Turner, Holmes). At least they backed the Bills' up, including a 10-yard holding penalty on the punt. Buffalo had a nice march taking the game into the fourth quarter, overcoming a 15-yard personal foul on lineman Erik Pears along the way and twice converting third downs. New York stiffened up on defense and Rayner tried to make amends for his kickoff flub by giving his team the 24-21 lead on a booming 53-yard field goal. After a quick exchange of punts, I pointed out on Twitter that the time was now for Sanchez and the Jets, even with 5:44 remaining. They responded. After drawing boos earlier in the game, the New York signal caller shook off his day-long inaccuracy by completing passes to convert a pair of third downs. Sanchez was 6-for-8 on what wound up being the winning drive for 65 yards and his final touchdown pass to, who else, Holmes covering 16 yards with 1:09 left on the clock. Keep in mind Sanchez entered the drive 11-for-27. The Bills came out in shotgun formation for their last ditch effort to pull out a victory and drove right down to the Jets' 27-yard line with quick passes to Nelson and Scott Chandler, plus some scrambling from Fitzpatrick, who smartly ran out of bounds on both scampers. However, God was again unhappy with Johnson, apparently, because he bounced a ball off his hands for what probably would have been the winning touchdown. After two more incompletions, that was that. Buffalo never got Spiller (19 rushes for 55 yards, 3 receptions for 15 yards) going and wasted Johnson's abuse of Revis and Smith's big day (4 receptions for 77 yards 1 TD). Sanchez was only great when he needed to be. Perhaps he has been watching Tim Tebow. Ultimately, however, Johnson's celebration antics proved costly in a tight finish. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Andy Dalton just turns it on in the fourth quarter. He nearly led a comeback against the Ravens last week, and he was able to complete the job versus Cleveland on Sunday. Things looked bleak when the Browns led 20-10 in the third quarter, but Dalton caught fire in crunch time. Dalton's best throw was a 51-yard bomb to A.J. Green on the final drive. Green ran down to the 2-yard line, ultimately setting up Mike Nugent for the decisive, chip-shot field goal. ",
            "2": "Dalton finished 21-of-31 for 270 yards and a touchdown - which is pretty impressive considering that Cleveland has a pretty underrated pass defense. Green, meanwhile, had three catches for 110 yards. ",
            "3": "Jermaine Gresham caught Dalton's sole score with five catches for 68 yards. Jerome Simpson, however, didn't do much (2-15) after his brilliant performance last week. Simpson had a bad drop in the second half. ",
            "4": "Cedric Benson had a great performance. He rushed for 106 yards and a touchdown on just 21 carries. He was stuffed on fourth-and-goal at the 1-yard line during the first quarter. I'm really sick of teams calling predictable running plays on fourth-and-short situations. If you're going to be aggressive, be aggressive. ",
            "5": "Speaking of being aggressive - OK, this is a poor segue - Peyton Hillis worked hard to get himself ready for this contest. He had a great 10-yard run where he carried multiple defenders, but was ineffective otherwise. Hillis finished with 65 yards on 19 attempts. Montario Hardesty, who injured himself in pre-game warmups, didn't play. ",
            "6": "Colt McCoy was solid early on, but ultimately had trouble moving the chains when it mattered most. He went 16-of-34 for 151 yards, two touchdowns and an interception. McCoy's scores went to the only two Browns who had more than two receptions: Greg Little (5-57) and Jordan Norwood (4-69). ",
            "7": "Of course, the Browns would have had a chance to win this game if Phil Dawson could have hit a 55-yard field goal inside two minutes. I'm not putting the blame on Dawson though, as the snap once again rolled to the holder. This is the second time in a few weeks that this has happened. As if the Browns didn't suck enough, they're killing themselves by not being able to complete a routine football process. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Texans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "Would the Texans be able to win with Matt Leinart? That was the question going into this game. Ironically, it was Arian Foster and Andre Johnson who screwed up early on. Following a nice 8-yard completion by Leinart on the opening drive, Foster was strip-sixed by his own teammate, as Johnson accidentally punched the ball out of his running back's hands. The Texans recovered and were able to establish a 20-10 lead at halftime, but now there's a different question: Can they win with T.J. Yates? Leinart suffered a broken collarbone just prior to intermission. He finished 10-of-13 for 57 yards and a touchdown. Leinart was used in many bootlegs and tossed mostly checkdowns. The offense was just really limited with him. A penalty forced them into a 1st-and-20 at some point, and it was evident that they didn't stand a chance to convert the first down. Not that it matters though because Leinart is likely out for the year. Yates looked great on his first drive in the 2-minute drill, but was dreadful after the break. Finishing 8-of-15 for 70 yards, Yates converted only one first down in the second half. With Houston unable to run the ball, the team just hung on for its life. Fortunately for them, the Jaguars were so inept on offense that it didn't matter. ",
            "2": "Blaine Gabbert was so bad in this contest that he was benched in favor of Luke McCown. Gabbert went 13-of-29 for 136 yards and an interception that looked like a punt. Once again, he had major issues with pocket awareness. He also has a terrible habit of not looking downfield amid a pass rush, and shows terrible body language when things aren't going well (which is often the case). Gabbert's inaccuracy doesn't help matters. It was so bad that the CBS announcers made fun of him. After a poor pass, the color analyst (I think it was Rich Gannon) said: You have throw the ball to the receiver; not close to the receiver. Gabbert actually should have thrown a touchdown, but Marcedes Lewis had a really bad drop. This was actually hilarious because a minute earlier, the CBS announcers were pleading for Gabbert to go to Lewis more often. ",
            "3": "The Jaguars were able to stay competitive because of Maurice Jones-Drew, who rushed for 99 yards on 18 carries. He also paced the team in receptions (4) and receiving yards (67) because many of Gabbert's completions were checkdowns. ",
            "4": "Speaking of checkdowns, Arian Foster hauled in seven balls for 24 yards to go along with his mediocre rushing numbers (22-65, TD). Andre Johnson, meanwhile, had just two receptions for 22 yards because his quarterbacks couldn't get him the football. His first catch came with two minutes to go in the third quarter. ",
            "5": "As for Houston's defense, Wade Phillips' unit compiled seven sacks. Four of those came from Connor Barwin, who also had 10 tackles. Rookies J.J. Watt (2) and Brooks Reed (1) had the other three sacks. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "19"
        },
        "comments": {
            "amount": "4",
            "1": "Curtis Painter wasn't as terrible as usual Sunday. Keep the as usual in mind because he was still dreadful. He's just usually much, much worse, but wasn't completely inept against the Panthers. Considering how horrific Carolina's defense usually is, I guess this was to be expected. Painter's big mistake occurred in the fourth quarter. Indianapolis had a 2nd-and-1 on the Panther 33-yard line with a few minutes remaining. The Colts' solid drive ended abruptly, however, because Painter foolishly decided to heave an underthrown ball into the end zone. There was no reason to do this because Carolina's defense was reeling. Painter had some other epic-fail moments. For instance, he had a miserable throw on 3rd-and-8 on the opening drive. I know most of Painter's passes are terrible, this was a work of art considering how bad it was. The ball was miles away from his intended receiver, and he wasn't trying to throw the ball away. Painter was also strip-sacked on the ensuing possession. He finished 15-of-29 for 226 yards, one touchdown and two picks. Like I said before, he wasn't nearly as bad as he usually is, but he ultimately cost the Colts an opportunity to notch their first victory of the year. ",
            "2": "Painter's score went to Reggie Wayne, who finally was productive with five catches for 122 yards. Donald Brown also found the end zone, as he had success running the ball against Carolina's putrid defense; he rushed for 80 yards on 14 carries. ",
            "3": "Speaking of rushing touchdowns, Cam Newton scampered into the end zone for the 10th time this season, putting him just two short of the NFL season record of 12, held by Steve Grogan. Newton went 20-of-27 for 208 yards. He completed passes to seven targets, all of whom had at least three receptions, including Steve Smith (3-68), Jonathan Stewart (3-12), Jeremy Shockey (3-41) and Greg Olsen (3-24). Olsen suffered an injury in pre-game warmups. ",
            "4": "Stewart had more rushing yards than DeAngelo Williams, edging him out by one, 70-69. However, Williams had five more carries and scored twice. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Titans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: And we have yet another bulls*** front-door cover. I didn't have any units on the Buccaneers, but Tennessee's cover, which was the result of a field goal with less than a minute left, was complete crap. We've definitely exceeded the single-season record for bulls*** front-door covers this year.) ",
            "2": "At halftime I wrote: This was an ugly football game of two mediocre football teams seeing who could do a better job of giving momentum to the other side. The brief halftime highlight clips of the frisbee dogs produced a good contrast with the Titans and Buccaneers. The dogs had better execution and held onto the frisbees while Tampa Bay and Tennessee had consistent breakdowns and fumbles. If you don't want to read a recap of a sloppy game, skip further down. On the second play from scrimmage, LeGarrette Blount fumbled the ball away after getting it slapped out by the Titans' Jason Jones. Tennessee recovered the ball to set up the Titans at the Buccaneers' 38-yard line. Fortunately for Tampa Bay, Tennessee went three-and-out. On the next possession, Blount hurdled a defender on a 35-yard screen pass that helped lead to a field goal. The Titans answered with a beautifully designed reverse on the kickoff. Marc Mariani ran 16 yards. Teammate Tommy Campbell looped behind him and Mariani handed the ball off to him. Campbell then sprinted downfield untouched 84 yards for a touchdown. The Buccaneers were completely caught by surprise. Tennessee passed up an easy field goal to go for the first from 4th-and-2. Matt Hasselbeck was pressured and threw an interception to linebacker Geno Hayes. The Titans' Rob Bironas wasted another good drive for Tennessee by missing a 42-yard field goal. The Buccaneers started to move the ball before Titans defensive end Dave Ball made a great play, leaping to deny a screen pass and when he landed, slapped the ball out of Josh Freeman's hands. Ball recovered the fumble at the Tampa Bay 38-yard line but Tennessee couldn't get in the end zone. Later, Ronde Barber forced a fumble from Javon Ringer, and that led to a short touchdown pass from Freeman to Mike Williams. The score was 10-10 at halftime. Chris Johnson had two good runs but fumbled the ball away after getting stripped by Aqib Talib. A few plays later, Williams fumbled the ball back to the Titans. Talib gave Tampa Bay the lead a little later with an interception he returned 27 yards for a touchdown. That was the seventh turnover in the game. Blount produced the eighth turnover when he was stripped of the ball by Jurrell Casey. Tennessee answered by squandering great field position and punting. The Titans got some big runs from Johnson to lead them to a field goal and then a go-ahead touchdown. On fourth-and-goal from the two-yard line, with three minutes left in the game, Hasselbeck threw a dart to a wide-open Damian Williams in the back of the end zone for the game-winning score. Freeman threw an interception to linebacker Colin McCarthy and Johnson ripped off a long run for a field goal. The Buccaneers had one more shot. They moved the ball inside the Titans 30. On 4th-and-1, Freeman fumbled the snap and was stuffed after recovering the ball to end the game. Subtracting the fumbles, both teams running backs played well. Johnson had a huge game with 190 yards on 23 carries. Tampa Bay's offensive line played well and Blount did a good job with 103 yards on 20 carries. Tennessee left a lot of points on the field and easily could have lost this game, so they should consider themselves lucky that they won. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "I've been sending Alshon Jeffery to the Vikings in my <b> </b>, but I may have to consider changing the selection to LSU cornerback Morris Claiborne if Matt Kalil and Justin Blackmon are off the board. Minnesota is just miserable against the pass. Matt Ryan basically did whatever he wanted to without the benefit of a reliable ground attack (Michael Turner: 19-60). Ryan finished 27-of-34 for 262 yards and three touchdowns. He was able to convert half of his third downs (7-of-14), allowing his team to win the time-of-possession battle by nine minutes. Ryan's only blemish was slightly overthrowing Roddy White on what would have been a long score. ",
            "2": "Speaking of White, he hauled in a whopping 10 balls for 120 yards and a score. Tony Gonzalez, meanwhile, had nine catches for 69 yards, but didn't reach the end zone. ",
            "3": "Julio Jones really disappointed his fantasy owners. He was listed as probable coming off a hamstring injury, but didn't catch a single pass. He was in and out of the game, but was on the field in the fourth quarter, which is an indication that he didn't suffer a setback. ",
            "4": "This was a very strange game for the Vikings - Percy Harvin in particular. Harvin had a 104-yard kickoff return, but didn't score. He also found his way into the end zone, but didn't get a touchdown. I'll explain. Harvin's return came from the back of the end zone. He ran inside the Atlanta 5-yard line, where he was tackled. Four plays later, Harvin had what seemed like a touchdown. The replay clearly showed him breaking the goal line. However, the officials ruled that Harvin's progress was stopped at the 1-yard line. Brian Billick and his play-by-play analyst nearly had an aneurysm as this was happening. It was a shady call that would make any conspiracy theorist wonder if the refs wanted the Falcons to cover the 9.5 points. ",
            "5": "Harvin had a big game though, catching eight balls for 95 yards and a touchdown. Christian Ponder was inconsistent, going 17-of-25 for 186 yards and the score to Harvin. ",
            "6": "Toby Gerhart also found the end zone once, though he didn't have much running room against Atlanta's stout ground defense. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "20"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: I didn't think the Bears would lose this game, let alone like they did. I figured they would be safe with Cal Hanie, but for some reason, Jay Cutler's replacement tried too many risky passes and was consequently picked off three times. He was absolutely horrible in the first half.) ",
            "2": "Both teams entered this game limited offensively. The Bears are entering the stretch run with Caleb Hanie at quarterback. The Raiders have been nicked up at the skill positions all season and were without wide receivers Denarius Moore and Jacoby Ford and stud running back Darren McFadden. Fortunately for them, they are deep at receiver and have Michael Bush as a hammer. After a quick punt by Chicago, right off the bat, Palmer welcomed Darius Heyward-Bey (4-42) back to the lineup for 19 yards. Unheralded tight end Brandon Myers had his only reception of the game for another 24 to put the offense in scoring position. As would be the theme of the day, they stalled from there, and Sebastian Janikowski made it 3-0 on a 40-yard field goal. The Bears needed to lean on the running game with a backup quarterback, but Matt Forte lost three yards to start their next drive, which went three-and-out. He was mostly bottled up on the afternoon, collecting just 84 yards on 18 touches with a huge chunk (33 yards) coming on one carry. Chicago forced a punt, but as would be another theme, they were backed up by Shane Lechler. Hanie picked up a first down on a 17-yard scramble, but the yardage was offset by a personal foul on fullback Tyler Clutts. Perhaps playing in front of the home crowd was too much for Clutts, who went to Fresno State and is from Clovis, Calif. After a false start, Hanie nervously tossed a pick to Stanford Routt while under pressure from Aaron Curry. Oakland's offense barely did enough to score, coming up with just two yards on the drive but since Janikowski is their kicker, it was no problem. He was good from 47 yards out for the 6-0 lead. The aforementioned long run by Forte (33 yards) put the Bears in plus territory, but on third down, Hanie threw another interception with Michael Huff on the receiving end. The Raiders did nothing with the ball as the first quarter ended, but Lechler not only avoided dangerous punt returner Devin Hester, he also pinned Chicago at the 3-yard line. A quick three-and-out put Oakland right back in business at midfield. They tried to get Michael Bush (24-69) going in the running game, but he was held in check all afternoon. Bush did manage to pick up a 4th-and-1, but the drive came up empty when Julius Peppers and Charles Tillman combined on a sack to back them out of field-goal range. The Bears finally got the chains moving with Marion Barber (10-69) looking like his old self running for 15, 4 and 8 yards to start the drive. Hanie (18-for-36 254 yards, 2 TDs, 3 INTs) did more damage on the run (5-50), picking up 24 to convert a 3rd-and-18. Faced with 3rd-and-8, he found his hot receiver when the Raiders blitzed, and Johnny Knox (4-145, 1 TD) did the rest for the score. Despite being outplayed, the visitors were up 7-6. I have a little fun with fullback Marcel Reece calling him a matchup nightmare which is what radio announcer Greg Papa referred to him as in the preseason, but he looked like one taking a screen 47 yards down the sideline to start Oakland's next drive. That was all they did, but it was enough for another Janikowski boot and a 9-7 lead. A squib kick was returned 56 yards by Knox and at the two-minute warning Chicago's offense was set up at the Oakland 35-yard line. A 16-yard pass to tight end Kellen Davis helped them reach the 6. However, a questionable play call of a throwback pass was blown up by the defense and resulted in an interception. Kamerion Wimbley caught the deflection from Curry and had a big return to the Chicago 6. Perhaps Hue Jackson is reeling himself in because, faced with third-and-goal from the 1, with five seconds left in the half, he wisely took the points for a 12-7 halftime lead. The field goals just kept coming in the second half. A 29-yard pass to Reece and a 17-yarder to Chaz Schilens keyed the change of field position, and Janikowski did the rest for a 15-7 advantage. The Raiders' defense held, and kept field position in their favor when the offense went nowhere. The Bears were forced to punt again after Wimbley sacked Hanie, but Oakland started the drive at its own 38 and continued to put pressure on a worn out Chicago defense. A long, scrappy drive just about closed out the third quarter and resulted in yet another Janikowski field goal for the 18-7 lead. His sixth boot was a franchise record. A 21-yard run by Barber and series of positive plays set up the Bears with a 4th-and-2 at the Raiders' 32. Lovie Smith went conservative taking the points to close within one score at 18-10 with 10:55 to play. The defense stood up, thanks to a smart challenge overturning a 15-yard reception by Darrius Heyward-Bey, but Lechler delivered a franchise record 80-yard punt that sent an amazed Hester running backwards as the ball went into the end zone. Chicago's offense had some fight left with Hanie finding Knox on a pickup of 19 yards then going right back to him on an identical play for 16 more to put them in scoring range. Hanie scrambled for seven yards and Gould connected from 53 yards out to trim the lead to 18-13. It looked like Oakland's next drive put a finish to any comeback bid. Carson Palmer (21-for-37 301 yards 1 INT) connected with Schilens to convert one third down and hit Louis Murphy for 47 yards on another to finally wound a Bears defense that answered the bell time after time, despite not getting help from their offense. Bush took the ball and ran right through the line for a 3-yard score to make it 25-13 and seemingly seal it. Hanie was not done, however, finding Knox on a bomb that the late Al Davis would certainly appreciate from the great beyond. It went 81 yards and led to a 9-yard touchdown pass to Davis. At 25-20, the Bears went to the onside kick and almost recovered it. The ball glanced off Matt Giordano, but rookie David Ausberry was on the ball and held on at the bottom of the pile. Time was still on the side of a comeback as Chicago was able to stop the clock at 2:01 in advance of the two-minute warning and got the ball back when a pass to Reece came up a yard short of a first down. Hanie utilized a pair of former Dallas receivers, Sam Hurd and Roy Williams, to move the ball 30 yards prior to a spike and incomplete pass intended for Earl Bennett. He found Forte for 12 yards, putting the team in position for a Hail Mary at their own 46-yard line and just seconds to play. Then Hanie got stupid, or cute as the case may be, attempting to emulate the old Dan Marino fake spike before actually spiking it. One problem - that's intentional grounding which results in a runoff of 10 seconds to end the game. This game was won by the specialists for the Raiders as Janikowski had four field goals (of the six he made) beyond 40 yards and Lechler averaged 54.6 yards punting while repeatedly putting the Bears in bad field position. Chicago can ride the running game and defense to wins down the stretch and earn a wild card berth as long as Hanie protects the football, which on this day, he did not. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "What a bizarre year. How could the Redskins travel across the country after an emotional overtime loss and win at Qwest Field, which is renowned for its homefield advantage? And how could Rex Grossman go 26-of-35 for 314 yards and two touchdowns? I know Grossman tossed two ugly picks, but he was great otherwise. I'm sure there will be plenty of Bad Rex next week. ",
            "2": "Santana Moss' return to the lineup definitely helped. Moss caught only four passes for 29 yards, but he opened things up for everyone else, namely Jabar Gaffney (5-72) and Fred Davis (4-58, TD). Anthony Armstrong hauled in Grossman's other touchdown, which was a 50-yard bomb. ",
            "3": "Roy Helu paced the Redskins with seven receptions (54 yards). He also rushed for 108 yards and a touchdown on 23 carries. Did Mike Shanahan finally realize that Helu is his best backfield option? I'd like to believe so - but it shouldn't surprise anyone if Ryan Torain gets most of the workload next week. ",
            "4": "Marshawn Lynch actually had more rushing yardage (24-111) than Helu. He also found the end zone by way of a 20-yard reception. Lynch suffered what looked like a scary injury in the middle of this contest, but he didn't miss much time. ",
            "5": "Someone who did get hurt, unfortunately, was Sidney Rice, who incurred another concussion in the third quarter - his second concussion in three weeks. Seattle's offense capsized after Rice left the contest. It's doubtful that he'll be able to play against the Eagles on Thursday night. ",
            "6": "Tarvaris Jackson, meanwhile, went 14-of-30 for 144 yards, two touchdowns and an interception. He also had a potential pick-six dropped. Jackson was hobbled with a chest injury, and the FOX announcers continuously stated that he has drawn the admiration of his teammates because of his ability to play through pain. Unfortunately, Jackson's just not that good. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Philadelphia's season is over, so the fans have resorted to booing and cheering their team. Not that I can blame them. The crowd got pretty angry once the Eagles blew a 10-0 lead and fell way behind the Patriots. The two targets were DeSean Jackson and Andy Reid. Jackson had multiple drops, including a possible touchdown that went right through his hands. He was ultimately benched in the fourth quarter. Meanwhile, once the Eagles failed on fourth-and-goal down 31-13, the fans erupted in a chant of, Andy sucks! Andy sucks! Andy sucks! and then Fire Andy! Fire Andy! Fire Andy! ",
            "2": "The Eagles were just outmatched. Vince Young versus Tom Brady? No chance. Brady put on a clinic. He went 24-of-34 for 361 yards and three touchdowns, as he was seldom pressured. He converted 6-of-11 third downs, and he led his team to points on seven of his first nine possessions, if you count one drive where Stephen Gostkowski missed a chip-shot field goal. ",
            "3": "Brady notched 24 completions, but only four Patriots had a reception. As you may guess, they were Wes Welker (8-115, 2 TDs), Deion Branch (6-125), Aaron Hernandez (6-62) and Rob Gronkowski (4-59, TD). ",
            "4": "Both New England rookie running backs saw action in this contest, but neither did anything meaningful. Shane Vereen (7-18) and Stevan Ridley (4-4) struggled, while BenJarvus Green-Ellis (14-44, 2 TDs) once again led the Patriots in attempts. ",
            "5": "As for Young, he actually threw for 400 yards on 26-of-48 passing with one touchdown and an interception, but most of that came in garbage time. Still, Young did an OK job considering how many drops his receivers were guilty of. ",
            "6": "Speaking of which, Jackson had four receptions for 73 yards. Even better were Jason Avant (8-110, TD) and Brent Celek (5-75). ",
            "7": "LeSean McCoy had only 10 carries because the Eagles fell behind early. He was able to compile 31 yards and a touchdown, with four catches for 30 receiving yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "13"
        },
        "comments": {
            "amount": "2",
            "1": "(Editor's Note: I can't wait to hear the Tim Tebow haters say this week. Probably more of the same nonsense. Oh, and speaking of which, one of the CBS announcers on Nick Novak's attempted field goal in overtime: Nick sweeps the leg... Quite a coincidence, considering John Kreese Elway and Johnny Lawrence Fox were on Denver's sideline.) ",
            "2": "In a must win for San Diego, the Chargers' failure to control the line of scrimmage cost them all game. The afternoon started well for them. After a San Diego field goal, Denver had a promising drive ended with a dropped pass by Eddie Royal. Philip Rivers moved the Chargers down the field and threw a strike to Antonio Gates for a 6-yard score. Late in the second quarter, Royal made up for it with a big punt return across midfield. Tebow moved the ball down the field with a two good passes. He finished the drive with an 18-yard touchdown pass to Eric Decker. In the third quarter, the teams traded field goals. Ryan Mathews broke off a 39-yard run on a pitch around the edge. San Diego couldn't finish the drive as Nick Novak missed a field goal. Denver had a promising drive of its own go for nothing. Tebow ran for a first down on a critical third down but a holding call canceled it out. He then threw a good deep pass to Decker just in front of the end zone, but Chargers defensive back Paul Oliver got away with a pass interference that caused an incompletion. On their next drive, Tebow hooked up with Decker for a 39-yard gain. It was a good pass and he made a superb catch. A few plays later, Tebow moved the ball inside the Chargers 20 with a 23-yard pass to Donate Rosario. The San Diego defense shored up and forced Denver into a game-tying field goal. The Broncos' defense came up with a clutch stop of the Chargers. A sack by Elvis Dumervil was the key play to kill the drive for San Diego. In overtime, Denver got the ball and got close to midfield before Tebow was stopped on a third-and-short run. The Chargers moved the ball into Broncos' territory and lined up for a 53-yard attempt. Denver blocked a field goal, but their head coach John Fox had called a time out, and the San Diego offensive line heard the whistle, so the Broncos busted through and blocked the kick easily. It didn't matter as Nick Novak missed the field goal on the actual play. Denver got great field position at their 43-yard line and finished the game in short order. Tebow ran for 16 yards on two carries and Willis McGahee ran up the middle for 24 yards. Broncos kicker Matt Prater made a 37-yard field goal to eke out another win for Denver. All game, San Diego's pass rush was pathetic. Tebow had all day to throw the ball on many pass plays. The Chargers' offensive line also struggled with the Broncos edge rushers. Dumervil and Von Miller combined for three sacks on the afternoon. Rivers was only 19-of-36 for 188 yards and one touchdown. Mathews ran for 137 yards on 22 carries. Gates had six catches for 50 yards and a score. Denver's play-calling is at best a work in progress. They don't mix in enough play-action passing. San Diego was selling out to stop the run and at the same time they couldn't get any pass rush. Tebow threw some good deep balls, and he is better at throwing deep than at precision passing in the short to intermediate part of the field. Tebow finished the game 9-of-18 for 143 yards and one touchdown. He also ran for 67 yards on 22 carries. McGahee had a good game with 117 yards on 23 carries. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "9"
        },
        "comments": {
            "amount": "3",
            "1": "I can't believe the Steelers didn't cover this game. They dominated this contest and forced Tyler Palko into three turnovers (two interceptions, one fumble) in the first half. Yet they managed only 13 points in a really poor showing. This should have been a 20-point blowout. Pittsburgh continuously shot itself in the foot with dumb mistakes, which was strange considering it was coming off a bye. Good teams are usually sharp following a week off. It started early when Mewelde Moore fumbled inside the 5-yard line. I don't know why the hell Moore would be carrying the ball over Rashard Mendenhall, but whatever. The offense also had numerous holding penalties that brought back big gains. I didn't count, but it seemed like rookie right tackle Marcus Gilbert had a half-a-dozen of them. Then, in the third quarter, Ben Roethlisberger (21-of-31, 193 yards, TD, INT) threw a poor interception deep downfield. I don't want to take much away from Kansas City's defense because Romeo Crennel did a phenomenal job game planning for Pittsburgh, but the Steelers really underperformed considering that they were coming off a bye and battling a team that was blown out on Monday Night Football. ",
            "2": "As for Pittsburgh's defense, the unit did a great job bottling up the Kansas City offense for three quarters despite losing Troy Polamalu to a concussion on the opening drive. However, Palko (18-of-28, 167 yards, 3 INTs) must have sprinkled some pixie dust on himself because he inexplicably improved in the fourth quarter. Unfortunately, his comeback was thwarted when Dwayne Bowe (7-69) quit on a route and didn't make an attempt to break up Palko's interception. A frustrated Palko yelled at Bowe for minutes, but the No. 1 wideout basically shrugged his quarterback off nonchalantly. And with that, Kansas City's season is officially over. ",
            "3": "Some stats: Rashard Mendenhall rushed for 57 yards on 17 carries. Antonio Brown paced Pittsburgh with four catches for 81 yards, while Mike Wallace struggled (2-17). As for the Chiefs, Thomas Jones (13-37), Dexter McCluster (9-28) and Jackie Battle (9-20) all shared carries out of the backfield. "
        }
    },
    "numberOfGames": "14"
}