{
    "year": "2011",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Bears",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "12"
        },
        "comments": {
            "amount": "5",
            "1": "How about that new Falcon offense? Matt Ryan posted a ton of passing yards (319), but the scoring attack as a whole had major issues sustaining drives. Part of it was Atlanta's perennial struggles while playing outdoors. Part of it, of course, was Chicago's stellar defense. And I'd like to believe that part of it was Jim Cornelison's awesome rendition of the national anthem prior to kickoff. That really fired up the crowd, the players and even me. I was so pumped up that I actually stopped eating Cheetos for a few minutes. At any rate, Ryan went 31-of-47 for 319 yards and a pick, as he was playing in catch-up mode the whole game. Ryan was constantly harassed by Chicago's front - he was sacked five times and hit many times more - but because he threw the ball so much, he was able to hit four different targets five times: Tony Gonzalez (5-72), Julio Jones (5-71), Roddy White (8-61) and Jason Snelling (5-32). ",
            "2": "Michael Turner gained 100 yards on only 10 carries. More than half of that came on a 53-yard scamper in which he was caught from behind by a Chicago defender, but Turner looked much healthier than he did last year. ",
            "3": "Jay Cutler was prolific against the Falcons, going 22-of-32 for 312 yards, two touchdowns and a pick. Cutler did have issues with holding on to the ball too long on a couple of his four sacks, but otherwise put together a very strong performance. ",
            "4": "The star of Chicago's offense was Matt Forte. He gained 68 rushing yards on 16 carries, and also had five catches for 90 receiving yards and a touchdown, evading seemingly slow Atlanta defenders with ease. Forte is going to have a huge year. ",
            "5": "Excluding Forte, Roy Williams paced the Bears with four grabs for 55 yards. He left the game with a groin injury in the fourth quarter, allowing Johnny Knox to see more snaps. As for Earl Bennett, he had just two catches for 11 yards, but was targeted four times. No Chicago player was targeted more than five times. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "Next year, remind me not to pay attention to what Colt McCoy does in the preseason. McCoy was woefully inept against the Bengals, going 19-of-40 for 213 yards, two touchdowns, an interception and a fumble, prompting Facebook friend John Y. to post on my wall: Does Colt McCoy know how to throw a pass longer than five yards? Looking at the stat box, you may notice that McCoy had a 56-yard completion to Mohamed Massaquoi, but that was the result of busted coverage. His impressive passes were far and few between. McCoy barely had any support from his running game. The offensive line couldn't open up anything for Peyton Hillis, who rushed for 57 yards on 17 carries; more than a third of his yardage came on a 17-yard scamper. Hillis did help McCoy in the passing attack, catching six balls for 30 receiving yards. ",
            "2": "The Browns really need to utilize Greg Little more often. Little caught just one pass for 12 yards and was targeted only three times. He also drew an embarrassing and uncharacteristic pass interference penalty on Leon Hall, who held on to Little's jersey to prevent a completion. It's really embarrassing that Cleveland is asking McCoy to throw to bums like Massaquoi and Brian Robiskie. ",
            "3": "Speaking of rookies, Andy Dalton started well, going 10-of-15 for 81 yards and a score. However, he slowed down in the second quarter and injured his hand right after halftime. He's listed as probable for next week's game at Denver. Bruce Gradkowski stepped in for an injured Dalton and led the Bengals to a victory. He lofted the 41-yard, game-winning touchdown to A.J. Green while the Browns were caught off-guard, seemingly unready for the play. ",
            "4": "Speaking of Green, he had just that one reception. In fact, only two Bengals had more than two catches: Jermaine Gresham (6-58, TD) and Jerome Simpson (4-44). ",
            "5": "Cedric Benson ran the ball well in the preseason, and that continued in the opener. He rushed for 121 yards and a touchdown on 25 carries, though those numbers are a bit inflated because he scored on a 39-yard scamper once he gained a first down as his team was running out the clock. The Browns quit and didn't show much interest in tackling Benson on that play. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "This was pathetic. Everyone was counting the Colts out with Peyton Manning injured, so I thought this veteran Indianapolis team would show some heart in an effort to prove everyone wrong. Instead, they rolled over and died. Of course, Kerry Collins (16-31, 197 yards, TD) and his dreadful offensive line were so terrible that you can't exactly blame them for quitting. Collins was sacked on the second play from scrimmage, as Jeff Linkenbach had no chance of stopping Mario Williams. On the first play of the next drive, Collins was strip-sacked and lost a fumble, leading to a Derrick Ward rushing touchdown. Collins then fumbled the snap on the initial play of the third drive, allowing Houston to find the end zone yet again (Ben Tate run). Now down 17-0, the Colts really needed to put a nice drive together and score at least a field goal to give themselves a chance. Collins moved the team to midfield and things were looking good until starting guard Joe Reitz committed a 15-yard face mask penalty. The infraction killed the drive and Indianapolis kicked the ball away, allowing Houston to score another touchdown. Game over. ",
            "2": "In total, Collins lost three fumbles. You really have to wonder why the Colts didn't just start Curtis Finger Painter. I'm not sure it would have made a difference in the outcome, but at least Painter is familiar with Jeff Saturday and the receivers. Maybe this game would have been closer. ",
            "3": "Reggie Wayne was the only Colt unaffected by Collins' presence. He caught seven passes for 106 yards and a very impressive touchdown in which he inexplicably tapped both feet inbounds before falling out of play. He still has it. ",
            "4": "As for the team that didn't give up, Ben Tate rushed for 116 yards and a touchdown on 24 carries. He looked great, as expected. The reason I had him so low in my Week 1 Fantasy Football Rankings was because I wasn't sure what Gary Kubiak would do with his running backs. Tate was amazing, but Derrick Ward (11-39, TD) was the one who started and scored the first touchdown. The two backs split carries evenly until Ward left with a minor injury. Tate drew heavy praise from Kubiak, so he'll probably be the main guy if Arian Foster misses Week 2. ",
            "5": "Matt Schaub went 17-of-24 for 220 yards, one touchdown and two picks. One of the interceptions was the result of an Andre Johnson tip. Johnson had a great game otherwise (7-95, TD). ",
            "6": "I'd like to praise the Texans and say that they've turned the corner, but we've seen this before. They demolished the Colts in Week 1 last year, and that was with Manning under center. This win was meaningless; Houston has been guilty of late-season collapses the past couple of seasons, so to me, it only matters how the team plays in November and December. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "I know Mike Munchak is new at this head coaching thing, but I would think anyone would have the common sense to know that it's best to get Chris Johnson involved as much as possible. Munchak clearly had other plans in mind, as he ran the ball with Johnson just four times in the first half. This great strategy obviously didn't work, as Tennessee managed just four first downs prior to halftime. I know Jacksonville's run defense did a great job containing Johnson on his few attempts - he was held to three rushing yards - but it doesn't matter. Keeping the ball out of CJ2K's hands like that was really irresponsible. Munchak's not going to win (m)any games with this strategy. Johnson actually had more attempts in the second half. One more, to be exact. He finished with a whopping nine carries for 24 yards. I'd buy low, if possible. ",
            "2": "Still, it's inexcusable that Johnson had nine attempts to Hasselbeck's 34. Hasselbeck went 21-of-34 for 263 yards, two touchdowns and a pick. He wasn't nearly as good as those numbers indicate, however, as he had a lucky 80-yard touchdown in which he heaved the ball up under pressure. Kenny Britt somehow caught it, broke two tackles and ran 80 yards for the score. As for Britt, he had a monstrous performance, grabbing five balls for 136 yards and a pair of touchdowns. ",
            "3": "If it weren't for Munchak forgetting the running portion of his playbook in the hotel room, I'd be completely shocked that the Jaguars managed to win just five days after cutting David Garrard. Luke McCown played well, going 17-of-24 for 175 yards. His two best throws both came in the fourth quarter when he was able to move the chains on a pair of third downs. McCown was able to hook up with Jason Hill and Mike Thomas for 15 and 26 yards, respectively, in third-and-long situations. ",
            "4": "Thomas made his PPR owners happy, catching eight balls for 55 yards. Marcedes Lewis (2-28) left the game in the third quarter with a calf strain. ",
            "5": "Maurice Jones-Drew is off to a good start in proving his critics wrong (even though he himself said his workload would have to decrease). Jones-Drew gained 97 yards and a touchdown on 24 carries, but that was probably more of a factor of Tennessee's defense just completely sucking against the run. The Titans are clearly one of the worst teams in the NFL, and it seems like we'll be seeing Jake Locker sometime soon. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bills",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "Holy crap. I like the Bills to contend for the playoffs this year and I had them winning this game in my <b> <a href=/picks.php> NFL Picks</a></b>, but never did I imagine that Buffalo would absolutely slaughter the Chiefs like this. I'd say Kansas City looked lost without Charlie Weis, but this all started at the end of last year. The team lost consecutive home games to the Raiders and Ravens by a combined score of 61-17. Matt Cassel looked completely lost in those two contests, and the same could be said of him in this game. He went just 22-of-36 for 119 yards, one score and a pick. This means that in his previous three outings, Cassel is just 42-of-87, 304 yards, one touchdown and a whopping six interceptions. That's a 3.5 YPA. Time for Andrew Luck? I'll probably slot a quarterback to the Chiefs in my next <b> <a href=/draft2012.php> 2012 NFL Mock Draft</a></b> update. ",
            "2": "With Cassel having major issues, Dwayne Bowe (2-17) couldn't do anything. The only Chief to post solid numbers was Jamaal Charles, who had a receiving touchdown to go along with 56 rushing yards on just 10 carries. I'd criticize Todd Haley for once again not giving Charles enough touches, but Kansas City was behind early and had to throw the ball to catch up. Instead, I'll criticize him for playing Cassel and Tony Moeaki too long in the preseason finale and getting both of them injured. ",
            "3": "While Cassel sucked, Ryan Fitzpatrick was a solid 17-of-25 for 208 yards and four touchdowns. Don't think about starting Fitzpatrick in your fantasy league or anything, but he'll be a solid backup this year. ",
            "4": "Steve Johnson caught one of Fitzpatrick's scores (4-66). Two others went to tight end Scott Chandler, who grabbed five balls for 63 yards. ",
            "5": "Fred Jackson handled most of the workload, rushing for 112 yards on 20 carries. C.J. Spiller found the end zone, but he did so late when the game was already well in hand. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "What a disaster for the Rams. Not only did the Eagles beat them on the scoreboard, and not only did they beat themselves with dumb mistakes, but they were also beaten down by major injuries. Let's begin with the latter, which obviously is the most important element. It all started when Steven Jackson pulled his quad on 47-yard touchdown run early in the first quarter. Jackson had another 9-yard run, but then had to leave the game. A pulled quad doesn't sound serious, but soft-tissue injuries tend to linger. Later in the game, Danny Amendola was knocked out with a dislocated elbow. According to the team, his season is in doubt. Right tackle Jason Smith (sprained ankle) and corner Ronald Bartell (stinger) were also hurt, but the big blow was to Sam Bradford, who suffered a finger injury in the fourth quarter. The Rams are fearful that Bradford may have suffered nerve damage, and Steve Spagnuolo went on to say, I'll be praying all night. ",
            "2": "As far as the Rams beating themselves, the score of this game isn't nearly as indicative of how these two teams played. St. Louis easily could have held the lead going into the fourth quarter, but continuously shot itself in the foot with mistakes: - The Eagles scored their second touchdown on a fumble return. Late in the first quarter, Bradford stumbled trying to get the ball to his running back. He lost control of the ball, which was returned 56 yards by Juqua Thomas-Parker. - Rookie tight end Lance Kendricks had two huge drops, including one that would have set the Rams up with a first-and-goal at the 5-yard line. - Brandon Gibson dropped a potential first down in the second quarter. - Amendola dropped a first-down conversion in the third quarter. - Billy Bajema had a false start on second-and-goal at the Eagles' 1-yard line. The Rams had to settle for a field goal as a result. - Josh Brown missed a 47-yard field goal in the third quarter. - Bradford missed an open Amendola for a touchdown at the end of the third quarter. ",
            "3": "Bradford's overall numbers were 17-of-30 for 188 yards, with a hidden 42 yards that he essentially threw for on a pass interference penalty off a beautiful play fake. As indicated, he was betrayed by his awful receivers. The offensive line also struggled to protect him. ",
            "4": "As for the Eagles, QB Dog Killer once again had issues reading the blitz, and he had to use his scrambling ability (10-98) to get out of trouble. His passing numbers weren't very good (14-of-32, 187 yards, 2 TDs). He was fortunate not to have an interception when he forced a ball to DeSean Jackson (6-102, TD) into double coverage early on. ",
            "5": "Jeremy Maclin had just one reception for 20 yards. I hope you took my advice and sat him; he needs to play himself into game shape. ",
            "6": "LeSean McCoy scored twice, rushing for 122 yards on 15 carries in the process. Ronnie Brown (4-7) didn't see much action - obviously a major disappointment to the one person on this planet who thought the Eagles would utilize a two-back offense. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Lions",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "To start the game, Matthew Stafford led a 12-play, 76-yard drive that resulted in a field goal. The next drive ended in disaster for Detroit as a Stafford pass to tight end Will Heller was off the mark. Heller tipped the ball into the air and Buccaneers cornerback Aqib Talib snatched the loose ball and coasted into the end zone from 28 yards out for a touchdown. The next drive Stafford dropped a snap and it was almost recovered by Tampa Bay. Stafford led a second field goal drive in the first quarter, but he missed a wide-open Calvin Johnson in the end zone from busted coverage. The pass sailed over Johnson's head, and the Lions settled for another field goal. ",
            "2": "Stafford made a beautiful touchdown toss on a fourth down. Calvin Johnson got behind Talib for a 36-yard touchdown score. Stafford threw a perfect pass just over the hand of Talib. On the next possession Stafford tossed an 11-yard score to Tony Scheffler. In the third quarter, Stafford contributed to another long drive. It ended with him throwing another touchdown to Johnson on a fade route that beat Talib. After that play, Staffford's day was pretty much done as Detroit ran the ball to drain the clock. Stafford completed 24-of-33 passes for 305 yards with three touchdown and one interception. Here were Stafford's targets: Calvin Johnson: 10 Brandon Pettigrew: 6 Nate Burleson: 5 Javhid Best: 5 Maurice Morris: 2 Rashied Davis: 1 Tony Scheffler: 1 (and one screen pass ruled a lateral) Maurice Stovall: 1 Titus Young: 1 Will Heller: 1 ",
            "3": "Megatron was more dominant than his numbers indicate. He caught six passes for 88 yards and two scores. The Bucs had no answer for him; not even Talib. ",
            "4": "Javhid Best was the Lions' primary back against Tampa Bay. Best ran for 72 yards on 21 carries (3.4 average) while catching four passes for 42 yards. The Bucs defense was able to contain Best. ",
            "5": "Tight end Brandon Pettigrew came close to having a big game. He almost had a couple of touchdowns, and he should have a productive season for Detroit. Pettigrew finished with 57 yards on four catches. ",
            "6": "Wide receiver Nate Burleson also had an effective game for Detroit with catching all five of his targets for 60 yards. ",
            "7": "For Tampa Bay, quarterback Josh Freeman started the game slowly. He took a sack when he could have thrown the ball away and was struggling to move the chains. Freeman started to heat up in the second quarter, but a poorly thrown jump ball in the end zone for Arrelious Benn was intercepted by Chris Houston. ",
            "8": "Freeman engineered a two-minute drill to produce a field goal just before halftime. The third quarter saw Freeman struggle some more. He was injured and left the game after getting tackled by multiple Lions defenders. Freeman went into the locker room with cramps, but returned to the game early in the fourth quarter after backup Josh Johnson played for one possession. It wasn't until late in the fourth quarter that Freeman finally guided the Bucs offense to a touchdown. He hit wideout Mike Williams for a 5-yard score. It was a phenomenal catch by Williams. For the day, Freeman completed 28-of-43 passes for 257 yards and one touchdown with one interception. Here were Freeman's targets: Mike Williams: 9 Earnest Graham: 9 Kellen Winslow: 8 Arrelious Benn: 7 Preston Parker: 5 Dezmon Briscoe: 1 Kregg Lumpkin: 1 Luke Stocker: 1 ",
            "9": "Buccaneers running back LeGarrette Blount couldn't get going in the first half with 13 yards on four carries. All of Tampa Bay's running backs struggled to find running room against the Lions front seven. The Bucs' inability to control the ball prevented them from getting Blount more carries in the first half. In the final two quarters, Tampa Bay was forced to throw the ball and play their two-minute offense package that has Earnest Graham in the game instead of Blount. The second-year Blount finished with 15 yards on five carries. In order for Blount to be featured more, the Bucs have to be competitive throughout the game. ",
            "10": "Tampa Bay struggled to get their top receivers involved. Tight end Kellen Winslow had six catches for 66 yards while Mike Williams finished with four receptions for 50 yards and a score. Many of the passes thrown to Winslow and Williams were off the mark, and the ones that were catchable rarely hit them when they had room to run. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "I can't believe what I just saw. Cam Newton was awesome, shattering Peyton Manning's rookie record for most passing yards in a Week 1 game. Newton, who went 24-of-37 for 422 yards, two passing touchdowns, one rushing touchdown (on a sneak) and an interception, destroyed Manning's mark of 302. What Newton did was completely legitimate. He was very accurate, both deep and short. The kicker is that he didn't even have much time in the pocket; on several plays he had to escape pressure, failing most of the time, as Arizona's defense was much quicker than any stop unit he faced in the SEC. I'm really excited to see what Newton does going forward. As Tony Dungy said on NBC's highlight show, rookies don't come in and do this, especially on the road. Newton really looks like something special. ",
            "2": "I'd like to congratulate Steve Smith for trying hard for the first time since 2009. Smith mailed it in last year, but was actually motivated in the opener. He caught eight balls for 178 yards and two touchdowns. If the Panthers lose more games, I hope Smith doesn't quit for the sake of Newton's development. ",
            "3": "I really have to wonder why the Panthers re-signed DeAngelo Williams to that massive contract. Williams carried the ball often in the first half, but finished with just 30 yards on 12 carries. Jonathan Stewart gained 26 yards on seven attempts. It would be nice if Stewart and Williams could both start in this league, for fantasy purposes, but Carolina's inept front office ruined that for us. ",
            "4": "Kevin Kolb's numbers (18-of-27, 309 yards, 2 TDs) look a bit better than he actually performed, but he did a solid job managing the offense. The Panthers blew a number of coverages, making things much easier to Kolb. Still, he deserves credit for being able to convert those opportunities, whereas Derek Anderson probably would have drunkenly tossed an interception and then laughed on the sidelines. ",
            "5": "Chris Wells looked great in the preseason, so it was not surprising to see him dash for 90 yards and a touchdown on 18 carries. Wells looked quick and spry, showing no lingering effects from last year's injuries. ",
            "6": "I'm not sure who was calling this game for FOX. I thought it was Dick Stockton, until I may have heard him doing the 49ers-Seahawks game. Perhaps he was everywhere. Nevertheless, I thought it was hilarious when Stockton(??) called Larry Fitzgerald Larry Johnson. Fitzgerald/Johnson had three grabs for 62 yards. ",
            "7": "Saving the worst for last, Jon Beason, who also signed a mega deal despite coming off a torn Achilles, was carted off the field in the third quarter. Beason, the team's best defensive player, could be out for a while. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I don't understand. With the new kickoff rules, this wasn't supposed to happen. With all the focus on upgrading the special teams, this wasn't supposed to happen. But yet, it happened. The Chargers surrendered yet another kickoff for a touchdown, as Percy Harvin returned the opening kick 103 yards. Adding injury to insult, Nate Kaeding tore his ACL on the play. He's out for the year. Even worse, five-technique Luis Castillo is also done for the season. He's San Diego's top defensive lineman. ",
            "2": "One other Charger who was injured was Mike Tolbert, but he appears to be fine. As usual, Tolbert vultured touchdowns (two) away from Ryan Mathews, though both running backs looked good in the passing game. Tolbert caught a whopping nine balls for 58 receiving yards, while Mathews notched 73 receiving yards on three receptions. Mathews and Tolbert had 45 and 35 rushing yards, respectively. ",
            "3": "Philip Rivers went 33-of-48 for 335 yards, two touchdowns and a pair of interceptions despite the fact that he was constantly harassed by a Minnesota front four that was missing Kevin Williams. ",
            "4": "Excluding Tolbert, Rivers' top target was Antonio Gates, who notched eight balls for 74 yards. Vincent Jackson (2-31) didn't do much, though Rivers nearly hooked up with him for a long touchdown. ",
            "5": "As for the Vikings, they couldn't muster much offense, scoring just 10 points if you exclude the Harvin return. Minnesota managed only 187 net yards and 10 first downs. Donovan McNabb went 7-of-15 for 39 yards, one touchdown and an interception that was tipped and impressively caught by Shaun Phillips. McNabb had absolutely no time in the pocket. He was constantly on the run, scrambling for 32 yards. ",
            "6": "Only three Vikings caught passes: Michael Jenkins (3-26, TD), Percy Harvin (2-7) and Adrian Peterson (2-6). Bernard Berrian could have caught a long pass, but didn't show much effort in trying to haul in the reception, allowing the defender to break it up. ",
            "7": "Adrian Peterson rushed for 98 yards on 16 carries. He looked great himself, but his inept offensive line couldn't open up any lanes for him. Take away one 46-yard dash, and he averaged just 3.5 yards per attempt. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "I hate Ted Ginn. I really hate Ted Ginn. I f***ing hate Ted Ginn. I wish aliens would abduct Ted Ginn so he would never play football again. When I bet on Ginn's teams, he screws me by dropping touchdowns and losing fumbles. When I bet against Ginn's teams, he returns kickoffs and punts for touchdowns. This always happens, without fail. The five-point-underdog Sehawks trailed by two late in this game, but Ginn ruined the potential cover by scoring on a kickoff and punt return. ",
            "2": "I liked the Seahawks +5 because the crappy 49ers didn't deserve to be favored by more than a field goal. Both offenses played terribly, as Seattle and San Francisco totaled just 219 and 209 net yards, respectively. <br <li=/> Alex Smith completed 15-of-20 passes, but for only 124 yards to go along with 22 rushing yards and a score. He struggled to move the chains all afternoon, but at least he didn't commit any turnovers. Smith's top target was Vernon Davis, who had five grabs for 47 yards. Braylon Edwards had just three catches for 27 yards. ",
            "3": "Frank Gore looked decent, gaining 59 yards on 22 carries. The problem was that Seattle's defense focused on Gore and baited Smith into beating them. ",
            "4": "Tarvaris Jackson was an abysmal 21-of-37 for 197 yards, two touchdowns, an interception and three fumbles. He often made just one read, as usual, often looking toward Ben Obomanu and Doug Baldwin. Speaking of Baldwin, the undrafted rookie hauled in four grabs for 83 yards and a touchdown, though most of his yardage came on a somewhat fluky 55-yard, fourth-quarter score. Ignore him in fantasy leagues. ",
            "5": "I found it hilarious that Seahawk fans on GameCenter posted comments at halftime like, T-Jack needs to step up, we can't rely on Marshawn! At that time, Lynch had just six yards on seven carries. Ladies and gentlemen, Seattle's 2011 offense! Lynch finished with 33 yards on 13 attempts, by the way. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "Sometimes the preseason isn't a strong indicator as to what's going to happen in September. Colt McCoy's struggles against the Bengals come to mind. But often times, we can get a really good estimate. This contest is a prime example. Eli Manning was awful in the preseason, as he had issues with his accuracy in every outing. That continued at Washington. Though he went 18-of-32 for 268 yards, a rushing touchdown and a pick, he made numerous poor throws and missed open receivers. That said, he doesn't deserve blame for the interception, which happened to be returned for six. Kareem McKenzie whiffed on a block, allowing rookie Ryan Kerrigan to take the pick back for six. On the other side of the coin, Rex Grossman really looked good in the exhibition contests, beating out John Beck by a mile. Grossman was really sharp against the Giants, going 21-of-34 for 305 yards and a pair of scores. He made only one mistake, which was a fumble that he committed while getting sacked. He also overthrew Jabar Gaffney for a potential touchdown, though Gaffney repaid the favor by dropping a long completion. Maybe Grossman was on to something when he said that the Redskins were going to win the NFC East. ",
            "2": "If you need a tight end in your fantasy league, pick up Fred Davis. He was every bit as good as his numbers indicate; he hauled in five passes for 105 yards. ",
            "3": "Santana Moss had six receptions for 76 yards. Tim Hightower, meanwhile, generated 72 rushing yards and a touchdown on 25 attempts to go along with three catches for 25 receiving yards. ",
            "4": "The only positive stat-producer on the Giants was Hakeem Nicks, who notched seven receptions for 122 yards. Mario Manningham's four grabs for 49 yards were the result of Manning's inaccuracy. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Jets",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "Different head coach, same old Cowboys. Dallas dominated this game, yet still somehow found a way to lose. This happened last year under Wade Phillips, and it's once again the team's M.O. under Jason Garrett. Tony Romo went 23-of-36 for 342 yards, two touchdowns and an interception. Romo played really well for about 50 minutes, but the pick cost Dallas the game; he forced a ball into a covered Dez Bryant. The blocked punt returned for a touchdown, the penalties and the fumble at the Jets 1-yard line were all huge, but Romo's pick was the worst mistake of them all because it could have been prevented. Romo himself said that he needed to avoid the big error, yet he was guilty of it because he made a dumb decision. ",
            "2": "Part of Dallas' demise occurred because of Dez Bryant's injury. Bryant caught three balls for 71 yards and a touchdown, dominating the opening drive. However, he missed some action because of leg cramps and then couldn't run whatsoever. This made it very easy for Darrelle Revis to shut him down - particularly on the aforementioned Romo interception. ",
            "3": "Romo's other targets: Jason Witten (6-110) and Miles Austin-Jones (5-90, TD). Witten nearly scored a 65-yard touchdown, but was chased down from behind and tackled at the 1-yard line by Jim Leonhard. This saved the game, as Romo fumbled a couple of plays later. ",
            "4": "Felix Jones generated 66 total yards and a touchdown in a very difficult matchup against the Jets. He'll have better days against worse defenses. ",
            "5": "Mark Sanchez struggled early on, but finished 26-of-44 for 335 yards, two touchdowns and an interception. Sanchez was able to heat up because Dallas lost numerous defensive backs to injury. Sanchez's top targets were LaDainian Tomlinson (6-73) and Santonio Holmes (6-70). Tomlinson had just five carries, but nearly as many rushing yards (16) as Shonn Greene (26). Greene simply couldn't find any running room on his 10 carries, and New York had to abandon the run because of an early deficit. ",
            "6": "Plaxico Burress didn't catch a single pass in the first half, but finished with four catches for 72 yards, including a 26-yard touchdown. I still wouldn't trust Burress in fantasy leagues; I feel like his production was the result of all the injuries in Dallas' secondary. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "34"
        },
        "comments": {
            "amount": "1",
            "1": "You can read all about the Packers-Saints game in my <a href=/blog2011kickoff.php> Live Kickoff Blog</a>. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "13"
}