{
    "year": "2011",
    "week": "18",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "The Lions battled the Saints tough back in Week 13, but thanks to countless dumb penalties, they lost by 17. But things would be different this time, right? They'd have Ndamukong Suh, Louis Delmas and Chris Houston back to help defend Drew Brees in this matchup, after all. Apparently not. Different game, same result. We can now confirm the Saints are 17 points better than the Lions. ",
            "2": "This game could have actually been much uglier. Like Detroit last time, New Orleans killed itself with mistakes early on. Marques Colston fumbled in the red zone in the first quarter. Drew Brees lost a fumble in the following period. And right before halftime, Colston dropped a touchdown. The Saints, however, got their act together in the second half. Brees was unstoppable, going 33-of-43 for 466 yards and three touchdowns. The team didn't even punt. In fact, New Orleans set a playoff record for most net yards in a single game with 626. Of course, it didn't help the Lions' cause that they continuously blew coverages and whiffed on tackles. It's amazing how many times Brees' targets were open downfield. And I know Detroit struggled versus the run all year, but making Pierre Thomas (8-66, TD) and Chris Ivory (13-47) look like Beast Mode was inexcusable. Thomas also caught six balls for 55 receiving yards. ",
            "3": "Brees' top receiver was Colston, who had seven grabs for 120 yards, though he had that aforementioned missed opportunity in the end zone. Brees' scores went to Robert Meachem (4-111, TD), who had a deep drop that went right through his hands, Devery Henderson (2-64) and Jimmy Graham (7-55). Darren Sproles was also a big factor, racking up 51 rushing yards on 10 carries, 34 receiving yards off four receptions and two touchdowns. ",
            "4": "The Lions played well offensively for most of this contest. They probably could have kept up on the scoreboard, but two horrible calls went against them. First, an inadvertent whistle nullified a defensive touchdown on Brees' fumble. In the third quarter, a horrible spot gave New Orleans a first down when it clearly should have been a punting situation. The Saints went on to score a touchdown on the drive. ",
            "5": "Matthew Stafford was great at times. He went 28-of-43 for 380 yards, four touchdowns (three pass, one rush) and two interceptions. One pick came in desperation, but the other one pretty much ended the game in the fourth quarter. Under heavy pressure, Ser Stafford irresponsibly opted to fire the ball deep to Titus Young, who wasn't open. Jabari Greer, who would also come up with the second pick, made the easy turnover. ",
            "6": "Calvin Johnson was a monster, hauling in 12 grabs for 211 yards and two touchdowns. The Saints simply had no answer for him, so you have to wonder why Ser Stafford didn't lob it up for Megatron in the fourth quarter instead of heaving it toward a covered Young. ",
            "7": "The Lions had no running game. Kevin Smith carried the ball six times for 21 yards. Detroit as a whole had just eight rushing attempts. The Saints had 32. That was the difference in this contest. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Giants",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "2"
        },
        "comments": {
            "amount": "8",
            "1": "Football is indeed a game of inches. No one knows that right now more than the Falcons. They've had issues in short-yardage situations all year, most notably in their first matchup against the Saints, and that problem was prevalent in their third-consecutive opening-game playoff defeat in four seasons. Atlanta was 0-for-3 in short yardage in this contest. They went for it on fourth-and-inches on the New York 25 on the first play of the second quarter of a scoreless game. They tried to sneak it, but failed. Luckily, they were still able to establish a lead on an ensuing safety in which Eli Manning was whistled for intentional grounding in his own end zone. The other two miscues were much more damaging. Down 10-2 at the end of the third quarter, Atlanta attempted another another sneak from the Giants' 20. Ryan was stuffed, and the entire Falcon sideline reportedly was completely deflated. Three plays later, Manning hit Hakeem Nicks for a 72-yard touchdown, blowing this contest open. Michael Turner was stuffed on 3rd-and-1 on the ensuing possession. The Falcons had to punt, and New York would find the end zone a few minutes later. The two New York scores put the game out of reach, but you have to wonder what would have happened if Atlanta opted for the field goals. With two successful kicks, the team would have trailed 10-8, and the players wouldn't have been sulking on the bench. ",
            "2": "While you could argue that Mike Smith made the right decision in being aggressive and going for it, no one can defend his antics at the end of the first half. Following an odd New York possession that featured a terrible spot by the officials, the Falcons were doing a decent job of moving the chains. They advanced to their own 45, but after being tackled inbounds, Smith inexplicably refused to take a timeout. The Falcons ran out of time and had to attempt a Hail Mary, and they went into the locker room with two timeouts in their pocket. Remember when I said that Atlanta could have been down 10-8 with two kicks? Well, if Smith used a timeout and his team was able to drive down to field-goal range, the Falcons could have led 11-10 at the end of the third quarter. It's amazing how significant inept coaching decisions can be in an NFL game. ",
            "3": "Regardless of the bad coaching, Matt Ryan was simply awful. He went 24-of-41 for just 199 yards, now owning an 0-3 playoff record. He suffered through some Roddy White drops, but he was pretty inaccurate all afternoon. He also looked shaky in the pocket. Despite the drops, White still caught five balls for 52 yards. Julio Jones was better statistically (7-64). Poor Tony Gonzalez, who still hasn't won a playoff game in his Hall-of-Fame career, had just four grabs for 44 yards. ",
            "4": "The FOX announcers and studio analysts were shocked that the Falcons couldn't run the ball, as Michael Turner mustered just 41 yards on 15 carries. This shouldn't have been a surprise, as Turner really wore down during the stretch, averaging 3.6 YPC or worse in all but one game beginning in Week 12. The Giants have also improved against the rush lately. ",
            "5": "New York, meanwhile, ran the ball really well. Brandon Jacobs (14-92) and Ahmad Bradshaw (14-63) both had more yards than Turner on fewer carries. ",
            "6": "As for Eli Manning, he struggled early because his offensive line inexplicably struggled to block a mediocre Atlanta pass rush. However, Manning settled in during the second quarter and was on fire after halftime, finishing 23-of-32 for 277 yards and three touchdowns. ",
            "7": "Two of Manning's scores went to Hakeem Nicks, who was a monster (6-115) because the Falcons paid so much attention to Victor Cruz (2-28). Of course, it didn't help that top corner Brent Grimes was out. Manning's other touchdown, by the way, went to Mario Manningham (4-68). ",
            "8": "Three fun notes: 1. As I tweeted (), Congratulations to FOX for the first ever commercial-one play-commercial-punt-commercial series. Seriously, I can't believe FOX pull this. We often see commercial-kickoff-commercial, but I don't ever recall seeing two plays sandwiched in between three ad breaks. 2. I also tweeted this in the fourth quarter: Since 1989, only one team has ever finished with 2 points in a game. That was the 1993 Bengals, who lost to the Patriots, 7-2. Well, you can now add the Falcons into that dubious category. 3. My senior editor pointed out that at one point during the second half, Troy Aikman said, Matt Ryan incompleted it. What's up with the grammar issues from all the 90s Cowboy players? <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "This is the most fun I've had watching a football game since the Patriots upset the Rams in Super Bowl XXXVI. Like most people, I love David versus Goliath matchups, and this was a true example of that. No one gave Denver a chance. Bill Simmons, whom I'm a fan of, called the Broncos the worst team to ever make the playoffs. Cris Carter and Keyshawn Johnson predictably called for a Pittsburgh blowout. Several ESPN and CBS analysts stubbornly opined that they wouldn't even score a touchdown. That certainly looked like the case when Denver mustered just eight yards of offense in the first quarter. Offensive coordinator Mike McCoy had some of the worst and most predictable play-calling I had ever seen. He called for runs on all three first downs in the opening period, and Tebow was in second-and-long as a result each time. Things really changed after that though. Just a bit, right? Tim Tebow, whom many suggested could be benched in favor of Brady Quinn because he had struggled the past two weeks, completed many deep, accurate bombs downfield. He had just five completions at halftime, but four of them were for 30, 40, 58 and 41 yards. Not included in that were a Demaryius Thomas drop inside the 5-yard line and an Eric Decker 21-yard apparent catch that was overturned after a Pittsburgh challenge. ",
            "2": "Tebow finished 10-of-21 for 316 yards and two touchdowns to go along with 50 rushing yards and a third score on the ground. If you were unfortunate enough to miss this contest, Tebow was simply amazing. He was really accurate downfield, including one pass in which he made a perfect back-shoulder throw. He went through his progressions like any good quarterback. He showed great pocket awareness. And of course, he ran when needed to, displaying his trademark rushing ability. The Broncos led throughout, beginning in the second quarter, but it looked like they might lose this playoff battle late in the fourth quarter and overtime. The ironic thing was it would have been everyone's fault but Tebow's. Willis McGahee (19-61) fumbled at midfield prior to Pittsburgh's game-tying drive. The defense struggled to stop a hobbled Ben Roethlisberger, including Champ Bailey, who dropped an interception that went right through his hands right before Big Ben hit Jerricho Cotchery for the tying score. ",
            "3": "tweeted, Josh McDaniels, the easiest target for lazy NFL fans, drafted both players that just won that game. Pretty crazy, huh? Thomas was amazing despite the aforementioned drop, catching four balls for 204 yards and the 80-yard decisive touchdown, torching corner Ike Taylor all evening. Even crazier is that Tebow and Thomas will have to battle McDaniels next week. ",
            "4": "As for the other quarterback, it was clear that Roethlisberger was hobbled by his high ankle sprain in the first three quarters, but he finished strong, even showing some nice mobility on a couple of scrambles. Big Ben went 22-of-40 for 289 yards, one touchdown and an interception. ",
            "5": "Five Steelers caught at least five passes: Emmanuel Sanders (6-81), Antonio Brown (5-70) and Heath Miller (5-60). Mike Wallace barely did anything aerially (3-26) because Bailey shut him down, but he was able to score a rushing touchdown on the 1-yard line. ",
            "6": "Pittsburgh had so many injuries in this contest. Ryan Clark, Maurkice Pouncey and Rashard Mendenhall were out. Max Starks, Casey Hampton and Brett Keisel all left with various maladies. Save for Mendenhall's absence (Isaac Redman rushed for 121 yards on 17 carries), all of the injuries were felt. There was a botched snap in the second quarter. Roethlisberger was often pressured (five sacks), while the Steeler defense accumulated no sacks and no turnovers. And of course, Tebow beat the Broncos deep in overtime - a play that perhaps may not have resulted in a touchdown if Clark were there. ",
            "7": "A quick word on the officiating in this contest: It was putrid. I don't know how the officials were able to overturn Decker's completion in which the wideout sprained his MCL because it wasn't anywhere close to being conclusive. A more egregious blown call was a clear Pittsburgh lateral that John Fox couldn't challenge for some strange reason. And then there were multiple blatant face masks that the Steelers got away with. I was so frustrated on the forums that I half-joked that the Pittsburgh players were idiots for calling tails during the overtime coin toss because it was clear the ref had a two-headed coin. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "3"
}