{
    "year": "2015",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Dolphins came into this game playing with great momentum and spirit, but they have to feel absolutely crushed right now. Not only were they completely dismantled in a humiliating blowout; they also lost two key members of their team. It started in the first quarter when right tackle JaWuan James went down with a toe injury. It was a significant loss, as the Dolphins had issues pass protecting after that. Ryan Tannehill took five sacks, which was a season-high total for him - which is saying a lot because he didn't have Branden Albert shielding his blind side prior to the bye. In the third quarter, Cameron Wake was down on the field for a while, and it was determined that he sustained an Achilles injury. Wake could be done for the season, which is huge, considering that he's one of the NFL's top pass-rushers. With Wake gone for the year, the Dolphins' chances of securing the second wild-card spot are very slim. ",
            "2": "The Patriots, meanwhile, have moved on to 7-0. Aside from the opening drive, they had trouble moving the chains in the first half. The Dolphins did a great job of putting pressure on Tom Brady, and it seemed like New England was in third-and-longs on every other set of downs. Once Wake went out, however, Brady suddenly had more time, and the Patriots became unstoppable on offense against a deflated team. Brady went 26-of-38 for 356 yards and four touchdowns. He once again played extremely well - not at all like a rotting corpse - but the pass protection continues to be a problem, especially in the wake of guard Tre' Jackson going down with an injury. In a year in which pass protection is so prevalent, this is going to be a problem against better teams that can actually keep up with New England on the scoreboard. ",
            "3": "Two of Brady's touchdowns went to Julian Edelman (7-81), while the other two were thrown to Rob Gronkowski (6-113) and Dion Lewis (6-93). All three saw nine targets. Gronkowski's score was a 47-yarder in which safety Reshad Jones whiffed on a tackle. This occurred after Lewis, who had five carries for 19 rushing yards, converted a third-and-14 on a screen. That was basically New England's offense in the opening half before the final minute. ",
            "4": "LeGarrette Blount pummeled the Miami front, which was surprising. Blount gained 72 yards on 17 carries despite the fact that the Dolphins had surrendered just 3.1 yards per attempt since the bye. Both Blount and Lewis were effective tonight, which bodes well from a fantasy perspective if you own one of them. ",
            "5": "As for the Dolphins' offense, they looked horribly inept until they put some garbage yardage together in the second half. They had fewer than 100 net yards prior to intermission and failed to cross midfield until the third quarter. Tannehill went 28-of-44 for 300 yards and two interceptions. Again, Tannehill's 300 yards are a mirage, as he had just 85 at halftime. He also took a safety when the ball was snapped before he was prepared. Tannehill's first pick was a telegraphed throw in which the defensive back ran the route for Rishard Matthews. The second was a miscommunication. This type of performance has to make the Dolphins question whether Tannehill should be their quarterback of the future. Unfortunately for them, they gave him a big contract recently. ",
            "6": "Tannehill's leading receiver was once again Jarvis Landry, who caught six balls for 71 yards. Tannehill targeted Matthews the most, however. Matthews collected seven receptions for 62 yards, but dropped a couple of passes. Besides Lamar Miller, Landry is the only consistent fantasy option on the Dolphins, and this will probably go down as one of his worst performances. ",
            "7": "Like they did on Sunday, the Patriots took away the run. Miller mustered just 15 yards on nine carries, though he bailed out his fantasy owners with a touchdown. He also caught five balls for 19 receiving yards. He could've had more yardage in that regard, but was barely tripped up. Meanwhile, Jonas Gray, making his return to New England, dropped a pass. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Chiefs lost Jamaal Charles and then dropped to 1-5 a couple of weeks ago. They looked absolutely dead, but Andy Reid and his players deserve credit for not quitting. They've reeled off two victories, and now have improved to 3-5. Following this victory, they were just 1.5 games behind the Steelers, whom they've beaten, for the second wild-card spot. Having said that, the same problems persist for the Chiefs. They can't pass protect, as Detroit even got pressure on Alex Smith pretty constantly. Smith was able to pick up big chunks of yardage while scrambling, but only because the Lions were truly inept on defense. They didn't seem to understand that Smith was capable of sprinting downfield, as they had no spy set up for him. The usual missed tackles and blown coverages didn't help either. As for Smith's passing, he made some mistakes. He was nearly pick-sixed in the second quarter and missed a wide-open Travis Kelce in the end zone. However, his day was mostly positive because Detroit allowed it to be. Smith went 18-of-26 for 145 yards and two passing touchdowns to go along with 78 rushing yards and a third score on the ground. Smith's YPA was miserable - what else is new? - but Travis Kelce and Jeremy Maclin both dropped passes, so it could've been better. ",
            "2": "Speaking of Kelce and Maclin, both players caught touchdowns, but didn't accumulate much yardage. Kelce's eight targets paced the team, and he reeled in six of them for 49 yards. Maclin, meanwhile, caught three passes for just 35 yards. ",
            "3": "Charcandrick West ran well, albeit against a dreadful defense. He didn't reach the century mark, but he accumulated 97 yards and a touchdown on 20 attempts. Knile Davis (4-9) was barely a factor, while De'Anthony Thomas scored on a trick play. ",
            "4": "As for the Detroit offense, it was more of the same despite the promotion of Jim Bob Cooter. The new coordinator wanted to simplify the blocking schemes, but it didn't matter because the line still couldn't block. Stafford was constantly under siege, taking six sacks. This rattled Stafford, who was forced into two interceptions as a consequence. Both were horrible passes that shouldn't have been thrown. Stafford was nearly picked on a couple of other occasions as well, so this performance could've been much worse. That said, I wouldn't dump him in fantasy because the new coaches could help turn things around in the second half of the season. Stafford finished 22-of-36 for 217 yards, one touchdown and the two interceptions. Don't be fooled, however. Much of that, including the score, came in garbage time. By the middle of the third quarter, Stafford was 8-of-17 for 72 yards and two picks. He looked like a hot mess, but perhaps Cooter can help improve things during the bye. Unless, of course, he's busy sneaking into random women's apartments again. ",
            "5": "Calvin Johnson saw a team-high 10 targets, but could only haul in half of them for 85 yards. He dropped a pass early and left the game in the fourth quarter with an ankle injury, ruining his chances of a garbage touchdown. ",
            "6": "The only other Lions who caught more than three passes were Golden Tate (6-59) and Theo Riddick (6-30). Eric Ebron (3-24) didn't do much. Lance Moore (3-29) secured Stafford's sole touchdown. ",
            "7": "Joique Bell rumbled for a gain of 32 on the opening drive, but the Lions oddly didn't give him the ball very much afterward. Bell finished with 56 yards on seven attempts. Ameer Abdullah barely did anything, outside of complaining to Stafford after the first interception. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Vikings had a lot going against them entering this contest. They hadn't won in Chicago since 2007; one of their top defensive linemen, Sharrif Floyd would be out; and the Bears were coming off a bye. It appeared as though Chicago was going to come away with a 20-13 victory, despite surrendering a punt return touchdown, but the team's secondary betrayed them twice, allowing the Vikings to steal a victory and improve to 5-2. Teddy Bridgewater had struggled for about 58 minutes. In the first half alone, he was 7-of-14 for only 41 yards and an interception. However, he found Stefon Diggs for a 40-yard score right after the 2-minute warning near the end of regulation, thanks to a blown coverage. Following a major Chicago error - more on that later - Bridgewater connected with Charles Johnson for a 35-yard bomb; Johnson was only on the field because Diggs hobbled off. Johnson beat a clueless Antrel Rolle, who set up Blair Walsh with the game-winning field goal. Thanks to those two deep connections, Bridgewater went 17-of-30 for 187 yards, one touchdown and the pick, which was foolishly forced into tight coverage. It sort of looked like the type of pass Jay Cutler would make. Bridgewater deserves credit for the win, but he won't be bailed out by awful secondary play when he battles superior competition. He needs to clean up his sloppy throws. For instance, he badly sailed a pass over Mike Wallace's head for a potential touchdown in the third quarter. Bridgewater absolutely needs to hit throws like that. ",
            "2": "Diggs had another big game. He caught six of his team-high 12 targets for 95 yards and the touchdown. Bridgewater was locked in on Diggs so much that the player with the next-highest amount of targets was Wallace, with four. Wallace couldn't secure a single reception. ",
            "3": "Adrian Peterson gashed the Bears, gaining 103 yards on just 20 carries, despite not having any long bursts. He also chipped in with two receptions, but for just six yards. ",
            "4": "Chicago's running backs weren't as fortunate. Matt Forte picked up 41 yards on 10 carries to go along with four catches for 28 receiving yards. However, he was knocked out with a knee injury in the second half, which reportedly is an MCL sprain. His replacement, Jeremy Langford, looked good at times, tallying 46 yards on 12 attempts. However, he absolutely killed his team with a drop in the final minute of regulation. This occurred on a third down, and a reception would've moved the sticks. Instead, the Vikings were able to obtain possession and ultimately win the game on the ensuing drive. ",
            "5": "Cutler had a solid outing, going 22-of-33 for 211 yards and a touchdown. He didn't win the game, but took just one sack and continued to play mistake-free football, which is huge for him. ",
            "6": "Alshon Jeffery abused Minnesota's secondary, catching 10 passes for 116 yards and a touchdown. He dominated the targets, seeing 15 balls go his way. Martellus Bennett was next with three grabs for 32 yards on five targets. Eddie Royal didn't do much (3-2) because he left the game with a knee injury. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Rams",
            "Points": "27"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "There's little doubt that the Rams are a much different team now than the one that lost to the Redskins and Steelers early in the year. Todd Gurley became a full-time player for them following that Pittsburgh defeat, and in the weeks since, St. Louis upset the Cardinals, stayed close to the Packers in Lambeau, and then demolished both the Browns and 49ers. Gurley is most definitely the catalyst, as he had yet another dominant performance in this contest. The 49ers actually did a good job of containing him, and yet he still accumulated 133 yards and a touchdown on just 20 carries, most of which came on a 71-yard scoring burst in the second quarter. In doing so, Gurley became the first rookie to ever open up his career with four consecutive 100-yard performances. An NFL team told us prior to the 2015 NFL Draft that they considered Gurley to be the next Jim Brown, and he certainly looks like he's the best running back in the NFL right now. He has fundamentally changed this St. Louis team, which wouldn't have crawled back to above .500 without him. Gurley is so dynamic that Jeff Fisher opted to run with him on obvious passing situations during the 2-minute drill prior to halftime. Thirty-one of 32 teams would've passed in those situations, yet Fisher called for Gurley rushes because that happened to be his best option. Of course, it says something that Fisher didn't trust Nick Foles very much. Foles was shaky in this contest, as his stat line - 14-of-23, 191 yards, one touchdown - was very misleading. That's because 66 of his yards came on a Tavon Austin receiver-screen touchdown late in the game. Take that away, and Foles was just 13-of-22 for 125 yards, giving him a pedestrian YPA of 5.68 against one of the worst aerial defenses in the NFL. ",
            "2": "Foles doesn't deserve all the blame for the passing woes, as his receivers didn't help him very much. Austin (4-98, TD) had that big gain, but he also couldn't come up with a deep catch earlier in the afternoon. He also lost a fumble deep in San Francisco territory. Kenny Britt, meanwhile, dropped two passes. Britt, who didn't log a single reception, is a bum who should no longer be on the field. I've been saying this for eight weeks now. He's a piece of crap who doesn't give full effort. ",
            "3": "Only two Rams players besides Austin accumulated more than seven receiving yards, which is mind-boggling. Those were Jared Cook (2-57) and Gurley (3-13). ",
            "4": "As for the 49ers, they had no chance to move the chains. Colin Kaepernick was constantly smothered in the backfield, and as a consequence, he failed to complete half of his passes, going 20-of-41 for 162 yards. There were two silver linings, however. The first was that Kaepernick didn't throw an interception, though he certainly came close on some instances. In fact, on one play, he was nearly picked by four separate players. I'm not exaggerating. The second was that Kaepernick, unlike last week, showed a willingness to scramble. He picked up 28 rushing yards on six runs, and while that didn't end up mattering in this contest, perhaps it will versus lesser foes. ",
            "5": "Kaepernick actually ended up leading the team in rushing yardage. In fact, no other back picked up more than six yards on the ground. Carlos Hyde was out, and Reggie Bush was slated to start, but Bush suffered an injury on an early kickoff return, which wasn't exactly the most shocking thing in the world. Because the 49ers faxed the wrong papers to the league office and accidentally waived Jarryd Hayne, they had to start Mike Davis, who mustered only four yards on 10 carries. It's a shame for San Francisco, as Hayne would've had a much better performance. ",
            "6": "With Anquan Boldin out, Kaepernick didn't have anyone to throw to. Jerome Simpson saw a team-high 10 targets, but couldn't do anything with them, catching just three passes for 34 yards. Quinton Patton (2-33), Vernon Davis (6-24) and Torrey Smith (2-19) were next on the receiving list. The 49ers are devoid of talent, so a busted fax machine is actually the least of their worries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "This might go down as one of the worst games in NFL history. Not because it wasn't entertaining; on the contrary, there was tons of action and lots of explosive plays, with each team establishing multiple leads. It went down to the wire, with Justin Tucker hitting yet another clutch kick. Unfortunately, it was a bad contest in that there were so many injuries, and we may never see one of the NFL's all-time leading receivers ever again. More than a dozen key players sustained injuries in this contest, but the most-prominent one was Steve Smith, who tore his Achilles in the third quarter. Smith had to be carried off, and he covered his face with a towel, probably because he was crying. Smith discussed this being his final NFL season, so if that's indeed the case, this was Smith's last game ever. It's a shame that his brilliant career had to end like this. ",
            "2": "Smith was just one of many Ravens who went down. Center Jeremy Zuttah also suffered an injury, and that had a major affect on Baltimore's offense in the fourth quarter. Zuttah's replacement had a huge issue snapping the ball, and Flacco consequently took some losses. However, he did a great job of moving his team down the field on the final possession - despite more bad snaps and Smith's absence - and setting Tucker up with the decisive field goal. Flacco went 25-of-37 for 319 yards and two touchdowns (one passing, one rushing). He only had a couple of poor throws, including one dropped potential pick-six early on, but he carved up a San Diego team that couldn't tackle whatsoever. The Chargers' effort on this side of the ball was embarrassing, but they can be excused a bit. Eric Weddle was out, and they lost Corey Liuget and Patrick Robinson during the contest, so they weren't close to full strength. It didn't help that safety Jahleel Addae was getting torched and being flagged for unsportsmanlike penalties throughout the afternoon. ",
            "3": "The Ravens curiously didn't run the ball very much. Justin Forsett had just four carries in the first half, which was absurd, considering that San Diego entered this contest with the league's worst rush defense. The Ravens did a better job of giving him the ball after intermission, however, and Forsett finished with 69 yards on 17 tries. ",
            "4": "Besides Smith (5-82), Baltimore's leading receiver was Kamar Aiken (6-62), who will have to move forward as the team's No. 1 wideout, at least until Breshad Perriman returns from injury. Chris Givens (3-57) was also involved, while Crockett Gillmore (2-8) secured Flacco's sole touchdown. ",
            "5": "As for the Chargers, it's remarkable that they were able to be so effective on offense, considering the injuries they sustained. It started early when King Dunlap was carted into the locker room. Keenan Allen, Stevie Johnson, Ladarius Green, Chris Watt and Chris Hairston also had to leave with injuries, though Johnson and Watt eventually returned. That's such a long list, comprised of talented play-makers and key blockers, so the 26-point output just shows how porous Baltimore's defense really is. Of course, it didn't help that C.J. Mosley and Kendrick Lewis also got hurt. Philip Rivers was terrific, going 28-of-37 for 301 yards and three touchdowns. He only made one bad decision, which was flipping the ball carelessly while in field goal range at the end of the game, and the pass was nearly pick-sixed. It was dropped, and San Diego was able to tie the game with about two minutes remaining in regulation. Unfortunately for him, his defense betrayed him and couldn't send the game into overtime. ",
            "6": "I mentioned that Allen was knocked out. It was a shame for his fantasy owners, as it appeared as though he was on pace for a solid performance. He caught all five of his targets for 35 yards and a touchdown in less than a half of action. Rivers' other scores both went to Malcom Floyd (4-92). ",
            "7": "Antonio Gates was suspected to be out, but he was a surprise active. It's a good thing he was, as Green (1-10) went down. Gates hauled in four passes for 56 yards, some of which were key third-down conversions. ",
            "8": "Melvin Gordon struggled once again, mustering just 54 yards on 18 carries. He nearly lost a fumble on one occasion. It seemed like a wasted down every time Gordon touched the ball, but to be fair, he didn't have much room behind a banged-up line. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: It's a crime that the Browns didn't cover. They were touchdown underdogs and led 20-7! If I had any money on them, I'd be having a classic meltdown right now. But I picked them for just zero units, so I'll just complain for a few sentences. Maybe if Mike Pettine wasn't such an idiot and actually used Duke Johnson, the Browns could've held on to lead, or at least the cover. Like seriously, what in the world is making him think that Isaiah Crowell and Robert Turbin (especially) are better options!? It makes no sense! ",
            "2": "This was a typical game for the Browns, as they played well for awhile before self-destructing. Cleveland built a first-half lead, but Arizona's offense came storming back. After getting hot and scoring three touchdowns, the Browns' offense wilted with four punts, an interception and a fumble in the second half before garbage time when Johnny Manziel came in. The Cardinals didn't play a complete game, thanks to turnovers and coverage issues, but they made good second half adjustments to cruise in Cleveland. ",
            "3": "To start the game, Carson Palmer got going with a 38-yard pass to J.J. Nelson and some passes to Larry Fitzgerald. Palmer finished the possession by hitting a wide-open Troy Niklas for an 11-yard touchdown. Arizona started another drive well before Chris Johnson fumbled the ball away as Karlos Dansby punched the ball out. Armonty Bryant scooped it up and returned the fumble 34 yards to the Cardinals' 9-yard line before Palmer was able to upend Bryant. McCown took advantage by throwing a bullet to Brian Hartline for a touchdown after he got behind Tyrann Mathieu. The Browns struck again as McCown hit a quick slant to Duke Johnson, who smoked Kevin Minter and took off on a 51-yard scamper. McCown finished it with a back-shoulder fade as Gary Barnidge beat Tony Jefferson for a 3-yard touchdown. McCown kept ripping the Cardinals' defense down the field and he Hartline for another short touchdown pass. Arizona got moving afterward, but Fitzgerald fumbled the ball away inside the Browns' 10-yard line after getting stripped by K'Waun Williams. The Cardinals got the ball back soon enough and moved into Cleveland territory, where Michael Floyd caught a touchdown pass. But a penalty brought that score back, so Arizona settled for a field goal to cut the Browns' lead to 20-10 at the half. Really, Cleveland was lucky to be leading as Palmer overthrew Michael Floyd and Fitzgerald running wide open down the field for touchdowns. In the third quarter, Floyd beat Joe Haden down the sideline as Palmer finally connected on a deep ball for a 60-yard touchdown pass. McCown was injured after taking a hit and was trying to gut it out, but Arizona's defense made good halftime adjustments to completely dominate Cleveland in the second half. The Cardinals got in position for more points with a 39-yard pass to Jaron Brown. The drive finished with a 1-yard score to Niklas, and just like that the Browns were down 24-20 midway through the third quarter. A terrible Palmer interception to Tashon Gipson and another fumble by Chris Johnson kept the Browns in the game, but McCown forced a pass downfield into double coverage, and Reshad Johnson intercepted the ball in the end zone. Arizona matched down the field and Palmer hit the back-shoulder pass to Fitzgerald for a 6-yard score. Arizona tacked on another field goal to clinch its fifth win of the season. ",
            "4": "Carson Palmer finished 23-of-38 for 374 yards with four touchdowns and an interception. He remains one of the top fantasy options at his position. ",
            "5": "Chris Johnson ran for 109 yards on 30 carries, but lost two fumbles. It was disappointing that he didn't do more in such a great matchup. ",
            "6": "Michael Floyd (4-106-1) and Larry Fitzgerald (9-84-1) led the Cardinals' receivers with John Brown out. Troy Niklas (2-12) had two scores. ",
            "7": "Josh McCown was 18-of-34 for 211 yards with three touchdowns and one interception. The Browns had no running game. McCown led them with 18 yards on five carries. Isaiah Crowell (10-14) was ineffective, and for some reason, the explosive Duke Johnson had only one carry for three yards despite catching two passes for 68 yards. ",
            "8": "Gary Barnidge led the Browns with seven receptions for 53 yards. Taylor Gabriel (4-32) and Travis Benjamin (3-26) were ineffective. ",
            "9": "Arizona's defense got a strip-sack out of Dwight Freeney and put a lot of heat on McCown in the second half. Surprisingly, the Cardinals' secondary had an underwhelming game against Cleveland. ",
            "10": "After being beaten by Floyd on the long touchdown, Haden went into the locker room with a head injury. Armonty Bryant and Karlos Dansby played well for the Browns. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "20"
        },
        "comments": {
            "amount": "12",
            "1": "EDITOR'S NOTE: Have the Falcons secretly sucked this whole time? They could've easily lost to the Eagles and Giants to start the year. They had some big victories, but those were against Brandon Weeden and Ryan Mallett. They then barely escaped against the Redskins, who went on to get blown out at the Jets, and the Titans, who were just crushed by the Texans. And now, Atlanta lost to the crappy Buccaneers at home. We've all been fooled, and they are not a good football team. ",
            "2": "Maybe someday the Tampa Bay Buccaneers will look back at what happened Sunday as a watershed moment in franchise history. Maybe Sunday's overtime victory will do for coach Lovie Smith what a 1996 victory at San Diego did for Tony Dungy. Smith got what was easily the biggest victory of his short tenure in Tampa Bay on a day when the Bucs (3-4) came dangerously close to blowing another big lead. Dungy's victory in San Diego marked a turning point for the franchise, and the victory against the Falcons (6-2) could do the same thing. After building a 20-3 lead in the third quarter, the Bucs looked like they were ready to choke the way they did at Washington last week when they squandered a 24-point lead. But this time ended up being different. This time, the Bucs hung on. But it wasn't easy. The Bucs let the Falcons back in the game in the second half, and a Matt Ryan touchdown pass to Julio Jones with 16 seconds remaining in regulation sent the game to overtime. From there, Tampa Bay rookie quarterback Jameis Winston calmly set up a drive that ended in a 31-yard field goal by Connor Barth. Tampa Bay's defense took care of the rest, shutting down an Atlanta drive in overtime. ",
            "3": "Smith has a reputation for being conservative. That's why a decision he made late in regulation was so surprising. Faced with a fourth-and-1 in his own territory, Smith elected to go for the first down. It didn't work as Doug Martin was stuffed, giving Atlanta the ball at Tampa Bay's 41-yard line with 1:52 remaining. If the Bucs ended up losing, that call would have been questioned endlessly. Instead, we'll give Smith a pass and credit for showing some guts. ",
            "4": "Defensive tackle Gerald McCoy has taken some recent criticism from fans for not coming up with big plays, but he made one against the Falcons. On the final play of overtime, McCoy got to Matt Ryan and tied the quarterback's legs up, forcing an incompletion. ",
            "5": "Tampa Bay's defense had a huge outing, forcing four turnovers that were converted into 20 points. Rookie middle linebacker Kwon Alexander was a force, coming up with a fumble recovery and an interception. ",
            "6": "Winston didn't have a big fantasy day, but he had a solid reality day. He completed 16-of-29 passes for 177 yards and a touchdown. More importantly, Winston didn't throw an interception for the third-straight game, and he showed plenty of poise late in the game. ",
            "7": "Atlanta's defense clearly was focused on slowing running back Doug Martin, and that strategy worked. Martin was held to 71 yards on 23 carries, ending his streak of 100-yard games at three. ",
            "8": "With wide receiver Vincent Jackson out with a knee injury, the Falcons were able to devote defensive attention to Mike Evans. He was a frequent target for Winston, but ended up with just three catches for 48 yards. ",
            "9": "For the Falcons, Ryan had a nice fantasy day, completing 35-of-47 passes for 397 yards with two touchdowns and an interception. But, in reality, Ryan didn't have a great game. Besides the interception, he lost two fumbles. ",
            "10": "After being relatively quiet for the last three contests, Jones had a bounce-back game. He had 12 catches for 162 yards with a touchdown. ",
            "11": "Atlanta tight end Jacob Tamme is becoming a player worth starting in fantasy leagues. He had 10 catches for 103 yards and a touchdown. ",
            "12": "Falcons running back Devonta Freeman entered the game as the NFL's leading rusher. But the Bucs did a decent job of keeping him in check. Freeman finished with 88 yards on 21 carries and didn't score. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "10"
        },
        "comments": {
            "amount": "12",
            "1": "EDITOR'S NOTE: Losing this game from a betting perspective hurt. The Steelers had the lead and looked like they were going to pull the upset, but Le'Veon Bell suffering a second-quarter injury was brutal. Pittsburgh couldn't move the ball whatsoever after that, costing me two units. Blegh. ",
            "2": "Ben Roethlisberger returned from his MCL sprain and four weeks on the sideline to lead the Steelers down the field on their opening drive, completing 4-of-5 passes for 80 yards and a 1-yard pass touchdown to Antonio Brown, but that was the highlight of his return. ",
            "3": "After that initial drive, this game was a defensive struggle, with interceptions and field goals dominating until the fourth quarter. Andy Dalton had his worst game of the season, completing 23-of-38 passes (60.5 percent) for 231 yards, one touchdown and two interceptions. He had only thrown two interceptions all season, so his two on Sunday tied his season total. This game was also only the second this season where he didn't throw for two or more touchdowns. If you were to promise these numbers from him, in Pittsburgh, against the Steelers' leaky defense, with Ben Roethlisberger back, 99 out of 100 people would agree this would be a Steelers win, but not this time. ",
            "4": "The only real connection Dalton was on target with all game was A.J. Green, which is a player you want to be working well with. On 17 targets, Green caught 11 for 118 yards and a touchdown, while no other Bengals player topped 39 yards receiving. In many ways, this game was held together offensively by Green. ",
            "5": "The biggest blow to the Steelers' offense was losing stud running back Le'Veon Bell with 9:14 remaining in the second half. After catching a pass, he was tackled by Vontae Burfict near the sideline and had his lower leg/knee rolled up under Burfict's full weight. Bell was then carried to the sideline, carted to the locker room and then transported to the hospital. There is some indication that it might not be a season-ending injury, but we have to wait to see at this point. ",
            "6": "After Bell went down, DeAngelo Williams took over and had some nice numbers, rushing nine times for 71 yards, including a 55-yard run that Panthers fans would recognize. He also caught four passes for 39 yards. If Bell is out for a while, Williams should be a capable backup, especially with the Steelers' usually good passing game. ",
            "7": "The leading target for the Steelers this week wasn't Antonio Brown, but tight end Heath Miller, who had zero receptions last week for the first time since 2007. He followed up that zero with 10 receptions on 13 targets for 105 yards as the Bengals gave way over the middle, to focus on stopping Antonio Brown and Martavis Bryant. ",
            "8": "Coming out of halftime, the Steelers still led 7-6 and drove down the field, but were stalled and had to kick a field goal to make it 10-6. That was the last lead Pittsburgh would have, as Roethlisberger went on to throw three interceptions, helping Dalton and company work with shorter fields. ",
            "9": "The Bengals' defense coupled with A.J. Green are the MVPs of this game, but Green gets the glory as he caught a 9-yard touchdown with 2:57 seconds left in the game to make it 13-10 Bengals. ",
            "10": "Much of Roethlisberger's troubles came after Le'Veon Bell went down, which is somewhat understandable, but Roethlisberger had two opportunities to drive his team to a victory, once with 2:57 left, when he threw an interception and then again with 1:47 left, and he came up short both times. I think Pittsburgh fans can chalk this one up to rust and a good Cincinnati defense more than Bell's absence. ",
            "11": "The Bengals' running backs split was highly in favor of Jeremy Hill this week. Cincinnati wanted to grind this game out with Hill rather than playing the up-tempo pass game with Giovani Bernard. Hill ran the ball 15 times for 60 yards, while Bernard ran once for 12 yards. Bernard also had two receptions for 22 yards, and Hill had one for eight yards. Again, the more talented pure runner was Bernard, but Hill is still the better between-the-tackles runner, especially when trying to wear down the defense. Much like Dion Lewis and LeGarrette Blount, we will see this team lean on one of their backs more, based on their offensive game plan or game flow if they get behind. ",
            "12": "Even with a sub-par game from Dalton, the Bengals found a way to win in Pittsburgh to stay undefeated. That's the mark of a good team and one that could become a great team if they build on this divisional win. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Texans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "6"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: And to think, the Titans, at one point, thought that they'd keep Zach Mettenberger as their starter rather than draft Marcus Mariota. Crazy. There's really no comparison, as the Titans had no chance with Mettenberger, even against one of the worst teams in football. ",
            "2": "Against a backup quarterback and a terrible offensive line, the Texans' defense finally looked like the dominating unit everyone thought they would be entering the season. J.J. Watt and Whitney Mercilus were awesome, as they destroyed Tennessee's offensive line and teed off on the statue in the pocket known as Zach Mettenberger. ",
            "3": "The Titans' first possession produced a field goal after runs from Dexter McCluster and Antonio Andrews, a 12-yard pass to Dorial Green-Beckham, and a Brian Cushing roughing-the-passer penalty moved the ball in for a 35-yard opportunity. The Texans' defense then locked it down and started to win the field-position punt exchange between the offenses. Houston started a drive around midfield and a few passes moved the ball to Tennessee territory before DeAndre Hopkins made a tremendous leaping catch in the corner of the end zone for a 21-yard score. Bishop Sankey promptly fumbled the ball to the Texans on the kickoff. The Houston offense didn't move the ball though, and Nick Novack kicked a field goal. After trading punts, Dexter McCluster made a 37-yard return to the Texans' 28, but Whitney Mercilus had a sack, which along with a 15-yard penalty on Byron Bell, moved the ball out of field goal position. Houston took a 10-3 lead into the half. In the third quarter, the Titans got going when Antonio Andrews put together a 28-yard run. A great play by Texans rookie corner Kevin Johnson killed the drive, and Tennessee settled for another field goal. Houston got moving afterward with passes to Hopkins before Hoyer threw a bomb to Nate Washington, who had beaten Coty Sensabugh, for a 42-yard touchdown. Following a J.J. Watt sack, Mettenberger was picked off by Johnson. The Texans then punted and pinned the Titans inside the 10-yard line. Watt soon beat a double-team to get a strip-sack that was recovered by Jared Crick at the Tennessee's 10-yard line. Houston could only get three out of the turnover, but it didn't matter because the defense slammed the door on the Titans. ",
            "4": "DeAndre Hopkins totaled 94 yards on eight catches with a score. Nate Washington made four receptions for 74 yards and a touchdown. ",
            "5": "Brian Hoyer completed 23-of-35 for 235 yards with two scores. Alfred Blue, meanwhile, recorded 39 yards on 14 carries, a disappointing showing. ",
            "6": "Zach Mettenberger went 22-of-31 for 171 yards with an interception. Antonio Andrews actually ran pretty well for the Titans, notching 64 yards on 16 carries. ",
            "7": "Tight end Delanie Walker led Tennessee with 62 yards on six receptions. Kendall Wright (4-21), Justin Hunter (2-17) and Dorial Green-Beckham (1-12) couldn't do much with Mettenberger and the offensive line struggling. ",
            "8": "Tennessee's defense played well considering the tough positions they were put in. The Texans couldn't run the ball with only Hopkins and Washington making plays for the offense. Karl Klug, Brian Orakpo, Jurrell Casey and Zach Brown all notched sacks for the Titans. ",
            "9": "The Texans' defense was superb and finally played a complete game. Mercilus and Watt were animals off the edge. Mercilus recorded 3.5 sacks, while Watt notched 2.5 and a forced fumble. Jared Crick chipped in another sack. Rookie corner Kevin Johnson made six tackles, plus an interception, and played extremely well. The one negative was that Jadeveon Clowney left the game in the first half with a back injury. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Saints",
            "Points": "52"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "49"
        },
        "comments": {
            "amount": "12",
            "1": "EDITOR'S NOTE: Was anyone else rooting for the Saints to both lose and win at the very end? I wanted their kicker to miss the decisive field goal so that the game could go to overtime, so that Drew Brees could set an NFL record with an eighth touchdown pass. But congratulations to Brees regardless; seven scores with a somewhay shaky supporting cast is pretty damn impressive. ",
            "2": "You can forget all that talk about Drew Brees being washed up, and you can forget the talk that the New Orleans Saints aren't a factor in the NFC South. Brees had the best day of his career, throwing for 511 yards and tying the league record with seven touchdown passes, as the Saints won a crazy game on a 50-yard field goal by Kai Forbath as time expired. The game featured an NFL-record 13 touchdown passes as New York's Eli Manning had a career-high six touchdown passes, including three to fellow New Orleans native Odell Beckham Jr. But Manning's big day still wasn't quite enough against the Saints. New Orleans now has won four of its last five games after getting off to an 0-3 start. Carolina (6-0) leads the division and Atlanta is 6-2, but the Saints might be the hottest team in the NFC South right now. ",
            "3": "Brees was sharper than I've ever seen him, and I've seen plenty of games where he was very sharp. He completed 40-of-50 passes. ",
            "4": "Trading Jimmy Graham to Seattle in the offseason is starting to look like a pretty good move by the Saints. His replacement, Benjamin Watson, had another big game. Watson had nine catches for 147 yards and a touchdown. He has become a guy you must start on your fantasy team. ",
            "5": "Speaking of guys who can't be written off, how about New Orleans receiver Marques Colston? He's been pretty much silent all season, and that's led to speculation that age has caught up to him. But Colston had a huge day against the Giants. He logged eight catches for 114 yards and a touchdown. ",
            "6": "What might have been the most impressive thing about Brees' performance was the way he spread the ball around. He completed passes to nine different players, and five different players had touchdown catches. Wide receivers Brandin Cooks and Willie Snead each had two touchdown receptions. ",
            "7": "It was lost in the shuffle of all the passing, but running back Mark Ingram had another pretty solid day. He had 16 carries for 80 yards and is a guy worth using in daily formats. ",
            "8": "The downer of the day for the Saints was that backup running back Khiry Robinson suffered a leg injury that appeared serious. ",
            "9": "For the Giants (4-4), Manning had a performance that, under normal circumstances, would have been more than enough for a victory. But these circumstances weren't at all normal. Manning completed 30-of-41 passes for 350 yards and six touchdowns as the Giants tried to play catch up most of the day. ",
            "10": "If you're not starting Beckham on your fantasy team, perhaps you should consider other hobbies. Beckham had eight catches for 130 yards and three touchdowns. ",
            "11": "New York wide receiver Dwayne Harris is a journeyman, but he had the best day of his career, catching two touchdown passes. ",
            "12": "With all the passing, the Giants didn't run the ball very much. Rashad Jennings led the way with 54 yards on 10 carries. Jennings, who has one rushing touchdown on the season, is not a guy you want starting on your fantasy team. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "No one gave the Raiders much of a chance going into this season, or even this game. Both the public and sharps pounded New York like crazy, with about 80 percent of the action coming in on them. Not only did Oakland pull the upset; it dominated this contest. The end result said it was a two-touchdown victory, but the Raiders could've easily won by close to 30 points. Some garbage scores tightened the margin, but it didn't matter. In the end, the Raiders improved to 4-3 and moved into position for one of the wild-card spots. The biggest difference has been Derek Carr. He looked like Aaron Rodgers against the Chargers last week, and he once again played like a Pro Bowler. He went 23-of-36 for 333 yards and four touchdowns, and his numbers could've been even better if it wasn't for some late-game sloppiness when the team was up big. This performance was highly impressive, especially considering the type of defense he was going up against. The Jets missed lots of tackles, but they still have talented personnel that's been capable of shutting down other high-powered scoring attacks. ",
            "2": "Despite Carr's great numbers, he and Amari Cooper couldn't hook up very often. Cooper caught five passes for 46 yards, thanks to some excellent coverage from Darrelle Revis, who is one of the few Jet defenders who actually played well. Instead, Carr targeted Michael Crabtree most often. Crabtree saw 12 balls go his way, securing seven of them for 102 yards and a touchdown. He nearly had a second score early on, but his sole conversion was a great one, as he eluded numerous tacklers. ",
            "3": "Carr's other scores went to Taiwan Jones for 59 yards, and Andre Holmes, who snatched two, but also dropped a pass. Don't get excited about either, as the two combined for just four targets. ",
            "4": "Latavius Murray came into the game faced with a tough matchup. In fact, the NFL Network's Michael Fabiano even predicted that he wouldn't be a top-20 back this week. Murray silenced the critics by rumbling for 113 yards on 20 carries. Once again, New York simply showed no interest in tackling. ",
            "5": "As for the Jets, they suddenly have some injury concerns. Ryan Fitzpatrick sustained torn ligaments in his thumb, knocking him out of most of the game in favor of Geno Smith. That didn't work out too well, as Smith made numerous mistakes. He fired an interception into double coverage, which was snatched by Charles Woodson. He later took a 5-yard loss on a third down late in the game by running out of bounds instead of throwing the ball away. Smith then took a terrible sack and didn't seem to know how to line the team up. He took a big hit, forcing Fitzpatrick to reenter the contest briefly, but Smith was able to return to make more mistakes. Smith went 27-of-42 for 265 yards, two touchdowns and an interception. The numbers are inflated because the Raiders let him have short completions in garbage time. Smith may not be any sort of downgrade over Fitzpatrick, but he's inconsistent, which could hurt going forward, since Fitzpatrick is set to miss some time. The Jets have reportedly already begun contacting some free-agent quarterbacks to replace Fitzpatrick. ",
            "6": "Brandon Marshall was also banged up, leaving the contest on two separate occasions. His knee popped awkwardly the second time, so it wouldn't surprise me if he missed a game or two, though it's also possible that he couldbe fine for Week 9. Marshall saw 18 targets and reeled in nine balls for 108 yards. Eric Decker, meanwhile, snatched six receptions for 60 yards and a touchdown. ",
            "7": "The silver lining for the Jets is that they may have Nick Mangold back next week. Mangold's absence hurt the running game - among other things - as Chris Ivory was limited to just 17 yards on 15 carries. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "The Cowboys have dropped to 2-5, but could easily be 6-1 right now if Tony Romo hadn't gotten injured. They would've beaten the Falcons, Saints and Giants with Romo for sure, and I think the Seahawks can be added to that list, given that Dallas hung in with Seattle, losing by just one point despite Matt Cassel starting once again. Cassel struggled in his second start. He at least didn't commit a turnover this time - though he was close for what would've been a horrific front-door cover at the end - but aside from some timely scrambles, he simply didn't threaten Seattle's defense with his dinks and dunks. His stat line says it all. He went 13-of-25 for only 97 yards. That's a YPA of 3.88, which is just embarrassing. Somewhere out there, Brodie Croyle is laughing at such a horrible number. It's worth noting that Cassel picked up for 43 rushing yards on four running attempts. He showed a ton of emotion after one scamper in which he picked up a first down. Mobility and leadership are two traits Cassel possesses that Brandon Weeden doesn't, so he should continue to start. However, Dallas is going to continue to struggle until Romo returns. That will be in three weeks. ",
            "2": "Dez Bryant made his return, but it didn't matter. Richard Sherman smothered Bryant, limiting him to just two catches for 12 yards on six targets. He nearly had an interception on one occasion, and he also did a terrific job to break up a touchdown in the second half. ",
            "3": "Darren McFadden had a great outing. He only rushed for 64 yards on 20 carries, but considering that Seattle's terrific ground defense was stacking the line of scrimmage, he did well. McFadden ran with great strength and burst, and he was huge in the passing game, catching six balls for 49 receiving yards. He also had a big run called back by an inconsequential illegal motion. ",
            "4": "Some other Dallas players of note: Christine Michael, battling his former team, mustered 20 yards on five carries, but was also guilty of a drop. Terrance Williams (2-20) and Jason Witten (2-16) disappointed their fantasy owners. ",
            "5": "The Seahawks, meanwhile, may have prevailed, but this was yet another discouraging showing from their offensive line. Russell Wilson was constantly under siege. He wasn't sacked at all, but he had to run for his life on so many occasions, with Greg Hardy constantly bearing down on him. Hardy also had an interception, tipping a Wilson ball into the air and then snatching it. That was Dallas' first take-away since Week 2. Despite this, Wilson went 19-of-30 for 210 yards, one touchdown and that pick. He made some poor throws, including a horrible pass behind Jimmy Graham on a third down, and a near interception late on an overthrow, but he was able to take advantage of Barry Church's replacement by firing a score to Luke Willson after the safety left with an injury. He also scrambled six times for 32 rushing yards, which helped put Seattle in position for the game-winning field goal. ",
            "6": "Marshawn Lynch had trouble finding running room behind his poor offensive line. He ran like a bull, but there were just too many instances in which he didn't have any lanes. He mustered 71 yards on 21 carries. ",
            "7": "Graham paced the Seahawks in targets (10), catches (7) and receiving yards (75). After Willson (2-41), Tyler Lockett was next on the receiving list, collecting three balls for 36 yards, but he dropped a pass on third down. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "If you were to tell me that Aaron Rodgers would be limited to 77 passing yards in this matchup, I would've asked, OK, what quarter did he get injured in? If you missed this game, yes, Rodgers played throughout. He simply had no chance against Denver's prolific defense. It was amazing how dominant the Broncos' stop unit was. The group both pressured Rodgers heavily, who barely had any room to breathe, and smothered his receivers. Aqib Talib and Chris Harris combined to surrender just four catches for 21 passing yards. Rodgers had to look off his first and second reads most of the time, and by then, he was either being sacked or chased out of the pocket. Rodgers, who usually can pick up significant yardage on the ground, couldn't scramble very much because there was a spy. It seemed as though the Broncos had all of the answers. ",
            "2": "Meanwhile, the narrative concerning the other side of the ball will be that Peyton Manning is back. Manning, after all, went 21-of-29 for 340 yards. However, despite his high completion percentage and yardage total, there's still cause for concern. Some of Manning's passes took forever to reach their targets, and he also had an underthrown ball that was picked off. So, how was Manning able to have great success? The Packers lost multiple defensive backs early, including Sam Shields, so they had to go to an ineffective zone that constantly left receivers open in the middle of the field. Manning had open targets all evening, and quite frankly, it was just as challenging as a seven-on-seven drill. This Packer defense has played like garbage of late, nearly losing to a bad San Diego squad prior to the bye because Philip Rivers threw for 500 yards. ",
            "3": "The concerning thing for the Packers is that they couldn't stop the rush. The ineptitude against the pass can at least be explained by the injured defensive backs, but C.J. Anderson and Ronnie Hillman, both of whom have struggled this entire season, combined for 161 yards and three touchdowns on the ground. Anderson was terrific, sprinting for 101 yards and a score on just 14 attempts, while Hillman managed 60 yards and two end-zone trips to 19 tries. For those of you who haven't given up on Anderson, this was huge, as he might be able to be started again. I'd still be cautious, as his score came when Clay Matthews left the contest briefly, but this is obviously a positive development. ",
            "4": "Despite Manning's high receiving total, only one Bronco had more than 61 yards. That was Demaryius Thomas, who racked up eight catches for 168 yards. He ate up the middle of the field, as did tight ends Virgil Green (3-61) and Owen Daniels (3-44). Unfortunately for Emmanuel Sanders owners, their wideout didn't do very much; he caught only two of his five targets for 22 yards. ",
            "5": "Going back to the Packers, Rodgers' official stat line was 14-of-22 for just 77 yards, a career-low YPA of 3.5. He also was strip-sacked for a safety. As mentioned, he was rattled in the pocket, and this forced him into some inaccurate passes, including some overthrows. ",
            "6": "With Rodgers' low passing total, his leading receiver, Randall Cobb, had just 27 yards on six catches. James Jones caught only one ball for two yards. It was a controversial play because the official screwed up the forward-progress call, but it didn't have an overall bearing on the outcome of this game. ",
            "7": "It appeared as though the Packers would be able to run the ball when Eddie Lacy ripped off a 15-yard run to begin the contest, but the Broncos shut him down as well. Lacy was limited to just 38 yards on 11 attempts, though he did score a touchdown. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "I can barely describe what happened in this game. The Panthers held a 23-6 lead in the fourth quarter, and it appeared as though they were going to win easily. They completely dominated this contest, limiting Indianapolis to fewer than 200 net yards through three quarters. Andrew Luck literally looked like the worst quarterback in the NFL, as he posted a line of 4-of-10, 37 yards by halftime. He couldn't even complete routine passes. He threw wide of his targets, missing open receivers, and was responsible for two picks. The first was one of the worst passes I've ever seen from a professional signal-caller, while another was an ugly overthrow. He was also strip-sacked, but was fortunate to recover the loose ball. By the time the Panthers went up 23-6 in the fourth quarter, I imagine people stopped watching the game and went to bed. If you shut the TV off, you missed one of the craziest finishes ever. Luck went nuts in the final portion of the fourth quarter. He was drilling his receivers in stride, regaining his pin-point accuracy. The Panthers, who looked gassed, didn't seem to have any answers. Luck put together three scoring drives to tie the game at the end of regulation. Luck definitely had some help from a horrific officiating crew - an awful hold on Greg Olsen, an incorrect ruling on a completed pass, and a determination that an Indianapolis player was out of bounds when he clearly was tackled in the field of play, were just some of the atrocious calls - but he deserves all the credit in the world for not giving up and giving his team a chance. Unfortunately for Luck, he threw his third interception in overtime. It was off a deflection, and Luke Kuechly just happened to be at the right place at the right time. The Panthers took advantage of the field position to set up a game-winning field goal by Graham Gano, who was able to redeem himself after whiffing on an extra point earlier in the evening. ",
            "2": "It's crazy that this game went to overtime, as it was completely lopsided after three-and-a-half quarters. The Panthers' defense dominated, while the offense moved the ball somewhat well for most of the night. Carolina converted two early turnovers - a botched snap, Luck's first pick - into 10 points, as Ron Rivera went for it twice on fourth down. However, the Panthers made enough mistakes along the way themselves to keep Indianapolis alive. For instance, Cam Newton and Jonathan Stewart had a fumble on a read-option exchange. Olsen dropped a 25-yard reception. Newton fired an ugly interception off his back foot that Ted Ginn didn't fight for. Olsen had a blatant pick on a long Ginn catch. The Panthers fumbled the ball inside the Indianapolis 5-yard line because of a botched snap. So, while this was 23-6 in the fourth quarter, it could've easile been 37-6, and the game would've been completely out of reach. ",
            "3": "Newton finished with a horrible completion percentage, going 16-of-35 for 248 yards, two touchdowns and the interception. He had some accuracy issues, but was betrayed by tons of drops, including one by Ginn that would've won the game in overtime. The torrential downpour had something to do with it, as both Newton and Luck were better when the rain died down. Newton was 10-of-18 for 166 yards and two touchdowns following intermission, though he was nearly picked again by Vontae Davis. He also scrambled 10 times for 41 rushing yards. ",
            "4": "Newton's touchdowns went to Olsen (6-79) and Philly Brown (3-42). Olsen had an up-and-down game; he made some great plays, but also was guilty of some penalties and a big drop. His offensive pass interference was way too blatant. Ginn, meanwhile, reeled in just two of his 10 targets for 60 yards. ",
            "5": "Jonathan Stewart continued his torrid pace following the bye. He rushed for 82 yards and a touchdown on 24 carries. All but 17 of his yards came after halftime, as the Colts had him bottled up early. However, Stewart eventually broke free and rumbled for big gains. ",
            "6": "As for the Colts, Luck's final numbers were 23-of-47 for 231 yards, two touchdowns and three interceptions. He also scrambled six times for 35 rushing yards. Whatever Luck did to summon his former, lethal self late in the fourth quarter, he'll need to channel it going forward. The Luck we saw late is capable of beating any team in the NFL. However, Luck is clearly injured, so he'll need to get healthy before he can perform like an All-Pro quarterback consistently again. ",
            "7": "Luck's late touchdowns went to Andre Johnson (4-81) and Coby Fleener (7-43). The usual suspects, T.Y. Hilton and Donte Moncrief, did nothing. Hilton saw seven targets, but was able to come up with only one reception for 15 yards, thanks to Josh Norman's incredible coverage. Norman broke up a couple of touchdowns and continued to perform like the best cornerback in football. Moncrief, meanwhile, was limited to just 18 yards on two receptions. He also saw seven targets. ",
            "8": "The Colts had a couple of double-digit runs from their backs, with Ahmad Bradshaw breaking free for a 23-yard burst on an early third-and-10. Gore received most of the workload, tallying 70 yards on 22 tries. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}