{
    "year": "2015",
    "week": "19",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "The Patriots limped toward the end of the season, losing to both the Jets and Dolphins, which ultimately cost them home-field advantage. They were so incredibly banged up that Bill Belichick didn't even want to risk Tom Brady's health in an overtime contest against a fierce Jets defense. Belichick was willing to concede those games for a chance at the ultimate prize, and as always, he made the correct decision. Most of New England's players were set to return for this contest, though there was some concern with Rob Gronkowski and his back. That turned out to be a non-factor, as Gronkowski was completely dominant. Brady, meanwhile, seemed to be back to form - though there were a few shaky moments early on. The Patriots scored on their opening drive, throwing on every single play. Brady's first pass was way behind Julian Edelman, but he then hit Edelman on a sharp, 11-yard throw on a third-and-10. Brady went back to Edelman for 13 on the next play, as their chemistry was still so strong that a clueless football fan wouldn't have known that Edelman missed any time. However, the Patriots stumbled a bit after that. For instance, Brady missed Edelman for what would've been a huge gain. Edelman then dropped a pass that was nearly intercepted, and James White followed that up with a drop of his own. The Patriots went into the break with a 14-6 lead, which should've been much greater. However, they were able to convert most of their drives into points by finally getting their act together. They ultimately went up two touchdowns, though the Chiefs scored at the end to decrease the margin to seven. ",
            "2": "Brady, as mentioned, was guilty of some errors early, but had a great performance overall. He went 28-of-42 for 302 yards and three touchdowns (two passing, one rushing). He was nearly picked once by Marcus Peters, but that was one of his few blemishes in the second half. ",
            "3": "Both of Brady's scores went to Gronkowski, who showed no signs that he had any sort of back issue. He caught seven of the eight passes thrown to him for 83 yards and the touchdowns. He trailed only Edelman in the receiving department; Edelman saw a whopping 16 targets and hauled in 10 of them for an even 100 yards. As mentioned, he had a drop, and Brady missed him for what would have been a huge gain. ",
            "4": "Danny Amendola is worth noting, but not because of his stat line, which was a meager two catches for 18 yards. He lit up a Kansas City special-teams player on an absolutely dirty hit on a punt return. It wouldn't surprise me if he happened to be suspended for that, especially with what happened last week in the Cincinnati-Pittsburgh blood bath. ",
            "5": "The Patriots barely ran, but why would they? The Chiefs are stout versus the rush, and Steven Jackson isn't any good. Jackson was limited to just 16 yards on six carries. ",
            "6": "The Chiefs, meanwhile, couldn't run the ball as much as they wanted to because they were constantly trailing. They rushed 23 times, excluding Alex Smith's scrambles, compared to 50 pass attempts. Charcandrick West dropped a pass, but scored a touchdown to complement his 17-61 line. Spencer Ware, meanwhile, was nowhere to be seen for some reason. Knile Davis (6-30) shared the workload with West, but was guilty of a key fumble when the score was 14-6 in the third quarter. ",
            "7": "As for Smith, he played the best he could have, but proved to be just too limited. He made some sharp throws, even converting some third-and-long situations, including one play in which he dodged three potential sacks to find Jason Avant for a 26-yard gain. However, Smith struggled in the red zone, which was expected. Smith went 29-of-50 for 246 yards and a touchdown, which doesn't look that bad at first glance, but his YPA (4.92) is pretty brutal. Smith did, however, make up for it by picking up 44 yards on the ground. That said, Smith is just way too limited to lead a team deep into the playoffs. He can beat up on bad teams during the regular season, but he'll never overcome top-level competition. ",
            "8": "It didn't help Smith's cause that Jeremy Maclin barely played. Maclin was constantly on and off the field. It appeared as though he would be fine after reeling in an early catch on a third down to move the chains, but he limped off at one point and wasn't heard from again. He caught two passes for 23 yards. ",
            "9": "The trio of Jason Avant (4-69), Albert Wilson (5-57, TD) and Chris Conley (5-33) tried their best to replace Maclin, as well as Travis Kelce (6-23), who was erased by Belichick's schemes. Avant was the best of the bunch, as he showed off some great hands. ",
            "10": "Andy Reid's abysmal clock management needs to be mentioned. Down 14, the Chiefs took their time on a drive late in the fourth quarter. They were ultimately set up with a first-and-goal at the 1-yard line with 2:50 remaining. However, they somehow ran just one play prior to the 2-minute warning. After that, the Chiefs actually huddled up with 1:40 on the clock, as it ticked down. It reminded me so much of the Patriots-Eagles Super Bowl 11 years ago when the Eagles took their time and Donovan McNabb puked all over the field. It's astonishing that Reid hasn't fixed this problem after more than a decade. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "20"
        },
        "comments": {
            "amount": "1",
            "1": "I posted the following on my Facebook wall at the very end of regulation: "
        }
    }
}