{
    "year": "2015",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Rams",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "comments": {
            "amount": "9",
            "1": "These teams appeared to be heading in different directions entering this game, and they're continuing to move that way. The Buccaneers had lost two of their previous three contests (to the Colts and Saints), while St. Louis had rebounded off its losing streak to beat the Lions last week, thanks to some defenders returning to the lineup. The Rams prevailed in a blowout. And yes, this wasn't close. St. Louis led 31-13 late before the Buccaneers posted some meaningless scores to make this game look a lot closer than it really was. ",
            "2": "The star of this matchup wasn't Todd Gurley or Jameis Winston. It was Case Keenum, who played the game of his life. Keenum was extremely precise on almost every throw, going 14-of-17 for 234 yards and two touchdowns. He began the contest by dinking and dunking, but he made some special passes as the evening progressed. Keenum hit Kenny Britt in stride with a 60-yard bomb in the first quarter. He later showed great touch when lofting a pass over a defender's head to Jared Cook for a 17-yard gain. He then managed to complete another deep pass by threading the needle in between two defenders. Keenum made just two errors in this contest, both of which occurred on the final drive of the opening half. He had a pass that was dropped by a Tampa defender, and then he took a horrible sack to give his team no chance on a third down. However, those were his only blemishes. It'll be interesting to see how he fares in the next couple of games. If Keenum puts together a pair of quality performances, the Rams may eschew taking a quarterback in the first round, which is what I have happening in my <a href=/draft2016.php>2016 NFL Mock Draft</a>. ",
            "3": "As for Gurley, he had trouble finding room against a tough Tampa Bay run defense. He still performed well for his owners, however, as he generated 48 yards and a touchdown on 21 carries. He was in position for a second score following a Benny Cunningham kickoff return down to the 2-yard line, but he was stuffed on three consecutive plays. ",
            "4": "Tavon Austin had a spectacular night. He scored twice; once rushing and once receiving. He compiled 32 rushing yards (four carries) and 41 receiving yards (three catches). It actually makes me wonder why he touched the ball just seven times. ",
            "5": "St. Louis' two leading receivers were Britt (2-71, TD) and Cook (4-64). It was surprising to see both try hard. They must have been motivated because they didn't want to embarrass themselves on national TV. ",
            "6": "Moving on to the Buccaneers, Winston struggled, despite what his numbers may say. Winston went 29-of-50 for 363 yards, two touchdowns and an interception. Those stats are completely misleading, as Winston was just 6-of-12 for 49 yards at halftime. A large chunk of his yardage, as well as both scores, came in garbage time. Winston was very inaccurate throughout the evening. He sailed passes over his receivers' heads, including Doug Martin on one instance when Martin was in position to catch a simple pass in the flat. Winston also had a second dropped pick in the end zone, and he had to eat a timeout right before halftime because he spent 30 seconds yelling at several Rams players, including Aaron Donald, after what he felt was a dirty hit. ",
            "7": "Mike Evans and Austin Seferian-Jenkins benefited from Winston's junk-time stats. Evans had just three grabs for 36 yards in the first half, but he finished with nine catches for 157 yards. He dropped another pass, but he would've enjoyed a much better game had Winston not missed him on numerous occasions. Seferian-Jenkins, meanwhile made only three grabs for 29 yards, but he was able to haul in a touchdown at the very end. ",
            "8": "Doug Martin and Charlie Sims both ran extremely well. Martin burst for 91 yards on just 18 carries, while Sims (7-50) also posted an impressive stat line. It was odd to see the Rams struggle so much versus the run. However, they did manage to stuff Martin on a fourth down before halftime, and they were able to force him into a fumble. ",
            "9": "Some Rams fans were trying to chant Keep the Rams! Keep the Rams! Perhaps St. Louis would keep its team if more fans showed up. Here's a shot of the stands 20 minutes prior to kickoff last Sunday versus the Lions. Try not to laugh too hard: "
        }
    }
}