{
    "year": "2015",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "20"
        },
        "comments": {
            "amount": "11",
            "1": "Kickers are among the lowest-paid players in terms of the position as a whole, but they can really decide lots of games. This matchup was all about the kickers, as Josh Scobee whiffed on two potential game-winners in the fourth quarter, missing from 49 and 42. Justin Tucker, one of the most-clutch kickers in the league, drilled a pair of attempts late - one to send the game to overtime, and the other to ice the victory from 52. It's unfortunate for the Steelers, who had an inspired effort in the wake of Ben Roethlisberger's injury. Scobee, who was also brutal in the season opener, was so bad in this contest that Mike Tomlin eschewed a pair of kicking attempts in overtime because he had no faith in him. The Steelers failed twice on those tries, and Baltimore took advantage on the second occasion. John Harbaugh, of course, had no reservations about trusting Tucker from 52. Tucker is easily one of the NFL's top kickers. ",
            "2": "Pittsburgh's kicking and fourth-down woes bailed out Joe Flacco. It was astonishing how bad Flacco was in this game. It's as if he happened to be the unprepared backup. The signs were there on the opening series when he was nearly picked off and then fumbled on a sack. He managed to recover the ball, but those two plays were a dubious beginning to his dreadful evening. Flacco truly began to implode in the second quarter. Up 7-3, he threw one of the worst interceptions I've ever seen when he heaved the ball right to reserve corner Ross Cockrell. It was almost inexplicable how poor that throw was. It then appeared as though there was something wrong with Flacco in the second half. The team came out and committed a false start penalty right away, and then he fumbled when the ball hit his knee. It was about to trickle out of bounds, but Cockrell somehow scooped it up and planted both feet inbounds to recover the fumble. Flacco was later nearly picked on a botched screen, and then he left a shotgun snap slip through his hands, resulting in a huge loss. In the final quarter in regulation, Flacco was stuffed on a horrible quarterback-sneak attempt on a fourth down, and then he fired a couple of passes behind his receivers. He wasted too much time on the game-tying drive, but Justin Tucker bailed him out. Flacco went 20-of-33 for 189 yards, one touchdown and an interception. As mentioned, he was nearly picked several other times. It needs to be noted that Flacco had poor protection and missed Steve Smith late in the game because of an injury, but that doesn't excuse his miserable passes, awful pocket presence, or his 5.7 YPA. ",
            "3": "Smith was banged up on a brutal hit in the second half. After he left the game, he tried to go back in, riding the bike on occasion, but he couldn't get healthy enough to return to the field. Smith let his fantasy owners down as a consequence, snatching four balls for only 24 yards. ",
            "4": "Baltimore's leading receiver was Kamar Aiken, who logged five receptions for 77 yards and a score. You can ignore him, as this will likely go down as his top performace on the year by a wide margin. ",
            "5": "With Crockett Gillmore out, Maxx Williams had just two catches for 17 yards. I expected a bigger performance from him. He's not worth owning with Gillmore due back soon. ",
            "6": "Justin Forsett racked up nearly half of Baltimore's net yardage. Forsett gashed the Steelers for 150 yards on 27 carries. It wasn't very odd, despite Pittsburgh being usually pretty stout versus the rush. The team was missing Ryan Shazier, its top linebacker. He would've made a big difference in this contest, though the Ravens were missing a key role player of their own in left tackle Eugene Monroe. His absence was a huge reason why Flacco took five sacks - all from different players. ",
            "7": "Of course, the big name who was out of this game was Ben Roethlisberger. It was encouraging to see him without crutches on the sidelines, but his backup will start the next several games. Pittsburgh's No. 2 quarterback was underwhelming, despite receiving an absurd amount of praise from the NFL Network analysts prior to kickoff. His stats were misleading. He finished 19-of-26 for 124 yards and a touchdown to go along with nine scrambles on 33 rushing yards. That doesn't look too bad, but keep in mind that his YPA of 4.8 is on a Brodie Croyle-type level. He made a couple of nice throws and was able to pick up some first downs with his legs, but a few of his passes were way off the mark. He was nearly picked in overtime and was inaccurate on passes that could've moved the chains late in the game. He also took some awful sacks, including one to move his team out of field-goal range in the first half, though Josh Scobee probably would've just missed anyway. Pittsburgh's backup is not worth owning in any league. Despite Deion Sanders' incoherent ravings, he's not nearly the same athlete we once saw in Philadelphia or Atlanta. Already one of the most overrated players in NFL history, he's a shell of his former self, and if the Steelers opened things up for him, he would've made many more mistakes. ",
            "8": "Given that the Steelers were using a reserve signal-caller, it's curious that Todd Haley shied away from Le'Veon Bell on two short-yardage attempts during fourth-down overtime plays. Bell should have been given the ball. It's not like he was running poorly or anything; Bell trampled the Ravens, gaining 129 yards and a touchdown on 22 carries to go along with seven catches for 21 receiving yards. Bell became the first running back to gain 100-plus yards on the ground against Baltimore's defense in two years. ",
            "9": "Pittsburgh's leading receiver, as usual, was Antonio Brown. However, he didn't have the type of performance his fantasy owners have come to expect. Brown caught just five balls for 42 yards. He sort of dropped a touchdown pass in the second quarter, but he had to dive to catch an inaccurate pass from his backup, so it's not fair to fully fault him for that one. ",
            "10": "Darrius Heyward-Bey (4-31) caught a touchdown, but don't think about picking him up. If his inefficiency wasn't bad enough, Martavis Bryant is set to return to the team next week off his suspension. Markus Wheaton, who also shouldn't be owned, sustained an injury in this contest. He caught one pass for 18 yards. Sammie Coates (1-11) took his spot in the lineup. ",
            "11": "CBS really needs to think about replacing Phil Simms as the lead color analyst. Simms, who is usually very bland, was mumbling incoherent and strange thoughts all evening. He pretended to read Tomlin's lips at the end, incorrectly telling the audience that Tomlin said my bad instead of what he really said, which was, He made it. Simms also complained about the Steelers not trying a 50-yard field goal in overtime when Scobee had already missed two in the 40-49 range. And if that wasn't bad enough, Simms said that QBDK had never played in an offense with lots of weapons. So, DeSean Jackson, Jeremy Maclin and LeSean McCoy were a bunch of scrubs, then? Simms also had an awful stance on QBDK, opining that he was a changed man simply because he spent a year-plus in prison. There are plenty of other worthy color analysts who can take Simms' post as Jim Nantz's partner. CBS needs to make a move soon. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jets",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "9",
            "1": "It's not a question of if Joe Philbin will be fired soon; it's whether or not he'll even be allowed on the team plane back to America. The Dolphins came into the season with a ton of hype, but entered this contest with an underwhelming 1-2 record. They turned things around in a Week 4 London contest last year, but that was not the case this time. The Jets blew Miami completely out of the water, so it'll be a major surprise if Philbin retains his job heading into the bye week. Thanks to Philbin's horrible coaching, the Dolphins were lazy and lethargic throughout the morning. It began with a Jarvis Landry drop and a false start right before a delay-of-game flag was thrown. Following a quick Jets touchdown, there was a hold on Landry's bobbled kickoff return; Ryan Tannehill overshot Greg Jennings by a mile; and a false start on a punt backed up Miami even farther. Brandon Marshall was then open for a 22-yard gain on a third down, allowing the Jets to score once more. At that point, it was apparent that New York would run away with a blowout, and that's exactly what happened. The Dolphins had no sense of urgency throughout the game. They were guilty of unforced penalties; Philbin was asleep on one play and didn't recognize that he should challenge a Tannehill fumble that looked like a pass; offensive coordinator Bill Lazor didn't seem to understand how to deal with the Jets' constant blitzing. They just looked dead, yet they should have been desperate to avoid a 1-3 hole, which would drop them way behind every other team in the division. That's why Philbin needs to go. Immediately. ",
            "2": "Ryan Tannehill went 19-of-42 for 198 yards, two touchdowns and two interceptions, but don't be fooled; much of his yardage came in garbage time when his team was down 27-7. He was 7-of-15 for just 58 yards and a touchdown by halftime. Tannehill played poorly - he missed numerous receivers - but it wasn't all his fault. His pass protection was horrid, and his offensive coordinator didn't seem to understand how to counter the Jets' constant blitzes. In an embarrassing sequence of events, the Dolphins had a three-and-out in just 16 seconds, with all three plays featuring tipped passes as a result of blitzes that weren't picked up. It was a joke. ",
            "3": "Another issue for Tannehill was that Jarvis Landry was bottled up. It was reported during the week that Darrelle Revis wouldn't be covering Landry, but that turned out not to be the case. Revis smothered Landry, though he was flagged for a deep pass interference at one point. Landry caught four balls for 40 yards, and he also was given two carries for 29 rushing yards. He had a touchdown at one point, but it was negated by a weak offensive pass interference call on DeVante Parker. ",
            "4": "Landry actually led the team in rushing. Lamar Miller (7-26) couldn't do anything after bursting for 13 yards on his first carry. He just didn't have any sort of run blocking. ",
            "5": "Miami's leading receiver was Kenny Stills, who caught five passes for 81 yards and a touchdown. All of this came late in meaningless action, so don't pay any attention to this from a fantasy perspective. ",
            "6": "As for the Jets, they may have won this game, but they have some concerns. They committed way too many penalties, which allowed the Dolphins to hang around. Their punt return coverage was once again abysmal, so that's something they'll need to work on during the bye week. Ryan Fitzpatrick is a problem as well, as he could've easily ruined this victory. He got away with so many potential interceptions. He actually tossed a pick on a pass that looked like a punt, but the Dolphins dropped at least two of his throws. Fitzpatrick also sailed balls way behind his targets. His accuracy issues are a real concern, and it'll cost the Jets against superior competition. Having said that, Fitzpatrick wasn't all bad. He began with a 58-yard bomb to Marshall, who beat Brent Grimes. He then found an open Marshall for a 22-yard gain, who shed a Grimes tackle. Despite Grimes leaving the game with an injury, Fitzpatrick had issues moving the chains aerially, but was able to pick up some first downs with his legs. On one play, he somehow got out of a sack and was able to rush for a gain of 12. Ndamukong Suh, who had a dreadful performance, couldn't get off a Brian Winters block. Suh had a neutral-zone infraction penalty and also missed a tackle on Chris Ivory. He's been a major bust thus far, and it doesn't appear as though anything will change anytime soon. Fitzpatrick finished 16-of-29 for 218 yards, one touchdown and a pick to go along with 34 rushing yards on nine scrambles. He began hot, completing his first four passes, but then had a 2-of-9 stretch where he fired inaccurate balls. He's a liability, and as mentioned, he'll be exposed versus tougher foes. ",
            "7": "Chris Ivory was iffy for this game after missing last week's contest. There's no doubt that he's completely healthy, as he ran like a bull. The Dolphins had major issues tackling him, as he picked up 166 yards and a touchdown on 29 carries. We've seen runners like Ivory - Marion Barber, Brandon Jacobs - have short career spans, so I don't like his long-term prospects. However, Ivory should serve as an RB2 at the very least for the rest of the year. ",
            "8": "Marshall's matchup against Grimes was not meant to be, as the latter left the game in the first quarter and never returned. Marshall did burn him for 58 yards, however. He finished with seven grabs for a team-high 128 yards. ",
            "9": "Fitzpatrick's sole touchdown went to Eric Decker. It appeared as though Decker got banged up early on, but he came back to snatch the score. He also made an impressive, one-handed grab in Miami territory. He finished with four catches for 46 yards. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Giants",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "This was an obvious flat spot for the Bills. They were coming off a huge victory against one of their arch rivals. They've had a dubious history following games against Miami, owning just a 16-35 record entering this contest, dating back to 1989. Make that 16-36 now, as they lost to the Giants despite being close to touchdown favorites. The Bills were lethargic all afternoon. They constantly made errors, and everyone was guilty. Tyrod Taylor made poor throws throughout, constantly missing his receivers and dumping passes at the ankles of his targets. There were numerous drops and missed tackles, and the penalty count was quite high. They committed a ridiculous 17 infractions. Seventeen! Many of them were painful, including a Taylor scramble touchdown that was nullified by one of the worst holding calls you'll ever see. Buffalo also had another score wiped out by a chop block. The officiating was horrendous; it was the same crooked ref from Monday night in the Colts-Jets game, except he has grown a mustache to perhaps fool everyone. I'm not saying this game was fixed, but as my picks podcast co-host Matvei texted, I wonder if you can call 12 men on the field on the Giants when the ref is on their team. ",
            "2": "Despite all of that, Tyrod Taylor played poorly. Taylor's final numbers weren't bad - he went 28-of-42 for 274 yards, one touchdown and a pick, with another two scores negated by penalties - but most of that came in garbage time. By halftime, Taylor was 6-of-13 for only 36 yards and the interception, which was a great play by linebacker Devon Kennard. Taylor can be bought low right now in fantasy if you're desperate at quarterback. The Bills will bounce back; they simply always play porly after battling Miami, and it didn't help that both Sammy Watkins and LeSean McCoy were out of the lineup. ",
            "3": "With Watkins missing, Charles Clay led the Bills in receiving, catching nine balls for 111 yards. He also had a touchdown negated by a chop block. This performance wasn't a surprise; the Giants have struggled immensely in terms of defending tight ends this year. With that in mind, Clay is someone you can sell high. ",
            "4": "Karlos Williams got the start with McCoy banged up. He disappointed in terms of running, as he gained just 40 yards on 18 carries, but he bailed out those who started him with a receiving touchdown. He caught three balls for 30 extra yards. ",
            "5": "The Giants won this game, by the way. They didn't have to do all that much, as the Bills simply self-destructed with penalties. They did a good job of moving the chains, however. They picked up 19 first downs and did a great job of controlling the clock until this contest was well in hand. ",
            "6": "Eli Manning finished 20-of-35 for 212 yards, three touchdowns and an interception. He didn't do anything great, as his longest real pass was a 22-yarder. However, he was mostly efficient against a strong defense. Of course, the one exception was a dumb pick he threw while trying to run out the clock. He's lucky it didn't cost him the victory, or the media would be talking about yet another screw-up. I mentioned real pass because Manning's longest touchdown, a 51-yarder, was all Rashad Jennings leaking out of the backfield and breaking three tackles. Jennings rushed for 38 yards on just nine carries. He saw fewer touches on the ground than Andre Williams (11-35), but was predictably more effective. Williams dropped a pass. Neither can be started in fantasy until there's an injury. ",
            "7": "Manning's two other scores went to Dwayne Harris (5-51) and Rueben Randle (3-31). The former isn't on any fantasy radars, while the latter is just a fringe player. He tied for third in targets with six. ",
            "8": "Odell Beckham Jr. disappointed his fantasy owners with just five catches for 38 yards. He saw a team-high 12 targets, so he'll bounce back. Keep this in mind if you want to trade for him. Beckham did at least make a spectacular catch, hauling in a pass with one hand along the sidelines in the second half. Unfortunately, he was out of bounds. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bears",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Raiders haven't handled success well since playing in the Super Bowl, owning a miserable record following a victory (13-42). They prevailed last week, so it seemed like they might be able to turn things around. However, these might be the same, old Raiders after all. Oakland had its chances, and it even received the usual gifts from Jay Cutler and company. The Bears were guilty of three turnovers, yet the Raiders couldn't maintain possessions, controlling the ball for less time than Chicago despite having all of those extra drives. ",
            "2": "Derek Carr went 20-of-33 for 196 yards, two touchdowns and an interception that wasn't his fault (more on that later). He looked good early, lofting a beautiful score to Amari Cooper, but he converted just nine of his 19 attempts in the second half. That's not good news, especially considering the level of his competition in this matchup. To be fair, Carr appeared to have a touchdown to Seth Roberts late in the game, but Roberts' second foot was barely out of bounds. ",
            "3": "Cooper snagged four balls for 49 yards and a score, as mentioned. However, he dropped a pass and didn't do anything after intermission. Michael Crabtree led the team in receiving with five catches for 80 yards. Crabtree appeared to suffer an injury while blocking for Cooper in the first half, but he turned out to be fine after missing the second quarter. ",
            "4": "It was surprising to see Latavius Murray struggle to run the ball. He managed just 49 yards on 16 attempts. Making matters worse for his fantasy owners, he was benched after he both bobbled a pass that resulted in Carr's pick and dropped a pitch that turned out to be a fumble. Sitting him was not wise despite the two errors, as he's the best running back on the roster by a mile. ",
            "5": "As for the Bears, Jay Cutler put together a great, game-winning drive, but before that, it appeared as though he was trying his best to give this victory away. He was nearly picked on a tipped pass early, and then he actually tossed an interception to Charles Woodson deep in Oakland territory when he telegraphed the throw. Cutler and his center botched an exchange as well, setting up the Raiders with a quick touchdown. Having said all of that, Cutler deserves credit for the victory. He went 28-of-43 for 281 yards, two touchdowns and the interception. The Raiders had no answer for him when he wasn't trying to let them win. ",
            "6": "Alshon Jeffery didn't play, so Cutler targeted Martellus Bennett more than anyone. Bennett snatched 11 of his 13 targets for 83 yards and a touchdown in which he was wide open by 10 miles. He nearly had a second score, but Cutler underthrew him. It's not surprising to see Bennett have a dominant performance, since the Raiders have been so dreadful in terms of defending tight ends all year. You can seriously start any tight end battling Oakland. ",
            "7": "Cutler's other touchdown went to Eddie Royal, who caught seven passes for 54 yards. He nearly had a second score in the first half. Marquess Wilson also had a big game with six grabs for 80 yards, but he dropped a couple of balls. He's not worth owning. ",
            "8": "Matt Forte gained 91 yards on 25 carries, while also catching four passes for 64 receiving yards. He fumbled near midfield in the third quarter, but the Raiders failed to capitalize. His best play was a 38-yard reception that featured a fantastic stiff-arm. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "It's hard to believe that four weeks ago, many had the Eagles penciled in as their Super Bowl team. Dropping games to the Falcons and Cowboys, who had a combined 5-1 record entering Week 4, wasn't exactly devastating, but losing to a Washington squad that couldn't handle the Giants last week has to be very worrisome. It was more of the same for the Eagles. They once again couldn't block whatsoever for Sam Bradford early on. Bradford was still tentative to take shots downfield for most of the afternoon, but it was hard to blame him considering that the Redskins were able to generate consistent pressure on him. Bradford took five sacks and even appeared to suffer an injury to his ankle at one point. The trainers were looking at him on the sidelines, but he was able to reenter the game on the next drive. Bradford finished 15-of-28 for 270 yards and three touchdowns, with the bulk of his stats coming in the second half (10-of-18, 196 yards, 3 TDs). The difference was that the line gave Bradford more time following intermission. He nearly had a fourth score, but he overthrew Jordan Matthews deep downfield. I'd say that Philadelphia fans should be more optimistic going forward in the wake of Bradford's second-half performance, but we saw this in Atlanta back in Week 1. Besides, the Redskins have an abysmal pass defense, so Bradford should have been even better. ",
            "2": "Bradford's touchdowns went to Riley Cooper (2-72) and Brent Celek (1-10), neither of whom is worth owning. The team's top receiver, Jordan Matthews, caught only three balls for 50 yards. As mentioned, Bradford missed him for a score, though Matthews didnt help his stat line by dropping more passes. That's been a huge issue for him this season. ",
            "3": "Rookie wideout Nelson Agholor is worth mentioning. He caught three balls for 64 yards, highlighted by a one-handed, 45-yard grab. Howver, he lost a fumble on an end-around on the very next play and later was responsible for negating a touchdown because of a penalty. I've been writing this every week, but Agholor needs to be ignored in fantasy amid Philadelphia's offensive struggles. ",
            "4": "Much was made about DeMarco Murray's availability, with ESPN's Britt McHenry reporting that Murray wouldn't play. Murray ended up leading the team in carries, gaining 36 yards on eight tries. However, almost all of his yardage came on one 30-yard burst. On one attempt, he ran backward and took a terrible loss. Philadelphia's offensive line woes aren't getting fixed anytime soon, so don't expect much from Murray in the near future. As for the other running backs, Ryan Mathews managed just 20 yards on five carries, while Darren Sproles touched the ball only four times, though he did drop a couple of passes. The Eagles won with a Mathews-Sproles time share against a solid New York defense, so I'd question this usage if Chip Kelly didn't happen to be such an offensive genius. I'd also discuss Philadelphia's time-of-possession woes - Washington held the ball for about 41 minutes - but Kelly is such a great offensive mind that criticizing him would be extremely foolish. ",
            "5": "The Eagles' kicking woes continue. Cal Sturgis whiffed on a 33-yard field goal and also missed an extra point. That was the difference in this game. ",
            "6": "The Redskins were more effective moving the ball throughout the afternoon, and it began with Christian Thompson picking up 42 yards on a third-and-forever run. This was a harbinger of things to come, as the Redskins, as mentioned controlled the clock for most of the game. It didn't help that the Eagles lost some defenders to injury, including Mychal Kendricks and Byron Maxwell to leg maladies. Kirk Cousins played well, going 31-of-46 for 290 yards and a touchdown. Not included in that was a pass interference call on Eric Rowe in the end zone. Cousins did a great job of leading his team on a 90-yard, game-winning drive versus Philadelphia's banged-up defense. It was nice to see him rebound following a disastrous Thursday night performance against the Giants, especially considering that he imploded following a similar circumstance a year ago. ",
            "7": "Pierre Garcon, who caught the game-winning touchdown, tallied seven receptions for 55 yards despite missing some time with a minor knee injury. It was easy for Garcon to torch a beleaguered Philadelphia secondary, so that sets him up as a sell-high target. Jordan Reed, meanwhile, snatched five balls for 37 yards. Unfortunately, he was knocked out of the game with a concussion. ",
            "8": "The Redskin who had the most targets against the Eagles? It wasn't Reed or Garcon; rookie Jamison Crowder held that distinction. Crowder caught seven balls for 65 yards on 12 passes thrown to him. Washington's coaching staff likes Crowder, and the 12 targets are encouraging. Crowder is worth picking up. ",
            "9": "It's difficult to run on the Eagles, which would explain why Matt Jones was limited to only 11 yards on seven carries. Alfred Morris had more success (17-62), which included some tough runs late in the game. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "13"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: Poor Jaguars. If they can't beat the Colts when Andrew Luck sits, how are they ever going to beat them when Luck plays? The scary thing is that Jacksonville could've led the division with a victory. That could have signified the Apocalypse, so it's best that their kicker choked at the end of the game. </i> ",
            "2": "The Jaguars caught a break with Colts' franchise quarterback Andrew Luck being held out with a shoulder injury. Jacksonville outplayed the Indianapolis, but two missed field goals by Jason Myers, including one in overtime, allowed the Colts to escape with an overtime win. ",
            "3": "Starting around their own 10, Colts backup quarterback Matt Hasselbeck put a drive together with passes to Donte Moncrief and Coby Fleener. Adam Vinatieri drilled a 54-yard field goal to get on the board first. The Jaguars answered with Blake Bortles hitting Allen Hurns for 26 yards. Then, Bortles hit Allen Robinson on a go route that burned Darius Butler for 48 yards. If Robinson didn't have to dive for the ball, and it had hit him in stride, it could have gone for a touchdown. Instead, the Jaguars were stopped in a goal-line situation to settle for a short field goal. Jacksonville's defense came through with Josh Robinson fumbling the ball away on a tackle by Dan Skuta. Bortles then hit Clay Harbor for 21 and rolled out to hit Hurns for an 8-yard touchdown. The Colts tied it up on a drive that was given away because of five penalties on the Jaguars. Hasselbeck threw a short touchdown pass to Fleener. Before the half, Bortles led a field goal drive to take a 13-10 lead into the locker room. The Colts had a possession set up with good field position in the second half, and they moved it closer for a chip-shot field goal from Vinatieri. Hasselbeck got into rhythm distributing passes around and getting T.Y. Hilton involved. The Colts looked like they were going to go into the end zone for the lead, but Gore fumbled the ball into the end zone after having it punched out by Jags safety Josh Evans, and it was recovered by the Jaguars. Late in the game with less than a minute remaining, Bortles took off on a 14-yard run, hit Marcedes Lewis for 12 yards and T.J. Yeldon for five yards. Myers missed a 53-yard field goal, but the Colts had called a time out right before to ice him. On the second try, Myers whiffed again. In overtime, the teams traded punts before the Jaguars put together a drive that set up Myers for a 48-yard field goal, but he missed it again. The Colts took advantage with Hasselbeck hitting Fleener for 28 yards along the sideline. When the Colts were setting up a field goal, Gore broke off a 23-yard run inside the 10-yard line. Vinatieri then drilled a 32-yarder to win the game. ",
            "4": "Matt Hasselbeck completed 30-of-47 passes for 282 yards with a touchdown. He managed the game just enough for the Colts to get a needed win. T.Y. Hilton had seven receptions for 67 yards. Colby Fleener led the Colts in receiving with nine catches for 83 yards and a score, thanks to Hasselbeck dinking and dunking. Donte Moncrief (6-75) also contributed and continued to play ahead of Andre Johnson. ",
            "5": "Frank Gore ran for 53 yards on 17 carries. He caught five passes for 34 yards. He also had a key fumble to ruin a potential touchdown. ",
            "6": "Blake Bortles completed 28-of-50 passes for 298 yards with a touchdown. Allen Hurns led the Jaguars with 11 receptions for 116 yards and a score. Allen Robinson (4-80) was limited by Vontae Davis. ",
            "7": "T.J. Yeldon ran for 105 yards on 22 carries. He had a 36-yard burst in overtime, but the Jaguars failed to do anything with it. ",
            "8": "The Jaguar safeties played well. That would be Johnathan Cyprien (14 tackles) and Josh Evans (1 forced fumble, 5 tackles). ",
            "9": "Colts rookie defensive end Henry Anderson had a good game at the point of attack. D'Qwell Jackson and Davis also played well. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: Andy Reid called throws for Alex Smith to some bum named Charcandrick West non-stop. Reid tried to call back-to-back timeouts. His offense constantly screwed up in or near the red zone. He had his team kick a field goal down 29-15 in the middle of the fourth quarter. Never change, Andy. Never change. </i> ",
            "2": "Jeremy Hill got of the doghouse in a big way as he found the end zone three times against Kansas City. That puts him at five touchdowns on the season and makes his fumbling issues and benching seem like a distant tale told by old men in a lightless tavern, trying to one-up each other with their fantasy football nightmares. ",
            "3": "Another Cincinnati running back also found the end zone and just missed another touchdown that Hill went on to vulture. That Bengal was named Giovani Bernard, well, I guess he's still named that. Hill and Bernard put the Bengals at four rushing touchdowns for the day. Over the previous 20 games, Kansas City's defense had allowed a total of four rushing touchdowns by running backs. So now, the Chiefs have to go 19 games without allowing one, so they don't look so bad. ",
            "4": "With four rushing touchdowns, you can of course infer that Andy Dalton didn't have his best fantasy game ever. And your inference would be correct, but even with four touchdowns that are in no way credited to his fantasy day, he ended up throwing for 321 yards and a touchdown. This was his first game of the season with fewer than two touchdowns, and it shouldn't deter you from believing Dalton could have thrown five touchdowns in this game if the coaches had pushed the offense that way. ",
            "5": "On the other side of the field was a team that was much less efficient near the end zone. Kansas City scored 21 points, but did not score one touchdown. That should be a riddle for middle-schoolers. And the answer would be Cairo Santos, who kicked a whopping seven field goals, setting a Kansas City record. That's good for him, especially on a day when missed field goals were the norm, but when you give up five touchdowns, you can't reply with seven field goals. ",
            "6": "The Chiefs were able to move the ball, and their play-makers had good yardage games. Jamaal Charles totaled 145 yards - 75 on the ground and 70 through the air. He was his usual electric self and would have had a long touchdown on a wheel route if Alex Smith hadn't underthrown the ball. ",
            "7": "Kansas City's other play-maker, Jeremy Maclin, also put up nice numbers, catching 11-of-13 targets for 148 yards. That follows up his eight receptions, 141 yards and a touchdown game last week. Kansas City's No. 1 receiver from last season was Dwayne Bowe, and he can barely get on the field for the Browns. The idea that Maclin would have trouble in this offense has turned out to be false-ish. We, of course, would like to see more touchdowns from him, but those should come, especially with Chicago and Pittsburgh coming up. ",
            "8": "This game never was in real doubt as Alex Smith was sacked five times, and even though the Chiefs were able to move the ball and had more yards and first downs, they never could sustain with the pass rush disrupting their game plan. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: If the Texans start Brian Hoyer, he sucks. If the Texans start Ryan Mallett, he sucks. Here's an idea: Why don't the Texans start a random quarterback - it doesn't matter which one - and immediately pull him after one drive? That would totally work, right? </i> ",
            "2": "Finally, someone found a way to slow down Atlanta wide receiver Julio Jones. The Texans threw all sorts of coverage at Jones and held him to four catches for 38 yards. It didn't matter. The 4-0 Falcons still hammered the Texans with running back Devonta Freeman, showing last week's effort wasn't a flash in the pan. For the second straight week, Freeman scored three rushing touchdowns. Freeman became the first player since LaDainian Tomlinson in 2006 to score three rushing touchdowns in back-to-back games. He also became the first player since Tomlinson in 2005 to have seven rushing touchdowns in the first four games of a season. Freeman has made himself into a must-start in any fantasy league. He finished with 68 yards on 14 carries and also caught five passes for 81 yards. Freeman's numbers could have been even higher, but the Falcons replaced him with Terron Ward (19 carries for 72 yards and a touchdown) once the game got out of hand. ",
            "3": "Even with Jones being held quiet, quarterback Matt Ryan had an efficient day. Ryan completed 19-of-27 passes for 256 yards with one touchdown and no interceptions on a day when the Falcons didn't really need to throw the ball. ",
            "4": "Atlanta wide receiver Roddy White continued his very quiet season. He had two catches for eight yards. If you still have White on your fantasy team, it's time to consider letting him go. Age clearly is catching up to White, and his best days are behind him. If you're looking for a replacement, you might want to grab Leonard Hankerson. He could start to cut into White's playing time after producing six catches for 103 yards. ",
            "5": "Atlanta's defense continues to play well. The Falcons forced two early turnovers that helped them build a quick 21-0 lead. Linebacker Paul Worrilow tipped a pass that was intercepted by defensive tackle Jonathan Babineaux, and cornerback Desmond Trufant scored a touchdown after scooping up an Arian Foster fumble. ",
            "6": "For the Texans (1-3), the big story entering the game was the return of Foster from an injury. However, Foster ended up having almost no impact. Foster had eight carries for 10 yards. His longest run of the day went for five yards. Foster also had three catches for 25 yards. His backup, Alfred Blue, who had a big week last week, also was held in check. Blue was limited to 17 yards on six carries. ",
            "7": "Ryan Mallett may have played his way out of a starting job. He completed 12-of-27 passes for 150 yards with an interception. Backup Brian Hoyer entered the game after it was out of control and fared much better than Mallett. Hoyer completed 17-of-30 passes for 232 yards with two touchdowns. The Texans could decide to make a switch at quarterback. ",
            "8": "Wide receiver DeAndre Hopkins was the lone fantasy bright spot for the Texans. Hopkins had nine catches for 157 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "comments": {
            "amount": "11",
            "1": "<i> EDITOR'S NOTE: I can't believe I moved two units off the Panthers because the Buccaneers were considering this their Super Bowl. I'm an idiot. Thanks to Jameis Winston's horrible interceptions, the Panthers could have prevailed if they had shown up completely drunk. </i> ",
            "2": "If all you saw was the score of Carolina's victory against Tampa Bay, you would assume the Panthers had a monstrous day on offense. You would be wrong. Carolina's offense wasn't bad by any means, but it was the defense that decided this game. The Panthers scored 27 points off turnovers. They had five of them ? four interceptions and one fumble recovery. That made for an easy day for quarterback Cam Newton and the offense. The victory puts the Panthers (4-0) in great shape as they head into their bye week. Linebacker Luke Kuechly, who has missed the last three games with a concussion, should be able to return against Seattle after the bye, and that can only help a defense that already is playing very well. ",
            "3": "Carolina cornerback Josh Norman is making an early case for Defensive Player of the Year. Norman had two interceptions, including one he returned 46 yards for a touchdown. Norman already has four interceptions on the season. ",
            "4": "Wide receiver Ted Ginn is looking like a player worthy of starting in fantasy. Ginn had only two catches, but both of them went for touchdowns. Ginn is known as a deep threat. But, both touchdowns came on short passes. Even when Jerricho Cotchery returns from injury, Ginn still is going to get a fair amount of targets. ",
            "5": "The injuries at wide receiver have forced the Panthers to play some young players. Rookie Devin Funchess hasn't stepped up yet though. Funchess was targeted twice and did not have a reception. He's not worth having on your fantasy team. ",
            "6": "Running back Jonathan Stewart had a quiet day. Stewart had 50 yards on 10 carries and lost a fumble that tight end Ed Dickson grabbed and ran in for a touchdown. Stewart could have put up bigger numbers, but Carolina elected to rest him and give the carries to Cameron Artis-Payne once the Panthers had a comfortable lead. ",
            "7": "Newton continued his steady season on a day when the defense kept handing him good field position. Newton completed 11-of-22 passes for 124 yards and two touchdowns. He also had 51 yards rushing on 12 carries. ",
            "8": "For the Buccaneers (1-3), rookie quarterback Jameis Winston had an absolutely dismal day. He was intercepted four times and lost a fumble. Winston did put up 287 passing yards and two interceptions. But a big chunk of his yardage came after the game was out of hand and the Bucs were throwing on virtually every down. ",
            "9": "One of the few bright spots for the Bucs was running back Doug Martin, who looked like he was worthy of being a fantasy starter for the first time in a long time. Martin carried 20 times for 106 yards and a touchdown and also had five receptions for 37 yards. But don't go rushing to get Martin into your starting lineup until he shows he can run like that with some consistency. ",
            "10": "The Panthers devoted most of their defensive attention toward wide receiver Mike Evans, and that strategy worked. Evans was held to three catches for 32 yards. But all that coverage left Vincent Jackson open. Jackson responded with 10 catches for 147 yards and a touchdown. Teams are likely to continue to focus on Evans, so Jackson isn't a bad fantasy option. ",
            "11": "Tampa Bay probably will have a new kicker next week. Rookie Kyle Brindza struggled for the second straight week. Brindza missed two field goal attempts and an extra-point attempt. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Rams",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "22"
        },
        "comments": {
            "amount": "9",
            "1": "Todd Gurley. Wow. One NFL team told us prior to the 2015 NFL Draft that they thought he'd be the next Jim Brown, and he's definitely off to a great start. Gurley took off his knee brace and was extremely effective in his first start. Gurley rushed for 146 yards on 19 carries, rumbling with great power and blazing speed. On his longest run, a 52-yarder, he nearly outran Tyrann Mathieu. Gurley also showed impressive intelligence for a rookie at the end of the game. On one run, he danced around when there were several defenders in front of him just to make sure some extra seconds ticked off the clock. Gurley then slid down inbounds so that more time would expire. The Cardinals, down 24-22, were hoping to get the ball back to engineer a game-winning drive, but Gurley single-handedly made sure that they didn't have a chance. ",
            "2": "You can't feel bad for the Cardinals, however, because they made so many mistakes in this game. They opened with a fumbled kickoff return, setting up the Rams with a short touchdown. Larry Fitzgerald lost a fumble following a long gain. Carson Palmer launched an interception into the end zone amid double coverage. David Johnson dropped a touchdown in addition to losing that aforementioned fumble on the kickoff. The Cardinals also sputtered in the red zone all afternoon. So, despite outgaining St. Louis, 447-328, Arizona lost its first game of the year. ",
            "3": "I guess you can say that Palmer performed well in between the 20s - especially when considering the circumstances. Palmer went 29-of-46 for 352 yards, one touchdown and an interception despite having no time to throw on many of his snaps. He was hit constantly by the Rams' ferocious pass rush. Despite this, Palmer was able to move the chains, though his team just failed deep in St. Louis territory and screwed up with turnovers. ",
            "4": "It's no surprise that Fitzgerald led the team in receiving (7-99), but had that aforementioned fumble, which led to a St. Louis touchdown. John Brown (7-75) and Michael Floyd (5-59) also contributed, but neither found the end zone. It's worth noting that Floyd drew a pair of pass interference penalties. ",
            "5": "With Andre Ellington out, Chris Johnson drew another start. He looked good again, gaining 83 yards on 16 carries. David Johnson, as mentioned, had multiple screw-ups, including the fumble on the opening kickoff. David at least made up for it with four catches for 63 receiving yards and a touchdown. He was given just three attempts on the ground, which he turned into 18 rushing yards. ",
            "6": "The Cardinals were screwed over by a horrible ruling. In the third quarter, Benny Cunningham fumbled deep in his own territory. The Cardinals recovered to set up first-and-goal, but the officials inexplicably announced that Cunningham's forward progress was stopped. This was incorrect, as the ball popped out way earlier. Considering how much money Vegas was set to lose if the Cardinals had won, prompting many teasers to cash, it's fair to wonder if these officials were bought. The call was that bad that there was no other logical explanation for it. ",
            "7": "Moving back to the Rams, Nick Foles' performance was completely unexpected. He struggled versus Pittsburgh's poor secondary, yet rebounded against Arizona's prolific stop unit. He went 16-of-24 for 171 yards and three touchdowns. Foles was errant on some of his attempts, but was solid overall. ",
            "8": "Two of Foles' touchdowns went to Tavon Austin, who caught six of his seven targets for 96 yards. He's more of a gadget player, so I wouldn't trust him in fantasy. Stedman Bailey (2-30) reeled in the third score. ",
            "9": "Jared Cook was second on the Rams with six targets, but hauled in only three balls for 22 yards. He dropped two passes, one of which should've been a touchdown, proving once again to be inefficient. Another player who can be described that way, Kenny Britt didn't log a single reception. Don't make the mistake of having either of these bums on your fantasy roster. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Packers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "3"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: The 49ers lost another game, but at least Colin Kaepernick was able to be himself. The Packers, meanwhile, were able to cover, but I expected a much greater margin of victory from them. Aaron Rodgers took too many sacks, which has to be a bit of a concern. </i> ",
            "2": "The Packers improved to 4-0, as they cruised over an anemic 49ers' offense. San Francisco's defense did a nice job of limiting Aaron Rodgers and the high-scoring Green Bay offense, but it was the Packers' defense that dominated from start to finish. Colin Kaepernick was helpless to move the ball, and the 49ers' offensive line was completely inept. Green Bay's secondary had an easy game as the Packers' defensive line and linebackers owned the line of scrimmage and lived in the 49ers' backfield. ",
            "3": "On the first play from scrimmage, Rodgers dropped in a beautiful pass downfield for Ty Montgomery, but the rookie dropped the pass. A penalty gave Green Bay a first down after a third-down sack, and that second chance was all the Packers needed as they marched down the field. Rodgers hit Richard Rodgers for a 9-yard score. That was all the points the Packers' defense would need. In the second quarter, the 49ers got moving when Quinton Patton broke off a 40-yard gain. Patton came in motion, and after a shotgun snap, Kaepernick pitched the ball forward to Patton, who turned the corner to explode down the field. Sacks by Nick Perry and Jayron Elliott forced San Francisco to settle for a 33-yard field goal from Phil Dawson. Before the end of the half, the Packers drove into 49ers territory, but Mason Crosby missed a 44-yard field goal on the final play, so despite outplaying the 49ers, the Packers had only a 7-3 lead going into the locker room. In the third quarter, James Jones made an amazing catch on a beautiful 38-yard throw from Rodgers. Jones stretched out to snatch the pass while tapping his feet in bounds despite good coverage. After a holding penalty, Rodgers took off on a 17-yard run to the 1-yard line to set up a third-and-goal. John Kuhn vultured the touchdown away from Eddie Lacy and Rodgers, but Green Bay went up 14-3. Rodgers expanded the Packers' lead with a field goal drive. The Packers' defense continued to dominate as they were constantly harassing and sacking Kaepernick. He heaved a desperation bomb that was picked off by Sam Shields. Kaepernick threw his best pass of the game for a 47-yard completion to Torrey Smith, but on a fourth-and-5, Kaepernick was sacked by Mike Neal to finish off San Francisco. ",
            "4": "Aaron Rodgers completed 22-of-32 passes for 224 yards with a touchdown. He also ran for 33 yards. He played well, but he had trouble sustaining some drives because his offensive line surrendered lots of pressures and three sacks. ",
            "5": "Randall Cobb had five receptions for 44 yards, while Richard Rodgers (5-45) and James Jones (5-98) contributed. Eddie Lacy totaled 90 yards on 18 carries. He ran well for Green Bay. ",
            "6": "Colin Kaepernick was 13-of-25 for 160 yards with an interception. He ran for 57 yards on 10 carries, but Kaepernick's regression is in full-blown crisis mode for San Francisco. ",
            "7": "Carlos Hyde had 20 yards on eight carries. Anquan Boldin (3-12), Quinton Patton (2-53) and Garrett Celek (3-26) were ineffective. ",
            "8": "On the positive side for the 49ers, the defense played pretty well overall against the potent Green Bay offense. Edge rusher Aaron Lynch, in particular, stood out with two sacks and another tackle for a loss. ",
            "9": "The Packers' front seven was superb with six sacks of Kaepernick. Clay Matthews just had one sack, but was incredibly disruptive. B.J. Raji, Nick Perry (2 sacks), Jayron Elliott, Datone Jones and Julius Peppers all played well for Green Bay. The Packers' pass rush is just nasty right now. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "A losing franchise tends to drop games in interesting ways, and the Browns are the kings of all losing franchises. It appeared as though they were going to send this contest into overtime, thanks to a spectacular drive by Josh McCown. The Chargers had an opportunity for a game-winning field goal at the end of regulation, but missed. However, Tramon Williams inexplicably was offside, so kicker Josh Lambo had a second opportunity. He converted, giving San Diego a victory and Cleveland yet another defeat. McCown played extremely well, which was a huge surprise because the Chargers have considerable talent in their secondary. He misfired on just nine occasions, finishing 32-of-41 for 356 yards and two touchdowns. He began slowly, going three-and-out on his first drive and then losing a fumble because he held on to the ball too long. However, the later the game progressed, the sharper he was, tossing only two incompletions in the second half (13-of-15, 144 yards, TD). He made some mistakes, like nearly fumbling again and taking a bad sack to take his team out of field-goal range, but he was very solid overall. ",
            "2": "McCown doesn't have quality receivers outside of Travis Benjamin, so he used rookie running back Duke Johnson as a receiver out of the backfield. Johnson tied Benjamin for the team lead in targets (10) and caught nine passes for 85 receiving yards and a touchdown. He handled a decent workload on the ground, getting eight carries for 31 yards. Isaiah Crowell handled just four more attempts, gaining 63 yards on 12 tries, though nearly half of that (32 yards) came on one burst. It'll be interesting to see if Johnson continues to see a greater overall workload than Crowell. Johnson will at least be a big part of the passing attack going forward, so he has a chance to overtake Crowell as the primary back. Johnson is owned in half of ESPN leagues, so pick him up if you can. ",
            "3": "As for Benjamin, he snatched six balls for 79 yards. He's becoming more than just a situational deep threat, but it's hard to rely on him, given how inconsistent Cleveland's quarterbacks are. ",
            "4": "It's a shame the Browns lost, as it spoiled Gary Barnidge's brilliant catch, by only just a bit. Barnidge helped give the Browns the lead with a fantastic reception. He bobbled the ball, but was able to secure it and plant his knee inbounds before falling out of play. Barnidge caught six balls for 75 yards and a touchdown. This was his second-consecutive strong performance, and he's worth looking into if you need help at tight end. ",
            "5": "The Chargers had a difficult task in this game, considering the number of injuries they dealt with on the offensive line. Three blockers were missing, and they also lost Stevie Johnson (hamstring) and Malcom Floyd (concussion) in this contest. With so many players hurt, it's amazing that San Diego was able to post 30 points and win this game. Philip Rivers went 23-of-38 for 358 yards and three touchdowns despite missing 60 percent of his offensive line. Rivers had issues with his protection early on, but the Chargers were able to get on track offensively by constantly placing their quarterback in a shotgun formation. Rivers responded by torching the Browns, although it should be noted that Cleveland was missing both Joe Haden and Tashaun Gipson. Haden never played, while Gipson limped off in the third quarter. ",
            "6": "Rivers' scores went to Keenan Allen (4-72), Ladarius Green (4-53) and backup tight end John Phillips. Allen's resurgence continues following a poor sophomore campaign. Green, meanwhile, had a big catch on the final drive, but that should've been negated by offensive pass interference. Green will take a back seat to Antonio Gates next week, so I wouldn't blame you if you decided to drop him. ",
            "7": "Stevie Johnson led San Diego in targets (8), but caught just four balls for 32 yards. His hamstring injury could keep him out, however, so Dontrelle Inman, who snatched three balls for 88 yards, is worth picking up. Inman shined at the end of last season, and he has some nice ability. He could be San Diego's No. 2 receiver versus Pittsburgh's poor secondary next week. ",
            "8": "It's now been four games, and Melvin Gordon still doesn't have a touchdown. He struggled to find running room behind San Diego's banged-up offensive line. He managed just 38 yards on 12 carries. Danny Woodhead had more success, tallying 54 rushing yards on eight carries to go along with four catches for 84 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "If it wasn't apparent already, this game was proof that Denver's defense, and the running game, to a lesser extent, will have to carry Peyton Manning. It's obvious that Manning is a shell of his former self; he's nowhere near the player he once was, and he seems like he can be a liability at times for the Broncos. That was the case in the second half of this game, but the stop unit willed the team to victory. Manning finished 17-of-27 for 213 yards, one touchdown and two interceptions. The first pick was by Anthony Barr, who jumped the route after baiting Manning into a throw. The second was a bad overthrow, hauled in by Harrison Smith. Manning nearly had a third pick early when Robert Blanton also jumped in front of the receiver, but couldn't come up with the ball. Manning had just a handful of quality passes, but he looked like a dying animal at times. In terms of a fantasy perspective, Manning is still worth starting on a weekly basis because of his volume and supporting cast. However, he's going to have way more many duds like this than he's had in the past. ",
            "2": "Demaryius Thomas caught nine passes for 93 yards, seeing twice as many targets (12) than anyone else on the team. He left the game temporarily with what looked like a neck injury, but he was able to reenter the contest after missing about half a quarter. Meanwhile, Emmanuel Sanders snatched three balls for 68 yards. I listed both wideouts as sell-high players because of Manning's decline. If you can still trade them for equal perceived value, do it. ",
            "3": "C.J. Anderson and Ronnie Hillman received an equal workload, with both getting 11 carries. However, there's more to that story. Hillman had just one attempt by halftime, which was a 72-yard touchdown. The coaching staff apparently thought that he needed more opportunities. He ultimately accumulated 103 yards and a score. Anderson tallied 43 yards on his tries. He also caught a 27-yard pass. ",
            "4": "Like Hillman, Adrian Peterson broke a long touchdown run. This occurred on a fourth-and-inches in the fourth quarter near midfield. A huge hole opened up for Peterson, who galloped 48 yards. Peterson finished with 81 yards and the score on 16 tries. Peterson had a tough time finding room otherwise against Denver's stalwart defense. ",
            "5": "Teddy Bridgewater had problems with his offensive line as well. He took a whopping seven sacks, including one that ended the game. Bridgewater was stripped, allowing the Broncos to take over with barely any time left on the clock. The pressure disrupted lots of drives and forced Bridgewater to sail lots of passes out of bounds. However, he was able to put together some quality drives as well to give Minnesota a chance. Bridgewater went 27-of-41 for 269 yards and a touchdown. He also picked up 23 rushing yards on three scrambles, one of which was a converted sneak on fourth-and-1 just shy of midfield on the opening drive. He made some poor throws in the first half, but was very accurate after intermission, connecting on 13 out of his 15 attempts. Unfortunately, his offensive line did him in and ruined a potential victory. ",
            "6": "Bridgewater targeted two players 10 times each: Mike Wallace and Stefon Diggs. Wallace caught eight balls for 83 yards and a touchdown. Diggs, meanwhile, secured six passes for 87 yards, but isn't much of a fantasy option - at least not yet - because Charles Johnson will return to the field soon. ",
            "7": "Kyle Rudolph had a disappointing outing, catching just two balls for seven yards. However, the Broncos defend tight ends well, so look for Rudolph to bounce back in the near future. He's a fine buy-low target. ",
            "8": "The Vikings need Blair Walsh to get his act together. The struggling kicker whiffed on a 38-yard try in this contest. That turned out to be Denver's margin of victory. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Saints",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "The Cowboys are fortunate to be getting Greg Hardy and Rolando McClain back from injury next week; otherwise, they'd have no one left. Already limping into the Sunday night contest, Dallas lost Sean Lee, Lance Dunbar and new receiver Brice Butler to injury. Lee's absence was especially huge. Missing action with a concussion, Lee had to watch a replacement linebacker get confused in coverage during the second play of overtime. C.J. Spiller took advantage of this on an 80-yard touchdown to win the game. I'd say Dallas would be leaking oil, but Hardy and McClain returning will be huge. The severity of Lee's concussion will also be key. Of course, Tony Romo's future health will determine how far the Cowboys ultimately advance. The good news is that the rest of the NFC East is 2-2 or worse. ",
            "2": "The Saints, meanwhile, have issues of their own. Drew Brees clearly isn't 100 percent. He misfired on just eight passes, going 33-of-41 for 359 yards and two touchdowns, but he doesn't have the same type of arm strength in the wake of his shoulder injury. Brees was fortunate to be battling a Dallas skeleton-crew defense that actually dropped a couple of potential interceptions. The Saints also had to rely on several illegal pick plays that weren't whistled by an incompetent officiating crew that blew calls for both teams in this contest. ",
            "3": "Spiller ended up as New Orleans' top receiver, but prior to the game-winning score - the 400th touchdown in Brees' career, by the way - he had just four catches for 19 yards. He was barely a factor, so keep this in mind if you have wild ideas about plugging him into your lineup. Keep sticking with Mark Ingram instead. Ingram gained 77 yards on 17 carries to go along with six catches for 51 receiving yards. Ingram appeared to score a touchdown, but replay review incorrectly overturned it. Khiry Robinson vultured the end-zone trip on the very next play. Ingram also appeared to lose a fumble, but replay review worked in his favor on that occasion. ",
            "4": "Brandin Cooks had yet another disappointing performance, catching just four of his eight targets for 25 yards. Willie Snead once again out-performed Cooks, catching six balls for 89 yards. Snead can't be ignored any longer, and he should be added to your roster. ",
            "5": "It's worth noting that Brees' other touchdown went to Josh Hill. Before you get too excited, Hill had just two catches for 11 yards. Ben Watson (3-30) outgained him. ",
            "6": "Going back to the Cowboys, Brandon Weeden was relatively solid, but unspectacular, going 16-of-26 for 246 yards and a touchdown. He put together a great, game-tying drive with a few minutes remaining, capped off with a score to Terrance Williams, who secured the ball while diving to the ground. Williams was inefficient all evening, hauling in just three of his 10 targets for 49 yards, but he made it count at the end. ",
            "7": "Amazingly, only three Cowboys had more than one target. Aside from Williams, Cole Beasley (6-62) and Jason Witten (4-57) held that distinction. The Saints struggle versus tight ends, so I was surprised that Witten didn't have a bigger performance. ",
            "8": "Each of the three main Dallas running back had a long run, but none of them did much else. Dunbar led the way with 54 yards on three attempts, but most of that came on a 45-yarder. He was missed when he left the game. Joseph Randle (11-26, TD) and Darren McFadden (10-31) surprisingly struggled to find running room for the most part. ",
            "9": "This was a horrible beat for anyone who bet Dallas. The Saints should have won, 23-20, but whiffed on a 30-yard field goal at the end of regulation. That would have covered or pushed the spread for all Cowboy backers. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "This was a big game for both teams' postseason chances, but it didn't appear that way based on the play on the field. Both teams seemed to attempt to one-up each other in terms of horrible mistakes. They each tried to give this game away. The Seahawks won by just three points, but they controlled the entire game. They outgained the Lions by 100 yards despite a long drive by Detroit late in the evening. However, they scored just 13 because of some horrible errors. It was small stuff early. Russell Wilson missed Fred Jackson for a first down on the opening drive. Wilson then took a big loss on a bad snap near midfield on the next possession. It got progressively worse after halftime. Tyler Lockett muffed a punt near midfield. Wilson fumbled on a zone-read play inside the Detroit 40-yard line, nullifying a chance for points. The real killer was another Wilson fumble that was returned by Caraun Reid for a touchdown. Suddenly, a 13-3 battle was 13-10, and the Lions, for the first time, had a chance. Of course, the two greatest errors occurred at the very end. The Lions inexplicably moved the ball downfield after doing nothing all evening. Calvin Johnson caught a pass and lunged for the end zone, but Kam Chancellor punched the ball out at the last second. It was a turnover in real time, which was the first mistake. The second was made by the officials. K.J. Wright tapped the loose ball out of bounds, and it was ruled a touchback. That was the incorrect call, however, as a batted ball goes back to the other team, so Detroit should've maintained possession on the 6-inch line with a chance to take the lead, or at the very least, tie the game. Some are wondering about this call because punters tend to do this all the time, but they have possession whenever that happens. The Seahawks didn't, and that's the difference. The league screwed up big time here. What they should've done, once they realized they were wrong, was tell the Seahawks and Lions to line up at the 6-inch line to play it out. It's one thing if an official screws up a judgment call, even if it's blatantly obvious, but this was black and white. The correct rules weren't enforced. It's a real shame for Detroit, as this loss drops the team to 0-4 and effectively ends its season. ",
            "2": "At least I'm not the only one who's frustrated right now. The Seahawks choked away their cover, so I'm pretty angry. They had complete control of the game, but just gave it away with their three turnovers. Wilson was the one who fumbled, but the person most to blame is beleaguered offensive coordinator Darrell Bevell, who failed to adjust for Detroit's constant corner blitzes. Seattle should have considered Bevell's employment status for quite some time now, and at this rate, it'll be a surprise if he still has his job at the end of the year. Bevell was bailed out by Wilson's good plays. He had many of them where he danced around and avoided defenders in the backfield amid awful pass protection. In fact, Jon Gruden, at one point, said of Seattle's scoring attack, Their whole offense has been Russell Wilson scrambling. Wilson actually misfired on just six attempts, going 20-of-26 for 287 yards and a touchdown to go along with 40 rushing yards on 10 scrambles. Based on those numbers alone, he had a great night, but the two lost fumbles nearly cost his team the game. ",
            "3": "Marshawn Lynch was out, and the Seahawks really missed him. Thomas Rawls (17-48) and Fred Jackson (3-21) had a couple of nice runs, but struggled to find room for the most part. Jackson limped off the field in the third quarter and never returned. Seattle could have used him in pass protection. ",
            "4": "Jimmy Graham once again proved to be a huge disappointment. He caught four balls for 29 yards, as the Lions made sure to smother him. Wilson and Graham still don't have good chemistry, and I have to believe that if the Seahawks could go back in time and negate that trade, they would in a heartbeat. Wilson really could use Max Unger right now. ",
            "5": "Jermaine Kearse led the Seahawks with 84 receiving yards, doing so on two catches. Doug Baldwin (3-36) scored. Lockett, as mentioned, muffed the punt, but tried to make up for it with four grabs for 58 yards. ",
            "6": "Going back to the Lions, I mentioned earlier that they had problems moving the chains. They had two quality drives all night, thanks mostly to their many mistakes. They had untimely penalties to nullify quality plays, and Matthew Stafford managed to overshoot an open Megatron on one play. Stafford went 24-of-35 for 203 yards. If there's a silver lining Detroit fans can take out of this game, it's that Stafford didn't commit any turnovers, which has been a major issue for him. However, the offensive line still didn't protect him very well, so he had to settle for mostly short passes. ",
            "7": "The Lions struggled to run the ball once again. Ameer Abdullah took some losses, and he managed just 33 yards on 13 carries. His longest gain was a 9-yard burst. ",
            "8": "Calvin Johnson led the receivers with seven grabs, but for only 56 yards. Though the fumble should have been brought back, the fact remains that Johnson still coughed the ball up at the worst possible moment. Meanwhile, Golden Tate (3-29) barely did anything in his return to Seattle. ",
            "9": "The Lions saw some key players get hurt. Haloti Ngata, Eric Ebron, Tyrunn Walker and Darius Slay all left the game with various injuries. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    }
}