{
    "year": "2015",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Giants",
            "Points": "32"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "21"
        },
        "comments": {
            "amount": "13",
            "1": "A year ago, the Redskins had some cause for optimism heading into a Thursday night battle against the Giants. Kirk Cousins had played well in two consecutive contests, but all of that positive thinking came crashing down because they were blown out in a game in which Cousins was terrible. Well, different year, same result. Washington had played well in its first two games and really was a punt return touchdown away from beginning the year 2-0. The defense was better, the running game had improved, and Cousins wasn't awful. All that changed in yet another blowout defeat to the Giants. It's astonishing how many errors the Redskins made in this game. Kirk Cousins' first completion was negated by offensive pass interference. Rashad Jennings blocked a punt that resulted in a safety. Cousins telegraphed an interception snatched by Prince Amukamara that set up an easy Giants touchdown. After missing a routine pass along the sideline in the red zone, Cousins underthrew an open Pierre Garcon in the end zone, allowing a defensive back to break up the pass. The special teams was flagged for a personal foul on a simple kickoff kneel-down. A holding call negated a 25-yard reception by Jamison Crowder. Cousins launched another interception, a pass that was late across the middle into tight coverage. Andre Roberts dropped a pass. And, to effectively end the game, Matt Jones fumbled the ball into the end zone, resulting in a touchback. As you can tell, this was a horrible coaching effort by the Redskins. They didn't seem prepared to play, as Tom Coughlin coached circles around Jay Gruden. The Giants, meanwhile, improved to 1-2. They could - not should, like Jim Nantz repeatedly said - be 3-0 right now had they not blown consecutive double-digit leads in the fourth quarter. They managed to hold on this time, at least, albeit against an opponent they've dominated for years. ",
            "2": "Kirk Cousins had an awful game. The final numbers weren't bad - 30-of-48, 316 yards, one touchdown, two interceptions - but most of his yardage came in garbage time. By the time the score was 25-6 late in the second half, Cousins was just 11-of-19 for 132 yards and the two picks. That means that nearly 200 yards and a touchdown occurred when the game was out of hand, and the Giants were playing a simple prevent defense. Cousins is most definitely not the long-term solution for the Redskins. Both picks were poor throws, including his first one that he telegraphed, which showed how tentative he was. He could've thrown multiple scores, but his passes were underthrown and/or late. He was hurt by some drops, but many of his long-range passes were off the mark, at least when the verdict of this game was still up in the air. ",
            "3": "The Redskins were expected to run the ball well in this contest; New York's ground defense hasn't been very good, while Matt Jones and Alfred Morris had been trampling over their first two opponents. It looked like they'd have success doing that early on, as they opened up with two nice rushes, but then left guard Shawn Lauvao was carted into the locker room. Lauvao may not be a big name, but he and Trent Williams are the team's best run blockers by a wide margin. Washington tends to pound the ball left most of the time, so not having Lauvao on the field really hurt. Jones led the team with 38 rushing yards on 11 carries. He struggled to run without Lauvao, but he broke free in the fourth quarter for a touchdown - except that he fumbled the ball prior to reaching the end zone. That really hurt his fantasy owners, but it's nothing compared to what those who started Alfred Morris went through. Morris was barely a part of the game plan, getting just six carries for 19 yards. I wrote last week that Morris owners need to look for new options to start, and that was obvious tonight. Jones is the more-talented player, so Morris is being faded out of the offense. If you can trade Morris for anything, do it now. ",
            "4": "Jordan Reed led the Redskins in receiving with 96 yards on six catches. He was targeted nine times. Much of his yardage came in junk time, but he'll continue to serve as a TE1 as long as he stays healthy. Reed has been injury-prone in the past, but he has changed his diet, and it appears as though it's paying off. ",
            "5": "No one else on Washington's roster stood out. Pierre Garcon had an inefficient evening, catching five of his 12 targets for 64 yards. Don't blame Garcon though; Cousins had him open for a touchdown, but the ball was underthrown. ",
            "6": "You might notice that someone named Chris Thompson snatched eight receptions for 57 yards and a touchdown. Thompson is the third-down back, and he was on the field so much because the team was so far behind in the second half. He's not worth owning in any league. ",
            "7": "As for the Giants, Eli Manning was sharp for most of the night, going 23-of-32 for 279 yards and two scores. He nearly threw an interception to DeAngelo Hall, but the ball luckily skipped in front of the cornerback. Manning will continue to be a decent streamer versus bad defenses. ",
            "8": "Manning's touchdowns went to Rueben Randle and Odell Beckham Jr. Each caught seven balls each for 116 and 79 yards, respectively. Randle's score, a 41-yarder, came very late in which Manning surprised the Redskins with a pass on a third down as he was running out the clock. Randle wasn't even open; there was good coverage, but the ball bounced right into his hands after it was tipped. Beckham, on the other hand, is a legitimate stud receiver, and this sort of production will be typical for him going forward. ",
            "9": "Larry Donnell caught three passes for 32 yards. He also dropped a pass. He's not worth owning in 12-team leagues that start only one tight end. ",
            "10": "The Giants struggled to run the ball against Washington's stout front. Rashad Jennings, who contributed with a blocked punt, managed only 32 yards on 11 carries. Andre Williams, meanwhile, mustered only 29 yards on 14 attempts. He scored a touchdown in the first half. Neither is really much of a fantasy option until the other gets hurt. The offensive line just isn't opening holes, and neither back is talented enough to compensate for it. ",
            "11": "Shane Vereen, meanwhile, logged 23 yards on six carries. He didn't catch a single ball, partly because he dropped a key pass deep in Washington territory. Vereen is just a reserve in PPR formats. ",
            "12": "In addition to Lauvao, DeAngelo Hall sustained an injury. He hurt his foot and had to be helped off the field. He couldn't put any pressure on his leg. ",
            "13": "One last note: The officials were terrible in this game. They didn't make any shady calls, or anything, but they repeatedly picked up flags they threw. This happened on at least five occasions. Additionally, a late Washington touchdown should've been reviewed. It wasn't, and a pissed-off Tom Coughlin threw the challenge flag. At the time, it looked like a dumb move on his part because he was trying to review something illegally, but he was probably just pissed off that the officials were so incompetent. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Colts",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "33"
        },
        "comments": {
            "amount": "9",
            "1": "The Colts may have won this game, but there is still a lot for this team to be concerned about. The offensive line, in particular, remains an issue. It wasn't a good sign early when Luck, heavily pursued by Karl Klug, threw the ball away just as Klug nearly took off his head. Klug later got to Luck, beating Anthony Castonzo, who had a very poor performance. He was also forced into more turnovers; one of his picks came when he couldn't step into his throw. He launched a pass off his back foot into double coverage, allowing Tennessee to snatch it away. Luck was ultimately sacked thrice, but the number could have been much greater. Luck finished 18-of-30 for 260 yards, two touchdowns and a pair of interceptions. Considering the amount of pressure Luck was under in this game, those numbers have to be considered pretty impressive. Of course, the Titans have a poor defense that had issues against Johnny Manziel a week ago, so Luck's struggles don't bode well going forward. Perhaps the Colts will be able to get things together in terms of their putrid blocking, but there are major concerns around Luck. If you can deal him for something close to equal value, I'd pull the trigger. ",
            "2": "T.Y. Hilton finally got back on track following a poor Monday night performance. He saw seven targets, which tied for the team lead, and snatched four of the passes for 94 yards. He made a great, 48-yard grab in the first half, but couldn't find the end zone. As with Luck, Hilton's potential will be capped as long as the offensive line can't block. ",
            "3": "Luck's two touchdowns went to Phillip Dorsett and Donte Moncrief. Dorsett (2 catches, 43 yards) was thrown to on just three occasions, so don't read into this performance very much. He can be ignored in terms of a fantasy perspective. Moncrief, on the other hand, should continue to be a decent option. He reeled in four of his seven targets for 32 yards and a score. Moncrief is a much greater part of the offense than Andre Johnson, who was barely a factor. Luck threw to Johnson just twice. Only one ball was caught, but that was wiped out by a penalty. Johnson simply can't get separation at this stage of his career. He's done, and there's no reason to have him on your fantasy roster. ",
            "4": "Coby Fleener logged four receptions for 51 yards. The Colts vowed to have their tight ends more involved this week, and they kept their word. Fleener was third on the team with six targets. ",
            "5": "Frank Gore hurt his fantasy owners with a goal-line fumble on Monday, but he redeemed himself by reaching the end zone twice in this contest. He rushed for 86 yards on only 14 carries. His workload was limited because the Titans led for most of the second half. ",
            "6": "Speaking of Tennessee, the team may have lost this game, but it has plenty to be optimistic about regarding Marcus Mariota. The No. 2 overall pick continues to look much better than Jameis Winston, and he single-handedly nearly led his team to victory over an opponent that his franchise hasn't been able to overcome. Mariota engineered a terrific drive at the end of the game that nearly tied the score at 35, but Tennessee ran the ball and was stuffed on the two-point try. Mariota shredded the Indianapolis defense, going 27-of-44 for 367 yards, two touchdowns and a pair of interceptions. Only one of the picks was Mariota's fault; Delanie Walker had the ball in his hand for a second, but a big Josh Thomas hit dislodged it. The ball popped into the air, and Dwight Lowery snatched it and returned it for six. Mariota's second interception was more legitimate, as he fired a pass into tight coverage, but it was one of the few blemishes on his otherwise brilliant afternoon. It needs to be noted that Mariota sliced and diced a poor defense that didn't seem to understand how to defend Kendall Wright slant passes. However, the fact that Mariota is able to routinely put together strong performances like this makes him a viable weekly fantasy option. ",
            "7": "Speaking of Wright, he logged seven receptions for 95 yards and a touchdown. He was my top fantasy sleeper heading into this season, so I don't think these types of showings are fluky. Wright, who was catching slant passes all afternoon, will continue to be a borderline WR2-WR3. ",
            "8": "Only two Titans saw more than three targets. Wright was one, and Walker happened to be the other. Walker was responsible for Mariota's pick-six, but he played well otherwise, hauling in seven balls for 68 yards. Dorial Green-Beckham, meanwhile, managed two catches for 22 yards and a touchdown. Green-Beckham clearly pushed off Vontae Davis on the score, but no flag was thrown for some reason. Green-Beckham is a physical freak whose progress is worth monitoring. If you have room on your bench, he's worth a stash, but I'll be monitoring him in the meantime. ",
            "9": "It appears as though Antonio Andrews has supplanted Bishop Sankey as the team's starting running back. Sankey was given just five carries and managed just 10 yards, while Andrews rumbled for 49 yards and a touchdown on 12 attempts. Andrews dropped a pass early in the game, but was better overall. He even had a second score negated by a holding penalty. Sankey, on the other hand, can probably be dropped. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "Since they lost the Super Bowl following the 2002 season, the Raiders have struggled to maintain any sort of success. They were 12-42 following a victory dating back to 2003, but perhaps this win is a sign that things will change. Of course, it helps that Oakland now has Amari Cooper. Cooper has been as great as advertised. He dominated Baltimore's secondary last week, and the Browns had no answer for him in this matchup. Cleveland tried to have top corner Joe Haden cover him, but Cooper torced him immediately on the opening drive. The Raiders were so efficient, thanks to Cooper's dominance, that they were able to overcome a Mychal Rivera hold that put the team in a long-yardage situation to eventually score a touchdown on the opening possession. Cooper ultimately finished with eight catches for 134 yards. His only blemish was a lost fumble. He also failed to reach the end zone, but the touchdowns will come. Cooper is a beast, and despite just being a rookie, he's arguably a weekly WR1 option. ",
            "2": "Benefiting from Cooper's presence, Derek Carr went 20-of-32 for 314 yards and two touchdowns. This is Carr's second-consecutive 300-yard performance, and it's beginning to look completely legitimate. Carr can be owned as a backup and a decent bye-week filler. ",
            "3": "Aside from Cooper, no other Raider had more than 56 receiving yards. Seth Roberts maintained that figure on three catches. He also scored a touchdown. He's not worth owning. Neither is Michael Crabtree, who is very inefficient; he caught four of his nine targets for 36 yards and was flagged for offensive pass interference on a couple of occasions. These sorts of outputs have been too common for Crabtree throughout his disappointing career. ",
            "4": "Latavius Murray had issues running the ball early, which was strange; he was stuck on just one yard after his initial seven carries. However, the lanes eventually opened up for the tough back, who ultimately finished with 139 yards and a touchdown on 26 attempts. Murray will be a solid RB2 most weeks. ",
            "5": "I'm not exactly revealing anything crazy by saying that the Browns played poorly in this game, but their mental mistakes following a big win over the Titans were alarming. They allowed a 10-point swing to take place in the first half. Cleveland was whistled for a roughing-the-kicker penalty deep in Oakland territory. The Raiders were able to maintain possession and ultimately score a touchdown. A bit later, the Browns were going for it on a fourth-and-goal on the 1-yard line. A false start ruined their chance, and they had to settle for three. So, the game went into halftime with a 17-3 score, but it easily could have been just 10-7. ",
            "6": "Cleveland's fans did not have a good time in this game, as they constanly booed the offense. They seemed displeased that Josh McCown - not Johnny Manziel - was the quarterback. McCown actually posted a strong stat line, going 28-of-49 for 341 yards, two touchdowns an interception and a fumble, but most of that came in garbage time. By halftime, McCown was just 7-of-15 for 104 yards, but Oakland's prevent defense allowed some decent gains. McCown actually had Travis Benjamin open for a game-tying touchdown at the very end, but he predictably underthrew him. McCown is obviously not any sort of fantasy option, especially given that Manziel could be named the starter any given week. ",
            "7": "Here are some more Cleveland fantasy players to ignore: Gary Barnidge (6-105) and Travis Benjamin (4-45) both scored touchdowns, while Brian Hartline reeled in five balls for 96 yards. All of this came in junk time amid prevent defense. No one is worth owning in Cleveland's aerial attack. ",
            "8": "Isaiah Crowell continued to see the majority of the workload, but struggled to find any running room. He mustered just 36 yards on 10 carries, while Duke Johnson's four attempts went for only three yards. However, Johnson was a much bigger part of the passing game, securing six of his seven targets for 32 receiving yards. Johnson could be a decent fantasy option if Crowell were to get benched/injured at some point. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "28"
        },
        "comments": {
            "amount": "9",
            "1": "When good teams miss their starting quarterbacks for the first time, they usually rise up and upset their opponent, as the other 52 players give 110 percent to compensate for the loss of their leader. It appeared as though the Cowboys were doing just that; they had two separate two-touchdown leads, including a 28-14 advantage right before halftime. However, the Falcons were able to not only come back, but prevail with a double-digit victory, thanks to some unbelievable offensive play. Matt Ryan was able to engineer some very long drives in the second half, thanks to 8-of-9 third-down conversions versus a Dallas defense that actually played somewhat well in the opening two quarters. Ryan was very precise, dissecting Dallas' defense with ease. He finished 24-of-36 for 285 yards and two touchdowns, and his second-half numbers were particularly impressive. He misfired on just four occasions, going 13-of-17 for 153 yards following the break. Ryan was nearly intercepted twice early in the first half, but he was lucky that the Dallas defensive players dropped the ball twice. ",
            "2": "Ryan, of course, couldn't do this all by himself, and he had the luxury of throwing the ball to the best receiver in the NFL right now. Julio Jones is having a monstrous 2015 campaign thus far, and it doesn't appear as though he can be contained. Seeing a ridiculous 20 targets, Jones snatched 12 passes for 164 yards and two touchdowns. Jones had just three grabs for 27 yards at intermission, so a bulk of his output came in the second half. Ryan targeted him relentlessly, and it paid off. The Cowboys simply had no answer for the elite play-maker. ",
            "3": "Jones' great performance was expected. Devonta Freeman's, on the other hand, was not. I don't know what happened to the pedestrian runner I've seen for the past year-plus, but Freeman was unstoppable. He tallied 141 yards and a whopping three touchdowns on 30 carries, and he also caught five passes for 52 receiving yards. Freeman was unbelievable. He ran with both great speed and tremendous power, and the Cowboys couldn't tackle him whatsoever. It was almost as if the Falcons kidnapped a better running back on another team and dressed him in Freeman's uniform. It's that inexplicable. Freeman is owned in just 49 percent of leagues, so he needs to be added immediately if he's available. ",
            "4": "Some other Falcons worth mentioning are Leonard Hankerson and Roddy White. Excluding Jones and Freeman, Hankerson was the only Falcon who saw more than one target. He caught three of the six balls thrown his way for 45 yards. He dropped a pass earlier that was nearly intercepted as a result. White, meanwhile, wasn't officially targeted. He caught a 17-yard pass, but it was nullified by a holding penalty. White is no longer a big part of Atlanta's offense, so he can be dropped in 12-team formats. ",
            "5": "Going back to the Cowboys, Brandon Weeden was not the problem in this game. He made just one horrible throw, which was intercepted. He rolled left and heaved the ball way late over the middle to no one in particular. It was a dumb decision, but Weeden was 22-of-26 for 232 yards and that pick, so it's not like he played poorly or anything. On the contrary, Weeden, despite some shaky attempts following intermission, was solid for most of this contest, but he barely had a chance to do anything in the second half because the Falcons maintained possession for so long. ",
            "6": "It appeared as though Joseph Randle was going to have a career afternoon. By halftime, he had 92 yards and three touchdowns on just 10 carries. However, the Falcons somehow clamped down on the run following intermission, and Randle's yardage actually dropped to 87 on 14 attempts. Darren McFadden (6-35) also scored. Randle continues to see more of a workload than McFadden, and he's definitely worth a start some weeks despite Tony Romo's absence because of how good the offensive line is. ",
            "7": "Dallas' leading receiver was actually a running back. Lance Dunbar snatched all 10 of his targets for an even 100 yards. Weeden was simply more than happy to check the ball down to his third-down back, and it worked on most occasions. Jason Witten, meanwhile, was second in receiving with six grabs for 65 yards. ",
            "8": "Terrance Williams, who was seen as a promising fantasy player when Romo was healthy, failed to secure either of his two targets. Williams drew a face-mask penalty on the opening drive, but did nothing else. I wouldn't drop him yet, but it's hard to justify starting him as long as Romo is sidelined. ",
            "9": "There was a scary moment for the Cowboys in this game - not including the Jones catches and Freeman runs - and it occurred when Sean Lee sustained an injury. Lee was down for a while in the second half and left the contest, but was able to return at some point. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "51"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "11",
            "1": "The Patriots are pissed. Even though they were caught red-handed deflating footballs in the playoffs, they seem willing to do whatever it takes to embarrass the rest of the league. They certainly did so Sunday, running up the score on the poor, hapless Jaguars, who never had a chance. The Patriots, who have often taken these horrible teams for granted, failing to cover large spreads in the process, appear to have a new philosophy in the wake of everything that happened this offseason. ",
            "2": "Tom Brady entered this game just one touchdown shy of 400 for his career. He nearly had the monumental score to Rob Gronkowski early on, but Davon House made a nice pass-breakup - one of the few, quality plays that Jacksonville's defense enjoyed this afternoon. Brady went to Danny Amendola shortly afterward for the milestone. Brady finished 33-of-42 for 358 yards and two touchdowns. Jacksonville's inept stop unit offered absolutely no resistance. It was pathetic. Brady remains the quarterback to own in daily formats, as the pissed-off Patriots want to humiliate teams by running up the score. ",
            "3": "Brady's touchdowns went to Amendola (5-39) and Keshawn Martin (3-33). Amendola saw just five targets on the afternoon and is just a PPR reserve. Martin isn't worth owning, and neither is Aaron Dobson, who fell back down to Earth following last week's productive performance. Dobson caught one ball for five yards. He drew a deep pass interference flag, but also dropped a ball. ",
            "4": "Gronkowski didn't find the end zone, but he broke the century receiving mark, snatching four balls for 101 yards. He nearly scored, so there's nothing to worry about there. Meanwhile, Julian Edelman hauled in eight of the 11 targets thrown his way for 85 yards. ",
            "5": "The box score may show that LeGarrette Blount had a great game, but don't be deceived. Blount barely had any touches in the first half, with Dion Lewis getting most of the work. Blount plunged into the end zone thrice following intermission, and much of his yardage (18 carries, 78 yards) came when this game was well out of hand. Lewis, meanwhile, had just eight carries, but turned those into 37 yards and a touchdown. If this game were closer, Lewis would've handled more of a workload. In fact, he didn't even touch the ball after the break. It's a sign that Bill Belichick values him. Lewis also caught five passes for 30 receiving yards. Lewis was great, breaking many ankles on his touches. It's a shame that we didn't get to see him in the second half. ",
            "6": "As for the Jaguars, they had their chances early, despite what this score says. A holding penalty ruined their first drive, which looked promising. An illegal formation did the same on the next possession. Blake Bortles was then picked. Jacksonville simply couldn't keep its possessions alive long enough to keep pace with New England's unstoppable offense. ",
            "7": "Bortles had a rough afternoon. The stat sheet may say otherwise, since the second-year quarterback went 17-of-33 for 242 yards, two touchdowns and an interception, but much of his yardage came in garbage time. By the time the score was 30-3, Bortles was just 8-of-19, 90 yards and a pick, which was a pass that sailed way too high. Bortles was nearly intercepted on several other throws, including one play in which he was fooled by the coverage early in the contest. ",
            "8": "The Jaguars planned to feature T.J. Yeldon heavily in this contest, but never got the chance because they were way behind so early. Yeldon was given just 11 carries, which he turned into 33 yards. He's somewhat of a buy-low candidate, as he'll be more involved in closer games. ",
            "9": "Bill Belichick is great at erasing one aspect of an opposing team's offense, and he chose to eliminate Allen Robinson from Jacksonville's game plan with numerous double-teams. Robinson caught four balls for 68 yards, but had just one reception in the opening half. He's still a decent WR3. ",
            "10": "Allen Hurns led the Jaguars in receiving with two grabs for 70 yards and a score. Clay Harbor (3-43) also found the end zone in garbage time. Neither is worth owning in any league. ",
            "11": "A funny moment in this game occurred in the first half when Bortles appeared to fumble. Walt Coleman, who is somehow still officiating, ruled against the Patriots this time - years after he gave the team possession in the Tuck Rule game. The CBS color analyst, Rich Gannon, who was the opposing quarterback in the Tuck Rule game, spent nearly five minutes complaining about that historic play, and he could only chuckle when Coleman didn't reward the Patriots with the ball this time. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "A loss here wouldn't have ended the season for the Eagles, given the dubious state of the other three teams in the division, but falling to 0-3 obviously wouldn't have been ideal, especially after getting embarrassed like they were against arch-rival Dallas at home the previous week. Philadelphia rebounded with a victory, albeit against a New York team coming off an emotional Monday night victory and heading into a trip to London. Make no mistake, however. Sam Bradford, by no means, has redeemed himself. Bradford was actually very mediocre in this victory, and the numbers indicate that. He went 14-of-28 for 118 yards and a touchdown. He dealt with accuracy issues all afternoon, beginning on the first drive. He overthrew Miles Austin in the end zone, missing out on a potential touchdown. On the next possession, Bradford was guilty of a horrible third-down pass. Austin had a step on Antonio Cromartie, but Bradford threw the ball behind him. Bradford misfired badly on numerous other attempts, and he once again appeared to be skittish in the pocket. He does not appear to be the long-term answer for Philadelphia, but he has plenty of time to prove himself. Until he does, he belongs on your fantasy bench. ",
            "2": "The Eagles were able to win this game via a strong rushing attack. The Jets did not come into this game prepared to play, and it really showed as Philadelphia was more forceful in the trenches. As a consequence, Ryan Mathews, playing for an injured DeMarco Murray, was able to generate 108 yards on 25 carries. He also found the end zone as a receiver, catching two balls for 20 aerial yards. Mathews' score, a 23-yarder on a wheel route, was one of Bradford's few pretty throws. He also lost a fumble in the fourth quarter, but it didn't turn out to be a big deal. Mathews has proven that he can be started if Murray is out of the lineup, but it remains to be seen what Murray's status will be for Week 4. Darren Sproles, meanwhile, also found the end zone, but didn't have as much success running the ball. Sproles was given 11 carries, but turned them into only 17 yards, 12 of which came on one scamper. Sproles was also limited in the passing game, catching four balls for only 19 receiving yards, and he dropped a pass on what would've been a 78-yard touchdown. His best play, of course, came on an 89-yard punt return touchdown in the second quarter. ",
            "3": "With Bradford limited, Jordan Matthews was the only Eagle who accumulated more than 30 receiving yards. He caught six balls for 49 yards, but would've had a better day if he didn't drop two passes. Nelson Agholor, on the other hand, couldn't catch a single pass on his four targets. Agholor is owned in 68 percent of leagues for some reason. He should be rostered in zero percent. ",
            "4": "Many thought the Jets would win this game, but they were extremely flat - a common trend for teams flying to London the following week. It didn't help that the Jets were missing two of their key pieces. Both Chris Ivory and Eric Decker were ruled out, leaving only Brandon Marshall for Ryan Fitzpatrick to work with. As a result, the Jets achieved their second first down of the game after the 2-minute warning right before halftime. Fitzpatrick went 35-of-58 for only 283 yards, two touchdowns and three interceptions. All of Fitzpatrick's picks came in the second half, as he was trying desperately to lead his team back. One interception made by second-round rookie Eric Rowe, who had fantastic coverage. Fitzpatrick was also betrayed by some drops from Quincy Enunwa, but he needs to be blamed, as he missed several opportunities, including one where he had Devin Smith wide open for a touchdown in the second quarter. Fitzpatrick simply missed him. ",
            "5": "With Decker out, it's not a surprise that Brandon Marshall dominated the targets. Fourteen balls went his way, and he caught 10 of them for 109 yards and a touchdown. Marshall, however, had one of the dumbest plays of the year, when he foolishly tried to lateral to no one in particular while being tackled. Marshall was charged with a fumble as a consequence. Toward the end of the game, he dropped a pass that was tipped and intercepted. Marshall's stat line was great, and he'll continue to produce, but he cost his team a potential victory with those two errors. ",
            "6": "Other notables in the New York passing game: Jeremy Kerley scored a touchdown, but he's just a mediocre slot receiver not worth owning. He caught six passes for only 33 yards. Meanwhile, second-round rookie Devin Smith made three grabs for 39 yards. He simply couldn't connect with Fitzpatrick; as mentioned earlier, the bearded quarterback missed him for a score. He might be a fantasy option next year, but not anytime soon. ",
            "7": "Ivory's carries went to Bilal Powell, who mustered only 31 yards on 10 attempts. Powell is a FLEX option at best if Ivory misses more time, but it sounds as though Ivory will be back next week. He was very close to playing in this contest. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "6"
        },
        "comments": {
            "amount": "10",
            "1": "This was the very definition of a Pyrrhic victory for the Steelers. They improved to 2-1 with the win, but lost Ben Roethlisberger to a knee injury in the process. Roethlisberger went down in the middle of the third quarter with a nasty knee injury. He was on the field for a while and ultimately carted off into the locker room. Adam Schefter is reporting that Roethlisberger is out for at least four weeks. Roethlisberger went 20-of-24 for 192 yards and an interception. He did not tear his ACL, so he may return in 4-6 weeks, so I'd hold on to him. And as for his backup, he's not worth owning despite his scrambling ability; he went 5-of-6 for 38 yards in limited action, but also fumbled, which he was fortunate enough to see recovered by his teammate. He's a turnover machine and will ruin his team's chances once opposing defensive coordinators begin confusing him with complicated schemes. ",
            "2": "The Steelers will lean on Le'Veon Bell in Roethlisberger's absence. Bell had a strong 2015 debut, though he was given just 19 carries as a result of the tempo of the game. Bell gained 62 yards and a touchdown on those attempts, and he also snatched seven catches for 70 receiving yards. His presence was felt almost instantly, as he was able to convert a long third down. He nearly fumbled shortly afterward, but was solid otherwise. ",
            "3": "Save for Bell, Antonio Brown was the only Steeler who had more than 19 receiving yards. He caught 11 balls for 108 yards. However, he managed just two receptions in the second half, thanks to Roethlisberger's injury. Brown's production is going to drop considerably, but he's still worth starting on a weekly basis. In fact, I consider him as a buy-low option right now because of the assumption that he'll completely drop off. If you can get him at a huge discount, I'd pull the trigger. ",
            "4": "Heath Miller (2-17) and Markus Wheaton (2-16) weren't big factors. With Roethlisberger out for the foreseeable future, and Martavis Bryant returning in two weeks, Wheaton can be dropped in all formats. ",
            "5": "The Steelers aren't the only team with quarterbacking issues. Despite battling one of the weakest secondaries in the NFL, Nick Foles was a huge disappointment. He went 19-of-28 for 197 yards and an interception, an overthrown lollipop toss that resembled a punt late in the fourth quarter. Foles was very conservative prior to that throw, which was odd, considering the poor shape of the Ryan Shazier-less Pittsburgh stop unit. He's not worth owning in any format. ",
            "6": "The good news for Pittsburgh is that Todd Gurley saw his first NFL action in this contest. The Steelers have a strong rush defense, however, so they were able to limit him to just nine yards on six carries. Tre Mason (9-16) didn't fare any better. The Rams couldn't block for Gurley, who looked pretty tentative, which is understandable. Gurley will have a larger role going forward, so he's a buy-low option right now. ",
            "7": "While Gurley is a buy-low, Kenny Britt is a sell-high. Britt secured seven balls for 102 yards, but this is going to go down as one of his top performances of the season. Britt is a lethargic bum who can't be counted on, but he was robbed of a key reception at the very end of the game. Britt made a great grab to move the chains on St. Louis' final drive. His forearm was definitely under the ball, yet the incompetent officials somehow overturned it to the surprise of the two CBS announcers. I'd say this ended up costing the Rams a victory, but that would be a lie; I'm not sure their inept offense could've achieved another first down after that. ",
            "8": "Aside from Britt, only one other Ram collected more than 18 receiving yards. That would be Tavon Austin, whose five receptions went for 38 yards. He should be ignored in fantasy. Lance Kendricks (2-12) was guilty of two key drops, one of which would've set up the Rams with a first down at the Pittsburgh 15-yard line. ",
            "9": "Kendricks wasn't the only Ram making mistakes. Just take a look at St. Louis' sole red-zone sequence, which occurred early in the fourth quarter: - Tre Mason given a carry, blown up in the backfield. - Jared Cook false started. - Foles' pass to Cook nowhere near the tight end. Cook stopped running inexplicably on the route. - Greg Robinson false started. A Robinson hold, by the way, ruined a previous promising drive. - Field goal. That's just awful. So was Jeff Fisher's decision-making. Fisher ran a fake punt on one occasion, which failed, and then he inexplicably punted on a fourth-and-5 on Pittsburgh's 42 late in the third quarter. The punt went into the end zone for a net gain of just 22 yards. ",
            "10": "This game was delayed for nearly a half hour because of a pyrotechnics accident when a blue flame torched part of the field. This was especially embarrassing, as these fireworks were unnecessary because the stadium was half-empty. Those in the stands cheered for the Steelers. A loud HEEEEEATH was heard when Miller caught a pass, and a Pittsburgh touchdown was cheered frantically. The Rams barely have any fans, and it's painfully obvious that the team needs to move back to Los Angeles. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: So much for the Chargers fixing their offensive line. They put so much energy into that this offseason, but injuries have pretty much negated everything they've accomplished. Meanwhile, Adrian Peterson may threaten the league office with a lashing if they don't schedule home games against the Chargers for him each season. </i> ",
            "2": "These two 1-1 teams came into this game heading in separate directions, and they continued going their separate ways as the game progressed, or regressed, if you are the Chargers. After all was said and done, Adrian Peterson and the San Diego offensive line will be the stories after the Vikings thumped the Chargers 31-14. Peterson is back. He still looks somewhat hesitant at times, but when he got going, he was unstoppable. He was able to push the ball in from two yards out in the second quarter to put the Vikings up 10-3. Philip Rivers answered with a touchdown to Keenan Allen before halftime, but soon after they came out of the locker room, Peterson put on a show with the Vikings' first play by running for a 43-yard touchdown. A stiff arm and a nasty cut into the middle of the field plus speed that a 30-year-old man of his size shouldn't have, and there was his second touchdown of the game. He went on to have a couple more nice runs and also got vultured at the goal line by Zach Line for what should have been his third touchdown of the game, but the Vikings had built too large a lead, and they rested him for part of the fourth quarter. Feel good about that fantasy pick. ",
            "3": "Teddy Bridgewater on the other hand, didn't look sharp early, as the Vikings went to the air instead of pounding the ball on the ground with Peterson. But as soon as the running game got going, Bridgewater had a much easier time with a better pocket to work from. He finished with a paltry line of 13 completions on 24 attempts for 121 yards, one interception and no touchdowns. He'll have better days, but establishing the run is needed for him and this passing game. ",
            "4": "Philip Rivers' day was not pleasant. He was hurried and sacked all game, while his offensive line limped off the field seemingly every other play. D.J. Fluker was shown limping, Orlando Franklin was carted off the field with a right ankle injury, and King Dunlap also had to come out of the game. Rivers was officially sacked four times, but was pressured and harassed all game. He took one shot to the ribs that almost took him out of the contest, and when the game was officially out of hand, Rivers went to the bench where he couldn't be hurt anymore. Except for his feelings, maybe. ",
            "5": "The Vikings' defense was led by Everson Griffen, who had two of those four sacks and dominated the Chargers line all game. Then, linebacker Chad Greenway twisted the dagger deeper when he intercepted a ball that Stevie Johnson couldn't hold on to in the red zone and returned it for a 91-yard touchdown in the fourth quarter to put the game even further out of reach at 31-7. ",
            "6": "Keenan Allen was the big offensive star for the Chargers as he saw 18 targets, catching 12 for 133 yards and two touchdowns. On Allen's first touchdown, Xavier Rhodes was hit by his own man and knocked out of the game with a concussion. That helped Allen as he went from Rhodes covering him to rookie Trae Waynes. Allen's work after the catch remains impressive, and as long as he's getting these kinds of targets, he's going to put up good numbers. ",
            "7": "Rookie Melvin Gordon didn't fare as well as he did last week, with the Vikings living in the Chargers' backfield. This offensive line will need to step up its game for Gordon to put up fantasy numbers, but it was good to see Gordon in the game even when the Chargers were trailing. ",
            "8": "San Diego still has plenty of offensive weapons, and if the line could have picked up a few more blitzes, Rivers could have picked the Vikings apart, but it all fell on this offensive line this week and the unit couldn't hold up under the pressure. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: Ben Roethlisberger's injury has major implications here. The Bengals have pretty much wrapped up the division as a result, while the Ravens' season is saved because they'll be able to beat up on QBDK on Thursday. </i> ",
            "2": "The Ravens were desperate for a win to avoid the dreaded 0-3 start to the season, but Baltimore came out flat, and its secondary was abysmal all day as Andy Dalton and A.J. Green dominated the Ravens through the air. Dalton and Green each set career highs for yards. Baltimore almost pulled out a win thanks to the inspired play of Steve Smith, but in the end, Dalton and Green were too dominant for Smith to overcome. ",
            "3": "The Bengals got on the board first when Dalton connected with Marvin Jones along the sideline for 32 yards. In the red zone, the Ravens hurt themselves as Courtney Upshaw dropped an interception and a penalty on Will Hill gave the Bengals a first down. Dalton finished the drive by diving into the end zone after a 7-yard run. Ravens answered with a drive that was led by a Flacco hooking up for a 19-yard pass to tight end Crockett Gilmore. However, the self-inflicted wounds continued as Justin Tucker missed a 50-yard field goal. Cincinnati continued to work the Ravens' defense, as Dalton threw a bullet to Jones for a 16-yard touchdown. On the next drive, Dalton used A.J. Green to move the ball for points. Dalton to Green completed passes of 17, 31 and 14 yards at the expense of Baltimore cornerback Jimmy Smith. After the 2-minute warning, the Bengals were set up for a fourth-and-1 that needed a half yard. Marvin Lewis decided to go for it, and on a broken play, Dalton threw a pass for Tyler Eifert who caught it over Smith and reached over the goal line. Smith's foot kicked the ball out as Eifert extended it over the goal line. At first, the play was called a touchdown, but upon review, it was ruled to be an incomplete on the decision that Eifert didn't maintain the catch. That limited the Bengals lead to 14-0 at the half. In the third quarter, Green made an incredible adjustment for a 47-yard gain. The Bengals looked like they were ready go in for more points, but Smith came back to pick off Dalton on a poorly thrown fade pass in the end zone. The Ravens finally got on the board in the third quarter. Flacco started moving the ball with passes to Smith. On a fourth-and-5 at the 50, Flacco hit Smith on an out along the sideline. He shook two tackles and exploded down the field for a touchdown. On the next possession, a 20-yard completion to Smith got the Ravens across midfield and a roughing the passer penalty by Chris Carter moved the ball to the Bengals' 23-yard line. The Cincinnati defense tightened and forced a short field goal to cut Cincinnati's lead to 14-10. The Ravens took the lead midway through the fourth quarter when Elvis Dumervil beat Eifert around the corner to get a blind-side strip-sack on Dalton. Linebacker C.J. Mosley scooped up the loose ball and ran it 41 yards for a touchdown to give the Ravens a 17-14 lead. The Bengals answered in tremendous fashion. Dalton hit Green down the seam to around midfield. He broke a tackle from Smith and maintained his feet to run 80 yards for a touchdown. It was a coverage bust as safety Kendrick Lewis was lined up at corner and Will Hill was caught out of position downfield. Baltimore moved back into Cincinnati territory thanks to completions to Smith. The old veteran beat the bigger cornerback Dre Kirkpatrick for a contested catch on a 16-yard touchdown to give the Ravens a 24-21 lead with just under four minutes remaining. At this point, the defenses looked gassed and incapable of covering. Dalton hit a 19-yard completion to Mohamed Sanu, and then, Jones caught a 31-yard pass over Kyle Arrington to the Ravens' 7-yard line. Dalton went back to his money-man with a touchdown pass to Green against Smith. Cincinnati's defense finally got a stop to clinch the win for the Bengals. ",
            "4": "Andy Dalton completed 20-of-32 passes for 383 yards with three touchdowns and one interception. He also ran for a touchdown. That yardage total was a career high for Dalton. ",
            "5": "A.J. Green also set a new career high with 227 yards through the air on 10 receptions with two scores. Green was awesome, and the Ravens were completely incapable of covering him. ",
            "6": "The Bengals' ground game was disappointing from a fantasy perspective as Gio Bernard (13-49) and Jeremy Hill (12-21) did the platoon approach that kept either from having a good game. ",
            "7": "Even worse than the Cincinnati duo, Ravens running back Justin Forsett continued to disappoint his fantasy owners. He ran for only 13 yards on 10 carries. ",
            "8": "Joe Flacco completed 32-of-49 for 362 yards with two touchdowns and one interception. ",
            "9": "Steve Smith looked like vintage Carolina version as he totaled 13 receptions or 186 yards and two touchdowns. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "22"
        },
        "comments": {
            "amount": "11",
            "1": "<i> EDITOR'S NOTE: Good news/bad news for the Panthers. The bad news is that they've been half-asleep for their three games now. The good news is that they're 3-0. I'd say tougher competition will come soon, but Carolina has Tampa next week. </i> ",
            "2": "Wide receivers? Who needs them when you have a tight end like Greg Olsen? That's what the Carolina Panthers found out on Sunday. Olsen had eight catches for 134 yards and two touchdowns. The victory marked the first time the Panthers have started a season with three straight victories since they went to the Super Bowl in the 2003 season. The undefeated Panthers are tied with the Atlanta Falcons for first place in the NFC South. ",
            "3": "With Kelvin Benjamin out for the season and Jerricho Cotchery missing Sunday's game with an injury, it's clear that Olsen is the No. 1 option in the passing game. He might be the best tight end in the league right now outside of New England. Ted Ginn Jr. did a nice job with four catches for 93 yards. But Ginn is a hit-and-miss player. Olsen is a sure thing. ",
            "4": "Cam Newton is becoming a quarterback you must start in fantasy despite the supporting cast at receiver. He makes things happen through the air and on the ground. With a thin corps of wide receivers, Newton still completed 20-of-31 passes for 315 yards with two touchdowns. He also ran seven times for 33 yards with a touchdown. This is a guy who is going to get the ball into the end zone one way or another. ",
            "5": "Carolina running back Jonathan Stewart didn't do much, gaining 52 yards on 14 carries. But it may not be time to bench Stewart just yet. With the success of the passing game, things could open up for the running game in the coming weeks. ",
            "6": "Cornerback Josh Norman already was off to a good start this season. But he took things to another level with a spectacular interception to seal the victory late in the fourth quarter. ",
            "7": "The Saints were without injured quarterback Drew Brees, but they got a strong performance from backup Luke McCown, who completed 31-of-38 passes for 310 yards. Aside from the interception, McCown was nearly flawless, but he didn't get the ball into the end zone through the air. ",
            "8": "Until they show otherwise, the Saints don't have a true feature back. Mark Ingram and Khiry Robinson each scored a touchdown, but the Saints appear to be undecided about who gets the key touches. Ingram is not a bad option in a deep league, but he isn't going to pile up points. ",
            "9": "New Orleans wide receiver Marques Colston had only four catches for 47 yards. He's looking more and more like he's on the downside of his career. ",
            "10": "Who Dat Nation might not be willing to accept it yet, but the season is over for the Saints. They're 0-3, and the Falcons and Panthers are off to 3-0 starts. The division is going to be better than last year, and the Saints already are in deep trouble. If they have to go another game or two without Brees, they could be looking at a very bad record. ",
            "11": "Perhaps the brightest spot of the game for the Saints was a 74-yard punt return for a touchdown by Marcus Murphy in the third quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Texans",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "9"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: Jameis Winston has now been the far worse of the top two rookie quarterbacks in two of the three weeks thus far. When time travel becomes possible, Tampa's front office will be the first to use it. Then again, maybe the Texans will go back in time and convince everyone that Marcus Mariota will suck, allowing them to snatch him up at No. 16. </i> ",
            "2": "Earl Campbell? Arian Foster? No, it wasn't either of them grinding out yards for the Houston Texans on Sunday. It was Alfred Blue, who ran for 139 yards and a touchdown to help the Texans get their first win of the season. Blue and a strong showing by the defense were the reasons the Texans were able to control the game from start to finish. The Bucs (1-2) were able to convert only two runs into first downs and finished the day with 57 yards rushing. The Texans still have a long way to go to contend for a playoff spot, but they, at least, kept their head above water with the victory. ",
            "3": "Don't be too fooled by Houston quarterback Ryan Mallett's numbers. He completed 24-of-39 passes for 228 yards with one interception and a touchdown. Aside from a quick start, Mallett was rather ordinary. Unless you are desperate for a quarterback, Mallett should not be on your fantasy roster. ",
            "4": "Aside from Blue, the other bright spot on Houston's offense was wide receiver DeAndre Hopkins. He had eight catches for 101 yards and a touchdown. He's worthy of being an every-week starting receiver despite the matchup. ",
            "5": "Cecil Shorts looked all right in the box score with six catches for 58 yards. But don't going putting Shorts onto your fantasy roster. He's just another guy in a very ordinary offense. ",
            "6": "For Tampa Bay, rookie quarterback Jameis Winston had a mediocre day. He completed 17-of-36 passes for 261 yards with one touchdown and one interception. Winston wasn't as haunted by J.J. Watt as many expected, but he didn't make many big plays. Winston is far from being a startable fantasy quarterback. ",
            "7": "Tampa Bay wide receiver Mike Evans bounced back after being held without a catch in Week 2 and sitting out Week 1 with an injury. Evans had seven catches for 101 yards. When he is healthy, he clearly is Tampa Bay's No. 1 option in the receiving game. ",
            "8": "Running back Doug Martin continues to look sharper than he did the last two seasons. But Martin still isn't a great fantasy play. He had 46 yards on 14 carries against the Texans. Tampa Bay simply doesn't have a good offensive line, and the running game isn't going to put up big numbers. ",
            "9": "If you have Tampa Bay's Kyle Brindza as your kicker, you probably should make a change because the Bucs likely will. Brindza missed three field goals and an extra point. The Bucs went out on a limb in keeping the undrafted rookie, but that move isn't working out well. There is a very good chance the Bucs will bring in a new kicker this week. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "47"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "7"
        },
        "comments": {
            "amount": "11",
            "1": "<i> EDITOR'S NOTE: Is Bruce Arians the next Bill Belichick? He's now 25-10 against the spread as head coach of the Cardinals, and like Belichick, he's running up the score against bad teams. I guess the one difference is that Arians doesn't cheat, but then again, who knows what he has under those magical hats he wears? </i> ",
            "2": "You could have turned your television off 5:57 minutes into the game after Colin Kaepernick through his second interceptions and second touchdown to the other team. And if you are a 49ers fan, you probably did click that clicker with authority and malice! When all was said and done, the Cardinals destroyed the 49ers, 47-7. ",
            "3": "If you did keep on watching this game, you saw Kaepernick throw two more interceptions, with all four of them being his fault. Amazingly, Kaepernick hadn't thrown an interception yet this season. It was a terrible display as he completed just six passes on 19 attempts for 67 yards. He also ran seven times for 46 yards and a touchdown. There is no doubt San Francisco would have fared better if Kaepernick had only run the ball and never thrown a pass. ",
            "4": "The only other 49er to top 50 yards was Carlos Hyde, who ran 15 times for 51 yards. He looked strong on his runs, but was lucky to get 15 carries in this blowout. He'll have better games when his quarterback doesn't spot the opposition two touchdowns. ",
            "5": "After the two quick defensive scores, Carson Palmer and the Cardinals had little trouble moving the ball. Chris Johnson helped push the lead into the depleted ozone layer as he rushed for two touchdowns in the second quarter to make the score 28-zilch. Johnson ran well all game with 22 attempts for 110 yards and his two touchdowns from six yards and one yard out. He tacked on one reception for 40 yards, vaulting his total yards to 150. Andre Ellington should be back next week, but Johnson has earned playing time. This backfield will remain muddy. ",
            "6": "Coming out of halftime with a 31-7 lead, Carson Palmer finally got into the touchdown mix with a 4-yard strike to Larry Fitzgerald to make it 38-7. Palmer and Fitzgerald were connecting at will all game, and thankfully for their fantasy football investors, Bruce Arians is not one to let up on the gas, as seen by their second touchdown with five minutes left in the game, up 40-7. That kind of blood lust is what we fantasy footballers like to see! ",
            "7": "Fitzgerald hogged the bulk of the targets with 11 of Palmer's 32 attempts and nine of his 20 completions. That's almost half for Fitz. Now over the last two games, Fitzgerald has 17 receptions for 246 yards and five touchdowns. I think that's pretty good. ",
            "8": "Palmer was on target all game, but had such a large lead he didn't need to push the throttle. He did end up with 311 passing yards, two touchdowns and one interception. He's now averaging three touchdown passes and 268 yards passing a game. He did take his first sack of the year and was hurried and hit more than he has been this season. The fact Arians kept him in the game was interesting. ",
            "9": "Michael Floyd finally saw some playing time and looked to have passed John Brown again on the depth chart. On the day, Floyd caught just one of five targets for 12 yards, but also had a nice reception called back by holding. It was a mixed bag, as he also had a drop. He will cut into John Brown's targets as both ended up with five, while Fitzgerald had 11. Brown had better numbers than Floyd, as he caught three of five targets for 62 yards, but had a sure touchdown in his breadbasket that he let spill to the ground for the dogs to lap up. ",
            "10": "Tyrann Mathieu was Honey Badgering all over the place, sticking his snout where the 49ers didn't want him. He ended the day with two interceptions (one returned for a touchdown), five solo tackles and two passes defended. ",
            "11": "In the end, this one was over before it started, but if you are a fan of the Cardinals, you are feeling mighty good about your 3-0 team going into next week's home game against the St. Louis Rams, and if you are a San Francisco fan, you might not want to turn that television back on until after the 49ers finish hosting the Packers and Aaron Rodgers. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "0"
        },
        "comments": {
            "amount": "11",
            "1": "<i> EDITOR'S NOTE: I always hated John Fox in Denver because I thought he was way too conservative. He was once again up to his old tricks, punting the ball in the third quarter on fourth-and-short near midfield. I'm not saying the Bears would've pulled the upset had they converted, but it was still a close game at the time, and punting seemed to take all the air out of the team. </i> ",
            "2": "The Seahawks were desperate for a win after an 0-2 start to the season and were fortunate to have a matchup with perhaps the worst team in the NFL. Seattle's defense dominated a Bears' offense missing starting quarterback Jay Cutler and wide receiver Alshon Jeffery. It was the first time Chicago has been shutout since 2002 when the future Super Bowl Champion Buccaneers goosed Henry Burris and the Bears. The Seahawks' offense looked anemic in the first half, but came alive in the final two quarters to send the Bears to an 0-3 start. ",
            "3": "There was very little good offensive play in the first half from either team. Midway through the first quarter, the Bears tried a fake misdirection punt to one side of the field, but Richard Sherman didn't bite and followed the ball to the vacant side. He caught the punt and returned it 64 yards to the Bears' 20-yard line. That led to a field goal for Seattle. Shortly later, the Bears got screwed on a terrible review by the officials. A punt deflected off a Seattle blocker, and Chicago recovered inside the 20, but it was ruled in Seattle's favor. The defenses kept producing punts, until the Seahawks moved the ball in the 2-minute drill with passes to Jermaine Kearse and Jimmy Graham. Marshawn Lynch caught a fourth-and-1 pass to move inside the Chicago 20. Two fade pass attempts at Chicago cornerback Alan Ball came up short as Ball slapped the passes away from Graham and Rishard Matthews. A field goal closed the first half to give Seattle a 6-0 lead at the half. To open the second half, rookie speedster Tyler Lockett took the kickoff back 105 yards for a touchdown. A 21-yard run by Thomas Rawls got the Seahawks moving, and a 22-yard pass to Doug Baldwin got them to the Chicago 30. Wilson hit Graham on a crossing route, and he broke a tackle from Brock Vereen to charge into the end zone for Seattle. With a 20-0 lead, the game was essentially over. The Seahawks' offense found their groove with Rawls running for 18 yards, Kearse hauling in an 18-yarder, and Wilson running for 13 yards. That led to another Seattle field goal. A fourth-and-short pass to Graham moved the chains, and that set up a final 48-yard field goal for Steven Hauschka. ",
            "4": "Russell Wilson completed 20-of-30 passes for 235 yards with a touchdown. He also ran for 28 yards on six carries. He remains an every-week starter because of his scrambling ability. ",
            "5": "Marshawn Lynch played injured and had only 14 yards on five carries. Rawls totaled 104 yards on 16 carries. Rawls will be someone to monitor if Lynch misses time in the future. His absence in this game seemed like a precaution. ",
            "6": "Jimmy Graham had his best game as a Seahawk with seven receptions for 83 yards and a score. Hope you were able to buy him low. If so, time to sell him high! ",
            "7": "Bears quarterback Jimmy Clausen completed only 9-of-17 passes for 63 yards. He's barely worth owning in 2-QB leagues. ",
            "8": "Chicago running back Matt Forte had 74 yards on 20 carries, but ran the ball better than the numbers illustrate. Try to acquire Forte cheaply, as his fantasy owner could be very frustrated right now. ",
            "9": "It was laughable that the Bears' leading receiver was tight end Zach Miller with one catch for 21 yards. Martellus Bennett had four catches for 15 yards. Alshon Jeffery was out of the lineup. ",
            "10": "Rush linebacker Pernell McPhee was the only bright spot for Chicago. He had two sacks and seven tackles. ",
            "11": "The Seahawks' defense was tremendous as they enjoyed the return of Kam Chancellor. He had one tackle and was platooned. Bobby Wagner and K.J. Wright played well for Seattle. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Bills",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "Now, this is what the Bills should've looked like last week. Rather than screwing themselves over with penalties, the team played clean football for the most part, converting 7-of-13 third-down tries and getting flagged only five times. Buffalo dismantled Miami, and the score isn't even indicative as to how much of a blowout this was. ",
            "2": "Tyrod Taylor was nearly perfect, going 21-of-29 for 277 yards and three touchdowns to go along with 12 rushing yards on three scrambles. He opened the game on a scoring drive featuring no runs, completing all five of his attempts for 77 yards and a touchdown. Thanks to an extremely lackluster pass rush featuring an injured Cameron Wake, Taylor dropped countless perfect passes into his receivers' arms, including a perfect, 38-yard touchdown to Chris Hogan in the final frame. Taylor is a high-end backup on most teams, but he can be started against non-elite defenses. ",
            "3": "Two Buffalo players sustained injuries in this contest. LeSean McCoy rushed for just 16 yards on 11 carries, spending most of his time on a bike. Fortunately, he helped out his owners with a 10-yard receiving touchdown. Sammy Watkins' owners weren't as lucky. All Watkins was able to do was catch a 39-yard pass before leaving with a calf injury. It's unclear if either will be available for next week's game. With McCoy sidelined for portions of this game, Karlos Williams had the most carries, gaining 110 yards and a touchdown on 12 attempts. Williams showed that he can be started if McCoy ever happened to miss a game. ",
            "4": "Taylor's touchdowns were thrown to Charles Clay (5-82), Hogan (3-42) and McCoy. Clay is a borderline TE1, whose production might have been possible because of Watkins' injury. Hogan is not a fantasy option. ",
            "5": "Percy Harvin had a big game. He snared seven of the eight passes thrown his way for 66 yards. He also rushed twice for 16 yards on the ground. I wouldn't trust Harvin as a third fantasy receiver, but he wouldn't be a terrible option if Watkins couldn't make it back. ",
            "6": "Moving on to the Dolphins, it's hard to say if their offense was worse than their defense. Both aspects were inept. Miami didn't score until the third quarter and was responsible for three turnovers, all by Ryan Tannehill. Tannehill was anemic, though his numbers indicate that he wasn't that bad. Tannehill went 26-of-49 for 297 yards, two touchdowns and three interceptions, but he was just 11-of-23 for 112 yards and the three picks in the first half. Much of his yardage, including the two scores, came in garbage time. It's difficult to blame just Tannehill. His receivers didn't help him out at all. Greg Jennings opened the game with two drops, and Tannehill's first interception bounced off Jarvis Landry's hands. Meanwhile, the offensive line was brutal. Tannehill barely had any time to throw. Still, he missed on several deep throws, and the other two picks were his fault. Tannehill also missed Jordan Cameron badly for a big gain when he threw behind him, and his deep passes didn't have any sort of touch. Tannehill figures to rebound, as his team, much like the Jets, was distracted heading into London. I'd buy Tannehill low if he didn't have a tough matchup against New York coming up. ",
            "7": "I listed Rishard Matthews as a add last week, and he responded with a six-catch, 113-yard, two-touchdown output against Buffalo. Granted, most of that came in garbage time, but fantasy stats late mean as much as they do early. Meanwhile, Jarvis Landry caught eight balls for 67 yards. He led the team with 13 targets, but one of the failed conversions was the aforementioned interception. ",
            "8": "Lamar Miller didn't even get a chance to run against the Bills. He gained 38 yards on seven carries, and was given just three attempts prior to halftime. He also caught three passes for 27 receiving yards. It's inexcusable that the Dolphins disregarded him in their flawed game plan, and I expect them to fix that mistake soon. Miller can be bought cheaply from a frustrated owner right now. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "By solely listening to the reaction of the media to Peyton Manning's performance, you'd think that Manning torched his opponent and put together a brilliant performance. That is hardly the case, however. Manning made several great throws in this contest, but he still looked like a shell of his former self despite battling a defense that had been inept in the first two weeks of the season. Manning once again barely had any zip on his passes, and he looked slower and more sluggish than he has in the past. His receivers came up with some clutch receptions to bail him out, most of which came over poor Darius Slay, who struggled in this contest. Manning went 31-of-42 for 324 yards, two touchdowns and an interception that was tipped at the line of scrimmage and secured by Glover Quin. The fact that he was able to post just 24 points - and really just 17 if a late score is excluded - speaks volumes because both the Chargers and Vikings racked up a higher total versus a stop unit that sorely misses Ndamukong Suh. ",
            "2": "Demaryius Thomas had an up-and-down game. He made a great, 45-yard catch over Slay on a fourth-and-1 right before halftime to score a touchdown, and he finished with nine receptions for 92 yards and that trip to the end zone. However, he was guilty of two drops that seemed to be crucial at the time. He also lost a fumble when foolishly trying to stretch for a first down he wasn't even close to. Meanwhile, Emmanuel Sanders collected six balls for 87 yards. Like Thomas, Sanders skied over Slay for a key, deep reception. I'm not crazy about Manning right now, so both remain sell-highs. ",
            "3": "Manning's other touchdown was thrown to Owen Daniels (5-28). Even though Daniels tied with Sanders for second on the team with nine targets, he's not worth owning in most leagues because of Manning's inconsistency. Daniels is only worth rostering in touchdown-only leagues, and even there, he's just iffy. ",
            "4": "The Broncos once again failed to establish any sort of running game, which has to be disconcerting for them, given that Adrian Peterson ran all over this defense a week ago. C.J. Anderson gained just 18 yards on eight carries, while Ronnie Hillman managed only 13 yards on seven tries with a touchdown. Anderson sustained an injury in this game, but managed to return. Both backs are holds for now. There's a chance Denver's offensive line will improve, and if it does, you'll be happy to have either player. ",
            "5": "The Lions struggled to run the ball as well. Ameer Abdullah caught a receiving touchdown, but couldn't get anything on the ground, mustering only 23 yards on eight attempts. He appeared to lose a fumble at some point, but replay overturned the call. Joique Bell was much worse, picking up just six yards on 10 carries, but he was at least able to salvage a touchdown. With Bell looking sluggish, there's no real reason to own him in 12-team leagues. ",
            "6": "As for Matthew Stafford, it was the same story as usual: Several impressive throws overshadowed by costly turnovers. Stafford had three of them in this game. He was picked off twice. He telegraphed the first directly to Bradley Roby, and he didn't see the safety on the second, allowing David Bruton to come away with the interception. Stafford also lost a fumble, a play which should've been ruled an incompletion via the Tuck Rule. The officials screwed that one up. This performance wasn't all Stafford's fault. He once again didn't get good blocking from his offensive line. He took four sacks, and that number could've been much greater. Stafford barely avoided some sacks, and he even had one by Von Miller called back by a penalty. The poor blocking will continue to be an issue for the Lions for the foreseeable future, and that's why Stafford, who finished 31-of-45 for 282 yards, one touchdown and the two picks, won't be a very appealing fantasy option unless he's going up against a poor defense. Unfortunately for Stafford, he'll have to battle the Seahawks and Cardinals the next two weeks, so it won't be getting any easier for him. ",
            "7": "Calvin Johnson caught eight passes for 77 yards, as Aqib Talib did his best to limit him. One of his receptions was extremely impressive, as he twirled around and snatched a ball thrown behind him. The catch was so great that it appeared as though Talib thought he had the pass picked off. Meanwhile, Golden Tate logged five catches for 57 yards. Considering Johnson's presence and Stafford's poor blocking, Tate won't be much of a fantasy factor in the near future, but he's worth holding on to just in case Johnson gets hurt again. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Packers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "The final score may say that the Packers won by 10 points, but make no mistake - this was a blowout in every sense of the word. The Packers led by separate margins of 31-7 and 38-14. They had complete control of this game until they took their foot off the gas. Aaron Rodgers was masterful against the Chiefs, and his stat line - 24-of-35, 333 yards, five touchdowns - was indicative of how dominant he was. Rodgers spent all night dropping perfect passes into his receivers' arms. He was also in full command of what was going on, catching the Chiefs with numerous procedural penalties and taking advantage with some game-breaking throws on free plays. He engineered 69- and 89-yard touchdown drives in two of his first three possessions, and the lone exception occurred on the opening sequence when Davante Adams had the ball zip through his hands. Rodgers was hit as he threw by Justin Houston, but Kansas City's elite pass rush wasn't much of a factor for most of this game. Rodgers had only a couple of blemishes. He lost a fumble after holding on to the ball forever, but was bailed out by illegal contact. Rodgers also was nearly intercepted by a linebacker he didn't see, but the Kansas City player dropped the ball. Rodgers got away with an interception-less evening, meaning he still hasn't thrown a pick at home since Week 13 of the 2012 season. Though he's not flawless on the road, Rodgers will still be a top daily play next week against the inept 49ers. ",
            "2": "Randall Cobb had a terrific evening. He caught seven of the 12 passes thrown his way for 91 yards and three of Rodgers' five touchdowns. Cobb also appeared to have a fourth score, but that was nullified by offensive pass interference. Cobb will continue to be one of the top fantasy receivers each week as long as Rodgers is healthy. ",
            "3": "Rodgers' other touchdowns went to James Jones, who snatched seven balls for 139 yards, and Ty Montgomery (2-14). Jones will continue his resurgence as a strong fantasy receiver, while Montgomery is worth adding because Davante Adams sustained an injury on the first drive. Adams, who aggravated his ankle, could have trouble making it back for next week's game on short rest. Montgomery isn't a great choice - he was targeted only twice, after all - but there are worse options in deep leagues if you need a receiver as a bye-week filler. ",
            "4": "Eddie Lacy showed no signs of his ankle malady, running strong on his attempts. However, he was given just 10 carries, which he turned into 40 yards. He also caught three passes for 41 receiving yards. Lacy had a limited workload as a precaution. His touches figure to increase next week. Meanwhile, James Starks had 17 rushes, but turned them into only 32 yards. While Lacy ran with great power, Starks was underwhelming. He can be dropped with Lacy now healthy. ",
            "5": "Meanwhile, the Chiefs put together a poor performance offensively. Alex Smith's final numbers don't look bad, as he went 24-of-40 for 290 yards, one touchdown and an interception, but by the time the score was 31-7, Smith was just 5-of-13 for 50 yards and the pick, an underthrown heave late over the middle of the field. His YPA at the time was a hilariously low 3.85, and I thought Andy Reid might bench him. Smith was horrendous. He constantly tossed checkdowns, and the one attempt down the field was a weak ball that sailed out of bounds. Smith was so tentative to throw a deep ball that he elected to scramble on what should've been a Hail Mary attempt at the end of the first half. Smith posted quality numbers at the end of the game, but did so against a Green Bay prevent defense that took its foot off the gas. Don't be fooled by Smith's final stats. Reid definitely needs to consider benching him in favor of Chase Daniel. Granted, Smith didn't get much help from his offensive line - Green Bay dominated the trenches all night - but he is so limited that he doesn't give the Chiefs much of a chance to beat elite opponents. He was lucky to get away with a couple of other possible interceptions, so this evening could've been much worse for him. ",
            "6": "Smith's garbage-time score went to Jeremy Maclin, who hauled in eight passes for 141 yards and a touchdown. Yes, that's right, a touchdown. That was the first by a Kansas City receiver since the 2013 season. Naturally, it was meaningless in terms of the result of this game. It wasn't all rosy for Maclin, who dropped a pass and forced Reid to waste a timeout late in the fourth quarter because he was so fatigued that he needed a break. Maclin remains a hold in fantasy, but if he has another strong performance next week, you might be able to sell him high. ",
            "7": "Only two other Chiefs had more than 16 receiving yards. One was Travis Kelce, who logged six catches for 80 yards on 10 targets. The other was Jamaal Charles, who secured five grabs for 33 receiving yards to go along with 11 carries, 49 rushing yards and a whopping three touchdowns. Charles had some nice runs, but didn't have many opportunities because the Packers were up big throughout. Charles, who was at least able to atone for last Thursday's fumble-filled outing, will continue to be one of the top running back options in daily formats. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}