{
    "year": "2015",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Rams",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "23"
        },
        "comments": {
            "amount": "9",
            "1": "These teams appeared to be heading in different directions entering this game, and they're continuing to move that way. The Buccaneers had lost two of their previous three contests (to the Colts and Saints), while St. Louis had rebounded off its losing streak to beat the Lions last week, thanks to some defenders returning to the lineup. The Rams prevailed in a blowout. And yes, this wasn't close. St. Louis led 31-13 late before the Buccaneers posted some meaningless scores to make this game look a lot closer than it really was. ",
            "2": "The star of this matchup wasn't Todd Gurley or Jameis Winston. It was Case Keenum, who played the game of his life. Keenum was extremely precise on almost every throw, going 14-of-17 for 234 yards and two touchdowns. He began the contest by dinking and dunking, but he made some special passes as the evening progressed. Keenum hit Kenny Britt in stride with a 60-yard bomb in the first quarter. He later showed great touch when lofting a pass over a defender's head to Jared Cook for a 17-yard gain. He then managed to complete another deep pass by threading the needle in between two defenders. Keenum made just two errors in this contest, both of which occurred on the final drive of the opening half. He had a pass that was dropped by a Tampa defender, and then he took a horrible sack to give his team no chance on a third down. However, those were his only blemishes. It'll be interesting to see how he fares in the next couple of games. If Keenum puts together a pair of quality performances, the Rams may eschew taking a quarterback in the first round, which is what I have happening in my . ",
            "3": "As for Gurley, he had trouble finding room against a tough Tampa Bay run defense. He still performed well for his owners, however, as he generated 48 yards and a touchdown on 21 carries. He was in position for a second score following a Benny Cunningham kickoff return down to the 2-yard line, but he was stuffed on three consecutive plays. ",
            "4": "Tavon Austin had a spectacular night. He scored twice; once rushing and once receiving. He compiled 32 rushing yards (four carries) and 41 receiving yards (three catches). It actually makes me wonder why he touched the ball just seven times. ",
            "5": "St. Louis' two leading receivers were Britt (2-71, TD) and Cook (4-64). It was surprising to see both try hard. They must have been motivated because they didn't want to embarrass themselves on national TV. ",
            "6": "Moving on to the Buccaneers, Winston struggled, despite what his numbers may say. Winston went 29-of-50 for 363 yards, two touchdowns and an interception. Those stats are completely misleading, as Winston was just 6-of-12 for 49 yards at halftime. A large chunk of his yardage, as well as both scores, came in garbage time. Winston was very inaccurate throughout the evening. He sailed passes over his receivers' heads, including Doug Martin on one instance when Martin was in position to catch a simple pass in the flat. Winston also had a second dropped pick in the end zone, and he had to eat a timeout right before halftime because he spent 30 seconds yelling at several Rams players, including Aaron Donald, after what he felt was a dirty hit. ",
            "7": "Mike Evans and Austin Seferian-Jenkins benefited from Winston's junk-time stats. Evans had just three grabs for 36 yards in the first half, but he finished with nine catches for 157 yards. He dropped another pass, but he would've enjoyed a much better game had Winston not missed him on numerous occasions. Seferian-Jenkins, meanwhile made only three grabs for 29 yards, but he was able to haul in a touchdown at the very end. ",
            "8": "Doug Martin and Charlie Sims both ran extremely well. Martin burst for 91 yards on just 18 carries, while Sims (7-50) also posted an impressive stat line. It was odd to see the Rams struggle so much versus the run. However, they did manage to stuff Martin on a fourth down before halftime, and they were able to force him into a fumble. ",
            "9": "Some Rams fans were trying to chant Keep the Rams! Keep the Rams! Perhaps St. Louis would keep its team if more fans showed up. Here's a shot of the stands 20 minutes prior to kickoff last Sunday versus the Lions. Try not to laugh too hard: "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jets",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "If this game is any indication, the Jets aren't going to have much success in the playoffs - if they even get there. New York was battling a skeleton-crew Dallas team that was effectively eliminated from the playoffs when it shot its wad at Green Bay and lost last week. The Cowboys' hopes were dashed, yet they still nearly handed New York a loss. The Jets came through, notching a win versus yet another sub-.500 team, but the fact they nearly lost to the duo of Matt Cassel and Kellen Moore has to be discouraging. Ryan Fitzpatrick, as mentioned earlier, will be New York's downfall. Fitzpatrick had some shaky moments in this game. He threw a horrible interception in his own territory that allowed the Cowboys to score. He was nearly picked on a couple of other occasions and was guilty of several other ugly throws, including a horrible pass behind Eric Decker on a crucial third down. He made some gutsy plays - he even opened a giant cut above his nose, which was bleeding for most of the evening, but he's just not a good quarterback. Fitzpatrick finished 26-of-39 for 299 yards, one touchdown and the interception, which was a terrible read. To be fair, he endured some drops, including what would've been a 30-yard gain by Brandon Marshall, and he managed to set up Randy Bullock for a game-winning field goal at the very end on a long pass to Kenbrell Thompkins, who beat rookie Byron Jones. ",
            "2": "Fitzpatrick's sole aerial score went to Decker (6-55), while Brandon Marshall (4-74) led the team in receiving yardage. Both players missed some action and had to go to the locker room, but they weren't out for very long. Marshall, as mentioned, had a deep drop. Phil Simms claimed that the ball was uncatchable, yet it hit Marshall right in the hands. This, of course, was a conflict of interest, as Simms and Marshall are co-hosts on <i>Inside the NFL</i>. This was yet another example of Simms being absolutely incompetent. Another occasion was when Simms said that the Cowboys were in great hands with Brandon Weeden and Matt Cassel behind Tony Romo. Simms needs to be dismissed from the CBS broadcast because he's absolutely horrible, bland and biased. ",
            "3": "Chris Ivory disappointed his fantasy owners, as he mustered just 37 yards on 13 carries despite the fact that Eddie Lacy and James Starks trampled this Dallas defense a week ago. Ivory had a chance to score, but was stuffed on a fourth down near the goal line. Bilal Powell, meanwhile, was more impressive. He ran for 25 yards and a touchdown on just six attempts, and he also was a big part of the passing game once again, snatching seven catches for 54 receiving yards. ",
            "4": "As for the Cowboys, they benched Cassel in the second quarter after a very ugly performance. Cassel was just 3-of-8 for 37 yards and an interception that was so horrible that the officials ruled it as intentional grounding. Following a 19-yard loss on a sack, Jason Garrett made the change, moving to Kellen Moore, who was better, but only by default. Moore went 15-of-25 for 158 yards, one touchdown and three interceptions. Moore is severely limited and seemed overmatched. One of his picks was a desperation heave at the end, but Moore's other two interception were ugly. The first was a weak throw that he heaved up for grabs, while the second was telegraphed in the end zone. Moore hit some of his targets and moved the chains on occasion, but he's not an NFL-caliber quarterback. ",
            "5": "Dez Bryant didn't have a bad performance. Showing more mobility in previous weeks, Bryant caught four passes for 50 yards and a touchdown. His matchup against Darrelle Revis was hyped by NFL Network, but Revis has regressed this year. Neither played particularly well; Revis allowed other receptions to Cole Beasley (3-37) as well, while Bryant dropped what could've been a touchdown in the first quarter. ",
            "6": "Darren McFadden ran surprisingly well versus the Jets' stout run defense, gaining 100 yards on 16 carries. New York sustained some injuries to Muhammad Wilkerson and David Harris, but McFadden was moving the chains even when both players were in the lineup. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Vikings needed to win this contest to snap their two-game losing streak and assure themselves a playoff spot. Considering how close the first matchup was, the consensus opinion, at least amongst professional bettors, was that this would be a close affair. The complete opposite was the case, as the Vikings dominated both sides of the ball and won in a complete blowout. Teddy Bridgewater put together an incredible performance. He was sharp all afternoon, slicing and dicing a Chicago secondary that had overperformed all year. He converted a key first down early on a third-and-10 play with a 12-yard pass to Kyle Rudoph, and then he found Stefon Diggs in the back of the end zone to cap off the drive, as the rookie wideout torched the normally beleaguered Tracy Porter. Bridgewater continued to lead successful drives throughout this contest, converting 8-of-12 third downs. He misfired just three times, going 17-of-20 for 231 yards and five touchdowns (four passing, one rushing). There was a scary moment in which he was banged low on a dirty hit, but he turned out to be fine. ",
            "2": "Speaking of potential significant injuries, Adrian Peterson limped off the field in the second quarter. He turned out to be just fine, as he was given six attempts after intermission - a number that would've been higher had the Bears been more competitive. Peterson, unfortunately, disappointed his fantasy owners in the process, generating just 63 yards on his 18 carries. He didn't look the same after coming back. His fantasy owners watched in horror as Jerick McKinnon hauled in four passes for 76 yards and a touchdown. ",
            "3": "Diggs secured two of the other Bridgewater touchdowns, snaring three balls for 55 yards in the process. Fullback Zach Line had a fourth at the end of the game. Mike Wallace (3-37) didn't do anything outside of securing a 34-yard reception. ",
            "4": "Meanwhile, Minnesota's defense was roaring. Despite missing several key defenders - Harrison Smith, Anthony Barr, Linval Joseph - and seeing another get hurt when Xavier Rhodes limped off the field, the Vikings completely shut down Chicago's offense, limiting the Bears to 4.7 yards per play. They were all over Jay Cutler, who was sacked five times. Cutler, however, was responsible for several of those sacks. He held on to the ball too long on numerous occasions. He played very stupidly and seemed to have the same sort of lackadaisical attitude he sported all last year. This has to be very discouraging for the Bears, as it appeared as though Cutler turned a new leaf. Instead, he looked like Ryan Leaf, and its clear that he's once again a hapless, overpaid bum. Cutler finished 26-of-37 for 231 yards, two touchdowns, an interception and a pick-six. Don't be fooled, however, as some of those numbers came in garbage time. ",
            "5": "Matt Forte had a big game despite not being able to run all that much because his team trailed throughout. Still, he accumulated 104 net yards, rushing for 47 (eight carries) and catching six balls for 57. He also had a big run early on, but that was negated by a hold. Jeremy Langford (11-46) was also mixed in. ",
            "6": "Zach Miller tied Forte for the lead in receiving yardage, catching six passes in the process. Alshon Jeffery didn't perform as well. He managed to catch a touchdown on his only reception, as he left early with a hamstring injury. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "The only way the Ravens could've handed this game on a silver platter more blatantly to the Chiefs is if they actually had one of their coaches run to the other sideline with a silver platter and offered it to Andy Reid. Baltimore gave itself no chance to win this contest, as all three of Kansas City's first-half touchdowns came on crucial errors. The first came on the opening drive when Timmy Jernigan was guilty of unnecessary roughness when Baltimore forced Kansas City into a punt. The Chiefs' drive stayed alive, and they eventually scored. After that, Buck Allen's lost fumble was returned 73 yards by Tyvon Branch for six. At the end of the first quarter, John Harbaugh inexplicably called for a fake punt from his own 17-yard line. The punter came up a bit short, setting the Chiefs up with a short field. Just like that, the Chiefs were up 21-3, and they barely did anything offensively. It was completely absurd, and it continued in the second half. The Ravens had a chance for a back-door cover, as Jimmy Clausen impressively drove them into the red zone. Unfortunately, a receiver fell down, and Clausen was pick-sixed as a consequence. ",
            "2": "Alex Smith completed 21 of his 25 passes, but accumulated just 171 yards and a touchdown. Smith dinked and dunked the entire afternoon, though he did engineer a drive that lasted 8:41 in the second half that just seemed to drain the energy out of the stadium. ",
            "3": "Just one of Smith's completions sailed longer than 13 yards. That was to Travis Kelce, who snatched six balls for 73 yards. Jeremy Maclin (7-50) reeled in Smith's lone touchdown. ",
            "4": "Spencer Ware was available to play, but Andy Reid didn't want to use him unless there was an emergency. West handled the majority of the workload as a consequence, generating 76 yards and a touchdown on 16 carries, with most of his yardage coming on his 38-yard score. ",
            "5": "Moving quickly through Baltimore's numbers, Clausen went 26-of-45 for 281 yards, two touchdowns and a pair of interceptions. Clausen's highlight was launching a 48-yard Hail Mary right before halftime that hilariously landed way short of the end zone. It looked like a terrific punt. The Chiefs seemed surprised by this, allowing Aiken to catch the ball and score. Clausen didn't perform poorly or anything; on the contrary, he was better than expected. His two picks came late in desperation time, and he did a decent job of moving the chains. Unfortunately, the team's aforementioned mistakes proved to be too costly. ",
            "6": "Speaking of which, Buck Allen didn't get a single carry after halftime, thanks to his early fumble. He gained 18 yards on four carries, and he watched Terrance West (7-35) handle the majority of the workload following intermission. ",
            "7": "Aiken played great, catching eight passes for 128 yards and a touchdown, including the Hail Mary. Six of Aiken's receptions came in the first half, so this was not a case of him accumulating garbage yardage. Aiken is legit and appears as though he can be a decent No. 2 receiver. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "25"
        },
        "comments": {
            "amount": "7",
            "1": "The narrative for the Redskins entering this week was that they couldn't win consecutive games all year. They obviously had to in order to help secure a wild-card spot, and they managed to do so, improving to .500 in the process. I'll give them credit, but the Bills made things incredibly easy with their numerous blunders and lethargic play. One obvious example occurred in the first half. The Redskins were up 7-0 and in the red zone, but were faced with a third-and-goal on the 13-yard line. It appeared as though the Bills were going to force Washington into a field goal, but Kirk Cousins was able to run into the end zone on a designed run. The Buffalo players seemingly had no interest in tackling him; it was an appalling lack of effort, and it set the tone for the rest of the game - at least until it was out of reach. The Redskins ultimately established a 28-3 lead, but the Bills made it seem closer than it really was when the Redskins took their foot off the gas. ",
            "2": "Cousins played brilliantly, misfiring on just six attempts. He went 22-of-28 for 319 yards and five touchdowns (four passing, one rushing). Again, Buffalo didn't offer much resistance with its poor tackling and blown coverages, but Cousins deserves tons of credit regardless. He's been so much better than most people expected him to be. ",
            "3": "Both Jordan Reed and DeSean Jackson pleased their fantasy owners in their semi-final matchups. Reed caught two touchdowns, securing all seven of his targets for 84 yards. Jackson, meanwhile, registered six catches for a whopping 153 yards and a touchdown, which was a 77-yard bomb. Jackson definitely pushed off on the play, but no flag was thrown. Pierre Garcon (3-34) had the fourth aerial score. ",
            "4": "More Washington running back frustration: Matt Jones handled the majority of the workload last week, but Alfred Morris had more touches in this contest. Morris garnered 84 yards on 14 carries, while Matt Jones (10-28) appeared as though he was stuck in mud. ",
            "5": "As for Buffalo's running backs, LeSean McCoy left the game with an injury. His knee was twisted after he took a hit, and he grabbed it in agony. He left the contest and wasn't seen again, leaving his fantasy owners extremely disappointed. McCoy managed just 29 yards on 10 carries to go along with just one catch for eight yards. He came close to scoring on one drive, but was stuffed on three consecutive plays. Adding salt to the wound, Mike Gillislee, replacing McCoy, scored on a 60-yard burst after the injury occurred. Gillislee gained 81 yards and a touchdown on four attempts. ",
            "6": "Tyrod Taylor, meanwhile, posted solid numbers: 16-of-27 for 235 yards and two touchdowns to go along with nine scrambles for 79 rushing yards. However, those aerial numbers are misleading; he was just 3-of-8 for 27 yards in the opening half. He didn't get much help from an offensive line that was completely overmatched, but he still made some crucial errors. For instance, he overshot a wide-open Sammy Watkins downfield for what would've been an early touchdown. Taylor had numerous overthrows, and some miserable play-calling didn't help. I can't imagine how frustrated Buffalo fans were when E.J. Manuel ran a dumb Wildcat play in the third quarter, which was followed by a useless field goal that turned a 21-0 deficit into a 21-3 score. ",
            "7": "Despite Taylor's misses, Watkins still had a big stat line, logging five catches for 111 yards and two touchdowns. All of this came in garbage time, as Watkins caught only one pass in the opening half. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "This was a pretty nondescript game. The Patriots won easily, but weren't challenged very much by one of the worst teams in football. The Titans, meanwhile, didn't get much of a look at Marcus Mariota, who hurt his knee in the first half and permanently left the field. It was a boring contest, though I suppose that the main take-away is that New England covered the spread in another game in which Walt Coleman has officiated. The Patriots have covered every single Coleman game in the past 10 years. Seriously. ",
            "2": "Tom Brady, who was battling some sort of mysterious sickness during the week, played just fine, going 23-of-35 for 267 yards and two touchdowns. Brady was surprisingly ineffective in the second half of this contest, completing just nine of his 16 passes after the break. The Titans put some pressure on him, which wasn't much of a surprise. New England's offensive line is very leaky, while Tennessee sports a pretty stout pass rush. Brady spent most of the afternoon dinking and dunking to avoid pressure. Save for Rob Gronkowski, Brady threw the ball most to James White, who snared seven of his eight targets for 71 receiving yards and a touchdown. Gronkowski, meanwhile, caught five balls for 54 yards and a touchdown. ",
            "3": "Brandon LaFell was the Patriot who paced the team in receiving yardage, hauling in four balls for 88 yards. However, he saw just five targets. Danny Amendola, meanwhile, was a major disappointment. He caught only one pass for three yards, and he also fumbled a punt return. He left the game early with a knee injury. Likewise, linebacker Dont'a Hightower left early with a knee issue, aggravating his previous injury. He'll be a big loss if he can't make it back to the lineup in the near future. ",
            "4": "Many expected Brandon Bolden to handle the majority of the workload, with Matthew Berry even touting him as a value running back play in DFS. I was more skeptical, as I've been fooled by Bill Belichick's confusing running back rotations far too many times. Sure enough, Bolden was second on the team in carries, trailing some guy named Joey Iosefa, who gained 51 yards on 14 carries. Bolden accumulated 36 yards on 10 tries. There's nothing exciting here, as Iosefa is just some big fullback, who could easily vanish into oblivion next week. You simply cannot trust Belichick when it comes to fantasy running backs. ",
            "5": "As for the Titans, Mariota didn't get to do much, going just 3-of-6 for 32 yards and a strip-six on a lost fumble that completely fooled the CBS camera man. Zach Mettenberger stepped in and actually handled himself relatively well. He went 20-of-28 for 242 yards, two touchdowns and a pair of interceptions. One pick came in desperation time, while the second was underthrown. ",
            "6": "Mettenberger showed a great rapport with Dorial Green-Beckham. The athletic rookie stood out again, catching six balls for 113 yards. However, Delanie Walker (2-64) caught the two touchdowns. One of the scores featured some of the worst tackling you'll ever see, which was surprising from a Bill Belichick defense. ",
            "7": "Tennessee struggled to run the ball once again, with Antonio Andrews mustering only 45 yards on 14 carries. Andrews is a big back, but he sucks in short yardage. He was stuffed on a fourth-and-1 on the New England 38 during the opening half. Andrews showed terrible patience and didn't bother looking for the hole, which was there. I think I'm going to slot Derrick Henry to the Titans in the second round of my next week. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Texans",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> My reaction to learning who T.J. Yates' backup quarterback happened to be in this game. Oh my God, their backup is Brandon Weeden... hahahahaha! Looks like the Weed Man got the last laugh. ",
            "2": "Realistically, the winner of this game is probably going to be hosting a playoff game as the victor of the AFC South. The Texans were 0-13 all-time in Indianapolis and picked a perfect time to break that streak. Houston's defense held the Colts to 190 total yards, zero points after halftime and two late turnovers to lead the Texans to a win over their biggest rival. It wasn't pretty, as the Texans went down to third-string quarterback Brandon Weeden, but Houston got just enough out of its offense to take control of the AFC South. ",
            "3": "The Texans moved the ball on their opening two possessions, but the first ended with a Vontae Davis interception and the second was killed by an Alfred Blue fumble, courtesy of Mike Adams. Matt Hasselbeck took advantage of the short field and moved the ball before threading a needle between defenders to Donte Moncrief for an 11-yard touchdown. A holding call and sack from Kendall Langford quickly got the ball back for Indianapolis with a nice punt return to the Texans' 35-yard line. An 18-yard pass to Andre Johnson moved the ball to the 17-yard line. That produced a chip-shot field goal for the Colts and a 10-0 lead. Houston's offense finally did something positive with a 41-yard run from Blue, but Bill O'Brien made a very questionable decision to have Nick Novak attempt a 57-yard field goal that wasn't even close. Before the half, Texans quarterback T.J. Yates moved the ball into Colts' territory, but went down with a knee injury that ended his day. Weeden finished the drive with a few completions to get inside the 5-yard line before having to settle for a field goal. The Colts took a 10-3 lead into the locker room. In the third quarter, Bernardrick McKinney sacked Hasselbeck at the 1-yard line on a third down, and that set up the Texans to start a drive at the Colts' 32-yard line. Penalties on Houston's inept tight ends killed some nice plays, and Houston settled for a 47-yard field goal from Novak. After going 25 straight drives without a touchdown, the Texans started at their 11-yard line, and Weeden moved down the field with passes to Hopkins. Houston converted a fourth-and-1 with Blue, and had a pass interference on Dwight Lowery move the ball to inside the 20-yard line. To end the drive, Weeden hit Jaelen Strong on the run for an 8-yard touchdown and a 13-10 Houston lead. After trading punts, the Colts got the ball back at midfield with three minutes remaining. Hasselbeck completed a pass to Griff Whalen, but Johnathan Joseph knocked the ball loose and Kareem Jackson returned the fumble 34 yards to Indianapolis' 21-yard line. That set up a short field goal for Novak to give the Texans a 16-10 lead. The next play from scrimmage saw Hasselbeck throw a ball up for grabs down the middle of the field, and A.J. Bouye ran underneath it for a game-clinching interception. ",
            "4": "Hasselbeck completed 17-of-30 for 147 yards with a touchdown and interception. Moncrief led the Colts in receiving with five receptions for 51 yards and a score. Johnson (3-52 and T.Y. Hilton (3-29) were held in check by Joseph, Jackson and Kevin Johnson. ",
            "5": "Frank Gore ran for 44 yards on 16 carries. He battled a tough defense, but appears to be worn down. ",
            "6": "DeAndre Hopkins had eight receptions for 94 yards to lead Houston's receivers. ",
            "7": "Yates was 6-for-10 for 68 yards with an interception before his knee injury that could be serious. Weeden was 11-of-18 for 105 yards with a touchdown. ",
            "8": "Blue had 20 carries for 107 yards for the Texans. As mentioned, he lost a fumble. ",
            "9": "The Texans' defense had a group effort with strong play from their edge rushers and secondary. The Colts got a good game from Mike Adams, Robert Mathis, Kendall Langford and Robert Mathis. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> I still can't believe the Jaguars were favored over a competent opponent. And I can't believe that Dick Stockton is calling games. Hearing Dante Freeman over and over again was just sad. Stockton used to be great, but he's just lost it, which is a shame. ",
            "2": "The Atlanta Falcons finally won a football game. They snapped a six-game losing streak, but it wasn't easy. The Falcons nearly blew a big first-half lead before kicking two fourth-quarter field goals. The win puts the Falcons at 7-7 and keeps their faint playoff hopes alive. But the win probably was too little too late. The loss puts the Jaguars at 5-9 and likely puts an end to any shot at the postseason. ",
            "3": "Even with the win, I'm wondering if Atlanta general manager Thomas Dimitroff is on the hot seat. Falcons owner Arthur Blank isn't known for his patience, and it's likely someone will have to take the fall for this season's collapse after a fast start. I'm still surprised Dimitroff was retained for this season. I thought he was a package deal with former coach Mike Smith. Dimitroff got off to a wonderful start in Atlanta by taking quarterback Matt Ryan, left tackle Sam Baker and middle linebacker Curtis Lofton in his first draft and signing free-agent running back Michael Turner at the start of his tenure. But Dimitroff has had his share of misses in more recent drafts (Peria Jerry) and free-agency signings (Ray Edwards). With Scott Pioli waiting in the wings, it might be time to hold Dimitroff accountable for his mistakes. ",
            "4": "The big fantasy story for Atlanta was that wide receiver Julio Jones scored his first touchdown since Week 8. Jones finished with nine catches for 118 yards. ",
            "5": "Ryan had a mediocre fantasy day. Ryan completed 22-of-35 passes for 246 yards with one touchdown and one interception. ",
            "6": "Atlanta running back Devonta Freeman, who was a must-start in fantasy early in the year, struggled to gain yards against the Jaguars. Freeman had only 56 yards on 25 carries, but did score a touchdown. ",
            "7": "Atlanta wide receiver Roddy White remains a player you should stay away from in fantasy leagues. White produced three catches for 47 yards. He clearly is past his prime and has become an afterthought in the Atlanta offense. ",
            "8": "For the Jaguars, quarterback Blake Bortles also had a mediocre fantasy day. Bortles completed 23-of-38 passes for 297 yards with one touchdown and one interception. ",
            "9": "Jacksonville receiver Allen Robinson remains a player who should be starting on your fantasy team. Robinson had only three catches for 57 yards, but one of those receptions went for a touchdown. Robinson leads the league with 13 touchdown catches. ",
            "10": "With top running back T.J. Yeldon sitting out with an injury, the Jaguars weren't able to do much on the ground. Bortles led Jacksonville with 44 yards on six carries. Yeldon's replacement, Denard Robinson, was held to 28 yards on 14 carries, though he did help out his fantasy owners with eight catches for 46 receiving yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "35"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> I had a write-up for this when the Giants trailed 35-7. It was quite the rant. Here it was: Odell Beckham Jr., arguably the best receiver in football, dropped multiple passes, including a long touchdown on the opening drive. Dominique Rodgers-Cromartie, a terrific corner, dropped a pick-six. Rashad Jennings, who had just TWO fumbles in his career entering this game, coughed up the ball at midfield, setting up the Panthers with a quick touchdown. How do you handicap something like this? It's ridiculous. The Giants had a chance to take complete control of this matchup, but they killed themselves with horrific mistakes, costing me my Pick of the Month in the process. The amount of bad luck I've had with my selections this year has been utterly appalling, and I don't know what to say anymore. After the comeback, I have just two words: holy balls. ",
            "2": "The Carolina Panthers remained perfect - barely. The 14-0 Panthers squandered a 35-7 third-quarter lead as the Giants made a furious comeback to tie the game late in the fourth quarter. But Carolina quarterback Cam Newton led a late drive to set up a game-winning field goal by Graham Gano. That was embarrassing the way we let those guys come back, Newton said. But Newton and the Panthers still came away with the win. Newton continued his campaign for the Most Valuable Player award with a huge day in fantasy and reality. Newton completed 25-of-45 passes for 340 yards and five touchdowns. He also was a big factor on the ground, running eight times for 100 yards. With games remaining against the Atlanta Falcons and Tampa Bay Buccaneers, the Panthers have a chance to become only the third team in modern history to finish a regular season undefeated. For the Giants, their playoff hopes took a major hit. The Giants fell to 6-8 and are a game behind in the race for the NFC East championship. ",
            "3": "Beyond the Panthers staying unbeaten, the other big story of the day was the matchup between New York wide receiver Odell Beckham Jr. and Carolina cornerback Josh Norman. There was plenty of pushing, shoving and jawing between the two throughout the game. Beckham repeatedly lost his composure, getting flagged for three personal fouls. Norman had the upper hand in the matchup for most of the day. Beckham didn't have a catch until the third quarter. He did finish with six catches for 76 yards and a touchdown, but Norman had the upper hand in this matchup. Beckham also dropped what would have been an easy touchdown pass in the first quarter. ",
            "4": "Carolina cornerback Charles Tillman forced the 44th fumble of his career late in the second quarter. That set up a touchdown pass from Newton to tight end Greg Olsen. ",
            "5": "For the Panthers, Newton clearly had the biggest game from a fantasy perspective. But he wasn't the only Carolina player to deliver big fantasy numbers. Wide receiver Ted Ginn Jr. had his third straight game with two touchdown catches. If Ginn isn't in your fantasy lineup, he should be. ",
            "6": "With running back Jonathan Stewart sitting due injury, the Panthers didn't have a true feature back. Newton made up for a lot of that. Rookie Cameron Artis-Payne got the most work of Carolina's running backs with 14 carries for 59 yards. Artis-Payne might be a good pickup for your fantasy team over the next two weeks because the Panthers are likely to take a conservative approach with Stewart. ",
            "7": "Olsen remains a guy you should be using in DFS each week. He had six catches for 79 yards and a touchdown. ",
            "8": "Carolina rookie wide receiver Devin Funchess is worth a late-season pickup in fantasy. Funchess is getting more playing time, and he produced a touchdown catch. ",
            "9": "For the Giants, quarterback Eli Manning was the fantasy star of the day. Manning completed 29-of-46 passes for 245 yards with four touchdowns and one interception. But Carolina's defense shut down Manning for much of the first half. ",
            "10": "New York's Rashad Jennings remains a running back worth considering starting on your fantasy team now that Tom Coughlin has gotten comfortable with his running back rotation. Jennings finished with 107 yards and a touchdown on 16 carries. However, he did have a costly fumble in the second quarter. Shane Vereen caught eight passes for 43 receiving yards and a touchdown. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> I don't get how the officials/coaches/players/football gambling gods allowed the Seahawks to cover with a front-door field goal at the very end. It seemed like the Browns were going to lose by 14, beating the 15-point line, but Cleveland dropped a Russell Wilson interception and then the Seahawks kicked the ball to cover. And just like that, the books got slaughtered on this game, which had close to 80-percent action. ",
            "2": "A hot team entering the playoffs is more important than having home-field advantage. While the Seahawks probably won't have the luxury of the 12th man helping them out, they have a red-hot quarterback-to-receiver combination with Russell Wilson and Doug Baldwin, while the defense is still tough to beat. Seattle cruised over Cleveland to keep building momentum for another January run, and this win over the hapless Browns clinched a playoff berth for the Seahawks. ",
            "3": "The Browns had an impressive opening drive to take a 7-0 lead. They mixed up some good runs and passes before Manziel scrambled and then threw a dart to Gary Barnidge for a score. Seattle answered by moving the ball down the field with some tough runs. A pass interference by Cleveland in the end zone put the Seahawks on the goal line. On third-and-goal, Wilson lofted in a pass to Doug Baldwin for a touchdown. After a quick three-and-out for Cleveland, Wilson kept moving the ball using his legs, and Christine Michael ran well for Seattle. Baldwin then caught his second touchdown from six yards out. Cleveland came back with a screen to Duke Johnson for 22 yards that set up a field goal for the Browns. The Seahawks responded with two field goal drives to take a 20-10 lead into the half. In the third quarter, Manziel made some nice throws to Barnidge to move the chains across midfield but the drive stalled. After trading some punts, Wilson struck again with a 27-yard touchdown pass to Tyler Lockett. Johnson soon moved the ball for the Browns with a 39-yard run. That led to a Cleveland field goal. The Seahawks responded with three more points, and the defense slammed the door on Cleveland. After a Michael Bennett sack, Manziel was picked off by Marcus Burley, and the Seahawks ran out the clock. ",
            "4": "Russell Wilson was 21-of-30 for 249 yards with three touchdowns. He also ran for 46 yards on five carries. Wilson was excellent against Cleveland with accurate passing and good decision-making. ",
            "5": "Doug Baldwin had four catches for 45 yards and two touchdowns. Jermaine Kearse (7-110) and Tyler Lockett (5-55-1) also played well for Seattle. ",
            "6": "Christine Michael led the Seahawks' rushing attack with 84 yards on 12 carries. ",
            "7": "Johnny Manziel was 19-of-161 yards with a touchdown and an interception. He had some nice plays and some duds, but Cleveland's offense doesn't have the talent to really challenge a defense like Seattle's. ",
            "8": "Duke Johnson had four carries for 46 yards with five receptions for 39 yards. He continues to flash serious play-making ability, but doesn't get a lot of touches. ",
            "9": "Cleveland tight end Gary Barnidge logged 29 yards on three catches with a score. The leading Browns wide receiver was Travis Benjamin with only three catches for 26 yards. ",
            "10": "The Seahawks' defense got a impressive games from Michael Bennett, Brandon Mebane, K.J. Wright and Richard Sherman. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "27"
        },
        "comments": {
            "amount": "13",
            "1": "<i> EDITOR'S NOTE: </i> I'd say I don't understand how a seven-point underdog blows the cover after being up 27-10, but I just watched the Giants come back from down 35-7. No lead is safe anymore. ",
            "2": "Both teams came into this game needing a win. The Broncos were fighting to stay atop their division and keep the playoff seeding that comes with that, while the Steelers needed a win to just keep in the hunt for a playoff berth. ",
            "3": "The first half was not kind to the Steelers' poor pass defense, as Brock Osweiler picked their secondary apart, completing 14-of-18 passes for 214 yards passing, three touchdown passes and another one on a 7-yard rushing touchdown. It was a dominant half, with the Broncos converting eight third-down opportunities. ",
            "4": "Former Steelers wide receiver Emmanuel Sanders must have gotten plenty of satisfaction as he scorched his old team on a 61-yard touchdown in the first quarter, and piled up yardage and receptions to finish the day with 10 receptions on 16 targets for 181 yards and that early touchdown. ",
            "5": "The other Broncos receiver to eviscerate the Steelers secondary in the first half was Demaryius Thomas, who caught two touchdowns from Osweiler, to help his team out to an imposing 27-13 lead at halftime. That lead was made even more imposing by a Denver defense, who were swarming Ben Roethlisberger early and often. ",
            "6": "The Steelers did keep within striking distance as they probed the Broncos' defense, with their final two drives of the half looking good, but both ended with field goals by Chris Boswell. Those two drives were full of Antonio Brown dog-walking Chris Harris around the field and foreshadowed what would happen in the second half. ",
            "7": "Coming into this game, the Broncos had allowed 115 completions on 204 wide receiver targets for 1,316 yards and two touchdowns to wide receivers. That's in 13 games, so entire opposing wide receiver groups had averaged barely over 100 yards receiving, and you can barely see the number that happens after you divide two by 13. That is some dominance. But then Mr. Antonio Brown walked onto the field. The second half was the Antonio Brown show, as he took his initial dominance of Chris Harris to a new level. Brown was consistently open and open quickly. Roethlisberger pelted him with targets, and after a third-quarter touchdown to get the Steelers within seven points, Brown finished the scoring with a beautiful pass from Roethlisberger for the receiver's second touchdown of the game, to make it 34-27. ",
            "8": "That's right, the Broncos didn't score a single point in the second half, as Pittsburgh's pass rush started getting to Osweiler, causing him to hurry his throws. He threw one interception, but had two others bounce off Steelers defensive backs' hands. But Demaryius Thomas and Vernon Davis, who both had costly drops for the second straight game, didn't help Osweiler. ",
            "9": "The end of this game was a nail-biter, as Roethlisberger threw an inexplicable interception in clock-killing mode, but the Steelers' defense, as they had done all second half, tightened up and stopped the Denver offense. Then, on third down, when the Steelers needed a first down to ice the game, whom did they go to? You are correct; Mr. Brown. Brown ended up catching 16-of-18 targets for 189 yards and two touchdowns, which is par for the course for him this year, but still unexpected against the Broncos' No. 1 defense. ",
            "10": "Roethlisberger completed 40-of-55 passes for 380 yards, three touchdowns and two interceptions. The Broncos hadn't allowed 300 yards passing all season and had allowed three touchdowns just once, to Tom Brady. Roethlisberger now has 836 combined yards against the top two defenses in the league, Seattle and Denver. ",
            "11": "Pittsburgh's wide receivers today caught 32-of-43 targets for 338 yards and three touchdowns. Remember that stat earlier? The amazing one where the Broncos had allowed just 115 completions on 204 wide receiver targets for 1,316 yards and two touchdowns through 13 games? Good, because that's an amazing discrepancy. ",
            "12": "So, the Steelers' win gets them in the wild card over the New York Jets for the time being. Pittsburgh will have to finish the season on the road, with games at Baltimore and Cleveland. Both are extremely winnable games, but both are division rivals on the road. ",
            "13": "The Broncos are slipping down the playoff rankings quickly. If they were to lose their last two games, against Cincinnati and San Diego, they easily could fall out of the playoffs completely. If Denver wins one of two, the team will look good for a wildcard spot after Kansas City jumps into the AFC West lead. It the Broncos win both, they hold onto the AFC West and would have a good chance of beating out the Bengals for the No. 2 seed. That's a wide range of outcomes, and with Brock Osweiler looking good early and then leading his team to zero points in the second half of the last three games, it could go any which way. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "14"
        },
        "comments": {
            "amount": "8",
            "1": "What an absolutely pathetic showing by the Dolphins. I'd like to lead this recap off with the Chargers putting forth a strong performance in their final game ever in San Diego, but Miami just made it too easy. They put absolutely no effort into this game, missing numerous tackles, allowing receivers to be open all afternoon, and giving up on third-and-long opportunities. As for the Chargers, you can look at this game from a glass-half-full, or glass-half-empty mentality. For the former, the Chargers prevailed in their final San Diego game ever, and Mike McCoy even let the three mainstays - Philip Rivers, Malcom Floyd and Antonio Gates - exit early to a standing ovation from a crowd that was comprised of a 50-50 mix of Chargers and Dolphins fans. It was a nice moment. If you're looking at this glass-half-empty, the Chargers' insistance on focusing on the past may have cost them greatly in the future. By winning, they lost out on the opportunity to draft Laremy Tunsil, the top left tackle in this upcoming class. Considering San Diego's glaring holes on the front, the team desperately needed Tunsil, but now it appears as though the Titans will secure him, which is what I have happening in my . ",
            "2": "Philip Rivers had an easy time delivering the ball to his open wideouts. He misfired just 10 times, going 26-of-36 for 311 yards, three touchdowns and two interceptions. Rivers had a few poor throws. He was nearly picked in the end zone and underthrew an open Floyd for a score. One of Rivers' interceptions was heaved into triple coverage. Reshad Jones secured the ball and ran back to where Rivers threw it from. Jones then fumbled, and Rivers inexplicably recovered the ball. ",
            "3": "Antonio Gates led the team in receiving with six catches for 88 yards. Dontrelle Inman (3-78) also was a positive contributor. Floyd caught just one pass for 27 yards, but as mentioned, he should've scored a touchdown. ",
            "4": "All three of Rivers' touchdowns were thrown to Danny Woodhead, who secured all six of his targets for 50 receiving yards. Woodhead also scored on a fourth occasion on the ground, as he and Donald Brown (12 carries, 90 yards!) split the workload in the wake of Melvin Richardson, erm, Melvin Gordon's injury. Gordon plodded for 41 yards on 15 carries before exiting with a knee injury. It wasn't surprising at all to see the duo of Brown and Woodhead be more effective than Gordon. If McCoy knew what he happened to be doing, he would've benched Gordon long ago. ",
            "5": "Meanwhile, the Dolphins could barely do anything on offense because of offensive line issues. Right tackle Ja'Wuan James was already out, and the team lost Branden Albert to a knee injury in the first half. Center Mike Pouncey was later carted off. With the team's three best blockers gone, Ryan Tannehill had absolutely no chance. Tannehill finished 20-of-34 for 216 yards, but most of that came in garbage time, as he was just 8-of-14 for 74 yards at halftime. Tannehill has struggled this year, but this game wasn't his fault. Most quarterbacks would struggle without their top three offensive linemen. ",
            "6": "Jarvis Landry racked up a bunch of receptions in the second half, though his most-significant catch came early when he broke O.J. McDuffie's single-season catch record. Landry finished with eight grabs for 54 yards. ",
            "7": "If Miami fans want a silver lining, it's that rookie DeVante Parker had a solid performance, catching four passes for 87 yards. He and Landry were the only Dolphins who had more than two receptions. ",
            "8": "Lamar Miller may have won Scrub of the Week honors, mustering only 12 yards on nine carries. He left the game in the second quarter with a quad injury. His fantasy owners watched in complete misery as Jay Ajayi (6-27) scored a late touchdown. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Packers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Packers may have won 30-20, but they still don't look quite right. They struggled to move the chains throughout the entire afternoon, as they were outgained 225-97 in the first half, averaging a pathetic 3.1 yards per play. Green Bay ultimately got into some sort of rhythm, engineering a 92-yard drive at some point. However, the Packers stalled despite having a first-and-goal on that possession, and then Rodgers followed that up with a horrible interception deep in Oakland territory when he just had to run out the clock. It wasn't from the most reliable source, but I've heard that Rodgers has a slight tear in his shoulder, which would explain why he hasn't played all that well. Rodgers had a truly miserable performance by his old standards, and I'm sure he cost some fantasy players a semi-final. He went just 22-of-39 for 204 yards, one touchdown and the aforementioned interception. ",
            "2": "Rodgers' sole aerial score went to James Jones, who was the only Packer who accumulated more than 40 receiving yards. Jones snatched six passes for 82 yards and the touchdown, which was on a miscommunication. However, he was guilty of some poor plays as well. He was whistled for offensive pass interference twice, and both penalties were pretty blatant. ",
            "3": "Elsewhere in the passing attack, Randall Cobb disappointed once again, catching five passes for 40 yards, though he did draw a deep pass interference. Davante Adams (5-32) made an appearance after being benched last week, while Richard Rodgers (1 catch, 7 yards), hurt his team with a bad drop. ",
            "4": "Like last week, James Starks broke free for a big gain at the end of the game, but fumbled early. He picked up 51 yards on nine carries, outgaining Eddie Lacy by a wide margin. Lacy looked slow and sluggish once again, mustering only 23 yards on 11 tries. ",
            "5": "There's good news and bad news relating to Green Bay's offensive line. The good news is that after two first-quarter sacks, Rodgers wasn't brought down once. Khalil Mack was completely silent following an early sack. The bad news is that left tackle David Bakhtiari went down with a knee injury. He was listed as questionable to return, so perhaps it's not that serious. ",
            "6": "The Packers were able to win this game by double digits because of Derek Carr. The second-year quarterback was an absolute wreck early on, throwing two interceptions that led to touchdowns. The first, off his back foot late over the middle, was brought back to the Oakland 18-yard line. The second was an actual pick-six in which Carr stared down his receiver. Carr got better after that, throwing some impressive downfield strikes in the pouring rain. However, he still made some errors. For instance, he missed a wide-open Clive Walford in the third quarter, and at the very end, he passed underneath for a 1-yard gain on a fourth-and-4 that ended the game. It was a pass you'd see Blaine Gabbert routinely throw. Carr failed to complete half of his passes, finishing 23-of-47 for 276 yards, two touchdowns and the pair of early interceptions. He was hurt by some drops, including one from Seth Roberts in the end zone, but he was very pedestrian overall. He could use some of last year's excellent coaching to get himself right, but the Raiders foolishly moved on from one of the top offensive coordinators in the NFL amid a coaching change. ",
            "7": "Despite some drops, Amari Cooper had a great game, catching six balls for 120 yards and two touchdowns. Michael Crabtree (6-70) also performed well. He missed a bit of action while being evaluated for a concussion, but he was cleared to resume action. ",
            "8": "Latavius Murray ran pretty well, gaining 78 yards on 21 carries. There were a couple of occasions in which Murray made some great moves to turn a big negative run into a small positive gain. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "24"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "All eyes were on A.J. McCarron, as he was making his first start in relief of an injured Andy Dalton. McCarron made some nice passes in this game, including a 37-yard rainbow to A.J. Green in the opening quarter. McCarron also found Marvin Jones fora 47-yard gain later on. McCarron settled for stuff mostly underneath otherwise, but managed to complete most of his passes, going 15-of-21 for 192 yards and a touchdown. We didn't get to see much from him, as Cincinnati's defense put the clamps on the San Francisco offense. As a consequence, McCarron didn't really have to do anything besides manage the game. ",
            "2": "Unfortunately for Green's owners, his 37-yard reception was his sole catch of the afternoon. He left early after aggravating his back on a McCarron misfire in the end zone. Jones (4-89) was the only Bengal who had more receiving yards. Tyler Kroft (3-31) did his best Tyler Eifert impersonation, catching a touchdown. ",
            "3": "Jeremy Hill certainly didn't run well, mustering only 31 yards on 19 carries. However, he scored twice on a pair of plunges from the goal line. Giovani Bernard (14-33) had the early work, but that didn't last long. He was stuffed on an early fourth-and-1 right outside the red zone. ",
            "4": "There's not much else to say about the Cincinnati scoring unit, but I don't think I have anything positive on the 49ers' offense. They were absolutely dreadful in every facet. Blaine Gabbert had another dreadful performance. He went 30-of-50 for 295 yards, one touchdown and three interceptions, and it's worth noting that most of his yards came in the second half; he tallied 75 by halftime. Gabbert spent the majority of this contest dinking and dunking, repeatedly throwing short on third downs once again. Gabbert, however, can't be blamed for two of his interceptions. Both clanked off the hands of Vance McDonald, who caught just one of his four targets for 10 yards. It was a very disappointing showing, as McDonald had shown some promise earlier. ",
            "5": "Anquan Boldin led the team with eight catches for 74 yards and a touchdown, but ended up costing his team with a fumble in the red zone when the game was still in doubt. Torrey Smith (2-33) sucked again. ",
            "6": "Shaun Draughn gained 38 yards on nine carries. All of this occurred in the first half, as Draughn left early with a knee injury. Kendall Gaskins stepped in and did most of his work in the passing game, catching six balls for 52 yards. He carried twice, but didn't gain anything. ",
            "7": "Jim Tomsula's coaching blunders need to be acknowledged. First of all, some of the players didn't appear to be focused. The receivers were guilty of being offside on multiple occasions. I'll repeat - the RECEIVERS, as in offensive players - were flagged for multiple offside penalties. Tomsula also had one of the most ridiculous challenges ever. It was so bad that color analyst Solomon Wilcots made fun of him. Tomsula predictably lost, making him now 0-of-6 on replay reviews. At the end of the third quarter, the 49ers scored a touchdown after they trailed 24-0. Simple arithmetic says a team needs three eights to tie, hence going for two thrice would be the right move. Tomsula, unaware of how math works, ordered his team to kick the extra point. It was yet another derp moment in a derp season by the 49ers. Meanwhile, ownership is already scheming on how to keep Tomsula around for another year because he's a company man. It's amazing how quickly the once-proud 49ers organization has disintegrated into the worst franchise in the NFL. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "This was a very scary game for the Cardinals. They managed to achieve their 12th victory of the year, claiming the NFC West in the process, but it nearly came at a steep price. Carson Palmer, upstart running back David Johnson and Tyrann Mathieu all missed time in this contest with what appeared to be serious injuries at first glance. Johnson was the first to get hurt. He left the field early right before halftime, but he was on the field to begin the third quarter. Palmer then banged his hand on Connor Barwin. His finger was dislocated, but the training staff was able to pop it into place, allowing Palmer to re-take the field after being out for several plays. Mathieu sustained an injury after an interception late in regulation, but he walked off under his own power. His status, however, is still up in the air. I don't understand why Mathieu was even on the field when the score was 40-17 with just two minutes remaining. I appreciate Arizona going hard at the end of the year to maintain momentum, but pressing the gas pedal too hard can definitely backfire. ",
            "2": "Outside of the injuries, Johnson is certainly the lead story. The rookie supplanted an injured and ineffective Chris Johnson and has proven to be an incredible replacement. David Johnson gained 187 yards and three touchdowns on 29 carries to go along with four catches for 42 receiving yards, and those numbers don't even tell the entire story. Johnson broke numerous tackles, as the Eagles had major problems tackling him. He was so great on one of his touchdown runs that Cris Collinsworth exclaimed, That's worth of Beast Mode! Johnson is also terrific as a pass-catcher in the receiving game. It's remarkable that he's such a complete back this early in his career, and beyond his tackle-breaking ability, his patience is incredible. ",
            "3": "Carson Palmer went 20-of-32 for 274 yards and a touchdown. The only reason he didn't post sterling fantasy numbers is because Johnson hogged all the scores. Palmer nearly had a deep touchdown early, but John Brown dropped the long score. ",
            "4": "Speaking of Brown, he let two deep balls fall through his hands, spoiling what could've been an amazing evening. Brown still managed to post solid fantasy numbers, catching three balls for 38 yards and a touchdown. ",
            "5": "Elsewhere, Michael Floyd led the team in receiving, securing five receptions for 70 yards, including an amazing diving catch where he landed at the 1-yard line. Larry Fitzgerald (3-43) didn't blow anyone away with his stats, but blocked well and drew a pass-interference flag. ",
            "6": "The Cardinals weren't the only team that seemed to sustain an injury to a significant player. Sam Bradford took a big hit and was down on the turf for a while. Mark Sanchez took the field for a bit, but Bradford was able to reenter the game to a standing ovation, as the crowd knew that it didn't have a chance with Sanchez under center. Bradford made some nice throws throughout the evening, but came up short in the second half, as he simply was too overmatched to compete in a shootout with Arizona's explosive offense. Bradford went 28-of-41 for 361 yards, two touchdowns and a pair of interceptions at the end. The first was a pick-six, which happened to be a miscommunication with Ryan Mathews. The second was a horribly underthrown pass, which Mathieu picked off, but the game was well in hand by then. ",
            "7": "Three other Eagles got hurt in this contest. Byron Maxwell and Eric Rowe both left in the opening half. Maxwell thoroughly embarrassed himself on a couple of occasions. He was beaten badly on one play, and then tight end Darren Fells took him on a ride for about 15 yards. Zach Ertz was also knocked out. He was having a great game, catching eight passes for 78 yards and a touchdown, but had to leave with an injury. ",
            "8": "Jordan Matthews was Philadelphia's top offensive player. Matthews opened the game with a great diving catch and later ran into the end zone on a long touchdown because of a broken coverage. Matthews secured eight balls for 159 yards and a score. ",
            "9": "Chip Kelly is going to face more scrutiny for his running back usage. Ryan Mathews was the primary back, which was a good decision on Kelly's part. Mathews picked up 58 yards on 11 carries. However, Mathews was stuffed on a crucial fourth-and-1 at the end of the second quarter when this game was 17-10. DeMarco Murray is Philadelphia's best short-yardage back, so his absence was highly inexplicable. Murray actually vanished, seeing just two touches. Those were both carries, which he turned into three yards. Kelly's mismanagement once again ended up costing him. Murray would've had a better chance to convert the play, and the Eagles could've sent this game into intermission with a 17-17 tie. Instead, Kelly proved once again to be an incompetent ego maniac. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Lions",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "27"
        },
        "comments": {
            "amount": "9",
            "1": "It appeared as though the Lions were going to choke another game away. They led 28-3 in the third quarter and had complete control of this contest. The Saints roared back, bringing the deficit to 28-20, but unlike the Green Bay contest, they managed to hold on to their huge lead. Granted, this game was far less important because the playoffs are no longer an option, but it was nice to see some growth from Detroit. ",
            "2": "Matthew Stafford had a terrific game, as he misfired on just three occasions. He went 22-of-25 for 254 yards and three touchdowns. The fact that Stafford did this without a healthy Calvin Johnson, who was hobbling around the field, was quite impressive. The only thing Stafford did wrong was hold on to the ball too long on a couple of occasions, taking some sacks in the process, but he was great otherwise. Thanks to a massive lead, Stafford had to throw the ball just 12 times after intermission; otherwise, he would've had a monstrous fantasy outing. ",
            "3": "Two of Stafford's aerial scores went to Golden Tate, who snatched all six of his targets for 45 yards. He also sprung some key blocks on other receptions. The other touchdown was tossed to fullback Michael Burton. ",
            "4": "Johnson, as mentioned, was limping around. He didn't look anywhere near 100 percent, and his numbers suffered as a consequence. He caught just one pass for 19 yards, murdering anyone who started him in a fantasy semi-final. ",
            "5": "Eric Ebron actually led the Lions in receiving, snatching four balls for 79 yards. He also just missed out on a touchdown, getting tackled at the 1-yard line in the fourth quarter. Though Ebron played well, he should've had a better game, given how poor the Saints have been versus tight ends all year. ",
            "6": "The Lions posted great rushing numbers, thanks to some big gains by their backs. Ameer Abdullah (9-77) lost yet another fumble, while Joique Bell (8-71) saved his day with a 36-yard burst at the very end. Both scored touchdowns. Theo Riddick, meanwhile, had a dirty juke on Dannell Ellerbe on a 21-yard reception. Ellerbe, by the way, was absolutely awful. ",
            "7": "Megatron wasn't the only future Hall of Famer limping around in this game. Drew Brees sustained some sort of non-contact leg injury when throwing the ball in the second quarter, and he struggled to move around afterward. He was actually better statistically with the injury, but only because the Lions were in prevent as a result of holding a huge lead. Brees was just 13-of-21 for 110 yards in the opening half, yet he went 21-of-31 for 231 yards and three touchdowns following the break. Brees finished 34-of-52 for 341 yards and three scores overall. He endured numerous drops early, including two by C.J. Spiller, who left the game briefly with concussion-like symptoms. Brees was also robbed of a touchdown at the end of the first half on a ridiculous sequence in which three scores were wiped out by penalties or replay reviews. Brandin Cooks appeared to find the end zone first, but was ruled down at the 1-yard line. Tim Hightower then scored, but an illegal formation eliminated that. Marques Colston managed to find the end zone as time expired, but an ineligible player downfield saw that the Saints would go into the break with just an earlier field goal. ",
            "8": "Both Cooks (10-124) and Colston (2-39) managed to secure touchdowns in the second half to appease their fantasy owners. Ben Watson (6-49) hauled in the third score, but he had a bad drop. Willie Snead (10-76) put together a decent performance, save for an early drop. ",
            "9": "Hightower owners, meanwhile, weren't as fortunate. He rushed for 54 yards on 13 carries. He also chipped in with three catches for 31 receiving yards. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}