{
    "year": "2015",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "The Colts gave Throwback Thursday a new meaning in this particular game. Matt Hasselbeck was dropping dimes, Andre Johnson was scoring touchdowns, Frank Gore was showing great burst on his runs, and Adam Vinatieri was perfect on his field goals. Are we sure that this is still 2015, or did we travel back in time to 2006? There was major concern with Hasselbeck entering this contest. Andrew Luck was the one with the shoulder injury, but Hasselbeck spent time in a hospital on Tuesday morning with flu-like symptoms. A report by Stacy Dales prior to kickoff seemed to indicate that Hasselbeck may not make it through the entire game. Despite this, however, Hasselbeck was terrific. He fired sharp, accurate passes to his receivers and lofted some perfect throws to his targets for significant gains. A beautiful ball to Andre Johnson for 24 yards set up a touchdown, while a 43-yard bomb to T.Y. Hilton sealed the game at the very end. Hasselbeck finished 18-of-29 for 213 yards and two touchdowns amid zero turnovers despite not practicing at all this week. His numbers could've been even better, but he suffered through a couple of drops. Houston's anemic defense had something to do with it, of course, but Hasselbeck played extremely well. He tearfully told Tracy Wolfson after the game that he had nothing left. ",
            "2": "While Hasselbeck was great, the big story was Andre Johnson. The veteran receiver, making his return to Houston, had looked completely done through three games. He was targeted heavily, but could do nothing with those opportunities. It seemed like he would ultimately get phased out of the offense completely, but this resurgence came out of nowhere. Johnson reeled in six of the seven balls thrown to him for 77 yards and two touchdowns, including a big pick-up on fourth down. None of this was fluky; Johnson dominated, which has to be very promising for the Colts (and fantasy owners) going forward. ",
            "3": "The third veteran I mentioned earlier, Gore ripped through Houston's defense, which once again had major issues versus the run. He nearly hit the century mark, going 98 yards and a touchdown on just 22 carries. He had some big lanes to run through, as the Colts did a good job neutralizing J.J. Watt. What they did was double team and chip Watt often. The other Texans should've stepped up, but it never happened. ",
            "4": "Other Colts worth noting are T.Y. Hilton and Donte Moncrief. Both dropped passes, but Hilton made up for it with five grabs for 88 yards, including the aforementioned 43-yarder at the end to seal the victory. Moncrief, on the other hand, never did much; his only catch went for three yards. His drop was costly, as it occurred on third down. ",
            "5": "Indianapolis' veterans were the story for the Colts. The Texans, meanwhile, were all about the quarterback controversy. Ryan Mallett wasn't terrible to open the game, but he took a crushing blow early in the second quarter. Brian Hoyer stepped in and completed a couple of passes. Mallett, meanwhile, was cleared to play, but Bill O'Brien decided to keep Hoyer on the field. Mallett looked stunned at first, and then angry, and then upset. He slammed his helmet on the ground, then shook his head furiously, then had this look of utter disgust, even as the Texans were having success. And to top it off, Mallett ran into the locker room before the first half was over. As my picks podcast co-host Matvei texted, He gets the Jay Cutler Award for sportsmanship. Mallett wasn't done. He spent the entire second half looking miserable. The camera panned to him pouting on multiple occasions. Luck, meanwhile, was jumping up and down and high-fiving everyone. That's the difference between a great and an awful teammate. Then again, Luck is actually a professional quarterback. Mallett, who is likely to be permanently benched, barring injury, doesn't have much of an NFL future. ",
            "6": "Hoyer did well overall. He went 24-of-31 for 312 yards, two touchdowns and an interception. He made numerous great throws, and at one point, he completed 11 consecutive passes. He actually gave the Texans some life. Unfortunately, he made two terrible mistakes late in the fourth quarter. His first was overthrowing DeAndre Hopkins for a potential touchdown, while the second was an atrocious interception that he hurled while getting hit. It wasn't a fourth down, so Hoyer easily could have thrown it away. The camera caught O'Brien shouting, Why did you do that!? right after the pick was made. As for Mallett's actual performance on the field, he was uncharacteristically accurate early on, though he did miss a throw. He went 7-of-10 for 50 yards and a pick, which was only partly his fault. The ball bounced off Arian Foster's hands, but Mallett should've put more touch on the ball. Mallett's play isn't why he'll be benched going forward; it's his horrible attitude and sportsmanship. How can a quarterback lead a team when he's actually visibly upset that his own team is winning? ",
            "7": "Speaking of Foster, he had a very mixed game. He looked good early on, but was partly to blame for an early pick. He then took some negative plays. For example, he reversed field and was swallowed up for a loss of four. Foster then appeared to be concussed, but somehow snuck onto the field. The coaching staff finally noticed and took his helmet away. Foster was eventually cleared in the third quarter, but by then, the Colts were way ahead. Foster managed just 41 yards on 19 carries, as rookie nose tackle David Parry did a surprisingly good job of clogging the run. Foster was more effective as a pass-catcher, hauling in nine balls for 77 receiving yards. ",
            "8": "Hopkins had a huge evening. He snatched 11 passes for 169 yards. He also could've scored a touchdown, but Hoyer overthrew him. He's a stud, and it's amazing that he's posting these massive numbers despite his mediocre quarterbacking. ",
            "9": "You may notice that Jaelen Strong scored twice. Pay no attention to that from a fantasy perspective. Those were Strong's only two receptions of the game, and one came on a fluky Hail Mary at the end of the first half. There was no one within 10 yards of Strong on the second score, thanks to a blown coverage. ",
            "10": "The Texans appeared to be coached poorly in this game. They were extremely sloppy and were guilty of horrible penalties. There was a roughing-the-passer infraction on third-and-22, though that was a shaky call. Hopkins was whistled for taunting at one point. The worst sequence came on one drive when Houston was flagged for a face mask, a defensive hold that negated an interception, and one of the most obvious pass interferences you'll ever see. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bears",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Chiefs needed a victory in this game to avoid a 1-4 hole. Not only did they fail to win, they suffered a loss much greater than anything found in the standings. That, of course, was Jamaal Charles, who suffered a non-contact knee injury on a red-zone run in the third quarter. Charles looked like he was enjoying a solid afternoon with 58 yards on 12 carries to go along with a 26-yard reception when his knee buckled on him. It doesn't look good for Charles, who could be out for the year with what Kansas City fears is a torn ACL. If so, it's a shame; Charles is a high-character guy who was nearing the middle of what appeared to be a great season. Without him, Kansas City can't possibly climb out of its 1-4 hole. We actually saw a preview of life without Charles in this contest. Kansas City could barely move the chains following Charles' injury. The team scored zero points on every drive following the one in which Charles left. The Chiefs had a field goal blocked, but they had major problems picking up first downs without their best player, and understandably so. The worst part is that Kansas City was so challenged versus one of the worst defenses in the NFL. Charles' replacement, some guy named Charcandrick West, managed 31 yards on seven attempts. The numbers weren't bad, but he offers no game-breaking ability like Charles did. While I would pick him up in fantasy, I wouldn't rush to do so. ",
            "2": "It also hurt the Chiefs that Alex Smith continues to dink and dunk. Even against Chicago's poor defense, Smith seldom looked beyond the sticks. It was pathetic, and Andy Reid needs to think about making the switch to Chase Daniel. Smith went 16-of-30 for 181 yards and a touchdown, and he pretty much has no hope of rebounding without Charles. Smith was at his worst at the end of the first half. He took 20 seconds to get to the line of scrimmage while in scoring territory, and then he took a sack to get knocked out of field-goal range. I don't know which was worse; his horrible clock management, or his lack of awareness in terms of recognizing where he was on the field. Sadly, this wasn't the first time a Smith sack nullified a field-goal try, and it seems as though Reid will never figure out how to score prior to the end of each half. He should have hired a 16-year-old Madden player long ago. ",
            "3": "Thanks to Smith's limitations, only one player had more than 35 receiving yards. Jeremy Maclin (8-85) led the way despite two brutal drops, while Travis Kelce (3-35) was next. Kelce didn't catch a single pass in the second half for some reason. ",
            "4": "Kansas City's defense faded along with its offense in the second half. The team limited the Bears to just 107 net yards in the opening two quarters, but surrendered 221 net yards following intermission. The Chiefs forced Cutler into a strip-sack in the end zone and then stuffed Matt Forte for a loss on short-yardage carry, but melted down toward the end. Making matters worse, Chicago didn't even have Alshon Jeffery or Eddie Royal. Cutler finished 26-of-45 for 252 yards and two touchdowns, both of which occurred in the fourth quarter. Cutler allowed a score himself when he was strip-sacked in the end zone and then got away with some possible interceptions, but for the second-consecutive week, he engineered a game-winning drive despite missing his top wideout. ",
            "5": "Cutler's scores went to Marquess Wilson (6-85) and Matt Forte (5-38). Wilson led the team in receiving, but was actually second on the team in targets. Martellus Bennett led the team in that category, snatching four balls for 32 yards. Unfortunately, he dropped some passes. As for Wilson, he's not worth owning unless Jeffery and Royal miss another game. He's a low-priority pick-up as a consequence. ",
            "6": "Forte had the aforementioned receiving stats on top of his rushing numbers, which were 71 yards on 18 attempts. Forte had just seven carries in the second half because his team was behind by two scores most of the time. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "The Ravens quickly went up 14-3 in this game. It appeared as though they were going to run away with a blowout victory. The Browns were settling for field goals, while Baltimore's offense was basically doing anything it wanted to. The Ravens, in the past, would have closed the door on lowly Cleveland, but the defense is no longer the same. In fact, it's one of the worst stop units in the NFL, and yet the injuries keep piling up. Baltimore was already without Terrell Suggs, while Jimmy Smith has clearly been hobbled. The team also lost Elvis Dumervil, Lardarius Webb and Will Davis in this contest. As a consequence, Josh McCown's 457-yard performance happened. I don't want to take much away from McCown's victory, as he put together a very impressive comeback. However, he did this versus a skeleton-crew defense that was already surrendering 350-yard performances to the Derek Carrs of the NFL. McCown began poorly; he was very fortunate to have an interception overturned because of a roughing-the-passer penalty that had nothing to do with the throw. He then took a bad sack in the red zone, and he stood at just 165 yards by intermission. Throwing on the Ravens was so much easier for McCown in the second half because of all of those injuries. He consequently finished 36-of-51 for 457 yards and two touchdowns. He put together a great game, as he didn't turn the ball over a single time, and he had just seven incompletions in the second half and overtime. The Browns should still be starting Johnny Manziel, just to see what they have in him, but McCown is definitely the superior player. ",
            "2": "Gary Barnidge had the catch of the game. It's almost pointless to describe it because I'm sure most of you have seen it already, but he somehow caught the ball when it landed in between his legs as he was falling down. He then rolled into the end zone for an inexplicable touchdown. Barnidge is quickly becoming a star; this is the third-consecutive huge outing he's enjoyed. Barnidge finished with eight grabs for 139 yards and that score. Barnidge is owned in just 37 percent of ESPN leagues, so if he's available in yours, pick him up. ",
            "3": "McCown completed multiple passes to six players. Barnidge was the leader in receiving yardage, while Travis Benjamin (6-83) was second. Benjamin saw 12 targets go his way, so once again, he has become more than just a situational deep threat, which is what he was earlier in the year. The other four players of the six were Taylor Gabriel (4-75), Duke Johnson, Andrew Hawkins (7-49) and Isaiah Crowell (2-38). ",
            "4": "As for Johnson, he touched the ball on the first two plays of the game, as it was apparent that the Browns wanted to feature him more. Johnson and Crowell had the same amount of touches. The former managed just 22 yards on nine carries to go along with six grabs for 55 receiving yards. Crowell, meanwhile, gained 49 yards on the ground (13 attempts) and also snatched two balls for 38 receiving yards and a score. ",
            "5": "While McCown thrived after intermission, Joe Flacco was abysmal. He was just 6-of-15 for 72 yards following the break. He also took a horrible, 14-yard sack on one play. It's hard to blame Flacco, as his receivers couldn't get open, but then again, he was battling one of the worst defenses in the NFL. Flacco's final passing numbers were 19-of-35 for 210 yards and a touchdown. He bailed out those who started him in fantasy with two rushing scores. ",
            "6": "With Steve Smith out, Flacco's top target was Kamar Aiken, who snagged only four of the nine balls thrown to him for 78 yards. The next player Flacco passed to most was his fullback, so that shows you what sort of afternoon it was for him. Kyle Juszczyk caught three passes for 31 receiving yards and a touchdown. ",
            "7": "Justin Forsett had a strong afternoon, at least until suffering an injury late. He rushed for 121 yards and a touchdown on just 21 carries while also reeling in four balls for 49 receiving yards. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Packers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "The streak is over. Aaron Rodgers had gone nearly three years without throwing an interception at home, but his initial pick came in the first half when a pass of his was tipped at the line of scrimmage and snatched in mid-air by a diving James Laurinaitis. Rodgers' next streak? Just six passes. Trumaine Johnson had the next pick, a lazy pass toward the sideline, though there was some question about whether it hit the ground. The play stood as called, and it wasn't Rodgers' final turnover of the afternoon. He didn't fire another interception, but he was strip-sacked after the Rams missed one of their field goals. Rodgers finished 19-of-30 for 241 yards, two touchdowns and the two picks. Rodgers hit two big plays in this contest - a 65-yard score to James Jones that was initially ruled down at the 1-yard line prior to replay review changing it, and a 31-yard touchdown strike to Ty Montgomery on the opening offensive drive - but was otherwise very mediocre. A big part of the problem was that Rodgers dealt with a ton of pressure. The Rams' ferocious defensive line hounded him, and it didn't help that guard T.J. Lang was carted into the locker room. This is the second straight week that Rodgers has been rushed heavily, so this has to be a concern for the team going forward. ",
            "2": "Jones and Montgomery, who had the two scores, led the team in receiving yardage. The former caught two balls for 77 yards, while Montgomery snared four balls for 59 yards. If you want to own Montgomery, that's fine, but keep in mind that he was fourth on the team in targets despite his output. He saw just five balls go his way, and if you take away the 31-yard score, his final numbers would've been three receptions for 28 yards. I'm not going to add him to my fantasy roster. ",
            "3": "Randall Cobb and Richard Rodgers both had more targets than Montgomery, but neither did much in terms of final numbers. Cobb caught just three passes for 23 yards, while Richard Rodgers had six receptions for 45 yards, but was guilty of a couple of poor penalties, including one that nullified a field goal. He also dropped a possible touchdown. ",
            "4": "Green Bay's leading rusher? Not Eddie Lacy. Not James Starks. Not John Kuhn either. It was Aaron Rodgers, who had to scramble eight times because of pressure. He gained 39 yards on the ground. Lacy, meanwhile, barely mustered more than two yards per carry. He managed only 27 yards on 13 tries. I wouldn't panic yet if you own him in fantasy. He's still averaging 4.1 YPC on the year. ",
            "5": "Given the Packers' offensive struggles, if the Rams had any sort of decent quarterbacking and kicking, they may have won this game. It's a shame for Todd Gurley, who once again showed everyone why one team told us that he's the next Jim Brown. Gurley ripped through a stout Green Bay run defense, gaining 159 yards on 30 carries. He's such an amazing player that the Rams were still feeding the ball to him despite being down two scores with less than six minutes remaining in regulation. He was the team's best chance of scoring, after all. That's partly because Foles was atrocious. The final numbers don't even tell the whole tale even though he went 11-of-30 for 141 yards, one touchdown and four interceptions. Believe it or not, those numbers were enhanced by garbage-time yardage, with a Stedman Bailey 68-yard grab coming because of Quinten Rollins' poor coverage (though Rollins later redeemed himself with a pick). Take that away, and Foles was just 10-of-29 for only 73 yards and all of those interceptions. That's a YPA of just 2.5! Brodie Croyle even scoffs at YPAs like that. Foles was abysmal. He opened the game by taking a sack to take his team out of field goal range. His first interception wasn't his fault because Gurley fell down. However, Foles was then responsible for a delay-of-game infraction immediately following Rodgers' first turnover, and then was pick-sixed amid heavy pressure. Jeff Fisher showed such little faith in Foles that he opted to run a draw on a third-and-8 on the Green Bay 42-yard line with about 40 seconds and a timeout remaining in the opening half. Foles was also brutal following intermission. In fact, the best pass play St. Louis had outside of the garbage-time completion to Bailey was on a fake punt. ",
            "6": "I'd commend the special teams, but Greg Zuerlein whiffed on three field goals. Granted, they were all from beyond 50, with one even coming from 63, but someone nicknamed The Leg needs to hit at least one of those. It was telling, by the way that Fisher called for a 63-yard field goal down 11 on a fourth-and-7. He knew Foles couldn't pick it up. ",
            "7": "Thanks to that late catch, Bailey led the Rams in receiving with three grabs for 73 yards. Tavon Austin scored, but caught only two passes for six yards. Kenny Britt failed to reel in any of his four targets. He dropped a pass early in the game and missed a bit of action with an injury. He sucks. ",
            "8": "Speaking of players who suck, Jared Cook needs to be mentioned. He's one of the least-efficient players in the NFL; he caught just one of six passes thrown to him for only eight yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "39"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "It's hard to believe that this game was 10-10 right after halftime. Make no mistake, though. The Eagles dominated this contest the entire way. They led the net-yardage battle, 300-130 at intermission, with New Orleans securing just eight first downs compared to Philadelphia's 16. The problem the Eagles had was that they couldn't get out of their own way with errors in the red zone. Sam Bradford was mostly guilty of those, though he was hurt by some drops. The Eagles went for it on fourth down on the opening drive, but a Bradford lollipop throw to Riley Cooper fell incomplete. He then heaved an interception on an underthrown attempt in the end zone to Cooper, and followed that up with another pick on a pass way behind Miles Austin in the red zone. Bradford was nearly intercepted again on a pass to Zach Ertz. However, the Eagles, in an attempt to save their season, played a clean second half versus an incompetent New Orleans defense. Bradford finished with great numbers, going 32-of-45 for 333 yards, two touchdowns and the two interceptions. He's an obvious sell-high, as the Saints were discombobulated throughout the second half. A prime example of this was when Sean Payton and Rob Ryan wasted a timeout because the stop unit couldn't line up properly in the red zone. Despite this, the Eagles scored a touchdown on the very next play following the irrelevant stoppage. The Saints surrendered 519 yet yards of offense. It continues to be perplexing as to why Ryan wasn't fired in the offseason. He has no answers, and he and Payton still aren't getting along. ",
            "2": "Philadelphia actually ran the ball effectively for the first time. The hapless Saints made that happen, surrendering 83 yards and a touchdown on 20 carries to the previously struggling DeMarco Murray. He was still guilty of going east-west too much because of poor blocking on some occasions, and Ryan Mathews once again looked better. Mathews nearly had the same rushing total (73) and a touchdown on only eight attempts. Both backs chipped in as pass-catchers. Murray logged seven receptions for 37 yards, while Mathews snagged all three of his targets for 23 yards. ",
            "3": "Bradford's touchdowns went to Josh Huff (4-78), who scored when two Saints collided with each other, and Brent Celek (3-44). It wasn't a surprise to see both Celek and Zach Ertz (5-60) have strong afternoons, given how much New Orleans has struggled versus tight ends this year. ",
            "4": "As for Bradford's primary receivers, both Jordan Matthews (5-44) and Nelson Agholor (1-5) disappointed their fantasy owners. To no surprise, Matthews dropped a pass, which would've been a touchdown if it weren't for a penalty. As for Agholor, I keep saying that he doesn't belong on fantasy rosters, yet he's owned in 45 percent of leagues. I don't get it. He's not an efficient player, and Bradford isn't good enough to compensate for that. ",
            "5": "Meanwhile, the Saints' offense struggled immensely, as Drew Brees did not play well. The stats may say otherwise - Brees finished 26-of-43, 335 yards, two touchdowns and an interception - but by the time the Saints were trailing 26-10, he was just 14-of-26 for 187 yards and a score. He also had two lost fumbles before he piled up garbage-time yardage. ",
            "6": "Part of the problem for Brees is that he just doesn't have anyone to throw to. His top receiver, in terms of targets, has been Willie Snead, who caught six passes for 141 yards. Snead is a solid route-runner, but Brees is missing the sort of dominant play-maker he's enjoyed in the past. That was supposed to be Brandin Cooks, who had five grabs for 107 yards and a touchdown, but he didn't do anything in meaningful action. ",
            "7": "The Saints ran the ball well, but didn't get a chance to keep their rushing attack going because of the deficit. Both Mark Ingram (12-57) and Khiry Robinson (5-30) averaged more than four yards per carry. ",
            "8": "C.J. Spiller, meanwhile, predictably did nothing. He had six touches for a grand total of two yards. If it wasn't for his fluky touchdown in overtime last week, this wouldn't be considered a disappointment, but just a continuation of a trend. I hope you didn't listen to the ESPN people who advised everyone to trade for him. Spiller has always been an overrated player, so it's not surprising to see him struggle. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "31"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: Why were professional bettors taking the Jaguars? I don't get it. Matvei said it best: Jaguars - forever No. 32 in the power rankings. ",
            "2": "Something had to give when the Jacksonville Jaguars met the Tampa Bay Buccaneers at Raymond James Stadium. Both teams entered the game with unflattering streaks. The Bucs had lost 11-straight home games, while the Jaguars had lost 11-straight road games. Led by another big day from running back Doug Martin and an efficient game from rookie quarterback Jameis Winston, the Bucs won at home for the first time since December of 2013. A victory against Jacksonville might not seem like a big deal, but snapping the home losing streak was important for the Bucs. The victory marked the first time coach Lovie Smith has won a home game. Smith has his share of detractors, but the win (as the Bucs head into a bye week) should silence the doubters for a while. ",
            "3": "Martin's 2-year slump appears to be over. He's running the way he did as a rookie in 2012. Martin had his second-straight 100-yard rushing game. He finished with 123 yards on 24 carries and had three catches for 35 yards. Martin had two rushing touchdowns and one receiving touchdown. The most impressive part might have been that Martin was running behind a make-shift offensive line. Center Evan Smith and left guard Logan Mankins missed the game because of injuries. But replacements Joe Hawley and Kevin Pamphile played well. Martin has turned himself back into a solid fantasy starter the last two weeks. ",
            "4": "If you're worried about backup Charles Sims cutting into Martin's touches, don't. The Bucs are committed to Martin as their feature back. Sims got 12 carries for 51 yards. But he's being used as a change-of-pace back, often playing on passing downs. Sims had four catches for 85 yards, including a crucial 56-yard gain. ",
            "5": "Winston bounced back nicely after a five-turnover game last week. He didn't have a turnover and had the most efficient day of his young career. Winston completed 13-of-19 passes for 209 yards and a touchdown and had a 122.5 passer rating. Those aren't big numbers, but this is the kind of football the Bucs want to play. They want Winston to be a steady game manager. That's exactly what he was against the Jaguars. ",
            "6": "Jacksonville's defense did a nice job of shutting down wide receivers Mike Evans and Vincent Jackson. Evans logged three catches for 41 yards and Jackson had one catch for 14 yards. When the running game is working like it did Sunday, Evans and Jackson aren't great fantasy plays because they won't get many targets. ",
            "7": "Tampa Bay's pass defense had some problems, but the run defense was stellar. Jacksonville's T.J. Yeldon was held to 32 yards on 11 carries. The Jaguars totaled only 55 rushing yards. ",
            "8": "Tampa Bay's pass rush had its best game of the season. The Bucs had six sacks. Defensive tackle Gerald McCoy led the way with 1.5 sacks. ",
            "9": "Despite the pass rush, Jacksonville quarterback Blake Bortles had a big statistical day. Bortles completed 23-of-33 passes for 303 yards with four touchdowns and one interception. ",
            "10": "Jacksonville receivers Allen Robinson and Allen Hurns took advantage of a struggling Tampa Bay secondary. Robinson had seven catches for 72 yards with two touchdowns. Hurns had five catches for 116 yards and one touchdown. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "19"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: Atlanta not covering is the only thing saving Vegas from having a historically bad day. The books were lucky that Julio Jones couldn't do anything as a result of his bum hamstring, but they still lost money because the teaser came through. I'll have more on this later, but the books are having such a bad year that some of the squarer shops may have to either take out huge loans or close down. ",
            "2": "The Redskins spent much of the day targeting Atlanta cornerback Robert Alford because they didn't want to mess with Desmond Trufant on the other side. That plan ended up biting the Redskins when it mattered most. Alford intercepted a Kirk Cousins pass on the first drive of overtime and returned it for a game-winning touchdown. The pass was intended for Ryan Grant, who slipped on the play. The win wasn't particularly impressive for the Falcons, but it pushed their record to 5-0. The Falcons are 5-0 for only the second time in franchise history. They started 8-0 in 2012. However, this victory wasn't easy for Atlanta. The Falcons trailed for much of the game as quarterback Matt Ryan uncharacteristically struggled at home for much of the day. But Ryan got hot at the end to put the Falcons ahead with less than a minute left in regulation. The Redskins (2-3) forced overtime when Dustin Hopkins hit a 52-yard field goal as time expired. ",
            "3": "Ryan threw two horrible interceptions earlier in the game and wasn't as accurate as usual. He completed 24-of-42 passes for 254 yards with no touchdowns on a day when Washington did a good job of keeping Julio Jones and Roddy White quiet. ",
            "4": "Jones, who played like a Most Valuable Player candidate for the first three games, had his second-straight quiet week. Jones, hindered by his bum hamstring, logged five catches for 67 yards. But Jones did score when he dived on a fumble in the end zone. White had two catches for 23 yards, and it's become obvious he no longer is a good fantasy option. ",
            "5": "The Falcons do have another player who has become a fantasy stud. That's running back Devonta Freeman. He had a huge game for the third-straight week. Freeman gained 153 yards on 27 carries with one touchdown. He also collected seven receptions for 44 yards. If you were worried about the return of a healthy Tevin Coleman cutting into Freeman's carries, stop. Coleman only got two carries for three yards. ",
            "6": "With the Redskins devoting so much attention to the wide receivers, Atlanta tight end Jacob Tamme had a big day. Tamme had eight catches for 94 yards. But Tamme isn't going to be targeted that much every week. ",
            "7": "For Washington, the fantasy statistics weren't very good. Cousins was intercepted twice and completed 21-of-32 passes for 219 yards with one touchdown. ",
            "8": "Running backs Matt Jones and Alfred Morris weren't able to do much of anything against the Falcons. Jones had 20 yards on 11 rushes, but did score a touchdown. Morris was held to 15 yards on eight carries. Both need the other one to get injured to receive a boost in fantasy. Until then, it's hard to start either. ",
            "9": "Rookie Jamison Crowder was Cousins' favorite receiver. He had eight catches for 87 yards. The Falcons did a good job on Pierre Garcon, limiting him to three catches for 51 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bills",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: This was another game that burned the books. They foolishly dropped this number, allowing it to middle. Those who bet the Titans +3, +2.5, etc. won, and those who took the Bills +1 prevailed as well. ",
            "2": "The Titans have made a habit of outplaying their opponent only to have some critical breakdowns in the fourth quarter that lead to a loss for Tennessee. That was the case again as the legs of Tyrod Taylor got Buffalo a road win and improved the Bills to 3-2 under Rex Ryan. ",
            "3": "Coming off a bye, the Titans had a horrendous start when Bishop Sankey fumbled the opening kickoff to the Bills inside the 5-yard line, but the NFL's most-penalized team struck again when Marcus Easley was offsides to force the Bills to re-kick. Late in the first quarter, Marcus Mariota put a field goal drive together where he converted a third down with legs and then added nice completions to Kendall Wright, Justin Hunter and Bishop Sankey. Mariota had Kendall Wright open for a deep touchdown, but threw it short, and that allowed the defense to come back for a breakup. That was the only score in the first half. In the third quarter, Denarius Moore was stripped on a punt return by Jalston Fowler, and the Titans recovered around the Bills' 40-yard line. Mariota went to work with clutch passes to Harry Douglas to convert a third down and hit Delanie Walker to get the Titans at the 1?yard line. Antonio Andrews plunged into the end zone to give Tennessee a 10-0 lead. The Bills' offense was putrid for the majority of three quarters as the Titans' defense suffocated Buffalo. The Bills finally did something when Tyrod Taylor ad libbed and took off on a run of 26 yards to get into Tennessee territory for the first time. A few plays later, Taylor took a quarterback draw into the end zone from 22 yards out. Mariota answered with clutch conversion to Hunter and then took off on a 23-yard run on a zone read. That led to the Titans to expand their lead to 13-7 midway through fourth quarter. Taylor continued to hurt the Titans with his legs, taking off on a 25-yard run to convert a third-and-23. Then, Taylor laid out a beautiful deep ball for a 46-yard gain to Chris Hogan, who beat Coty Sensabaugh to get inside the 10-yard line. On third-and-goal, Taylor went back to Hogan on a sprint out for a touchdown and a 14-13 lead. The Bills' defense came up with two stops to clinch the victory. On the second one, Mariota was pressured by Marcell Dareus into throwing a deep ball up for grabs that was picked off by Stephon Gilmore to end the game for Buffalo. ",
            "4": "Taylor completed 10-of-17 passes for 109 yards with a touchdown. He ran for 76 yards and eight carries and a score. He'll continue to be a solid starting option in fantasy because of his rushing ability. ",
            "5": "The Bills' offense was without LeSean McCoy and Sammy Watkins. Their top running back was Dan Herron (9-28), while Chris Hogan (3-52) led them through the air. ",
            "6": "Marcus Mariota was 21-of-32 for 187 yards with an interception. He ran for 47 yards on five carries. He didn't play poorly, and the Bills' defense did a good job of bending but not breaking. ",
            "7": "The Titans' ground game was shutdown by Buffalo as Dexter McCluster (8-20) and Bishop Sankey (7-20 rushing, 3-23 receiving) were unable to get in any groove. ",
            "8": "Antonio Andrews led the Titans through the air (3-45). Mariota spread the ball around to Kendall Wright (3-29), Justin Hunter (3-38), Delanie Walker (4-36) and Harry Douglas (2-17), but all were limited by the Bills. Walker and Wright suffered injuries late in the game that are worth monitoring. ",
            "9": "Titans defensive lineman Jurrell Casey (6 tackles, 1.5 sacks) and Derrick Morgan (3 tackles, 1.5 sacks) were excellent for Tennessee. Buffalo's defense got sacks out of Kyle Williams and Mario Williams. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: Well, what do you know? The Bengals won a showcase game, and Andy Dalton had a big hand in doing so with his great comeback. Maybe I'm overreacting here, but at this point, I'd say it's likely that Cincinnati will win a playoff game. ",
            "2": "This game started with Andy Dalton and the Bengals moving the ball seemingly at will, but after a 73-yard touchdown pass to A.J. Green, which would have made it 14-7 in the second quarter, was brought back on a holding call, then it was all the Seahawks as over the next two quarters as they built a 24-7 lead. With one quarter remaining, the Bengals' hopes were thin, but this team is made up of better stuff than Bengals teams of old and came back to tie it up with a Mike Nugent field goal as time ran out. Then, it just seemed like dotting the Is and crossing the Ts when Nugent kicked the game winner to take the Bengals to a perfect 5-0 and knock the defending NFC champs to 2-3. ",
            "3": "With Richard Sherman shadowing A.J. Green for much of the game, Bengals tight end Tyler Eifert was the main target for Dalton. He was targeted 12 times, catching eight for 90 yards and the all-important two touchdowns. Eifert continues to prove that he is a top tight end in this league, and Dalton no longer has to focus in on Green to move the ball. ",
            "4": "The Seahawks were once again without Marshawn Lynch, but a lack of a running game was not a problem this week as undrafted free agent Thomas Rawls was almost indistinguishable from Lynch. Rawls bowled over defenders and gained extra yardage after contact on nearly every touch. His masterpiece though, was a 69-yard touchdown run, where he shed multiple tacklers off his back and then waltzed into the end zone. Rawls ended up with 23 carries for 169 yards and that touchdown. As Lynch's body continues to betray him, Rawls is going to do work. ",
            "5": "Giovanni Bernard, who had 15 carries for 80 yards and five receptions for eight yards, while Jeremy Hill was given eight carries for 13 yards and one reception for two yards. Even with Hill's three touchdown runs last week, Bernard has continued to outplay Hill in every facet of the game. ",
            "6": "Russell Wilson played well for the most part in this game, completing 15-of-23 passes for 213 yards, one touchdown and one interception. He also tacked on three rushes for 21 yards. Wilson made some big throws, averaging over nine yards per pass attempt, but the Seahawks got complacent with the big fourth-quarter lead. He once again had protection troubles, getting sacked four times, and this team is just no longer as confident in stomping on their opponents when they are down. ",
            "7": "This game was a statement by the Bengals and Andy Dalton. They were down by 17 to the Legion of Boom, and Dalton did not look perfect, but he rallied and took it to them in the fourth quarter. Dalton is firmly in the early MVP talk and has a solid defense, offensive line, running backs, tight end, wide receivers and kicker. And now, Dalton is playing consistent ball, which has not been his modus operandi in the past. The Bengals served notice that they can beat top teams, even when everything isn't going their way. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: I'm glad I won this bet, but I'm frustrated at the same time. Why couldn't Matthew Stafford use up some of these turnovers in the Monday night game? Seriously, how in the world did this miserable Detroit squad not commit any turnovers prior to the Calvin Johnson fumble? How insanely improbable. ",
            "2": "After Arizona lost last week for the first time this season, a game at Detroit was a perfect remedy to get the Cardinals back in the win column. This was pure domination with tons of self-inflicted moves by the Lions. Arizona looks like a legitimate Super Bowl contender, and Detroit looks like a legit top-five selector in the 2016 NFL Draft. ",
            "3": "On the Lions' first possession, Matthews Stafford threw a terrible pick to Rashad Johnson. Stafford could have run for the first down rather than trying to force the pass to Tim Wright. Detroit's second possession saw Ameer Abdullah fumble the ball away courtesy of a strip from Tony Jefferson. Arizona couldn't do anything with the turnovers, and Stafford burned Jarraud Powers with a 50-yard pass to Corey Fuller (2-56) to the 6-yard line. The next play saw Stafford throw a touchdown pass to Theo Riddick (10-53-1). From there though, it was all Cardinals. Arizona's offense responded with a drive down the field. Carson Palmer hit Darren Fells for a 14-yard touchdown to tie the game at seven. The Lions quickly set up Arizona for another touchdown as Cory Redding tipped a screen pass to himself and rumbled down the field before being tackled by Stafford at the four. On the next play, David Johnson charged up the middle into the end zone. Abdullah fumbled again on the following kickoff return, but questionably, the ball was ruled to be Detroit's. Starting a drive at his own 1-yard line, Palmer laid out a 49-yard pass to John Brown, who got over the top of Darius Slay. Chris Johnson took off on a 40-yard run to the 2-yard line on the next snap. That set up another touchdown run for David Johnson. On the next possession, Golden Tate was stripped by Tony Jefferson, and Rashad Johnson recovered the ball for Arizona. A few plays later, Palmer hit John Brown for an 18-yard touchdown. The game was, effectively, over by halftime. The third quarter was more of the same as Stafford and Calvin Johnson weren't on the same page. A pass flew right to Arizona's Patrick Peterson, who he returned it 40 yards. Promptly, Palmer threw a perfect pass to Larry Fitzgerald for 26 yards. Then a slant to Fitzgerald hit pay dirt for the Cardinals. After that interception, Stafford was benched for Dan Orlovsky. In fourth-quarter garbage time, Andre Ellington took off on a 63-yard touchdown run to pad the Cardinals' lead. ",
            "4": "Carson Palmer was 11-of-14 for 161 yards and three touchdowns. It was an easy day at the office for him, and it's a shame for his fantasy owners that he couldn't play late in the game to pad his stats. ",
            "5": "Chris Johnson led the Cardinals on the ground with 11 carries for 103 yards. Ellington had three carries for 63 yards, while David Johnson was given three carries, which he turned into six yards and two scores. ",
            "6": "Larry Fitzgerald (5-58-1), John Brown (4-73-1), Darren Fells (2-25) and Michael Floyd (1-15) made easy work of Detroit's secondary. As with Palmer, they could've posted better numbers if the Lions were more competitive. ",
            "7": "Matthew Stafford was 20-of-32 for 188 yards with a touchdown and three interceptions. Dan Orlovsky was 21-of-38 for 191 yards with a score and an interception. Jim Caldwell told reporters that Stafford will remain the starter. ",
            "8": "Zach Zenner led the Lions on the ground with 10 carries for 30 yards. Ameer Abdullah had 17 yards on six carries with two fumbles (one lost). ",
            "9": "The lone real positive for Detroit was Calvin Johnson broke Herman Moore's record for career receptions in Lion history. Johnson had five catches for 67 yards. Golden Tate (8-74) led Detroit through the air. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "Different week, same result for the Broncos. Peyton Manning struggled immensely, yet his team was able to win, simply because his defense carried him to victory. That's been the case in all five of Denver's triumphs. Manning went 22-of-35 for 266 yards, but was picked off twice. He stared down his receivers and floated wobblers that were both snatched by Charles Woodson. This is significant, as Woodson and Manning are two of the three players still remaining from the 1998 NFL Draft (Matt Hasselbeck being the other). Woodson has never intercepted Manning in his Hall of Fame career, but now he can finally say that he was able to accomplish that after stealing the Heisman from him about 15 years ago. The concerns with Manning are real. The Broncos keep winning, so the media isn't talking about it as much as they should, but Manning is effectively just Alex Smith at this point of his career, and that is most definitely not a compliment, despite all of the fake positive things Trent Dilfer has to say about Smith. Manning was lucky to get away with another pick that was dropped by T.J. Carrie. If you can get something decent for him in fantasy, don't hesitate to pull the trigger. ",
            "2": "The Raiders, meanwhile, would've had the win if they didn't shoot themselves in the foot repeatedly. It started early when a false start, a Carr sack and a blocked field goal ruined a scoring opportunity. Sebastian Janikowski later missed a 40-yard field goal, and then a Derek Carr pick-six iced the victory for Denver. Carr had two receivers in the area, but neither inexplicably looked back for the ball. Oakland and Denver had about the same amount of net yardage (the visitor accumulated nine more), but the mistakes the host made allowed the Broncos to improve to 5-0. ",
            "3": "Carr went 26-of-39 for 249 yards, one touchdown and that pick-six to go along with a lost fumble. He moved the chains well throughout most of the afternoon, and he launched a deep bomb late that drew a pass interference flag, but he dinked and dunked more than he should have. Perhaps the worst instance of that occurred on a fourth-and-19 with about four minutes remaining. Doing his best impersonation of Alex Smith, Carr inexplicably tossed a checkdown that went nowhere. It's almost as if the Raiders didn't know it was fourth down. And no, Dilfer, that's not a good play. ",
            "4": "With Carr limited, it's no surprise that none of his receivers accumulated more than 54 yards. Michael Crabtree led the way with that amount, though he only reeled in four of his nine targets. One reception was an impressive sliding grab. Amari Cooper, on the other hand, logged four catches on as many targets for 47 yards. ",
            "5": "Latavius Murray was mysteriously benched for what Jack Del Rio referred to as health reasons, even though it didn't appear as though he was hurt. Murray managed just 39 yards on 13 carries, but his backups were worse. Del Rio appears to be in way over his head, which is no surprise. ",
            "6": "Meanwhile, Denver's ground attack struggled as well. C.J. Anderson was limited to just 22 yards on 11 carries, while Ronnie Hillman was only marginally better, mustering 21 yards on seven attempts. Take away both backs' longest carries, and they combined for only 27 yards on 16 attempts. That's awful, but a common sight for Denver's atrocious offensive line. ",
            "7": "Thanks to Manning's ineptitude, only one Denver receiver was a productive fantasy player. That was Emmanuel Sanders, who caught nine passes for 111 yards. Demaryius Thomas disappointed his fantasy owners with five grabs for 55 yards. He was targeted in the end zone a couple of times, but Manning couldn't hook up with him. Also, Manning was intercepted once while staring him down along the sideline. ",
            "8": "Owen Daniels also disappointed. He had a dream matchup against an Oakland defense that hasn't been able to stop tight ends. He saw five targets, but didn't have a single catch. Manning looked his way twice in the end zone, but couldn't connect with him. One of those attempts was picked off. ",
            "9": "DeMarcus Ware left the game with a back injury. Despite his absence, the Broncos played better in the second half. Von Miller recorded a strip-sack to set up a Denver field goal. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "6"
        },
        "comments": {
            "amount": "9",
            "1": "The Patriots haven't exactly been tested yet. They beat the Steelers, who didn't know how to line up in the opener for some reason. The Bills were guilty of multiple penalties on almost every possession. The Jaguars, well, are the Jaguars. New England entered this contest as the perceived best squad in the NFL at 3-0, but despite this, the Patriots were sure to improve to 4-0 because they were battling an opponent missing its quarterback and top play-maker. New England's offense was sluggish to start. It was a 3-3 tie until late in the second quarter, as the offensive line had major problems protecting Tom Brady. The future Hall-of-Famer took five sacks in the first half alone - a career-high figure for him in a single half. Greg Hardy, who had some strange things to say about Brady's wife during the week, accumulated two sacks. The woman-beater shouldn't be playing right now, but there's no denying that he's an unbelievable talent. DE Woman Beater treated Brady like one of his girlfriends on one occasion, hitting him so hard that the ball was jarred loose. Despite all of this, however, Brady wasn't sacked a single time in the second half. Bill Belichick made the proper adjustments, and the Dallas defense wore down because it was on the field so much. Brady consequently misfired on just one pass in the second half. He ended up finishing 20-of-27 for 275 yards, two touchdowns and the lost fumble. His sole incompletion following intermission was nearly picked, but he was flawless otherwise. ",
            "2": "Brady's two touchdowns were drastically different. One was a short dump-off to Dion Lewis, who made an impressive, one-handed grab and then dodged three Dallas defenders with impressive jukes to find the end zone. Lewis saw far fewer carries than LeGarrette Blount (13-74), getting just six attempts, which he turned into 34 yards. However, he was such a big part of the passing attack, seeing 11 targets - more than double compared to anyone else on the team. He ended up catching eight balls for 59 receiving yards and the score. ",
            "3": "Brady's second touchdown was a 59-yarder in the fourth quarter, which completely blew the game open. It should've never happened, however, as the Patriots got away with a blatant pick play, per usual. It ultimately didn't matter because New England was winning in a blowout no matter what, but if this were a close contest, it would've been a shame if the game had been decided because the officials weren't paying attention. ",
            "4": "Rob Gronkowski let his fantasy owners down with a four-catch, 67-yard performance. He looked good whenever he had the ball, but he didn't get many opportunities. ",
            "5": "Before moving on to the Cowboys, it should be noted that the Patriots lost Dont'a Hightower (ribs) and Nate Solder (elbow) to injuries. ",
            "6": "Dallas will have to move on from Brandon Weeden following the bye. Weeden has regressed every week and is now playing with zero confidence. When he wasn't settling for checkdowns, he was missing open receivers. Matt Cassel is severely limited, but is at least accurate in the short passing game. Weeden went 26-of-39 for 188 yards and an interception. He nearly had a second pick when he fired a pass right to Chandler Jones, who was shocked to have an opportunity to make a catch. Weeden should've fired a touchdown at the end to Terrance Williams (2-30), but Weeden missed Williams even though he was wide open. ",
            "7": "With Weeden checking down non-stop, it shouldn't be surprising to see that Darren McFadden led the team in targets, catches and receiving yards. McFadden, taking over for Lance Dunbar as the receiving back, hauled in nine balls for 62 yards. Cole Beasley (4-40) dropped a pass. ",
            "8": "While McFadden was catching most of the passes, Joseph Randle had a majority of the workload on the ground. Randle gained 60 yards on 15 carries. ",
            "9": "Belichick is the master of taking away one aspect of an opposing defense, and he wisely opted to silence Jason Witten in this matchup. Witten did nothing in the first half and ultimately caught five passes for only 33 yards. He also lost a fumble. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Giants",
            "Points": "30"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "27"
        },
        "comments": {
            "amount": "9",
            "1": "The Giants could easily be 5-0 right now, but they also could have been 2-3 after this game. They trailed 27-23 with less than a minute remaining, but Eli Manning engineered a brilliant, last-second touchdown drive despite the fact that the top three receivers on his roster were injured. Odell Beckham had been enjoying a terrific evening - seven catches, 121 yards, one touchdown - but left with a hamstring injury. Rueben Randle (5-42) was ruled out with the same malady. It was unknown if Beckham could return, and he wasn't on the field during the first half of the final drive. Beckham reentered the field midway through and actually said a prayer that he could stay healthy. He didn't catch a ball, but drew a crucial pass interference flag that set up Larry Donnell (6-35) with a game-winning touchdown. Donnell caught the pass over two San Francisco players, including NaVorro Bowman, and somehow hung on to the ball despite it being above his head as he was falling down out of the back of the end zone. ",
            "2": "Eli Manning finished 41-of-54 for 441 yards, three touchdowns and an interception, which was a poor underthrow into the end zone at the end of the first half. Manning was terrific considering all of the injuries. He was throwing passes to guys named Dwayne Harris - who dropped two passes - Will Tye and Myles White. Manning was fortunate that the 49ers dropped two possible picks, but he can be excused because of his supporting cast. ",
            "3": "Excluding Beckham, Manning's leading receiver was actually running back Shane Vereen, who was fantastic in his role as a pass-catching running back. Vereen caught all eight of his targets for 86 receiving yards and a touchdown. He was crucial on the final drive, picking up gains of 11, 16 and 24. It's amazing that the 49ers made the mistake of not doubling Vereen. Who else could they possibly be scared of? ",
            "4": "Vereen actually saw some carries, handling five attempts for 24 rushing yards. Rashad Jennings (11-46) saw most of the workload, while Andre Williams couldn't gain a single yard on his three attempts. Williams has been phased out of the offense, so he won't have an impact unless Jennings goes down, and rightfully so. He's not a good player. ",
            "5": "Before moving on to the 49ers, it should be noted that linebacker Jon Beason was knocked out early with a concussion when he collided helmet-to-helmet with Carlos Hyde. ",
            "6": "Speaking of Hyde, he had a solid evening, gaining 93 yards and a touchdown on 21 carries. He ran hard, and he could've totaled an even 100 if he didn't take a loss of seven on one rare poor attempt in which he ran around the backfield like a chicken with its head cut off. In my Fantasy Add/Drop page, however, I discuss why Hyde should be sold high right now. ",
            "7": "Colin Kaepernick was close to being benched prior to this game, but he has silenced those critics for now. Kaepernick bounced back in major fashion, going 23-of-35 for 262 yards and two touchdowns to go along with three scrambles for 23 rushing yards. Kaepernick was lucky to get away with some potential turnovers; he had an interception that was dropped, wasted a timeout at the end of the third quarter, and fumbled a ball that bounced back right to him, but overall, he had a strong evening - by far his best performance of the year. Kaepernick lofted two beautiful touch passes to Anquan Boldin for long gains, one of which went for 37 yards. It was bizarre to see him play so well after being horrible the past three weeks. ",
            "8": "Kaepernick threw to Boldin way more than anyone else. He drew 12 targets, more than double than any other 49er. Boldin logged eight receptions for 107 yards and a touchdown. Only two other San Francisco players logged more than three targets: Hyde and Garrett Celek (3-26), who was starting in place of an injured Vernon Davis. ",
            "9": "Torrey Smith saw just two official targets, snaring both for 42 yards. He also drew a defensive hold in the end zone as well as a deep pass interference, though the latter call was pretty bogus. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Steelers were extremely lucky to win this game for numerous reasons. Beginning with the final play of the game, Mike Tomlin decided to take a chance and run the ball with Le'Veon Bell from the half-yard line with just five seconds remaining. Bell lined up in the Wildcat, seven yards away from the goal line, so the play took a while. Bell was tackled right at the end zone, and replay review had to take a look at it to see if he scored. Bell's knee landed with the ball just inches over the white paint. It was correctly ruled a touchdown, but he nearly fell short, and because the play lasted so long, the Steelers wouldn't have had enough remaining on the clock to ask for their last timeout. Tomlin's gamble was successful, but football once again proved to be a game of inches. The other primary reason Pittsburgh was fortunate was the play of its quarterback. QBDK was atrocious for most of the evening. He made a brilliant throw to Markus Wheaton for a 72-yard bomb in the fourth quarter and drove the team down the field on the final drive, but he was so extremely lucky to get away with a disastrous outing. The Chargers dropped three possible interceptions of his in this contest. Those were legitimate. The football was in the hands of the Charger defenders, but they couldn't control it. All three passes easily could've been picked, which would have changed the course of this game dramatically. Elsewhere, QBDK was milliseconds away from being strip-sacked in the first quarter. He was hit as he released the ball, and was just barely able to push it forward. The Chargers picked up the loose ball, so they would've had possession in the red zone. QBDK also took some bad sacks, including one that knocked his team out of field-goal range. QBDK finished 13-of-26 for 203 yards, one touchdown and an interception along with a 24-yard scramble at the very end. The coaching staff showed very little faith in him for most of the evening, and rightfully so. As mentioned, he easily could've had a four-pick outing, and at one point, Jon Gruden was suggesting that Mike Tomlin would have to insert Landry Jones into the lineup. Bad times are coming for QBDK once he battles defenses that can hang on to his interceptions. ",
            "2": "Bell was the primary reason Pittsburgh prevailed. Not just because of his final touchdown, but because he kept some drives alive when QBDK was struggling in the first three quarters. He gained 111 yards on just 21 carries, while DeAngelo Williams (5-20) also looked good. The Steelers will always have a chance when Bell is lining up in the backfield, even when the quarterbacking is horrific as it was tonight. ",
            "3": "Antonio Brown was a major disappointment. Handicapped by the terrible QBDK, he caught only three balls for 45 yards, costing me a victory in a fantasy league (I needed just seven points from him in standard). Heath Miller (3-46) was next on the stat sheet, with both being behind Wheaton, whose only catch was that 72-yard score. ",
            "4": "The Chargers, meanwhile, drove down the field quite easily on the opening drive, but had major problems moving the chains after that. The culprit was the offensive line, which suffered yet another loss when replacement left tackle Chris Hairston was knocked out of the game. Right tackle Joseph Barksdale had to slide over to the blind side, forcing some scrub into his former spot. The results were disastrous. On four consecutive drives, the Chargers stalled because of two holds, one false start and a bad sack. The line was even guilty of two holds during San Diego's sole touchdown drive in the second half. Despite this, Philip Rivers went 35-of-48 for 365 yards, two touchdowns and an interception. The pick blew the game open, as it was returned for a score. It wasn't Rivers' fault, as Malcom Floyd ran one of the worst and laziest routes you'll ever see. Rivers played well, considering the lack of protection, but it wasn't enough. ",
            "5": "Melvin Gordon was another player who was a huge disappointment. The Chargers were forcing touches to him, and he struggled for the most part. He failed to pick up anything on the ground - 15 carries, 42 yards - and while his receiving numbers were solid (7 catches, 52 rec. yards), he was guilty of a blown protection, leading to Rivers getting sacked. The big blunder on Gordon's part was a fumble at midfield that ruined a promising drive. San Diego needs to feature Danny Woodhead more often. Woodhead caugh five balls for 66 receiving yards, and while he's the inferior talent, he doesn't make mistakes like fumble (none since 2013) or miss assignments in protection. The Chargers' offense was just more effective when he was on the field. ",
            "6": "Antonio Gates made his return from his suspension and caught a touchdown right away - the 100th of his prolific career. He ultimately finished with nine grabs for 92 yards and a pair of scores. Not bad for a player who rotated on and off the field with Ladarius Green (5-50). Keenan Allen, meanwhile, caught six of his 10 targets for 57 yards. Stevie Johnson missed this contest. ",
            "7": "There's been talk about the Chargers going to Los Angeles. They need to move because their fans were a no-show once again. There were more Pittsburgh backers in the crowd. In fact, it was so bad that Rivers had trouble dealing with the noise on his own third down at one point during the second half. It's embarrassing that the Chargers can't fill their stadium. They have to leave and move north. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}