{
    "year": "2015",
    "week": "06",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "21"
        },
        "comments": {
            "amount": "10",
            "1": "It's unknown if Drew Brees and Sean Payton will be in New Orleans next season. If not, it's a bit fitting that the team and city's resurgence began with a blocked punt returned for a touchdown in the home opener in the wake of Hurricane Katrina, and the last hurrah for the same regime occurred with yet another blocked punt for a touchdown versus Atlanta. Up 7-0, Michael Mauti echoed the memories of Steve Gleason, blocking the ball and falling on it in the end zone. The crowd, which already cheered Gleason, who was in the building to be honored, was ignited even more. Though the Falcons snugged up the margin to one touchdown, the Saints eventually exploded out to a three-score lead to keep their season alive. They now stand at 2-4, so they're not dead - at least not yet. The Falcons, meanwhile, sustained their first loss. It was a mistake-filled night for them, as they constantly killed themselves with turnovers. The blocked punt wasn't even the initial error, as Matt Ryan fumbled a snap on a fourth down of the opening drive. After that, Tevin Coleman coughed up the football in the red zone when it appeared as though Atlanta was going to tie the game. Later in the second quarter, the backup center, who was in the game because of an injury to the starter, screwed up the snap, prompting yet another lost fumble in the red zone, thus negating a second chance to even the count. Atlanta had a fourth turnover late - another Ryan fumble - but by then, it didn't matter. ",
            "2": "Ryan, despite the mistakes, had a solid stat line. He went 30-of-44 for 295 yards and two touchdowns. The numbers are misleading because of the two lost fumbles and the red-zone miscues, but Ryan didn't have a bad outing. He was betrayed by his supporting cast; he suffered through several drops and was sacked on five occasions, thrice by Cameron Jordan. ",
            "3": "The big story prior to the game was whether or not Julio Jones would play. Jones took the field and didn't appear to be limited. He caught six passes for 93 yards. Ryan didn't have enough time in the pocket to find Jones as much as he wanted to. Because of this, Ryan frequently tossed checkdowns to Devonta Freeman, who once again had a great game. He caught eight passes for 56 receiving yards and a touchdown to go along with some fantastic rushing numbers (13 carries, 100 rushing yards, TD). Freeman had a drop late, but it was his only blemish during the evening. Freeman was also helped by Coleman's aforementioned lost fumble. Not that Freeman was going to lose his job to Coleman, or anything, but Coleman (4-40) didn't have a single touch following intermission. ",
            "4": "Jones' fantasy owners had to be upset when they saw that Roddy White scored a touchdown. White, who caught three balls for 23 yards and the score, is still not worth owning; he saw just four targets despite Ryan's 44 attempts. Leonard Hankerson (4-37) was thrown to more, seeing six balls. Hankerson was guilty of a bad drop. ",
            "5": "As for the Saints, Brees had a terrific evening, going 30-of-39 for 312 yards and a touchdown. He had just one bad throw when he missed Ben Watson high inside the Atlanta 10-yard line at the end of the first half, but he atoned for it, especially after intermission, helping the team accumulate 211 net yards in the final two quarters. ",
            "6": "Speaking of Watson, his ridiculous output came out of nowhere. Watson caught a whopping 10 balls for 127 yards and a touchdown. Yes, Ben Watson! It was amazing, as the Falcons didn't understand how to cover him. The Saints repeatedly beat the Falcons with the same crossing route. It's astonishing that Atlanta didn't know how to adjust to this. ",
            "7": "The Saints' other pass-catchers disappointed their fantasy owners, but they didn't play poorly. Willie Snead caught four balls for 55 yards, but was able to convert some key third downs. Brandin Cooks' numbers were even worse (4-41), but he drew so much attention away from Brees' other weapons. ",
            "8": "Mark Ingram ran tough, but barely had any room against a strong Atlanta run defense, mustering just 46 yards on 20 carries. However, he scored twice and ripped for an impressive 11-yard burst when the Saints were running out the clock late in the fourth quarter. ",
            "9": "C.J. Spiller once again did nothing. This was very predictable, as he's been silent all year except for the game-winning touchdown versus Dallas. He had three carries for 10 yards to go along with four catches for 17 receiving yards. He's not worth a roster spot in non-PPR formats. ",
            "10": "A couple of dark clouds over the Saints' victory: Left tackle Andrus Peat was knocked out of the game with a leg injury. Also, kicker Zach Hocker whiffed on two field goals, though one was from beyond 50. He connected on one try, but it was from 31. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "This was Buffalo's second big statement game at home this year, and this one went exactly like the previous contest. As with the New England matchup, the Bills scored a touchdown on their opening drive. LeSean McCoy, who was questionable heading into the contest, ripped off a 33-yard burst. E.J. Manuel then threw a pass at Charles Clay's feet, which was ruled incomplete but overturned after a review. Manuel followed that up with a great pass to Robert Woods along the sideline and then scored on a touchdown run. It was 7-0, Bills, and they appeared primed to pull the upset. And then, the rest of the game went like the New England contest. The Bills lost to the Patriots because they absolutely killed themselves with horrible penalties. This game was different in that the Bengals beat them legitimately with superior talent, with the help of a key injury. Cincinnati, despite having great field position on many drives in the first half, sputtered early on, but accumulated 234 net yards following intermission. The Bengals put together multiple touchdown drives even though they began starting inside their own 20 for a change. ",
            "2": "Andy Dalton was exceptional, going 22-of-33 for 243 yards and three touchdowns despite playing a terrific defense. A big reason for Dalton's success was his pass protection. The Bengals have an elite offensive line, and it once again thrived, surrendering zero sacks despite battling the likes of Jerry Hughes, Mario Williams and Marcell Dareus. The Bills even tried blitzing, and it was no use. Dalton had plenty of time on most occasions, and even when he didn't, he released the ball quickly and allowed his play-makers to move the chains. One of those play-makers happened to be Marvin Jones, who saw a team-high 12 targets. He caught nine balls for 95 yards and a touchdown, which was an acrobatic flip into the end zone. His best catch was a 42-yard haul in the third quarter in which he somehow came down with the ball after leaping up for it in double coverage. The pass looked like it was going to be intercepted, but Jones managed to snatch it out of the air. ",
            "3": "A.J. Green didn't do much, disappointing his fantasy owners. He caught four passes for 36 yards, struggling because of Ronald Darby's elite coverage. Meanwhile, Tyler Eifert (4-30) caught a touchdown. ",
            "4": "The Bengals kept their word and ran the ball more with Jeremy Hill, but Giovani Bernard had a greater YPC average. Hill's 16 attempts turned into 56 yards, while Bernard's eight tries transformed into 50 yards and a touchdown. Hill actually caught a receiving touchdown early on. Like Jones, he flipped into the end zone. ",
            "5": "Going back to the Bills, Manuel cooled down after a hot start. He was sharp early, but began throwing passes wide and short of the mark. His final numbers weren't terrible - 28-of-42, 263 yards, one touchdown, one interception, 22 rushing yards, one rush touchdown - but some of that came in garbage time, and he had so much trouble maintaining drives after that initial possession. His pick, by the way, was a poor underthrow. To be fair to Manuel, he was much more ineffective without Sammy Watkins. The No. 1 wideout caught a touchdown just prior to halftime, which was an amazing feat because he injured himself prior to making the reception. This drew the game to within three, but the Bills couldn't get anything going without Watkins, who was on crutches right after the break. To illustrate Buffalo's troubles, Manuel was 15-of-20 for 129 yards, one touchdown and a pick with Watkins and 13-of-22 for 134 yards without him. The score was 17-14 with Watkins and 17-7 without him. ",
            "6": "Watkins at least helped his fantasy owners prior to leaving. He snatched four balls for 48 yards and the score in one half of action. No Buffalo player finished with more than 62 yards, with Charles Clay leading that category. Clay saw a whopping 13 targets, more than double than any other Buffalo player saw. He turned those into nine grabs for 62 yards. Clay was producing even with Watkins on the field, so don't think that the injury opened up opportunities for him. ",
            "7": "McCoy ran well despite being questionable prior to kickoff, though he didn't have much of an opportunity because the Bills trailed throughout. McCoy tallied 90 yards and a touchdown on 17 attempts. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "23"
        },
        "comments": {
            "amount": "9",
            "1": "Who would you rather have, Peyton Manning or Josh McCown!? A stupid question, but one I heard on ESPN four times throughout the week. The argument was made for McCown by some, while most chose Manning. The obvious choice is Manning, but based on this game alone, the answer is simple: neither. Both quarterbacks were dreadful in this contest. Beginning with the victor, Manning once again looked like a dying animal. He tossed three picks, all of which were terrible. The first was underthrown into double coverage. The second, which was a pick-six, was tipped because it was thrown behind Emmanuel Sanders. The third, which occurred in overtime, was a soft pass that was way underthrown. Manning, for whatever reason, doesn't realize that he's done. He keeps trying to force the issue despite having nothing left in his arm. Perhaps he refuses to see the truth - likely, given that he's always been an ego maniac - but if the Broncos had a worse record, they'd have to consider switching to Brock Osweiler. However, because they are undefeated, their fate will be getting blown out in the playoffs against a strong opponent. Until then, Manning (26-of-48, 290 yards, one touchdown, three interceptions) will continue to struggle while his defense continues to carry him. ",
            "2": "Despite Manning's woes, both of his receivers posted great numbers. Demaryius Thomas caught 10 passes for 111 yards, while Emmanuel Sanders had four receptions go for 109 yards and a touchdown. However, both players had dark clouds over their performances. Thomas had major issues hanging on to the ball, as he was guilty of several drops, including one on what could've been the game-winning drive in regulation. Thomas also dropped a pass in overtime, but was fortunate that the Browns were flagged for 12 men on the field. Sanders, meanwhile, appeared to injure his shoulder at the very end of the fourth quarter. Sanders seemingly caught a deep pass, but celebrated too much while grabbing his shoulder. As a result, time expired, ruining a chance at a field goal. However, it was eventually ruled that Sanders never completed the catch. ",
            "3": "You can say that Ronnie Hillman has officially overtaken C.J. Anderson as the team's lead runner. Hillman handled five of the team's initial seven touches amongst the running backs. He eventually out-carried Anderson, 20-13, and racked up way more yardage, 111-41. Anderson did catch four passes for 25 receiving yards, but the starting job now appears to be Hillman's. ",
            "4": "Owen Daniels is noteworthy because he dropped a pass. He finished with two catches for 24 yards. The Broncos need to upgrade this position next offseason. ",
            "5": "Sanders wasn't the only Bronco who sustained an injury. Pass-rusher Shane Ray, playing for DeMarcus Ware, was carted into the locker room during the opening half. ",
            "6": "Going now to McCown, he went 20-of-39 for 213 yards, two touchdowns and a pair of interceptions. One of the picks was also taken back for six, as McCown stared down his receiver, telegraphing the pass. Aqib Talib sat on the route and hauled in an easy turnover. The other interception occurred under pressure, as McCown hurled the ball carelessly. Something that's not shown on the stat sheet is that McCown took two terrible sacks in overtime, which shifted the Browns out of field-goal range. ",
            "7": "McCown did make some nice passes, including a 47-yard bomb to Travis Benjamin, who was the team's leading receiver. Benjamin's nine receptions were triple than that of the next Cleveland player, and those catches went for 117 yards. Despite the tough matchup, Benjamin was very productive, and he would've scored a touchdown had Talib not made a great pass break-up. Benjamin is way better than the situational receiver from earlier in the year. ",
            "8": "Both of McCown's touchdowns went to Gary Barnidge. It wasn't all rosy for Barnidge, however, as he converted just three of his nine targets. He also dropped a pass on a fourth down of the opening possession. ",
            "9": "Mike Pettine is extremely frustrating. Duke Johnson continued to see the most work in the passing game (3 catches, 18 rec. yards), but Robert Turbin was worked in on the ground. Turbin predictably flopped, mustering just 27 yards on 10 useless carries. Both Johnson (9-38) and Crowell (11-32) maintained superior YPC averages, though the latter was knocked out with a shoulder injury. Why Turbin is even playing is beyond me. Pettine is just crazy. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "34"
        },
        "comments": {
            "amount": "9",
            "1": "The Lions got into the win column, but they did so amid some controversy. The most talked-about play occurred just prior to halftime. Golden Tate seemed to catch the ball in the end zone, but it popped out of his hands, landing into the arms of a Chicago defender for an interception. It was reviewed, and the horribly inept Walt Coleman said that it was reversed to a touchdown and offered no explanation. The play was different than what we've seen in the past because Tate was never in the air and didn't go to the ground, meaning he didn't have to complete the process of the catch, whatever that means. That was at least the explanation the head of officiating gave, and it was the right one based on the rule. But the play? I don't know if Tate ever had possession of the ball, since it was bobbling in his arms the entire time. And given that it was so close, how could Coleman change the ruling on the field? Coleman also had some shaky instances late in the game. There was a mysterious roughing-the-passer call that set up a touchdown to Calvin Johnson at the end of regulation. There was also a missed hold on Johnson's 57-yard reception to set up the game-wining field goal. The Bears were definitely screwed out of a victory, but perhaps this was for the best, as it'll give them a better draft choice come April. ",
            "2": "I'd like to say that this win keeps the season alive for the Lions, but they're already finished. The silver lining is that Matthew Stafford looked good for the first time all year, but he was battling one of the worst defenses in the NFL, so what does it matter? His numbers were impressive, as he went 27-of-42 for 405 yards, four touchdowns and an interception, which was a terrible decision that he made on a third-and-long that he tried flipping to one of his receivers. Stafford got some help from the officiating, but he was still clutch when it mattered most. His bomb to Megatron at the end for 57 yards was a thing of beauty, and he was effective moving the chains throughout the afternoon despite being pressured quite a bit. The offensive line was up to its usual tricks, even somehow surrenderng a sack on a third-and-1. However, the Lions still were able to rack up a whopping 547 net yards of offense. ",
            "3": "Johnson came alive after struggling in the first five games. He caught six passes for 166 yards and a touchdown, highlighted by that 57-yard grab that set up the game-winning field goal. With some soft defenses on the horizon, Johnson should continue to be very productive. ",
            "4": "Stafford's four scores all went to different players. Besides Johnson, those were Lance Moore (5-106), Tate (6-40) and Tim Wright. Tate, of course, probably didn't deserve the touchdown, but his fantasy owners will take it, especially given that he had a score nullified by offensive pass interference. ",
            "5": "Ameer Abdullah led the team in carries, gaining 48 yards on 14 carries. However, the Lions didn't trust him toward the end of the game because of a fumble. Theo Riddick handled all of the late touches, and he was a major factor in the passing game; he caught three balls for 50 yards. ",
            "6": "As for the Bears, Jay Cutler had another solid outing, as he was helped by the return of Alshon Jeffery and Eddie Royal. He went 26-of-41 for 353 yards, one touchdown and an interception. The pick was a great play by Rashean Mathis, though Jeffery didn't fight for the ball to try and break up the pass. ",
            "7": "Jeffery had a great fantasy outing, catching eight balls for 147 yards and a touchdown. He was abusing Josh Wilson all afternoon; Wilson didn't have a prayer of covering him. Jeffery's only blemish, aside for not fighting for the pick, was dropping a ball that would've gone for about a gain of 20. ",
            "8": "Martellus Bennett tied Jeffery with 11 targets, but wasn't nearly as productive, snatching six balls for 59 yards. Bennett nearly had a touchdown, but Cutler's pass to him was broken up at the last second. He also dropped a pass in the second half. ",
            "9": "Matt Forte didn't have much running room, gaining only 69 yards on 24 carries. However, he scored a touchdown and also caught three passes for 20 receiving yards. He probably deserved a second score, but Jeremy Langford vultured it. The agonizing thing for Forte owners is that their back was on the field when this happened. Langford simply got the ball as the up back. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "The Vikings may have won this game by just six points, but this contest never felt close. This easily could've been a blowout by halftime. Teddy Bridgewater forced a pass in the end zone under pressure during the opening drive that was picked off. Right after that, the Chiefs had a safety in the end zone because of a holding penalty. It was somehow not ruled a safety even though all of the linemen were in the end zone. Minnesota dominated the play in the opening half, winning the yardage battle 193-51, with Kansas City recording just three first downs. The Chiefs managed to move the chains a bit better in the second half, but it wasn't enough. Minnesota was able to clamp down when it mattered most. The team forced a Charcandrick West fumble on Kansas City's penultimate drive, and Alex Smith went four-and-out on the final possession. ",
            "2": "Bridgewater moved the chains well overall; he had about 150 passing yards at the end of the first quarter, putting him on pace for 600. He didn't quite get there, and he actually became the first quarterback to fail to reach 250 yards against Kansas City's anemic defense. He was just one yard shy, going 17-of-31 for 249 yards and a touchdown. However, Bridgewater made a couple of key mistakes. I mentioned his first pick, which he forced despite being under heavy pressure. He tossed a second interception after halftime, which was another bad decision. Bridgewater looked good overall, but he'll need to clean up these sloppy errors when he starts playing better opponents. ",
            "3": "It was odd to see Adrian Peterson struggle so much. The Chiefs had a terrific performance from Jaye Howard again, who helped clog the trenches. Peterson, as a result, was limited to 60 yards on 26 carries, and much of that came on a 23-yard burst. Peterson just didn't have any room to run. For instance, on one play, he was forced into foolishly reversing field, which resulted in a 6-yard loss. ",
            "4": "Bridgewater targeted two receivers nine times each. One was Mike Wallace, who continued to be very inefficient, hauling in just two passes for 23 yards. He dropped a pass in the early going. Fifth-round rookie Stefon Diggs, on the other hand, was so much better, logging seven receptions for 129 yards. Diggs is definitely worth adding in fantasy. ",
            "5": "Kyle Rudolph caught Bridgewater's sole touchdown. However, he did nothing otherwise, catching two passes for only nine yards. ",
            "6": "As for the Chiefs, they were just very inconsistent on offense. Jamaal Charles was clearly missed, while West definitely did not serve as an effective replacement. Adding injury to insult, Jeremy Maclin left with a concussion, making Kansas City's scoring unit even more ineffective. West split touches with Knile Davis early on. He had the majority of the workload in the second half, but managed only 33 yards on nine carries with just one catch for six receiving yards. West looked slow and sluggish, and he was stopped on a fourth-down run in the red zone when Sharrif Floyd blew up the play. Davis, meanwhile, wasn't much better, gaining just 13 yards on five tries. ",
            "7": "Alex Smith finished 22-of-37 for 282 yards and a touchdown. He once again dinked and dunked, and most of his yardage came when this was a two-score game. Smith was 7-of-11 for only 43 yards in the first half. I'd say that the Chiefs need to try Chase Daniel, but no mediocre quarterback stands much of a chance without Charles and Maclin while being stuck behind such a horrible offensive line. ",
            "8": "Travis Kelce is all the Chiefs have left. He led the team with 88 receiving yards on five catches. Maclin (3-48) may not play next week, while Albert Wilson (3-57) scored a touchdown. Wilson is not worth an add if Maclin is out. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "It looked like the Jets were going to give this game away despite being huge favorites. Eric Decker fumbled on the Jets' first offensive play, leading to a Washington touchdown. The other starting wideout, Brandon Marshall, was then guilty of a fumble of his own when Bashaud Breeland ripped the ball out of his hands, with the help of a Keenan Robinson hit, to force a fumble. That wasn't Breeland's only turnover of the opening half; he also caught an interception that bounced off Marshall's hands. The Redskins, despite missing three starters on their offensive line, were leading 13-10 in the third quarter. However, the turnovers stopped coming in, as New York took much better care of the football in the second half. Washington, which continued to struggle to move the chains on offense, wilted on the other side of the ball as well, eventually leading to a brutal blowout. ",
            "2": "Washington's stop unit made Ryan Fitzpatrick look like a Pro Bowl quarterback. He misfired on just seven attempts, going 19-of-26 for 253 yards, two passing touchdowns and the aforementioned interception, which wasn't his fault. He also scored a third time on the ground, as he scrambled four times for 31 rushing yards. Don't think this is a sign of things to come. Fitzpatrick isn't any good, but he was able to benefit by shredding an injury-ravaged defense. ",
            "3": "I didn't expect the Redskins to stop the pass very well, but I was shocked that they struggled so much against the run. They came into the afternoon with a top-10 ground defense, but allowed Chris Ivory to burst for 146 yards and a touchdown to go along with three catches for 50 receiving yards. Most of his runs were positive, though he was stuffed on what seemed like a crucial third-and-1 on the opening drive of the second half. The Jets ended up kicking a field goal to tie the game at 13. It didn't matter, however, as New York exploded after that. ",
            "4": "While Marshall and Decker both made mistakes, they both made their fantasy owners very happy, as each scored a touchdown. Marshall caught seven balls for 111 yards, while Decker snatched four passes for 59 yards. Decker would've enjoyed a better performance had he not dropped two throws. ",
            "5": "As for the Redskins' offense, they barely could do anything because they were missing their starting left tackle, left guard and center. Kirk Cousins was constantly under siege and had to throw a bunch of short, junk passes as a result. It didn't help that some of his players dropped balls, including Ryan Grant on a third down that would've moved the chains. Cousins finished 25-of-43 for only 196 yards, which resulted in a 4.56 YPA that Brodie Croyle scoffed at while watching the game at home. Cousins also threw a touchdown and two interceptions. Both picks occurred late when Cousins finally began forcing the issue. The first was a late throw that Revis snatched, while the second was underthrown into double coverage. Don't blame Cousins for this loss, as he just didn't have a chance behind his anemic offensive line. ",
            "6": "The Redskins once liked to run behind the left side of their offensive line. Considering everyone there is out, it's no surprise that Alfred Morris couldn't even average two yards per carry. Morris' 11 attempts went for just 21 yards. ",
            "7": "With DeSean Jackson out yet again, Pierre Garcon led the team with five catches for 28 yards and a touchdown. Jamison Crowder (4-40) paced the team in receiving yardage. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: It's amazing how bad the Jaguars are. They lost by double digits to another bottom-five team at home. They're Forever32, as Matvei aptly called them. Oh, and by the way. DeAndre Hopkins needs to be used in FanDuel each week going forward. He's a monster, and he's getting a billion targets each week. ",
            "2": "Both teams entered this game with 1-4 records, so the loser would be putting themselves in better position to land the No. 1 pick. Neither franchise wants to be selecting high again, but the Jaguars seem poised to be picking in the top 10 thanks to a porous defense. By and large, Blake Bortles has been improved this season thanks to offensive coordinator Greg Olson. However, this game showed that Bortles still has room to improve, and the Jaguars' offensive line needs more upgrades, potentially at left tackle as well. ",
            "3": "Houston got on the board first. Brian Hoyer executed a 16-play, 99-yard drive led by a fourth-down conversion with a completion to DeAndre Hopkins and then finished the drive with a third-down 14-yard touchdown pass to Arian Foster. The Jaguars answered with a drive that was aided by a few Texans penalties. Close to the end zone, Bortles hit Allen Robinson for a short touchdown pass against A.J. Bouye. The Texans answered with a field goal drive to take a 10-7 lead. Right before the half, Bortles drove the ball to Houston's 10-yard line, but he threw a terrible pass that was intercepted by Andre Hal to maintain the three-point lead at the half. Late in the third quarter, the Jaguars stopped a fourth-and-1 carry by Foster for a loss of a few yards, which set up Jacksonville at midfield. Bortles went on to hit Robinson for a gain of close to 20 and then threw a dart to a wide open Julius Thomas for a 29-yard touchdown. The Jaguars took a 14-10 lead, but after that, the Texans took over. Houston answered with Hopkins making a ridiculous one-handed catch for 29 yards. A dumb 15-yard penalty on Jonathan Cyprien moved the ball to the 10-yard line, and Hoyer ended up throwing a bullet to Hopkins for a 9-yard touchdown. The Texans quickly got the ball back and struck again with a 26-yard touchdown pass to Hopkins. Bortles promptly threw a pick-six to Hal, who jumped the route and returned it 31 yards for a score. The game was essentially over after that play. In garbage time, Bortles threw a short touchdown pass to Allen Hurns, but the bad news was that Allen Robinson went down with a leg injury on that drive. ",
            "4": "DeAndre Hopkins was the fantasy star of the game with 10 receptions for 148 yards and two touchdowns. For some strange reason, the Jaguars resisted sending double coverage to Hopkins, who ate up man coverage. ",
            "5": "Brian Hoyer completed 24-for-36 for 293 yards with three touchdowns. He played an efficient game for the Texans and was more steady than what they had received under Ryan Mallett. ",
            "6": "Arian Foster finished with 53 yards on 18 carries. He did more damage through the air with 59 yards on five receptions and a touchdown. Foster had a fumble that Houston recovered. ",
            "7": "Bortles was 30-of-53 for 331 yards with three touchdowns and three interceptions. The Texans' pass rush rattled Bortles into a number of misguided throws. ",
            "8": "With T.J. Yeldon out, the Jaguars' rushing attack was nonexistent. They were led by Toby Gerhart (9-26) and Denard Robinson (7-19). ",
            "9": "Allen Robinson had six receptions for 86 yards and a score. His injury is worth monitoring for fantasy rosters. Allen Hurns (2-30) and Julius Thomas (7-78) each caught touchdowns. ",
            "10": "The Texans' defense played their best game of the season. J.J. Watt was pressuring Bortles all game. Whitney Mercilus had two sacks, including burning Luke Joeckel on an impressive spin move. Andre Hal's two interceptions led to a 14-point swing for Houston. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "13"
        },
        "comments": {
            "amount": "10",
            "1": "EDITOR'S NOTE: I'm a conspiracy theorist, but this was an obvious fix. It was so blatant that I received a text saying, Ed Hochuli should've been arrested for this performance. There was a shady roughing-the-passer penalty on Arizona early in the game. The Pittsburgh defender led with his helmet on John Brown's fumble, yet it wasn't called. Martavis Bryant was out of bounds before the second foot landed in the end zone, yet the play was never reviewed. Carson Palmer was hit late, yet no roughing-the-passer was called. A defensive pass interference on Pittsburgh was nullified mysteriously. There were other shady things going on, but I'm getting tired of typing. It was unreal. It's not a matter of whether or not this game was fixed; it's only a question of who happened to pay off Hochuli. ",
            "2": "Bruce Arians' homecoming looked like it would be an inevitable win, even though the Cardinals' offense wasn't getting into the end zone, because Mike Vick was so unbelievably bad. At halftime, the Steelers had totaled just 59 yards, while the Cardinals had 279, but astonishingly, the score was 10-3 Cardinals (Editor's Note: Read the previous editor's note to understand why). ",
            "3": "Carson Palmer and company were moving the ball with ease through the air, and he and Michael Floyd connected in the first quarter for a 3-yard touchdown. But that was the only touchdown Arizona would score all day. Floyd was called for offensive pass interference, which wiped away what would have been his second touchdown. The Steelers' defense played the epitome of bend, but don't break defense, picking Palmer off twice and stopping the Cardinals on 58 percent of third downs. ",
            "4": "Palmer was not his usual, accurate self and relied on some big receptions from his receivers, especially John Brown, who continues to show his immense ability. Brown made catches all over the field on his way to a big day, finishing with 10 receptions on 14 targets for 198 yards. All three were career highs for him. The only blemish, and it was an ugly one, was a fumble which set up the go-ahead touchdown for the Steelers. ",
            "5": "Vick was stuck on negative passing yards for most of the first half, and by the time he left in the third quarter, he was 3-for-8 for six yards. He ended up leaving due to a hamstring strain or possibly was just benched for Oklahoma Sooners product Landry Jones. Jones had never shown much ability in his three years with Pittsburgh, and just the fact that he hadn't taken over for Vick already showed exactly what coaches thought of Jones. But he came to play this week. After Vick went down in the third quarter, Jones quickly showed he should have been in the game the whole time with an 8-yard touchdown pass to Martavis Bryant, which put the Steelers up 12-10 after having barely moved the ball all game. And it wouldn't be the last time Jones found Bryant for a touchdown. With a five-point lead and 2:15 left in the game, Jones hit Bryant on a crossing pattern that he took 88 yards to pay dirt. ",
            "6": "Bryant ended up catching 6-of-8 targets for 137 yards and two touchdowns in his first game back from suspension/injury, while Patrick Peterson shadowed Antonio Brown. Peterson coupled with Vick for over a half, led to Brown having his third down game in a row. He might have done a bit more if Jones would have been at the helm, but more than anything, Brown needs Ben Roethlisberger back - and soon. ",
            "7": "Le'Veon Bell did well to gain 88 yards on 24 carries as the Cardinals' tough run defense was able to key on the Steelers' ground game for most of the day. The bad news for Bell's fantasy backers were his zero targets, which somehow led to zero receptions, which is the first time Bell has ever gone catchless in a game. ",
            "8": "Pittsburgh pass defensed a whopping eight passes, which shows you not only how swarming the Steelers were, but also how Palmer was not always on target. He ended up completing 29-of-45 passes for 421 yards with one touchdown and two interceptions. ",
            "9": "The Steelers are amazingly 2-1 while Ben Roethlisberger has been out, and they probably should have won that Thursday night game against the Ravens. When Roethlisberger does return, this offense is going to be crazy good, and their defense has seemed to step up during Roethlisberger's absence as well. ",
            "10": "The Cardinals may have taken a slight step back this week, but their core is strong. This game should just be a bump in the road. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: It turns out that all the Dolphins needed this entire time was to have their privileges checked. PC Head Coach means business, so don't count out Miami yet. ",
            "2": "The Miami Dolphins may have more than a new head coach. For one day at least, the Dolphins had a whole new team. Miami looked like Don Shula was back at the helm in a 38-10 victory against the Tennessee Titans on Sunday. After firing head coach Joe Philbin last week, the Dolphins played their first game with interim head coach Dan Campbell. The results couldn't have been more impressive for a team that had lost three-straight games under Philbin. The fiery Campbell brought a whole new attitude to the Dolphins, and the results were obvious. For the first time all season, the Dolphins had a running game and a pass rush. Again, it was only one game. But if the Dolphins (2-3) can continue to play this way, Campbell could have a shot at keeping the job on a permanent basis. For the Titans (1-4), they lost their fourth-straight game and showed nothing positive on offense or defense. ",
            "3": "From a fantasy standpoint, the biggest story of the day was Miami running back Lamar Miller. Miami's running game had been non-existent in the first four games. But Miller was hot on Sunday. Miller had 19 carries for 113 yards and a touchdown. He was a guy you wanted to stay away from in fantasy leagues - until this week. Under Campbell, the Miami offense, which had passed the ball 73 percent of the time in the first four games, appears like it will be a much more balanced approach. In other words, pick up Miller now. He's worth a fantasy play if the Dolphins keep playing like this. Miller's touchdown was the first rushing score by the Dolphins this season and their first touchdown in the first quarter this season. ",
            "4": "Miami quarterback Ryan Tannehill, despite lots of help from the running game, had an up-and-down day. Tannehill completed 22-of-29 passes for 266 yards and two touchdowns. That alone would have been nice. But Tannehill was intercepted twice. ",
            "5": "Don't get too carried away about picking up Miami's weapons in the passing game. Rishard Matthews had six catches for 85 yards. But Tannehill's passes were split among eight different receivers. ",
            "6": "The Dolphins showed a pass rush for the first time all season. Cameron Wake had four sacks, and Ndamukong Suh was a presence for the first time this season. ",
            "7": "For the Titans, rookie quarterback Marcus Mariota continued to struggle. Mariota completed 21-of-33 passes for 219 yards with one touchdown, but was intercepted twice. Mariota appeared to injure his leg in the second half. But, he stayed in the game even though he noticeably was limping. ",
            "8": "If you've made the mistake of having a Tennessee running back on your fantasy team, get rid of him now. The Titans have no running game (and that's part of the reason Mariota is having problems). Antonio Andrews and Dexter McCluster each had 23 rushing yards to lead the Titans. ",
            "9": "The lone fantasy bright spot for Tennessee was tight end Delanie Walker, who had eight catches for 97 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "23"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: What's happened to Seattle's homefield advantage? The team used to be invincible as hosts, yet it was lucky to get a win against the Lions and then followed that up with a loss to the Panthers. I mean, they're not the Chargers or Rams who can't even get a sellout if they pay their fans to come to the game, but the Seahawks need to stop struggling at home. ",
            "2": "The Carolina Panthers have made their statement. They might be the best team in the NFC. Heck, they might be the best team in the NFL. Question what the Panthers did in their first four wins. But don't question what they did in their fifth victory. The Panthers (5-0) went in to CenturyLink Field, complete with its famous 12th Man, and walked away with a victory. Quarterback Cam Newton hit tight end Greg Olsen with a late touchdown pass to seal a 27-23 victory. Count that as Newton's coming-out party. Newton and the Panthers entered the game 0-4 against the Seahawks (2-4) in the last three years, including a playoff game last season. But the Panthers went across the continent and got a win against a team that has been very good the last few years. You now can list Carolina among the Super Bowl favorites. Newton had struggled in the last four meetings with the Seahawks, but he got the job done this time. ",
            "3": "Newton can be streaky, but he came through in the clutch this time. His scoring pass to Olsen was perfect. Newton completed 20-of-36 passes for 269 yards with two interceptions. Newton, however, made up for the turnovers with a passing touchdown and a run for a score. He remains a player you have to start in any fantasy league. ",
            "4": "Speaking of players who must start in fantasy leagues, you have to begin with Olsen. Even though he's getting heavy coverage, Olsen had seven catches for 131 yards and the touchdown. ",
            "5": "Carolina had some nice balance in its offense. Jonathan Stewart had 20 catches for 78 yards with two touchdowns. Stewart is worth a start in any fantasy league. ",
            "6": "Seattle quarterback Russell Wilson continued his season-long slump and is not a player you want on your fantasy team. Wilson completed 18-of-30 passes for 239 yards with one touchdown and not interceptions. Wilson is supposed to be a running threat, but he wasn't against the Panthers, gaining 53 yards on eight carries. ",
            "7": "Marshawn Lynch was healthy, but he wasn't much of a factor. Lynch had 54 yards and a touchdown on 17 carries. ",
            "8": "The best thing Seattle had going for it was the play of tight end Jimmy Graham. A lot has been made, including by me, how Graham hasn't validated the trade from New Orleans that brought him to Seattle. But Wilson finally was able to make Graham a part of the offense. Graham had eight catches for 140 yards, but he did not reach the end zone. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: The Ravens remind me of the Saints last year. They had Super Bowl expectations, but struggled at the beginning of the year. Everyone expected them to eventually rebound, but it never happened. Baltimore has so many injuries that it's dealing with; I don't know how the team can possibly bounce back. ",
            "2": "Three years ago, these teams met in the Super Bowl, and now, they were rematching for the first time, but with each squad being more in contention for the No. 1-overall pick than for the postseason. San Francisco got some revenge as by ending a four-game losing streak, while the Ravens suffered another close loss. 49ers quarterback Colin Kaepernick made enough big throws downfield, and the Ravens' weak secondary was inept in coverage. ",
            "3": "San Francisco put two field goals on the board in the first quarter. The big plays of each drive were passes from Kaepernick to fullback Bruce Miller. The first went for 28 yards, and the second was for 52 yards in busted coverage by Baltimore. Each drive stalled, but Phil Dawson was good on his attempts, including a 53-yarder. The Ravens started to move the ball thanks to a nice kick return. The big play that led to a field goal was Flacco hitting tight end Crockett Gilmore for 19 yards. Kaepernick responded immediately as Torrey Smith burned new Raven Shareece Wright for a 76-yard touchdown. While he's struggled on some deep throws, Kaepernick threw that bomb perfectly. With the 49ers up 13-3, Flacco was picked off by forcing a pass to a covered receiver. Linebacker Michael Wilhoite cut in front of the ball, and that gave the 49ers another field goal. The Ravens answered with a field goal drive of their own. The 49ers took a 16-6 lead into the half. In the third quarter, Flacco threw an awful pass. It was late down the middle of the field, off his back foot, and up for grabs like a punt, and dropped in to San Francisco cornerback Kenneth Acker. A pop pass to Anquan Boldin led to a 27-yard gain and another Phil Dawson field goal. Acker found that Flacco giveth and taketh away, as Steve Smith got away with a push off of Acker for a 34-yard touchdown. Another Baltimore drive went into San Fran territory, but Justin Tucker slipped on the field goal attempt and it hit off the upright no good. San Francisco took advantage again of the Ravens' weak secondary as Kaepernick laid out a pretty 51-yard bomb that Boldin made a superb catch to Baltimore's 25-yard line. A few plays later, Quinton Patton got wide open in the end zone after Shareece Wright fell down, and Kaepernick hit him for a 21-yard score. A missed two-point attempt had the 49ers' lead at 25-13. Midway through the fourth quarter, the Ravens weren't quite done as they drove down the field. On fourth-and-goal, Kamar Aiken made a leaping catch for a score. Baltimore got the ball back with a little over a minute remaining, and needing to go 80 yards, but the 49ers' defense came up with a stop led by Eric Reid breaking up a pass in the end zone on the final play of the game. ",
            "4": "Kaepernick was 16-of-27 for 340 yards with two touchdowns. He threw the ball best when he scrambled out of the pocket. Don't expect similar performances going forward, as Baltimore's secondary has given up big outings to all quarterbacks. ",
            "5": "Baltimore's run defense held Carlos Hyde to 55 yards on 21 carries. Hyde appeared to injure his ankle at one point, but remained in the game. ",
            "6": "Anquan Boldin had five receptions for 102 yards. Torrey Smith (3-96) and Quinton Patton (2-38) caught Kaepernick's touchdowns. Most of Smith's production came on his score. ",
            "7": "Joe Flacco was 33-of-53 for 343 yards with two touchdowns and two ugly interceptions. ",
            "8": "Ravens running back Justin Forsett had 62 yards on 17 carries with seven receptions for 39 yards. Even though he was questionable prior to kickoff, Baltimore didn't use him enough. ",
            "9": "Steve Smith led the Ravens through the air with 137 yards on seven receptions. Not bad for someone who told reporters that he wouldn't be able to play earlier in the week. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Packers have improved to 6-0, but did so very unimpressively. Their offense was stagnant except for a few big plays in the first half, while their defense had no solution for Philip Rivers, who was on fire. All Rivers did was set single-game franchise records for completions (43) and passing yards (503). Rivers went 43-of-65 for 503 yards and two touchdowns. This was extremely surprising because of how banged up San Diego's offensive line was heading into the contest. The Chargers were missing three starting blockers, which was a problem for them Monday night. It was expected to be an issue once again versus a ferocious pass rush, yet it wasn't. Rivers was sacked a couple of times, but he fired tons of quick passes that the Packers had no answers for. Rivers also had some deep completions, which he inexplicably had ample time to convert. Though the Chargers moved the chains extremely well, racking up a ridiculous 548 net yards, they had trouble in the early going. Melvin Gordon fumbled in the first quarter and was extremely fortunate that D.J. Fluker recovered it because there were tons of Packers around the ball. Rivers then was lucky to have a dropped interception and missed Antonio Gates for a touchdown because he was hit as he threw. On a later drive, Gates couldn't quite haul in a pass on fourth down in the red zone. San Diego was stuck on three points just prior to halftime, but on the final play prior to intermission, Mike McCoy decided to take a chance and go for it rather than kick a field goal. The gamble worked, as Rivers threw a touchdown to Dontrelle Inman. This seemed to ignite the offense, as Rivers racked up 298 yards in the second half alone. ",
            "2": "Nearly a third of Rivers' yardage went to Keenan Allen, who hauled in 14 of the 15 passes thrown to him for 157 yards. Unfortunately for Allen, he suffered a hip injury in the second half and never returned. ",
            "3": "Believe it or not, Allen wasn't the team leader in targets. Gates held that distinction with 16. He reeled in nine balls for 95 yards. Malcom Floyd matched that yardage total on five catches (12 targets). ",
            "4": "Allen wasn't the only Charger who suffered an injury. Melvin Gordon also limped off. He actually returned to the game and promptly fumbled. I actually thought the Chargers were better off without Gordon because A) he's very fumble-prone, and B) Danny Woodhead is a more-efficient player. The Chargers apparently agreed because they didn't use Gordon in the second half. Woodhead had far fewer yards on an equal seven rushes (29 to 8), but he was so much better as a weapon in the passing attack. He snatched five receptions for 63 yards. He also didn't cough up the ball. ",
            "5": "Before I move on to the Packers, Rivers' touchdowns went to Ladarius Green (3-35) and Inman (3-18). Inman saw seven targets, but isn't much of a fantasy option unless Allen and Stevie Johnson miss more time. ",
            "6": "Aaron Rodgers' passing numbers paled in comparison to Rivers', but then again, Rodgers never trailed, so he didn't need to throw. However, Rodgers still looked off. Perhaps it was because Ty Montgomery left with an injury (carted off), and Randall Cobb isn't 100 percent, and his offensive line is iffy, but Rodgers still missed some throws he ordinarily makes. At the end of the game, Rodgers had Richard Rodgers open in the end zone twice, but overthrew him on both occasions. As a consequence, Rivers had a chance to tie at the very end, but came up just a bit short. Rodgers finished 16-of-29 for 255 yards and two touchdowns. Those aren't bad numbers, by any means, but Rodgers simply didn't look right. His receiving corps and offensive line need to improve. The Packers have a bye week to get their act together. ",
            "7": "Panic time for Eddie Lacy owners? Lacy was given just four carries, which he turned into three yards. Jim Nantz mentioned that Lacy had a tender ankle, which begs the question, why did he even play? Lacy looked slow and sluggish. He also fumbled, but was fortunate to have a teammate fall on the ball. James Starks, on the other hand, gained 112 yards and a touchdown on just 10 carries, with most of his production coming on a 65-yard sprint to the end zone early on. Starks also caught a 5-yard touchdown on his only catch. ",
            "8": "I mentioned earlier that Cobb is hurting. That was apparent, as he was able to catch just two balls for 38 yards. He also was guilty of a drop. James Jones had even fewer yards (2-30), but at least caught a touchdown. With Montgomery getting knocked out, Jeff Janis led the team with 79 receiving yards on two catches. He was targeted four times, though only one less than Cobb, Richard Rodgers and Jones. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "27"
        },
        "comments": {
            "amount": "10",
            "1": "All the talk entering this game was how the Patriots would be pissed off that the Colts accused them of cheating in the Deflategate scandal. Many thought New England and an angry Tom Brady would win by seven or so touchdowns, covering one of the most absurd point spreads ever posted in NFL history. However, Indianapolis matched the intensity level of the Patriots, as this was clearly a revenge game for the AFC Championship defeat. This was a fairly even game until one of the most ridiculous play calls anyone has ever seen. You've all seen it by now. If not, the Colts, down just six points at the end of the third quarter, lined up in a strange formation on fourth down. One player was behind the center, while everyone else was on the right side of the line of scrimmage. It resembled a swinging gate, except one door of the gate was broken. There was no way the player behind center was going to have any success because it was a two-versus-five situation. However, the Colts snapped it anyway, resulting in a quick loss. If that wasn't horrible enough, Indianapolis was whistled for an illegal formation, turning something awful into sadly hilarious. A clueless Chuck Pagano kept asking, Why'd you snap it? on the sideline, but the question that needs to be asked to Pagano is, Why line up like that in the first place? It was a stupid play that was never going to work. Why risk it then? This sort of thing warrants a firing, and if the Colts weren't in such a terrible division and a lock to reach the playoffs as a result, they'd probably fire Pagano right now. That play was absolutely a fireable offense. It was ridiculous. The failed conversion took the air out of the tires for the Colts and set up an easy touchdown for the Patriots, who went up two scores. That inexplicable decision pretty much ended up costing Indianapolis the game; again, it was just a six-point margin beforehand. ",
            "2": "The Colts eventually scored a late touchdown to draw within one score and covered the spread in the process. It took a tough effort, as Andrew Luck struggled in the second half. His overall numbers were solid - 30-of-50, 312 yards, three touchdowns; four carries, 35 rush yards - and he started hot, completing his first seven passes for 57 yards, but could've easily had several turnovers. Luck had three interceptions dropped, and he sailed a bunch of passes over his receivers' heads. He also failed to see an open Coby Fleener for a crucial first down in the middle of the fourth quarter. Luck definitely isn't 100 percent, so the Colts' only chance to advance deep into the playoffs is if he heals up by January. ",
            "3": "Of course, it would help if the Colts' offensive line improved. The blocking unit was at it again; it surrendered three sacks (2.5 by Chandler Jones), and the number would've been much greater had Luck not been so mobile. The front line was also guilty of countless holding penalties. It seemed like a hold bogged down a drive every time it got something going, including a third-and-14 conversion in the second half. In total, Indianapolis was whistled for 11 penalties, most of which were crucial. ",
            "4": "Luck's touchdowns went to T.Y. Hilton (6-74), Donte Moncrief (6-69) and Griff Whalen (2-30). Moncrief led the team with 11 targets, edging out Hilton's nine. Andre Johnson (3-35) disappointed after his brilliant Thursday night performance. ",
            "5": "Frank Gore ran well, but the Colts for some reason didn't attempt to establish him more. He gashed the Patriots for 78 yards on just 13 attempts. ",
            "6": "Moving on to the victors, Brady, expected to be in F-U Mode, had just a solid game. He went 23-of-37 for 312 yards, three touchdowns and a pick-six, though that wasn't his fault (more on that in a second.) Brady took advantage of some blown coverages by the Colts, but he struggled to move the chains in the second half, save for the short drive following that absurd fake punt play. Perhaps the reason Brady didn't meet everyone's expectations and throw for 500 yards and five touchdowns was because of Julian Edelman's injury. Edelman dislocated his pinkie finger, which was a scary sight because the digit was bent perpendicularly. Edelman thrived beforehand, but struggled after that. He dropped two passes and then bobbled a ball that bounced into the hands of Mike Adams, who took it back for a score. Edelman still pleased his fantasy owners with six catches, 50 yards and a touchdown, but it looked like he was in for a much bigger night. Adams, by the way, was also injured and missed the entire second half. ",
            "7": "With Edelman hurt, Danny Amendola picked up the slack. He caught seven passes for 105 yards, both of which were team-high figures. Rob Gronkowski, meanwhile, had trouble getting open because the Colts swarmed him, yet he still snatched three receptions for 50 yards and a score. ",
            "8": "The Patriots weren't sure if they'd have Dion Lewis for this contest because of an abdomen injury he sustained in practice. Thus, they fired up LeGarrette Blount again, as he rushed for 93 yards and a rushing touchdown on only 16 carries. He also scored on a receiving touchdown on his only catch. Lewis touched the ball seven times. He had 21 rushing yards on four attempts and 18 receiving yards on his three catches. ",
            "9": "New England, already down Nate Solder, also lost replacement Marcus Cannon in the first half. Brady's protection wasn't ideal as a result after Cameron Fleming was inserted into the lineup. ",
            "10": "The Colts' failed trick play provided a great laugh, but the best part of this game was when Al Michaels trolled bettors and sportsbooks everywhere. He acknowledged that the over-under on Deflategate being mentioned was four, so he intentionally said it four times in a row after mentioning it for the first time. I'm willing to bet that Michaels has an offshore book account that placed a heavy wager on the over on that particular prop before kickoff. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "This was one of the most frustrating games in recent memory. Both teams constantly shot themselves in the foot, and for a while, it didn't seem like either squad wanted to win this matchup to claim first place in the NFC East. The Eagles eventually pulled away, but it was a very unimpressive win on their part. Sam Bradford is not a good quarterback. He threw for 280 yards on 24-of-38 passing, but was guilty of three interceptions, and his touchdown drives all came after horrible mistakes by the Giants (more on that later). Bradford's first pick was a floater that sailed on him. The second wasn't entirely his fault, as Riley Cooper stopped his route. The third was an underthrown toss to Zach Ertz in the end zone, which Landon Collins was able to haul in. Bradford didn't have a terrible night, and he made some decent throws, but he's a liability who doesn't give Philadelphia much of a chance to advance deep into the postseason. ",
            "2": "DeMarco Murray managed to eclipse the century mark, gaining 109 yards and a touchdown on 22 carries. However, Murray had issues again early on. He was limited to just 12 yards on five attempts by halftime. The Giants simply wilted down on the defensive side of the ball because they were on the field so long. They were too tired to tackle Murray at the end, and he was able to burst for a 21-yard gain on the final drive to get him to that 100-yard barrier. Murray did have a blemish earlier in the contest, when he fumbled the ball on a botched exchange with Bradford deep in his own territory. The score was 24-7 at the time, so a quick New York score would've made it just a 10-point margin. However, the Eagles managed to recover the ball and were consequently able to maintain their big advantage. Meanwhile, Ryan Mathews gained 40 yards on nine carries. ",
            "3": "Jordan Matthews led the team with 11 targets, but managed to secure just six passes for 59 yards. Matthews hurt the team by losing a fumble in field goal range in the third quarter. Riley Cooper, meanwhile, paced Philadelphia with 76 yards on three catches, one of which was a touchdown. Cooper caught a 43-yard bomb early in the third quarter, and his score was a 32-yarder in the opening quarter. ",
            "4": "It was surprising that Darren Sproles didn't get many touches. He had the ball in his hands just three times, which he transformed into just seven yards. He had a nice punt return, but did nothing else. He also appeared to be concussed at one point, but was cleared to return to action. ",
            "5": "Before I move on to the Giants, Jason Kelce needs to be mentioned. The struggling center continued to play poorly. He had a botched snap, which turned into an 18-yard loss. He was also whistled for a hold, which disrupted a Philadelphia drive. ",
            "6": "As sloppy as the Eagles were, the Giants made them look like they had an Aaron Rodgers-led offense. Eli Manning actually began the game on fire. He completed his first 10 passes for 87 yards. He marched the team down the field on the opening drive for a touchdown and appeared to be doing the same thing on the second possession when DeMeco Ryans pulled away the ball from Larry Donnell for what turned out to be an interception. It appeared to be a fluke play, so the Giants were still expected to be highly efficient offensively. However, doubt began to creep in when Manning was pick-sixed on two drives after that. He telegraphed a late throw, which Nolan Carroll took back the other way. It was more of the same for the Giants the rest of the night, on both sides of the ball. The defense, as mentioned, made some horrible mistakes. Damontre Moore, for some reason, slammed Bradford into the turf when New York had forced a punt. This kept the drive alive for the Eagles, who ended up scoring a touchdown. Later, the Giants ran into the punter, allowing Philadelphia to continue its possession. This led to a touchdown. At the end of the third quarter, when this game still wasn't decided, an illegal substitution negated a safety on a Bradford sack, and that permitted Philadelphia to continue its drive, and, no, not score a touchdown, but the team switched field position and ate up time on the clock. As for the offense, following the pick-six, the Giants went three-and-out a whopping six of seven drives, with the lone exception featuring just one first down. The offensive line couldn't pass protect for Manning whatsoever. Manning, who was able to release the ball very quickly at the beginning of the game, was suddenly smothered almost every time he dropped back to pass. Right tackle Marshall Newhouse was especially brutal. Connor Barwin abused him relentlessly. Manning went 24-of-38 for only 189 yards, one touchdown and the two picks. If you exclude his first 10 passes, however, he was just 14-of-28 for just 102 yards and two interceptions, which would give him a 3.64 YPA, a truly horrifying number. Manning could've easily been picked several other times. Take away the first two drives, and Manning had one of the worst quarterbacking performances of the season. He's only excused from all the blame because he couldn't be protected, but he tossed many questionable passes. ",
            "7": "Manning didn't get much help from his supporting cast. I already mentioned Donnell (3-29) and his interception. Donnell also had a crucial drop deep downfield, which resulted in a fourth-down stuff on Rashad Jennings on what was a very stupid call. The Giants basically telegraphed the run versus a strong rush defense. Manning was still hot at that point, so New York should've either thrown the ball or called a sneak. Speaking of Jennings, his rushing numbers weren't bad (13-63), but he was guilty of fumbling when Ryans ripped the ball out of his hands. Ryans was on track to have a huge night, but was knocked out with a hamstring injury. Meanwhile, whenever Andre Williams got the ball, it was a waste of a down. Williams mustered just six yards on five carries. The Giants have to stop using him entirely. ",
            "8": "Odell Beckham Jr. was questionable heading into the contest. He looked like he was healthy in the first half, but saw just one target following intermission, which was a Manning overthrow. Beckham caught seven balls for 61 yards and a touchdown - production that all occurred in the opening half. Rueben Randle (5-44) looked like he was beaten up as well as the eveningprogressed. ",
            "9": "The officiating in this game was disgraceful. There were so many bad calls. Manning was whistled for intentional grounding even though Shane Vereen was clearly in the area. Prior to halftime, the clock didn't start, so the Eagles got extra time after the referees threw a flag for no reason. Later in the game, the officials didn't allow the Giants to subsitutute when the Eagles did. By rule, New York should've been allowed to change personnel, but the team wasn't given that luxury, and it was called for 12 men on the field as a result. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}