{
    "year": "2015",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "21"
        },
        "comments": {
            "amount": "9",
            "1": "The media is going to talk about Tom Brady as the big story in this game. And why not? Regardless of whether or not it was his fault, Brady had to endure Deflategate and everything that came with it, from an NFL investigation, to appearances in court. Brady's suspension was nullified just days ago, so he was able to take the field in the season opener. How would he do after a disastrous preseason? Well, pretty much as expected. Brady was projected for 300 yards in our <a href=/fantasyweeklyrankings/QB>Fantasy Football Week 1 Rankings</a>, and he almost got there, going 25-of-32 for 288 yards and four touchdowns. Brady's numbers look very impressive, but statistics can often be deceiving. Brady performed well, given the circumstances, but those circumstances were very easy. The Steelers have one of the worst defenses in the NFL. In fact, if it weren't for the Redskins, they just might own the league's worst stop unit. The team fielded a poor defense last year, and it lost Dick LeBeau and Troy Polamalu this offseason, so how could it possibly improve? It actually looks so much worse, and it's far beyond the personnel. Don't get me wrong, Pittsburgh has a ton of crappy players starting on its stop unit, but the main issue is the defensive coordinator. LeBeau's replacement, Keith Butler, did a horrible job of coaching in this game. The players were often lining up in the wrong spots, and they were guilty of so many blown coverages and missed assignments. It was pathetic to watch. Perhaps things will get better - nine days off could help - but I doubt the situation will improve very much. Pittsburgh fans yearning for the days of the Steel Curtain are going to be in for a very long season. Going back to Brady, and him doing everything that was expected of him, most of his completions were checkdowns to Julian Edelman and short throws to Rob Gronkowski. In fact, Brady's only pass longer than 20 yards was a 52-yarder to Gronkowski in which he fired a quick ball to Gronkowski, who was inexplicably wide open down the seam. There was no Pittsburgh player within 15 yards of him. It was insane that the Steelers could simply forget to cover him. They are going to be an abomination on that side of the ball this year. Brady attempted a few deep passes. He connected on one, and even that was just an 18-yarder. Elsewhere, Brady missed an open Danny Amendola down the sideline and then floated a pass over his receiver's head for a fifth potential score. Brady displayed great accuracy and a quick release in the short game, but he did absolutely nothing impressive downfield. In other words, he played exactly like Alex Smith on a good day, and I have to believe that a competent defense will be able to contain New England's offense. More on that later, but in the meantime, I'd attempt to sell-high and trade him to someone else. ",
            "2": "I mentioned that Brady was the media's top story. To me, it was the horrible coaching job by Mike Tomlin and his staff. It was so frustrating watching this team, and I'm not just talking about Butler's ineptitude on the defensive side of the ball. A poor effort by the stop unit was expected. The offense, however, was supposed to click better than this. Every time the Steelers had momentum going, they screwed up somehow. It started on the opening drive when they were ripping off 10 yards per play, and yet Todd Haley inexplicably tried a trick play that lost yardage. A holding penalty derailed the next drive. Then, a procedural penalty. After that, there were drops by Markus Wheaton in the red zone and a potential touchdown ruined by Darrius Heyward-Bey because his foot slid out of bounds as he was making the catch. Things looked slightly smoother in the second half until the Steelers false started on the 1-inch line, forcing a field goal. Ben Roethlisberger then fired a pass into double coverage that was intercepted. On the following drive, Pittsburgh failed to line up correctly on multiple occasions. By the time Roethlisberger threw a touchdown to either push or cover the spread, time had pretty much expired, all because of horrible clock management. ",
            "3": "There were two bright spots for the Steelers. The first was Antonio Brown. As expected, he dominated, catching nine balls for 133 yards and a touchdown. The second was DeAngelo Williams, who was running like it was 2008. Williams found big holes through a Vince Wilfork-less defensive line, gaining 127 yards on 21 carries. Rookie Malcom Brown struggled, while Dominique Easley was sent into the locker room with a hip injury. ",
            "4": "Roethlisberger, meanwhile, went 26-of-38 for 351 yards, one touchdown and the aforementioned interception. Those numbers are a bit deceiving, as a big chunk, as well as the score, came in garbage time. However, Big Ben also was betrayed by dumb mistakes, like the Heyward-Bey botched touchdown and some drops. Roethlisberger also had to target Heyward-Bey instead of the suspended Martavis Bryant, while center Maurkice Pouncey was missed. ",
            "5": "One other Steeler worth mentioning is Heath Miller, who snatched eight balls for 84 yards. Miller was his usual, steady self. ",
            "6": "While Miller played well, he wasn't nearly as dominant as his counterpart. Gronkowski was a beast, hauling in five balls for 94 yards and three touchdowns. He's one of the top play-makers in the NFL, though it helped that the Steelers completely forgot about him on a couple of occasions; once on the 52-yarder, and another time when he scored one of his touchdowns. ",
            "7": "I mentioned that Brady threw four scores. His fourth touchdown was a one-yarder to Scott Chandler, who secured his only catch of the game. Elsewhere, Edelman logged 11 receptions for 97 yards. It seemed like he was even more fired up than Brady, as he talked trash after every catch. ",
            "8": "Many may have been surprised by Dion Lewis' performance in the opener. I had him in the top five of our <a href=/fantasy2015sleepers.php>Fantasy Football Sleepers</a> list, so I'd recommend picking him up right away. Lewis gained 69 yards on 15 carries, and he also caught four balls for 51 receiving yards. He'll share carries with LeGarrette Blount, but he'll at least serve as the third-down back in Shane Vereen's old role. ",
            "9": "In terms of a betting aspect, I was frustrated that these two teams were matched up in Week 1 because I wanted to bet against both. Lo and behold, they pushed on the most common spread. Yes, the Steelers backdoored, but they should have covered anyway because aside from the mistakes, they were even - perhaps even ahead - of the Patriots. They outgained New England by 103 net yards, but those errors, plus two Josh Scobee missed field goals, distorted the score. Oh, and speaking of Scobee, had he missed the extra point at the very end of the game, that would have been the gambling moment of the year. I think Al Michaels would've had an aneurysm on the air. Going forward, these teams project as good fades. My Supercontest partner Matvei texted me, I'm underwhelmed by both of these teams tonight, and I couldn't agree more. The Steelers appear to be horribly coached, while the Patriots have major defensive issues of their own. Plus, it's very fair to still be skeptical about Brady. Any quarterback could've thrown checkdowns and looked great against this abomination of a Pittsburgh defense. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "I had the Bills pegged as a 7-9 team prior to what I saw in the preseason. However, Tyrod Taylor was very impressive, and on the podcast, I said that the Bills could legitimately win the AFC East with Taylor, as he looked like he could be a solid starter. As it turns out, my optimistic look at Buffalo may have actually been pessimistic. Taylor had a fantastic debut. He went 14-of-19 for 195 yards and a touchdown to go along with nine scrambles for 41 rushing yards, and he was every bit as good as those numbers indicate. He launched a perfect bomb to Percy Harvin for a 51-yard touchdown. One of his best plays was just an eight-yarder, but it moved the chains on third down. He stood in the pocket, took a bit hit, but managed to hit Robert Woods on a strike to move the chains. Taylor also proved to be elusive, escaping sacks and picking up first downs with his legs. He was awesome - much better than either Matt Cassel or E.J. Manuel would have been, though it's maybe worth noting that Cassel actually started. He was under center on the opening play, while Taylor was split out wide. I'm not sure what that was about, but I guess it doesn't matter. In terms of fantasy, Taylor may have gone undrafted in your league. If so, pick him up. His rushing ability makes him a viable fantasy option - at the very least as a backup with upside. ",
            "2": "Taylor was the big story in this game, but the primary reason the Bills prevailed was because of their dominant defense. Limiting Andrew Luck to just 14 points - and really just eight considering that a late touchdown came in garbage time - is no joke, especially without Marcell Dareus. Buffalo intercepted Luck twice and nearly secured some other turnovers. The first occurred on an underthrown ball that Ronald Darby picked off. The second was a desperation try at the end of the contest that was tipped into the air. Luck finished 26-of-49 for 243 yards and two touchdowns otherwise, but a lot of that came late in meaningless action. He couldn't even complete half of his attempts in the opening two quarters, going just 11-of-23 for 124 yards and a pick by intermission. ",
            "3": "Indianapolis fans have to be upset by the offense's lack of production. Granted, Buffalo may have the top defense in the NFL, but it's clear that the offensive line is a big problem. This was obvious heading into the offseason, yet Indianapolis' front office did nothing to fix it. An injury to Hilton is problematic as well. He sustained a knee bruise, ruining his seven-catch, 88-yard day. Jim Irsay said afterward that Hilton could be out for a few games. Frank Gore also got banged up with a calf problem, but came back into the game. Gore managed just 31 yards on eight carries. He'll be better in easier matchups. ",
            "4": "With T.Y. Hilton possibly out for a while, Donte Moncrief may step up. Moncrief collected six passes for 46 yards and a touchdown. The score came in garbage time, but he still looks like a promising fantasy option as long as Hilton is sidelined. Rookie Phillip Dorsett, meanwhile, struggled. He was guilty of a drop and a fumble. I would drop him if Hilton returns to the lineup because he's definitely behind Moncrief. ",
            "5": "Elsewhere for the Colts, Andre Johnson converted just four of 10 targets for 24 yards. Much like Reggie Wayne last year, Johnson struggled to separate, and he even dropped a two-point conversion try. It's still early, but he does not look like a good signing. ",
            "6": "Going back to the Bills, LeSean McCoy tallied 87 total yards, 41 of which came on the ground (17 attempts), with the rest off three catches. The Colts were able to bottle him up for the most part, though they somehow lost track of him on a 20-yard screen early on. Karlos Williams (6-55) vultured a touchdown away from McCoy, who also had a score wiped out by a penalty. ",
            "7": "Sammy Watkins, smothered by Vontae Davis, didn't come up with a single catch on three targets, thanks to Vontae Davis. Watkins is worth buying low. Harvin (5-79), a sell-high target, led the way in receiving, while Charles Clay (4-43) had a nice gain nullified by his own chop block. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Packers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "No Jordy Nelson? No problem. The Packers produced 31 points without one of their starting receivers, thanks to an unexpected, dominant performance from an old friend. James Jones came out of nowhere to run circles around Chicago's beleaguered secondary. He scored two touchdowns, and nearly had two more. One was negated by a hold while the second was a drawn pass interference in the end zone late in the game. It's a shame that the first one didn't count, as Jones made a brilliant catch in which he managed to get one knee inbounds while falling out of play. Jones, who caught four balls for 51 yards, had a very unexpected performance, considering the Raiders and Giants both ran him out of town. Jones seemed lazy, so the fact that he was able to come in and re-assimilate himself so quickly into the offense is a testament to how good Aaron Rodgers is. He needs to be added in all formats. ",
            "2": "Speaking of Rodgers, he misfired on just five occasions in this contest, going 18-of-23 for 189 yards and three touchdowns to go along with 35 rushing yards on eight scrambles. The Packers were slow to start offensively, as Rodgers and Davante Adams couldn't connect on an attempted back-shoulder throw, and another hold negated a long Rodgers scramble, but it was smooth sailing from there. ",
            "3": "Rodgers' third score went to Randall Cobb (5-38), while Adams (4-59), who led the team in receiving, reeled in deep pass in which he planted one knee inbounds along the sideline. The overall passing numbers were low because the Bears went completely ball control throughout the afternoon. ",
            "4": "Before I move on to Chicago, Eddie Lacy tallied 85 yards and a touchdown on 19 carries. He also caught two balls for 14 more yards, including a crazy, one-handed grab on a flip from Rodgers. ' ",
            "5": "The Bears looked better for a while, but it ended up just being the same old Jay Cutler. New offensive coordinator Adam Gase tried to move the chains with quick passes, and it seemed to work early on. However, Cutler made numerous mistakes. He took a sack in the red zone early on, and then appeared to fumble on the next drive, though he was bailed out by the replay review. Late in the game, Cutler was intercepted by Clay Matthews because he didn't see the linebacker. He was nearly picked on numerous other occasions throughout the afternoon. Cutler finished 18-of-36 for 225 yards, one touchdown and the pick. Cutler's longest pass, a 50-yarder to Marquess Wilson, occurred because Sam Shields, who had a rough afternoon, fell down. However, Cutler should've had a second score, but Matt Forte inexplicably dropped the ball. ",
            "6": "Forte was guilty of that drop, but he otherwise had a terrific afternoon, gashing the Packers for 141 yards and a touchdown on 24 attempts. He also caught five balls for 25 receiving yards. The Packers, who have serious issues at inside linebacker, sustained some injuries at that position in this contest. ",
            "7": "Cutler's score was thrown to Martellus Bennett (5-55), while Alshon Jeffery, who wasn't 100 percent heading into the game, snatched five balls for 78 yards. Both remain solid fantasy options, despite Cutler's ineptitude. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "The Panthers had major questions about their offense heading into the season, and yet they still remain unanswered. That's because they were playing the Jaguars, who once again proved that they aren't a legitimate NFL franchise. Cam Newton doesn't have a proven No. 1 receiver for the first time in his career, but it didn't matter much in this contest because the Jaguars couldn't cover anyone. Newton's numbers don't look great - he went 18-of-31 for 175 yards, one touchdown and an interception to go along with 35 rushing yards on 14 scrambles - but he made clutch plays when he needed to. He escaped a sack and found Jerricho Cotchery for a 24-yard gain during the later stages of the contest. After that, the Panthers took over deep in their own territory in the fourth quarter, yet managed to convert third down after third down to keep the ball away from Jacksonville. Newton completed a pass to Cotchery (4-45, TD), who fought to get beyond the marker. Newton then scrambled for a first down. This continued until the Panthers actually moved into field goal position to make this a two-score affair. Of course, Carolina's defense is primarily responsible for this victory. It didn't look good when Luke Kuechly left the game with a concussion, but the stop unit actually clamped down and played better after that, perhaps because every member of that stop unit knew that they had to step up with their leader gone. The defensive line gave Blake Bortles no room to breathe. They constantly swarmed him and accumulated five sacks, mostly past the left tackle spot, which was vacated by an injured Luke Joeckel. Sam Young, who took over for Joeckel, was anemic. If he has to start going forward, the Jaguars may not score any points against anyone. ",
            "2": "Going back to Newton, his numbers definitely could've been better. Ted Ginn (2-54) dropped a touchdown, and then Greg Olsen had a score nullified by his own offensive pass interference, which was completely unnecessary because he would've caught the ball had he kept running. Newton's pick was probably a miscommunication, as the pass sailed to no one in particular. ",
            "3": "You may notice that Olsen disappointed, logging just one reception for 11 yards. The Jaguars were determined to take him out of the game, using bracket coverage constantly throughout the afternoon. The interference call really hurt his fantasy owners. Because of this performance, Olsen could be obtained as a buy-low target in fantasy leagues. ",
            "4": "Jonathan Stewart didn't have much running room, gaining 56 yards on 18 carries, but with most of it (22 yards) coming on one attempt. He also caught four balls for 25 receiving yards. ",
            "5": "As for the Jaguars, Bortles was anemic, going 22-of-40 for just 183 yards, one touchdown and two interceptions. The huge liability at left tackle really hurt him, but aside from a couple of impressive drives, he was woeful. His first pass was a poor overthrow, which was a sign of how the afternoon would go. One of the picks was taken back for six, as he telegraphed the throw. The other happened because he was hit as he released the ball. He also took some bad sacks. A few weren't his fault, as Young looked like a human turnstile, but Bortles struggled to release the ball quickly enough. ",
            "6": "Bortles' supporting cast didn't help him. I mentioned the offensive line on numerous occasions already, but the receivers let him down as well. Allen Robinson was guilty of a bad drop and had a horrible afternoon overall, logging just one catch for 27 yards. He missed time with an injury, but was able to return. He should be able to bounce back, however, so I like him as a buy-low target. Allen Hurns (5-60), meanwhile, fumbled in the red zone. Slot receiver Rashad Greene posted solid numbers (7-28, TD), but dropped a 30-yard pass that would've set up first-and-goal. And then there was the kicking game. Jason Myers, replacing Josh Scobee, whiffed on a 44-yard field goal and then missed an extra point. It's amazing that incompetent general manager David Caldwell can't even get his kicking situation correct. Why replace the reliable Scobee with some unknown? I know Scobee struggled in the season opener at New England, but that was in the rain. I'd have to believe that he would've been better than Myers in perfect conditions. ",
            "7": "Perhaps only one Jaguar offensive player performed well. That would be rookie T.J. Yeldon, who gained 51 yards on 12 carries. He also caught three passes for 16 receiving yards. It also should be noted that Hurns tried to make up for his prior mistake with a great catch along the sideline. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "The Browns' coaching staff may have thought they'd see Johnny Manziel at some point this year, but not this early. Josh McCown led what looked like a promising scoring drive in the first quarter, but fumbled short of the goal line when he took a big hit prior to flying into the end zone. He left the game, forcing Cleveland to use Manziel the rest of the way. Manziel had a nice start, but quickly reminded everyone of why he is one of the worst quarterbacks in the NFL. He was responsible for two horrible turnovers that set up the Jets for easy points. New York, hindered by an anemic offense that shouldn't be able to produce many points, suddenly found itself with 31-spot on the scoreboard. Manziel's give-away count was three. The first was an interception on an inaccurate throw toward Brian Hartline. The next two were fumbles. The initial one occurred when he was running around like an idiot and stripped as a consequence. The second happened on a blind-side strip-sack. The trio of turnovers were transformed into 14 points from Jets, meaning the score would've been 17-10, had Manziel not been careless. Perhaps the Browns could've mounted a comeback in a one-score affair, but Manziel gave them no chance. ",
            "2": "Having said that, I don't want to completely ignore what the Jets accomplished because they do deserve some credit for this victory. They had key contributions from their prominent players, including Brandon Marshall, who caught six balls for 62 yards and a touchdown. I wanted to lead off with Marshall right away because he appeared to save the day when the game was still in doubt. Ryan Fitzpatrick threw an interception, caught by Tashaun Gipson. Marshall, however, ripped the ball out of Gipson's hands, setting up the Jets with an easy touchdown. It was nice to see some effort from him, as he appeared to slack off throughout the 2014 season. ",
            "3": "Speaking of Fitzpatrick, he performed well, outside of the pick. He went 15-of-24 for 179 yards, two touchdowns and the interception. It was odd to see so much life from him, but then again, he was playing the Browns. It helped that he got a bit lucky early on, somehow recovering a fumble from a horrible snap on his own 2-yard line while being flipped over. There were four Cleveland defenders around the ball, but Fitzpatrick somehow came up with it. ",
            "4": "Chris Ivory had a very strong debut, showing why he should've been the primary ball-carrier last year instead of the overrated Chris Johnson. Ivory accumulated 91 yards and two touchdowns on 20 attempts. Ivory had a scoring reception wiped out by a James Carpenter hold, but he found the end zone on the same drive anyway. ",
            "5": "I mentioned that Marshall caught one of Fitzpatrick's touchdowns. The other was hauled in by Eric Decker, thought he managed just two receptions for 37 yards. He doesn't belong on 12-team rosters. ",
            "6": "Going back to the Browns, Manziel finished 13-of-24 for 182 yards, one touchdown, a pick and the two fumbles. I mentioned all of his mistakes before. He made a couple of nice plays early on, hooking up with Travis Benjamin for a 54-yard touchdown. He had a cool-looking first-down scramble, featuring a juke move, but that was negated by a chop block. However, the first fumble of his came immediately after that. He then overshot Andrew Hawkins, who was wide open in the end zone. As for McCown, he looked much more promising, going 5-of-8 for 49 yards. It seemed like the Browns were going to be much more competitive with him under center. I know McCown isn't very good, but he's light years ahead of Manziel. ",
            "7": "Manziel happened to be Cleveland's leading rusher; he scrambled five times for 35 rushing yards. More hilariously, McCown was second on the list! He managed 23 yards on three scrambles. Duke Johnson (7-22) and Isaiah Crowell (12-20) couldn't find any room against the Jets' stout front. They both should be owned in fantasy, just in case, but you shouldn't start either until further notice. ",
            "8": "Benjamin (3-89, TD) paced the Browns in receiving, but most of that came on the 54-yard touchdown. He's not any sort of fantasy option. ",
            "9": "A dark cloud over this victory for the Jets was the injury Antonio Cromartie sustained. Cromartie went down on a non-contact injury, which is never a good sign. He couldn't put any weight on his leg. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Rams",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "The Seahawks were heavily criticized for not running the ball when they needed one yard in the Super Bowl. Seven months later, they once again needed a yard to pull a victory. They ran it with Lynch, but he was stuffed at the line of scrimmage. Clearly, Seattle can't convert a single yard no matter what the team does. Seattle can't win in St. Louis, either. It appeared on a couple of occasions that it would be a complete role reversal from last year's upset. Early on, the Seahawks had the Rams pinned down for a near-safety. St. Louis had to punt from the back of its end zone, allowing rookie Tyler Lockett to score on the return. The Rams would go on to establish the lead, but the Seahawks eventually reclaimed it via a strip-sack returned for a touchdown by Cary Williams. With a seven-point advantage and just 4:39 remaining in regulation, it appeared almost guaranteed that Seattle would come away with a win. After all, the defense would just have to keep Nick Foles and his underwhelming supporting cast out of the end zone for less than five minutes. Well, it took less than four. The Rams marched down the field on an 84-yard touchdown drive to tie the game, thanks to a 37-yard scored by Lance Kendricks, who beat Dion Bailey. Of course, Bailey is the player replacing holdout Kam Chancellor, who was the only Seahawk who won on that tying score. The other members of the Legion of Boom struggled in overtime, as Foles dropped a ball beautifully in between Richard Sherman and Earl Thomas. That set up a field goal, and Lynch was stuffed on the ensuing drive. ",
            "2": "The big story within the game was the poor play of Seattle's offensive line. It simply couldn't pass protect for Russell Wilson, who took six sacks - a massive number for a player of his mobility. Wilson would often be under duress right after the ball got to his hands, which obviously disrupted so many drives. It's clearer than ever that the Seahawks miss Max Unger. The player they acquired for Unger, Jimmy Graham, logged six catches for 51 yards and a touchdown. Wilson overthrew Graham on one occasion, but the big tight end came back to haul in a score on the same drive. ",
            "3": "As for Wilson, he went 32-of-41 for 251 yards, one touchdown and an interception to go along with eight scrambles and 31 rushing yards. The completion percentage is legit, as Wilson definitely didn't struggle to throw, though his pick was a dumb attempt under pressure. It was the pass protection that betrayed him. Granted, the Rams have an elite defensive line, but this is going to be a theme all year. ",
            "4": "Lynch struggled to run for the most part, save for a few attempts. He opened the game by carrying half-a-dozen Rams for 10 yards, prompting the crowd to boo. Lynch also had a 24-yard burst later in the contest, but he was otherwise bottled up. He managed 73 yards on 18 tries, though he helped out in the passing game, notching five catches for 31 receiving yards. He'll definitely have better games against weaker fronts. ",
            "5": "The only Seahawk who rated higher in receiving than Graham was Jermaine Kearse (8-76). Don't get too excited, however, as a different wideout is expected to lead the Seahawks in yardage each week. Speaking of, Lockett (4-34) caught all the targets thrown to him, three of which came in the opening half. Doug Baldwin (7-35) had an embarrassingly low yards-per-reception figure. ",
            "6": "The Rams did win this game, by the way. I feel like I've barely talked about them, but that's because the Seahawks, as Super Bowl contenders, are the bigger story. But it was nice to see St. Louis prevail in an opener after suffering countless injuries to Sam Bradford over the years. Foles proved to be an obvious upgrade over all of Bradford's replacements, going 18-of-27 for 297 yards and a touchdown. I already mentioned one of his best throws, a perfect ball to set up the game-winning field goal. He had another great one where he somehow flipped the ball complete to Benny Cunningham while being tackled, and later on, he impressively converted a third-and-15 to Kenny Britt while rolling right. His only blemishes on the afternoon were a pair of fumbles. One was a botched snap near midfield, while the other was the aforementioned Seattle touchdown that appeared to give the Seahawks a victory. I'm interested to see how Foles plays going forward. A 34-point showing versus Seattle is impressive on the surface, but the Seahawks played terribly defensively. They couldn't generate a pass rush for the most part, and they inexplicably gave up big gains after short throws, primarily to Cunningham. That would explain how Cunningham generated 77 receiving yards on four catches (to go along with his 45 rushing yards on 16 carries). On one instance, Cunningham picked up a third-and-15 on a screen. The Seahawks from 2014 and before would never have allowed something like that. It's not like they allowed this to Todd Gurley. Cunningham won't even be on the field in a few weeks. ",
            "7": "St. Louis' leading receiver was tight end Jared Cook, who snatched five of the six targets thrown to him for 85 yards. Stedman Bailey (3-58) was next on the list after Cunningham, while Tavon Austin could never get going as receiver; he took a loss of nine on a catch in the first quarter. However, he scored twice; once on a 16-yard run, and another time on a punt return. No Rams receiver is worth owning - including Brian Quick, who was inexplicably a healthy scratch. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "Everyone picked the Dolphins to win, and I figured Miami would prevail in this contest, and yet I have no idea how they won. The Dolphins did not deserve this victory based on how they played for the majority of the afternoon. The Redskins controlled the ball for most of the opening half, as Ndamukong Suh was a non-factor; in fact, the only thing Suh did during the afternoon was kick Alfred Morris' helmet off his head (seriously). Washington was stuck on just 10 points beginning in the second quarter though, thanks to a missed field goal and some mistakes of its own, which I'll get to later. Miami made its own blunders on offense. Ryan Tannehill was just awful early; he missed Dion Sims on a late throw, forcing the tight end to dive to the turf. Sims sustained a concussion on the play as a result. Tannehill then tossed a checkdown on a third-and-4 in the red zone that would've been pointless had Miami not attempted a fourth-down try. Unfortunately for the Dolphins, they gave the ball to Damien Williams on a slow-developing play, which allowed Ryan Kerrigan to blow it up. Tannehill took bad sacks and missed receivers throughout the afternoon. One of the sacks resulted in a fumble that pinballed around and went backward about 30 yards. Tannehill also had a wide-open Kenny Stills at one point, but fired the ball out of bounds. He then was guilty of a crucial delay-of-game penalty on what was a promising drive. It was just painful to watch. Fortunately for the Dolphins, Jarvis Landry bailed the team out with a punt return touchdown in the fourth quarter, allowing them to escape with a win that they didn't exactly deserve. ",
            "2": "Tannehill finished 22-of-34 for 226 yards and a touchdown. As mentioned, he made numerous mistakes that even prompted picking podcast co-host Matvei to text me, I hope for Miami's sake that Tannehill signed his contract extension in pencil. He was a bit better in the second half, but he still had a very disappointing showing. ",
            "3": "The hero of the game, Landry caught eight out of 12 targets thrown to him for 53 yards to go along with that return touchdown. He finished only behind Jordan Cameron on the receiving chart; Cameron logged four receptions for 73 yards, and he also happened to draw pass interference in the red zone. Cameron made one of the top catches of the week, diving for a 27-yarder. He looks like he'll be a low-end TE1. ",
            "4": "Lamar Miller didn't run as well as anticipated. He managed 53 yards on 13 carries, but a big chunk of that came on an 17-yarder. Miller was stuffed on a third-and-1 on Miami's opening drive, perhaps influencing the Dolphins to try Williams on that aforementioned short-yardage failure. Don't get too discouraged, though. Though the Redskins can't stop the pass, they had one of the tougher run defenses in the NFL last year. ",
            "5": "As for the Redskins' offense, Kirk Cousins looked good at times in the first half, but he melted down following intermission. That said, he wasn't flawless early, as he made a couple crucial mistakes. He took a sack deep in Miami territory on the opening possession and then tossed a pick on a late throw that was telegraphed. Cousins later had a second interception, which was an amazing play by Brice McCain, who made a one-armed grab and somehow pinned it to the side of his body. Cousins' final attempt was an inaccurate heave under pressure that fell way incomplete. Cousins completed 21-of-31 passes, but managed just 196 yards, one touchdown and two interceptions. That resulted in a pedestrian YPA of 6.32. It's clear that Cousins isn't the long-term answer, but at least he studies film, unlike Robert Griffin. ",
            "6": "To be somewhat fair to Cousins, he didn't have DeSean Jackson for most of the afternoon. Jackson grabbed his hamstring after stretching for an overthrow deep downfield and checked out of the game permanently. Jackson, who logged no receptions, is very injury-prone, so it's not surprising to see him get hurt. The Redskins won't be able to count on him being on the field very much. ",
            "7": "With Jackson out, Pierre Garcon took advantage, accumulating six catches for 74 yards, and he'll continue to produce similarly under Jackson returns. The star for them, however, was Jordan Reed, who snatched seven balls for 63 yards and a touchdown. Safety Rashad Jones fell down on the score, allowing Reed to come up with the pass in the end zone. Reed was one of my top fantasy sleepers this season, so I support him as an every-week starter. ",
            "8": "Morris, who recovered from yet another ridiculous Suh stomp, eclipsed the 100-yard barrier, gaining 121 yards on 25 carries. Matt Jones was mixed in with 28 yards on six attempts. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "<i> Editor's Note: </i> I want to like Ryan Mallett. I really do. He looked solid replacing the absolutely awful Brian Hoyer. Unfortunately, he's an idiot who oversleeps practice and gets too wild outside of football, so I don't trust him. Still, Bill O'Brien can't possibly turn back to Hoyer because he might lose his locker room if he does that. ",
            "2": "If Brian Hoyer hadn't gifted the Chiefs with 14 points via a terrible interception on his first pass and fumble near the end zone, this could have been a different outcome for Houston. Kansas City's defense should thank the Texans for going with Hoyer as the Chiefs struggled to control Ryan Mallett on his two drives. To Kansas City's credit, its front seven overwhelmed Hoyer, while an opportunistic offense led by Alex Smith, Travis Kelce, Jamaal Charles and Jeremy Maclin produced enough points before the half to win the game. ",
            "3": "The Texans' first offensive play from scrimmage saw Hoyer make a terrible pass that was easily intercepted by rookie corner Marcus Peters. That set up the Chiefs at the Houston 13-yard line. Two plays later, Smith hit Travis Kelce in the middle of the end zone for a score. Later in the first quarter, Kelce got wide open in busted coverage for a 42-yard touchdown. Hoyer answered with a drive led by passes to Nate Washington, Cecil Shorts, Jonathan Grimes, and a typical great catch by DeAndre Hopkins, who leapt over Peters for the score. The Chiefs responded with a field goal drive thanks to receptions by Kelce, Maclin, and a run by Knile Davis (6-16). On the next drive, Maclin got open for a 20-yard catch to set up another Kansas City field goal. Justin Houston then strip-sacked Hoyer with the ball recovered by the Chiefs. For the very next play, Smith threw a seven-yard touchdown pass to Charles. Before the half, the Texans tacked on a field goal to make it 27-9 at intermission, but the Houston defense had allowed 221 yards across the first two quarters. In the third quarter, Washington (6-105) beat Peters for a 32-yard reception, but the drive stalled at the 10-yard line when Dontari Poe blew up a fourth-and-1 for no gain. Both offenses struggled in the second half until Mallett came in. Mallett quickly drove the ball down the field, firing some lasers to Hopkins, including a touchdown pass and two-point conversion to his stud receiver. Mallett moved the ball for another field goal drive, but Maclin recovered an onside-kick attempt to clinch the win for Kansas City. ",
            "4": "Smith completed 22-of-33 passes for 243 yards with three touchdowns and zero interceptions. Charles had 57 yards rushing on 16 carries with 46 yards receiving and a touchdown on five receptions. Kelce (6-106) and Maclin (5-52) led the Chiefs through the air. The Texans had no answer for Kelce, and he looks poised for a huge year. ",
            "5": "Hoyer was 18-of-34 for 236 yards with one score and a pick. He struggled to see the field and was inept overall. Mallett should definitely be the starter in Week 2 at Carolina. He was 8-of-13 for 98 yards with a score on two drives. Hopkins (9-98) was awesome and would have produced even more if the Texans had gone with Mallett earlier or all game. He'll continue to produce massive numbers each week because the Texan quarterbacks don't have anyone else to target. ",
            "6": "Alfred Blue gained 42 yards, but was given just nine carries. Brent Grimes was mixed in too much, making Blue an underwhelming fantasy option. Arian Foster will be back soon anyway. ",
            "7": "The Chiefs' front seven really played well. Allen Bailey notched a pair of sacks, with Derrick Johnson and Jaye Howard each contributing one for Kansas City. Of course, Justin Houston made big plays as well. The Chiefs' corners were vulnerable. Peters had some coverage issues aside from his pick. Jamell Fleming got away with two pass interference penalties deep downfield and in the end zone. Corner could be an issue for Kansas City this year. ",
            "8": "Chiefs safety Eric Berry, who was returning to the field after beating cancer, had two tackles with a pass breakup. ",
            "9": "After struggling in the first half, the Texans' defense pitched a shutout in the second half. J.J. Watt was his typical self with two sacks, nine tackles and two tackles for a loss in the ground game. Jadeveon Clowney played well for Houston, too. He had four tackles (one for a loss), including a stop on a third-and-1 for no gain. Clowney should have had a sack on a blinding rush, but couldn't grab Smith. Brian Cushing notched 10 tackles. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Titans",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "<i> Editor's Note: </i> I really wonder if the Buccaneers would pick Marcus Mariota over Jameis Winston if they had to go back in time right now. It's a loss-loss either way, really. If they wanted to make the change, they couldn't in real life, which sucks, obviously. If they don't want to swap signal-callers, it just shows that they are stubborn. I wouldn't write off Winston quite yet, or anything, but this was a very disconcerting start to his career. ",
            "2": "You have to give credit to Titans general manager Ruston Webster, head coach Ken Whisenhunt, and director of college scouting Blake Beddingfield for trusting their evaluation and plan for Marcus Mariota. The rookie quarterback put on a clinic as the Titans blew out Tampa Bay. Of course, the Bucs passed on Mariota for Jameis Winston, and this game was a terrible start for that decision as Winston struggled, while Mariota was surgical in carving up Tampa Bay. However, you can't put blind faith in Mariota's performance because the Buccaneers' defense was atrocious. ",
            "3": "On his first NFL drive, Mariota ripped Tampa Bay on two completions. He converted a third-and-10 with a laser to Delanie Walker for 22 yards. On the very next play, Mariota made a great play fake to Bishop Sankey and then fired a dart to Kendall Wright on the run. Wright exploded down the field with the ball for a 52-yard touchdown. Winston's first throw as a pro, on the other hand, was a disaster and the complete opposite. He threw a floater to the flat that was undercut by Coty Sensabaugh and returned for a 26-yard touchdown. Mariota drove down the field again on his next possession and capped it with a rollout pass to Sankey that he ran in for a 12-yard touchdown. Winston answered with a drive where he used tight end Austin Seferian-Jenkins. They hooked up for a 21-yard reception that was a dropped interception tipped to Seferian-Jenkins. Winston then took advantage with a five-yard scoring pass to his tight end. The Titans kept moving on the anemic Tampa Bay defense, with Sankey ripping off a nice run and a 22-yard pass to Wright (4-101) where the speedy wideout had a great run after the catch. On third-and goal, Mariota threw a dart to Harry Douglas (2-24), who beat Alterraun Verner for a score. Winston set up Tennessee for more when he had a screen pass picked off by rookie outside linebacker Deiontrez Mount. A nifty play by Mariota resulted in an 18-yard pass to Anthony Fasano (1-18) to the 2-yard line, and Mariota hit Walker (3-43) on third-and-goal for his fourth touchdown pass of the first half. Tennessee added to its lead in the third quarter with a Sankey touchdown plunge. In garbage time, Winston hit Seferian-Jenkins in the middle of the field, and the big tight end broke two tackles to score from 41-yards out. ",
            "4": "Mariota's game ended after three quarters, and Zach Mettenberger took over to start the fourth. Mariota finished completing 13-of-16 passes for 209 yards with four scores. Sankey was vastly improved over his rookie year. He had 12 carries for 74 yards with a score and two receptions for 12 yards and a touchdown. Wright and Walker were excellent and looked as if they had played with Mariota for years. Both Sankey and Wright can probably be started most weeks, while Walker suffered a hand injury and could be out next week. ",
            "5": "Winston was 16-of-33 for 210 yards with two touchdowns and two interceptions. Doug Martin (11-52) and Vincent Jackson (4-51) were kept from making any big plays. Martin looked good, however, so you can buy-low from a clueless fantasy owner who didn't watch the game. ",
            "6": "Defensively, the Titans got an excellent game from Derrick Morgan (five tackles, two sacks) and Jurrell Casey (three tackles, one sack). Bucs defensive tackle Gerald McCoy (three tackles, one sack) was the only defender who really stood out positively for Tampa Bay. Cornerback Alterraun Verner really struggled against his former team. ",
            "7": "The Titans suffered a painful loss with Delanie Walker looking like he broke his right hand on a third-quarter reception with Tennessee up by a huge margin. That injury could be a huge loss to the Titan offense if he misses significant time. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "28"
        },
        "comments": {
            "amount": "13",
            "1": "<i> Editor's Note: </i> I really gave up on this game. Philip Rivers looked terrible, and it didn't appear as though Detroit's offense could be stopped. The Lions were shut down, however, as Matthew Stafford sucked in the second half. If he doesn't be careful, he's going to transform into Jay Cutler in the near future. There are just too many #yolo throws from him. He's not on a Cutler level yet, but he might be getting there. ",
            "2": "This game looked like the Lions were going to roll to victory early after taking a quick 21-0 lead midway through the second quarter, but then Melvin Ingram caused an interception with a nasty hit on Matthew Stafford. The Chargers preceded to go on a 30-0 run before Detroit made it look a bit closer with a late touchdown that finished out the game with a 33-28 San Diego win. ",
            "3": "The Lions' offense looked unstoppable early on; rookie running back Ameer Abdullah ran for a 24-yard touchdown in a fashion that made Pro Bowl safety Eric Weddle look like he was the rookie in the open field. Abdullah appeared to have an extra gear in in all aspects of the game as he finished with seven carries for 50 yards and a touchdown, four receptions on four targets for 44 yards and 105 yards on three kickoff returns. Maybe the Lions should have given him Joique Bell's six carries, which resulted in 14 yards. ",
            "4": "Turnovers were a big part of this game as both Philip Rivers and Matthew Stafford threw a pair of interceptions, and rookie Melvin Gordon lost a fumble. Those three turnovers by the Chargers played a big part in their early deficit with one interception returned for a touchdown and the other two turnovers halting what were nice drives. So in reality, San Diego's surge wasn't exactly out of the blue. ",
            "5": "Except for a couple of poor throws on his interceptions, Philip Rivers was on target all game, completing 35-of-42 passes for 404 yards and two touchdowns. A whopping 17 of those passes were aimed at Keenan Allen, who caught 15 - yes, 15 - for 166 yards. Allen was unstoppable on short to intermediate routes and picked up nice yards after the catch, highlighted by a third-and-19 situation when he caught an underneath pass and gained 20 yards for the first down. ",
            "6": "The next most-targeted Charger, with seven, was Danny Woodhead, who took a back seat to Melvin Gordon on the first few drives, but as soon as the Chargers were down by over two touchdowns, Woodhead was the main back due to his pass-catching/pass-blocking ability. Woodhead caught four passes for 20 yards, but did most of his damage on the ground as he rushed 12 times for 42 yards and two touchdowns. Both touchdowns came in the red zone, with one being a draw play from nine yards out. The other score was a 1-yard goal-line run with six minutes left in the game. Gordon is more suited for goal-line carries, but his fumble earlier in the game may have given the coaching staff pause with the lead 26-21 at the time. ",
            "7": "Melvin Gordon looked excellent early in the game with strong, chain-moving runs, yet also showed agile feet and good hands as he caught three passes. This came against a strong Lions run defense and bodes well for games in which the Chargers get early leads. He finished with 14 carries for 51 yards and three receptions on three targets for 16 yards. ",
            "8": "Matthew Stafford finished with a 63-percent completion rate, but couldn't get his top receivers, Calvin Johnson and Golden Tate, going. The Chargers concentrated on bracketing Megatron out of the game, and Tate ended up with the most targets, eight, but only caught four for 24 yards. No Lions' player topped 53 yards receiving, and Stafford never looked quite the same after taking the hard hit from Ingram, which caused Detroit's first interception. There's nothing to point toward that would prove Stafford has an injury, but the outlook of the game changed after that hit. ",
            "9": "The one pass-catcher who put up decent numbers was tight end Eric Ebron, who caught four of five targets for 53 yards and a touchdown. His touchdown was a wide-open 18-yarder down the seam, while his one missed target was a bad drop. He still has work to do, but seems to have his arrow pointing up. ",
            "10": "D.J. Fluker had his left leg rolled up and was carted off the field. If he misses any time, it will be a blow to San Diego's running game. ",
            "11": "With 400-plus yards passing, there were plenty of Chargers players who put up nice numbers, and interim tight end Ladarius Green was one of them. It looked during the week as if Green wouldn't play due to a concussion, but he was a surprise active and caught five of six passes for 74 yards and a touchdown; a touchdown that gave the Chargers the lead for good. Green's physical ability is off the charts, and anytime he catches the ball, you know he is going to tack on a bunch of yards after the catch, and he did just that this afternoon. Green made Stephen Tulloch look like a rag doll as he stiff-armed him to the ground, and defenders appear to be moving in slow motion around him. If Green is relegated to a handful of snaps after Antonio Gatrs returns, it will be a shame. ",
            "12": "Stevie Johnson was the other San Diego receiver to pile up yards and a touchdown as he caught all six of his targets, totaling 83 yards and a touchdown. He was also tackled at the 1-yard line on one catch before Danny Woodhead finished off the touchdown. ",
            "13": "Neither defense dominated, but the Chargers made plays when they needed them and tightened up after the early deficit. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "It's a brand new season for the Saints, yet it feels as though 2014 is continuing. Terrible defense, inept red-zone offense and coaching blunders once again capsized New Orleans in the 2015 opener. The stop unit doesn't seem like it's any better. Arizona accumulated 427 net yards, while Carson Palmer threw for 307 yards and three touchdowns on 19-of-32 passing. He sliced and diced the Saints' incompetent secondary, and he enjoyed a clean pocket for the most part. On his first score, he bought lots of time in the pocket and eventually found John Brown in the end zone. This has to be disconcerting for the Saints because the offensive line was seen as a glaring hole for the Cardinals heading into this contest. While Palmer played well, he wasn't completely flawless. He was lucky to get away with two passes that could have easily been intercepted. He also made a huge mistake at the end of the first half, scrambling and sliding inbounds as time ticking down without any timeouts. The Cardinals were in field-goal range, but couldn't stop the clock, resulting in no points in the 2-minute drill. ",
            "2": "New Orleans couldn't stop Andre Ellington either. The quick back sprinted for 69 yards and a touchdown on just 12 attempts. He looked very explosive in the early going, and was brilliant if you exclude a fumble that occurred during a 10-yard gain. Unfortunately, he was carted off with what appears to be a PCL injury. He could be out for a few weeks. Chris Johnson replaced Ellington, but wasn't nearly as potent, gaining just 37 yards on 10 carries. Perhaps David Johnson will be more of a factor; he had just one touch, but it was a 55-yard touchdown that iced the game. David Johnson is a better player than Chris Johnson at this stage of their careers, so the sooner the Cardinals realize this, the better. In the meantime, both Johnsons should be owned until Ellington returns to the lineup. However, I wouldn't be too excited to start Chris. ",
            "3": "I mentioned that Brown (4-46) and Johnson caught touchdowns. Palmer's other score went to big tight end Darren Fells (4-82). Larry Fitzgerald didn't reach the end zone, but he paced the team in receiving, hauling in six balls for 87 yards. He left the game momentarily because he banged his no-no special place (seriously), but he took the field a bit later. Michael Floyd, meanwhile, was targeted just once. He caught an 18-yard pass, but he's clearly behind Brown on the depth chart, and rightfully so. In addition to the numbers he posted, Brown drew a flag for pass interference in the red zone. He's a solid player, while Floyd belongs on the waiver wire in your fantasy league. ",
            "4": "The Saints' red-zone offense struggled, as written earlier. They moved the chains well in between the 20s, but struggled deep in Arizona territory. In four trips inside the Cardinals' 30-yard line, New Orleans came away with three field goals and just one touchdown. This may seem strange considering that Drew Brees is the quarterback, but this was a major problem for them last year. With Jimmy Graham gone, it doesn't appear as though this issue will be fixed anytime soon. Brees finished 30-of-48 for 355 yards, one touchdown and an interception, an inaccurate pass on a third down. Brees had a chance to take the lead with the score being 24-19 with 1:50 remaining, but the Saints strangely opted to punt the ball away. Granted, they were deep in their own territory, but I would rather trust Brees on a fourth down than the defense on any down. The FOX announcers were overly critical of this, and I couldn't believe it happened. I actually went to the bathroom - there was a stoppage prior to that fourth down - and when I came back to my desk, I actually exclaimed, They punted!? That was just a terrible coaching decision. ",
            "5": "The Saints' top play-maker on offense was Mark Ingram, who accumulated 122 total yards, though 59 of it came on one play, which was a wheel route. Ingram couldn't find much room on the ground, gaining just 24 yards on nine attempts. His eight catches for 98 receiving yards made up for it though. ",
            "6": "Brees' sole touchdown went to Brandon Coleman (4-41), who had a bad drop after the score. Brandin Cooks (4-49) and Marques Colston (3-29) disappointed their fantasy owners, though it must be noted that they were battling a very tough secondary. Cooks will definitely bounce back, making him a strong, buy-low candidate. I wouldn't be nearly as optimistic about Colston, however. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The good news for the Broncos is that they won a game versus a tough opponent. The bad news is that Peyton Manning played like a rotting corpse. I described Tom Brady's preseason play identically, but this was real action. Manning looked awful, and based on the way he performed in this contest, it doesn't appear as though he'll be in the NFL much longer. Manning went 24-of-40 for 175 yards and an interception. Yes, that's good (bad?) for a 4.38 YPA. He was horrible. It should be noted that the Ravens basically lived in his backfield, as the offensive line couldn't block whatsoever, but when Manning had time, he often couldn't hit his receivers, especially when he threw deep. Manning showed zero zip on his passes, which fluttered carelessly over the heads of his wideouts. I don't know if he was serious, but Rodney Harrison said Manning had too much power on his throws, but that was hardly the case. A complete lack of power resulted in those inaccurate floaters. I don't want to keep harping about this - OK, I actually kind of do - but the amount of points Manning left off the board was unreal. He missed Demaryius Thomas on a rollout and then overshot Emmanuel Sanders for a touchdown in the first quarter. Later on, he was errant on another potential touchdown to Sanders. He was then pick-sixed on a telegraphed throw. Even if you don't like Manning, this had to be painful to watch. He's a shell of his former self, and he can't use a bogus leg injury for an excuse this time. If you own him for some reason - he was on my bust list all summer - I would unload him immediately. ",
            "2": "Manning's futility was the primary story of this game. Another very significant event was Terrell Suggs' season-ending Achilles tear in the second half. I wrote about what this means for the Ravens in my <a href=/disastergrades.php>Disaster Grades</a> page. In addition to Suggs, Baltimore also lost Eugene Monroe to a concussion. Not having Monroe completely changed the offense, as Joe Flacco, like Manning, was suddenly constantly under siege. The stats show that Flacco took just two sacks, but he was under duress all the time, and he had to force quick and inaccurate throws as a result. The lack of weapons Flacco had at his disposal also hindered him. Steve Smith was banged up a bit, which didn't help the already-bad situation. Smith, as a result, wasn't very effective (2 catches, 13 yards), so Flacco had to rely on Crockett Gillmore as his primary option on a potential game-winning drive at the end of regulation. Flacco actually did a good job of moving the chains, hooking up with Gillmore on a big completion and drawing a pass interference going to him once more, but after Smith let a touchdown fall through his hands in the end zone, Flacco was intercepted on another attempt toward Gillmore. Flacco finished 18-of-32 for 117 yards and two picks. The first interception matched Manning's pick-six. Aqib Talib, who snatched the ball, told the sideline reporter after the game that he recognized the play. He read it perfectly. ",
            "3": "Flacco's leading receiver was Marlon Brown (2-25). Gillmore (2-23) was next. That's how bleak this situation is for Baltimore. Breshad Perriman needs to get healthy quickly. ",
            "4": "Justin Forsett struggled as well. This was predictable, given how stout Denver's front line is, and Forsett had no hope after Monroe exited with an injury. He tried to help his PPR owners with four catches, but those went for just 13 receiving yards. He'll improve against inferior opponents, so target him as a buy-low candidate. ",
            "5": "Going back to the Broncos for a bit, Ronnie Hillman actually outgained C.J. Anderson, 41-29, despite having the same amount of carries (12). The Ravens have a ferocious run defense, so don't be concerned for that reason if you drafted Anderson in the first round. Anderson sprained his toe, but he's fine, according to head coach Gary Kubiak. ",
            "6": "Manning didn't throw a touchdown, so the Denver receivers also underwhelmed their fantasy owners. Sanders led the way with eight catches for 65 yards, while Thomas (7-60) was right behind him. As with Manning, try to trade these guys because they won't be as productive with Manning and his decaying arm. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "New year, same old Raiders. Oakland looked like it didn't belong in the NFL with this effort. It's tough to determine how good the Bengals are based on this result because they didn't beat a real team. Andy Dalton was at least accurate. That's good, I suppose. Dalton went 25-of-34 for 269 yards and two touchdowns. He nearly had a third score to A.J. Green, but for once, the incompletion wasn't his fault. Green just dropped it. Dalton, meanwhile, was close to flawless on the afternoon. He overthrew Green on one occasion, but was otherwise very clean, which isn't a very common thing to say about a Dalton road performance. It obviously helped that the Raiders, much like the Steelers on opening night, left countless players open. It can't be a surprise that a Jack Del Rio-coached team was unprepared to play a football game, considering that his former boss, Jacksonville's previous owner Wayne Weaver, criticized him for his poor work ethic. ",
            "2": "Cincinnati's defense, meanwhile, appeared to be very pissed off for some reason. In the first quarter, Pacman Jones actually slammed Amari Cooper's head onto his own helmet, which fell off. Jones was flagged for a personal foul, but he should have been ejected. A bit later, George Iloka was whistled for taunting unnecessarily. The Bengals, perhaps well aware that they won't be able to celebrate much in the playoffs, seemed to be getting it out of their system against a hapless opponent. ",
            "3": "Of course, things got worse for the Raiders once Derek Carr left the game with a hand injury. Carr wasn't really doing anything - he went 7-of-12 for 61 yards - as many of his passes were way off the mark. He suffered through two drops, including one from Cooper, but Carr was wildly inaccurate before leaving for the afternoon. It's hardly a surprise that Carr struggled, given that the Raiders foolishly changed his offensive system. Once Matt McGloin stepped in, the Raiders didn't have much of a chance. Of course, it didn't matter much because the Raiders couldn't stop anything Cincinnati was doing offensively. The star for the Bengals was Tyler Eifert, who was a welcome sight for Dalton after being out all last year. Eifert tallied nine catches for 104 yards and two touchdowns. Because of Dalton's limitations, Eifert is going to be targeted heavily this season. Meanwhile, Green (5-63), could've enjoyed a better afternoon, but dropped a score. ",
            "4": "Jeremy Hill found the end zone twice. He gained 63 yards on 19 carries, but wasn't used much late in the game when it was out of hand. Giovani Bernard (8-63) handled the workload once this was out of reach for the Raiders. Hill is going to have a huge season. ",
            "5": "The Raiders, meanwhile, got some decent running out of Latavius Murray. The problem is that he couldn't carry the ball enough because the Bengals led throughout. Murray gained 44 yards on 11 attempts. Perhaps more impressively, he caught seven balls for 36 receiving yards. He can be targeted for a trade from a fantasy owner who isn't really paying attention very much. ",
            "6": "Cooper led Oakland in receiving, but managed five catches for just 47 yards. He was guilty of a drop early on, but Carr's inaccuracy and McGloin's incompetence ruined his afternoon. It's going to be a rough rookie campaign for Cooper until Carr gets his act together, perhaps in the second half of the season. Don't trade him yet; he'll get better as the year progresses. ",
            "7": "A quick note on McGloin: His numbers don't look awful (23-of-31, 142 yards, two touchdowns, interception) because of the dual scores, but those came very late in garbage time. The Bengals were up 33-0 entering the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "26"
        },
        "comments": {
            "amount": "1",
            "1": "I can't believe the Giants lost this game. I was so convinced that they would win throughout the second half that I had the perfect lead planned. I was planning on writing, If a picture is worth a thousand words, this one is worth a thousand laughs: "
        }
    }
}