{
    "year": "2015",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "10",
            "1": "The Bengals came into this game as 13-point favorites, so hardly anyone believed that this would be a competitive contest. The Browns, however, appeared as though they might prove everyone wrong. Thanks to a 92-yard touchdown drive led by Johnny Manziel right before halftime, Cleveland drew to within 14-10. That was the team's longest possession since December 2013. Unfortunately for the Browns, they simply couldn't keep up. Their offense had four consecutive three-and-outs following intermission, while the defense had no answer for Andy Dalton and company. The talent mismatch was too apparent; Cleveland played well considering the skill on the roster, but the team was just outclassed. ",
            "2": "I almost want to begin my analysis with Manziel, but I'll start with the quarterback who actually has a future in the NFL. Dalton misfired on just six attempts, going 21-of-27 for 234 yards and three touchdowns. He was 14-of-16 in the second half, which is just remarkable. With plenty of talented weapons at his disposal, the Browns and their skeleton-crew secondary simply didn't have a chance. However, something worth noting is that Dalton was under pressure quite a bit in this game. The box score says that the Browns sacked him twice, but in reality, he was brought down four times behind the line of scrimmage. Dalton has been protected extremely well all year, so this was a surprise. Offensive line play this year has been crucial, so it's imperative for the Bengals to shore up this area, which was once considered very strong. ",
            "3": "Tyler Eifert had a monstrous evening, so I hope you weren't going against him in fantasy. In fact, he was so dominant that the fans shouted MVP! when he was talking on the NFL Network post-game show. The Browns couldn't cover Eifert at all, as he logged five receptions for 53 yards and a whopping three touchdowns. ",
            "4": "Eifert tied two other Bengals for the team lead in targets with six. The other two players were Marvin Jones (5-78) and A.J. Green (4-53). Green's fantasy owners might be disappointed, especially when considering that Dalton just missed him on a downfield bomb in the fourth quarter. ",
            "5": "The only prominent Bengal who disappointed was Jeremy Hill. Expected to have a breakout performance against a horrible run defense, Hill picked up just 52 yards on 15 carries. He had some nice runs, but was stuffed at the line of scrimmage far too often. Once again, Giovani Bernard did more with less, gaining 72 yards on 13 tries. Both backs caught one pass. ",
            "6": "Moving on to the Browns, Manziel went 15-of-33 for only 168 yards and a touchdown. That's not the whole story, however. Manziel had a very solid first half - 11-of-18, 128 yards, one score - as he escaped the pocket well and did a great job of moving the chains. And I'm saying this as one of the biggest Manziel haters on the planet. The guy is a scumbag, but I'll admit when he's performing well. Manziel, however, self-destructed after intermission. It hurt him that Taylor Gabriel dropped two passes that would've gone for a combined 40 yards, but the Bengals pretty much figured him out and made sure to keep him in the pocket. As a result, Manziel was a horrific 4-of-15 for 40 yards in the second half. He was nearly intercepted a couple of times, including one instance in which Dre Kirkpatrick had an open field in front of him for a pick-six. Manziel is not a good quarterback, though he should ultimately find a home in the CFL. He does some nifty things, but he's just way too limited, both mentally and physically, and that's not even taking his glaring off-the-field issues into account. The Browns need to obtain a franchise quarterback soon, and that's exactly what I have them doing in my . ",
            "7": "Manziel was so ineffective for half the game that he slowed down Gary Barnidge, who was limited to just two catches (on seven targets) for 35 yards. In fact, the Browns' leader in receiving yardage was running back Duke Johnson, who caught two balls for 38 yards and a touchdown. ",
            "8": "The Browns ran the ball well at times with Isaiah Crowell, though his runs were limited because the Browns were behind throughout. Crowell managed 38 yards on 10 carries. The silver lining is that Mike Pettine didn't give the ball to the horrible Robert Turbin at all. ",
            "9": "Randy Starks is worth noting. Starks single-handedly gave the Bengals a touchdown on the opening half. He had a very dumb taunting penalty to get the drive going, and then he lined up way offside on a fourth down in the red zone that Cincinnati failed to convert. ",
            "10": "More on Phil Simms: Simms gave the usual bland analysis, but I was frustrated with him early on when he was talking about Starks' taunting penalty. Simms literally spent two minutes explaining what a taunting call was. Even my girlfriend, who barely knows anything about football, heard this and commented, Why is this guy explaining what taunting is? Even I know what a taunting penalty is! <!-- TreatRequestAsMobileOrTables = False --> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "The Patriots continue to piece together impressive victories, but the injuries also continue to pile up. Already banged up on the offensive line, New England lost Sebastian Vollmer to a head injury. Right after that, Dion Lewis was knocked out with a knee issue, which appears to be serious. It's a dark cloud over a victory that allowed New England to improve to 8-0. Despite what this score and the stats say, Tom Bady didn't have a great game, though it wasn't primarily his fault. He had poor blocking from his offensive line, and he often looked uncomfortable when he wasn't able to dink and dunk. This forced many errant throws, including his interception in which he didn't see Keenan Robinson. At one point, Brady was under heavy pressure and lofted up a helpless punt. Brandon LaFell actually had to stop for several seconds to wait for the pass, though he managed to reel in the ball for 48 yards. Any competent secondary would've picked off the pass, but Brady had the great fortune of battling a defensive backfield that's in shambles. Brady finished 26-of-39 for 299 yards, two touchdowns and an interception. He easily could've thrown a third score, as Dion Lewis dropped a sure touchdown. Then again, his afternoon could've been a lot worse if the Redskins' miserable secondary managed to intercept him on that pseudo-punt. The pass protection is an issue, but not against crap opponents like Washington and the three other awful teams in the AFC East. ",
            "2": "Brady's touchdowns went to Julian Edelman (5-55) and Brandon Bolden. The former converted a fourth-and-2 on the opening drive with a 5-yard reception, but was guilty of a fumble in Washington territory after his team recovered an onside kick. ",
            "3": "Brady's leading receiver was Brandon LaFell, who caught five balls for 102 yards. This wasn't fluky either; he paced the team with nine targets. Rob Gronkowski, meanwhile, barely did anything statistically, reeling in just four of his five targets for 47 yards. ",
            "4": "With the passing game being inconsistent, the Patriots had a huge boost from LeGarrette Blount, who bulldozed through a defense missing its starting nose tackle. The Redskins had issues tackling him for most of the afternoon, as Blount broke countless tackles. He tallied 129 yards and a touchdown on 29 carries. With Lewis injured, Blount figures to be a strong producer going forward. Lewis, meanwhile, had 53 net yards in two-and-a-half quarters of action. As mentioned, he screwed his fantasy owners out of a receiving touchdown. ",
            "5": "The Redskins, meanwhile, had an error-filled afternoon. Kirk Cousins' first three passes were all dropped, and one of them bounced off Pierre Garcon's hands and into the arms of a Patriot defender's. Washington continued to drop balls until late when the game was out of hand. Cousins finished 22-of-40 for 217 yards, one touchdown and an interception. Those are mediocre numbers, and yet they were enhanced by garbage time; at halftime, Cousins was just 7-of-14 for 60 yards and the pick. However, it's not like he played poorly. His receivers simply let him down. ",
            "6": "Cousins' sole score came at the very end of the game, and it was lofted to Jordan Reed, who had a pedestrian game otherwise; he caught three balls for 18 yards, dropping some passesin the process. DeSean Jackson also disappointed; the leader of the Crips returned to the field, but managed to reel in just three of his six targets. ",
            "7": "The top producers in the Washington passing attack were Garcon (4-70) and Jamison Crowder (6-50). Each saw a team-high eight targets. However, that doesn't mean that they both had solid games. Garcon dropped some passes and was responsible for that aforementioned interception. Crowder was also guilty of a drop. ",
            "8": "The Redskins struggled to run the ball once again, which has been a trend ever since they lost their offensive linemen to injuries. Matt Jones handled most of the workload, gaining 27 yards on 11 carries, whereas Alfred Morris managed just 10 yards on four attempts. Jones lost a fumble. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "29"
        },
        "comments": {
            "amount": "7",
            "1": "The Panthers deserve all the credit in the world for winning this game, despite a late scare, but the Packers are the big story. This is the second-consecutive game in which they've been blown out on the road. And yes, this was a blowout. This was a 37-14 contest at one point, but Carolina simply fell asleep. The Packers feasted on poor opponents to start the year, allowing them to establish a 6-0 start, but they've struggled immensely versus tough competition since. There's a lot wrong with the Packers. Their injured/pedestrian receivers can't separate against quality defensive backs, so the Denver and Carolina secondaries shut them down. The offensive line can't block, as both tackles haven't been able to handle superior pass-rushers. The defense, meanwhile, has struggled against both the run and the pass, though injuries to the defensive backfield haven't helped. And, of course, the team's glaring issues versus scrambling quarterbacks continued to fester. Green Bay had no answer for Cam Newton, as the defenders seemingly weren't even aware that Cam Newton could scramble. Newton gashed the Packers on the ground for 57 yards and a touchdown on his nine scrambles. He also had three aerial scores on an inconsistent passing afternoon. He delivered some perfect downfield bombs to his targets, but he also made some mistakes. He was nearly picked in first half on an attempt thrown behind Jerricho Cotchery and then missed a wide-open Cotchery for a touchdown following intermission. He was guilty of a horrible error late when throwing an interception on a pass fired behind his receiver while running the clock out with three minutes remaining. It was a lazy pass, and it was especially bad because it occurred on a first down. I have no idea what Carolina was doing even throwing the ball on that play. Newton finished 15-of-30 for 297 yards, three touchdowns and that pick to go along with his rushing total. He completed five passes longer than 20 yards against Green Bay's depleted secondary. He could've put together an even better day had he not missed Greg Olsen a couple of times for big gains. ",
            "2": "Despite the two miscues, Cotchery was Newton's top receiver, catching three balls for 82 yards. Meanwhile, Newton's touchdowns were thrown to Devin Funchess (3-71), Olsen (4-66) and Philly Brown (2-50). Funchess and Olsen both made impressive receptions. Funchess' was a 52-yarder which he grabbed in mid-air while being tackled by a Green Bay defender. Olsen, meanwhile, snatched a one-handed catch along the sideline that went for 23 yards. ",
            "3": "It was disappointing to see Jonathan Stewart struggle so much. Stewart, despite having a great matchup, mustered just 66 yards on 20 carries. He's been hot, so it's discouraging that he cooled down against a poor defense. ",
            "4": "As for the Packers' offense, Aaron Rodgers had a very deceiving 25-of-48 for 369 yards, four touchdowns and a desperation interception at the end. He nearly threw a second pick, but safety Kurt Coleman dropped the ball. Rodgers' halftime numbers - 8-of-16, 117 yards, one touchdown - are more indicative of how he played, though his struggles weren't his fault. He dealt with so much pressure in the pocket, so like last week, his inability to have time to find his receivers disrupted the timing of his offense. Rodgers caught fire in garbage time, when Carolina fell asleep, but it was telling that he couldn't punch the ball in for a game-winning score after the aforementioned Newton pick. ",
            "5": "Randall Cobb paced the Packer receivers with four catches for 99 yards and a touchdown, but he tallied just 18 receiving yards by halftime. James Jones (2-57) barely did anything at any point; his only contribution was a conversion on fourth-and-long with a leaping grab over Josh Norman. Davante Adams (7-93) was actually the only Green Bay wideout who did anything in meaningful action. He saw 11 targets, reeling in seven of them for 93 yards. ",
            "6": "Rodgers' three other touchdowns went to Richard Rodgers (5-19, 2 TDs) and James Starks (6-83). And yes, what Starks did occurred late once this contest was decided. Starks remarkably outgained Eddie Lacy on the ground; Starks gained 39 yards on 10 carries, while Lacy (5-10) barely did anything, thanks to an early fumble. Lacy's struggles continue to be a huge concern. You can't drop him or anything, but I would recommend against starting him until he proves himself again. ",
            "7": "I'm sure <i>SportsCenter</i> will show plenty of this, but two key Packer defenders, Julius Peppers and Ha Ha Clinton-Dix, got into a fight on the sidelines and had to be separated. I'm not sure how big of a deal this is, but it'll probably be overblown by the media. Still, it doesn't look good for a team that's absolutely reeling right now. <!-- TreatRequestAsMobileOrTables = False --> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bills",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "The Bills had some turmoil in London and were so terrible in that game that they lost to the Jaguars. With an upcoming battle Thursday night against the Jets, they had every reason to look ahead. The Dolphins, on the other hand, had extra time to prepare for just one opponent, and coming off an embarrassing loss on a national stage, they had every reason to show up in Buffalo. Instead, it was the Bills who showed much more emotion. Whereas the Dolphins whiffed on tackles and continued to struggle on third down, Buffalo was so much better in every aspect. Of course, it helped that the team had a competent quarterback under center again. Tyrod Taylor returned from injury, relegating the incompetent E.J. Manuel back to the bench. Taylor opened the game with a 14-yard scramble on a third-and-9. He then found Sammy Watkins on a couple of deep throws, including a 63-yard bomb to set up an eventual touchdown. He misfired just once in the opening half and then was perfect after intermission, finishing a very efficient 11-of-12 for 181 yards and a touchdown to go along with 44 rushing yards on 10 scrambles. The difference between Taylor and Manuel is night and day; Manuel was a train wreck, while Taylor has proven that he can be a legitimate starting quarterback. ",
            "2": "I mentioned Watkins earlier; it was reported that he would be limited in this contest because he was banged up. It was quite apparent early on that this was misleading, as Watkins was unstoppable. He sat some plays out, but the clueless Dolphins had absolutely no answer for him when he was on the field. He caught all eight of his targets for 168 yards and a touchdown. With Taylor back, Watkins' numbers should be terrific going forward. ",
            "3": "Remarkably, aside from Watkins, no other Buffalo player had more than seven receiving yards. In fact, only two other Bills - LeSean McCoy and Charles Clay - caught passes, and Robert Woods was the only other individual who saw a target. Taylor was simply locked in on Watkins in the passing game, and why not? Watkins torched Miami's horrible secondary all afternoon, and even Brent Grimes didn't have any sort of solution for him. ",
            "4": "Speaking of McCoy, he also took advantage of Taylor's return. He had a terrific outing, breaking free for a 48-yard touchdown burst early, thanks to some miserable tackling efforts by the Miami players. He finished 112 yards and a score on 16 attempts. Unfortunately for his fantasy owners, Karlos Williams vultured two touchdowns away from him when he was knocked out with a shoulder injury. Williams gashed the Dolphins' lazy rush defense as well, tallying 110 yards on just nine carries. McCoy will obviously remain the starter, but Williams has shown that he deserves a healthy workload as well. ",
            "5": "As for the Dolphins, they had a very sloppy game. I already mentioned their tackling ineptitude. They also had some horrible drops, and PC Head Coach, at one point, showed that he had a degree from the Andy Reid School of Poor Clock Management. PC Head Coach, with one timeout in his back pocket, allowed 24 seconds to elapse after a reception deep in Buffalo territory. Because of this, he gave his team just two opportunities to punch the ball in, and the team didn't even get a chance to kick a field goal because time expired after a drop on first-and-goal. It was absolutely ridiculous, and if that wasn't enough, PC Head Coach wasted multiple timeouts in the third quarter. Despite this, the Dolphins were in this game until late into the third frme. They trailed by just five while driving the ball in Buffalo territory. However, Ryan Tannehill was strip-sacked, and the Bills took over on the Miami 40. A few plays later, Taylor hit Watkins for a deep touchdown to effectively seal the victory. ",
            "6": "Tannehill boasted a nice completion percentage, going 27-of-36 for 309 yards. He was hurt with some drops, though he got away with a couple of potential interceptions. He also lost a fumble and was responsible for a safety when a shotgun snap sailed through his hands when he was backed up deep in his own territory. Tannehill struggled with pass protection, with Jason Fox played woefully in place of Ja'Wuan James. Fox ruined a fourth-down conversion late in the third quarter with a hold when this game was still in doubt. ",
            "7": "Lamar Miller put together a big game. His rushing numbers weren't impressive - he gained 44 yards on 12 carries - but he did score twice. However, he did most of his work as a receiver out of the backfield, snatching all seven of his targets for 97 yards. ",
            "8": "Jarvis Landry saw a whopping 13 targets, converting 11 of those for 69 yards. He also threw a 9-yard pass to Tannehill. It was completed, but it was a low pass that could've gone for more if it was on target. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> The Jets almost have to be downgraded for this win. They allowed a back-door touchdown to the Jaguars and nearly lost at the very end. Sure, Nick Mangold left the game, but surrendering 23 points to Jacksonville is inexcusable. ",
            "2": "The Jets stayed in the wild-card race thanks to inept play by the Jaguars' secondary and offensive line. Ryan Fitzpatrick was efficient and took advantage of Jacksonville's weak cornerbacks to make enough big plays through the air. The Jaguars got a good game out of their young offensive play-makers of Blake Bortles, T.J. Yeldon, Allen Robinson and Allen Hurns, as they produced 436 yards of offense compared to 290 for New York. But three fourth-quarter turnovers led to Jacksonville's loss. ",
            "3": "After starting with good field position, Bortles converted one third down with his feet and another with a screen to Yeldon for 21 yards. That led to a field goal for Jacksonville. New York got an excellent kick return from Antonio Cromartie to midfield. A screen to Zac Stacy converted a third-and-long and a back-shoulder throw to Eric Decker went for about 25 yards. To finish the drive, Fitzpatrick found Decker wide open in the end zone to give New York a 7-3 lead. Promptly, Bortles had a deflected pass intercepted by Marcus Williams to set up the Jets at the 32-yard line. A fourth-and-3 was converted by Fitzpatrick to Decker, and Chris Ivory scored on a third-and-1. The Jaguars moved the ball into Jets territory in the final seconds and Bortles made a beautiful throw to Allen Hurns for a 30-yard touchdown after beating Antonio Cromartie. The Jets took a 14-10 lead into the locker room. Bortles led a field goal drive in the third quarter before Fitzpatrick hit a wide-open Jeff Cumberland for a 44-yard gain. A screen to Ivory went for 16 yards to the Jaguars' 1-yard line, and he plunged into the end zone two plays later. In the fourth quarter, Bortles got going by hitting Allen Robinson for a 44-yard pass after he beat Darrelle Revis to get open before catching the pass with Marcus Williams all over him. A 16-yard pass to Hurns set up a Jacksonville field goal. The Jaguars got the ball back at their 10-yard line, and Bortles threw a 27-yard pass to Marcedes Lewis, and Yeldon ripped off a 45-yard run to get into Jets territory. However, Bortles was strip-sacked by Calvin Pace, who recovered the fumble for New York. Jacksonville's defense forced a punt, but muffed the punt, and Kellen Davis recovered for New York at the Jaguars' 25-yard line. A few plays later, Brandon Marshall made a phenomenal, diving, 20-yard touchdown catch. Quickly, Bortles ripped the ball down the field before throwing a 20-yard touchdown pass to Bryan Walters. Marshall recovered the onside kick. Ivory fumbled a third-down run, but was extremely lucky that Marshall recovered that loose ball as well. With a minute remaining, the Jaguars got the ball back at their 10-yard line, but Bortles threw a pick to Marcus Williams to end the game. ",
            "4": "Blake Bortles completed 24-of-40 passes for 381 yards with two touchdowns and two interceptions. He also ran for 32 yards on four carries. Bortles played well with a lot of excellent reads and throws. He's vastly improved this season. ",
            "5": "T.J. Yeldon ran for 64 yards on 14 carries with three receptions for 37 yards. His offensive line struggled to open holes. ",
            "6": "Allen Robinson had six receptions for 121 yards, and Allen Hurns logged five catches for 122 yards and a score. Robinson and Hurns outplayed New York's veteran corner tandem of Revis and Cromartie. Julius Thomas (3-14) didn't do much for Jacksonville. ",
            "7": "Ryan Fitzpatrick completed 21-of-34 for 272 yards with two touchdowns. At less than 100 percent with his hand injury, Fitzpatrick was a huge upgrade for New York compared to last week. ",
            "8": "Chris Ivory had only 26 yards on 23 carries with two touchdowns on the ground and three receptions for 22 yards. The Jaguars' front seven was excellent against the run. ",
            "9": "Eric Decker tallied six catches for 79 yards and a touchdown. The Jaguars really struggled to cover Decker. Brandon Marshall (4-44-1) had some clutch plays in the fourth quarter to lift the Jets to a win. ",
            "10": "Jets safety Marcus Williams was huge with his two interceptions and half of a sacks. Rookie outside linebacker Lorenzo Mauldin collected two sacks, and Calvin Pace had a huge clutch play with his strip-sack in Jets territory. Jared Odrick and Telvin Smith put together good games for the Jaguars. <!-- TreatRequestAsMobileOrTables = False --> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "18"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> I'm totally with my man Mike Zimmer. With Gregg Williams coaching the Rams, it's definitely not a coincidence that a dirty hit knocked Teddy Bridgewater out of the game. I said it when Williams was reinstated - it was a huge mistake to allow that maniac to continue coaching because his dirty tactics would lead to some valuable quarterbacks sustaining injuries. If Roger Goodell wasn't so incompetent and corrupt, he'd remove Williams immediately, but that's not going to happen. ",
            "2": "In the first quarter of this game, the Rams scored a touchdown to cut the Vikings lead to 10-6. St. Louis decided to go for two and failed. Passing on the extra point turned out to be catastrophic for St. Louis as they lost in overtime. At the end of the year, if the Rams come up short for a wild card while Minnesota gets into the postseason, that play could end up being a pivotal moment in the season. Aside from the wild card, Minnesota is hot on the heels of Green Bay, but seeing Teddy Bridgewater knocked out of the game with a concussion could greatly impair the Vikings' efforts to pass the Packers in the NFC North. ",
            "3": "The Vikings got on the board first with a field-goal drive as Bridgewater was taking what the Rams were giving him with short passes moving the ball down the field. That continued on the next drive, as Bridgewater moved it inside the 10-yard line before Adrian Peterson ran the ball into the end zone. St. Louis answered with a nice play-fake to set up a 55-yard bomb to Kenny Britt. Todd Gurley finished the drive with a 1-yard touchdown run. Then, the Rams went for the ill-fated two-point conversion that saw a Gurley run stopped. The decision was even more questionable shortly later when Greg Zuerlein drilled a 61-yard field goal. Nick Foles led two more field goal drives, and the Rams took a 15-10 lead into the half. After a hot start, the Vikings' offense cooled. Bridgewater threw a deep ball into the end zone that was intercepted by Trumaine Johnson. Some runs by Peterson got Minnesota righted though, and Bridgewater ran in a six-yard touchdown. He also ran in the two-point conversion to give the Vikings an 18-15 lead. Minnesota lucked out when Tavon Austin got wide open for a deep ball and dropped a well-thrown pass from Nick Foles that would have been a gain of about 40 yards, if not a touchdown. Then, the Vikings lost Bridgewater when he got nailed by a dirty hit from Lamarcus Joyner. Bridgewater was sliding and Joyner dived at his head. That knocked Bridgewater out of the game with concussion-like symptoms. After being held in check for most of the game, Gurley started pounding the Vikings' defense and moved the ball into Minnesota territory. That set up Zuerlein, but a 48-yard field goal attempt went wide right. With a little over two minutes remaining, Vikings backup Shaun Hill took a sack for an 11-yard loss. St. Louis timeouts between plays set up the Rams' offense to get the ball back at the Minnesota 39-yard line with a 1:12 to go. A completion and pass interference on Trae Waynes put the ball on the Vikings' 36-yard line. Zuerlein connected on his 53-yarder to force overtime. If the Rams had not gone for two in the first quarter, that would have won the game on that kick. In overtime, the Vikings forced a three-and-out, before Marcus Sherels returned the punt 26 yards to midfield. Peterson did the rest to set up Blair Walsh as he was good on a 40-yarder, and Minnesota won its fourth straight game. ",
            "4": "Teddy Bridgewater was 13-of-21 for 144 yards with an interception. He ran three times for 17 yards and a score. ",
            "5": "Adrian Peterson ran for 125 yards on 29 carries with a touchdown. Stefon Diggs, meanwhile, was held to 42 yards on three receptions, but that led the Vikings through the air. ",
            "6": "Nick Foles was 18-of-33 for 168 yards. He had a decent game, but saw steady pressure as the Rams' offensive line was underwhelming. ",
            "7": "Todd Gurley had 89 yards on 24 carries with a touchdown, breaking his consecutive streak of 100-yard rushing performances. ",
            "8": "Tavon Austin had eight carries for 66 yards and four receptions for 15 yards. Kenny Britt (3-87) was St. Louis' leading receiver. The latter should be ignored in fantasy. ",
            "9": "Vikings defensive tackle Linval Joseph had a superb game with 10 tackles and a sack. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Titans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "28"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Wow, Saints. Way to lose at home to one of the worst teams in the league. Though I guess that's what happens when a team employs a professional wrestler as the defensive coordinator. ",
            "2": "Maybe the Tennessee Titans should have fired coach Ken Whisenhunt sooner. Interim coach Mike Mularkey led the Titans to an overtime victory against the New Orleans Saints on Sunday at the Mercedes-Benz Superdome. Rookie quarterback Marcus Mariota, who came back after missing the last two games due to injury, hit tight end Anthony Fasano with a 5-yard touchdown pass to seal the victory. The win snapped a six-game losing streak by the Titans (2-6) and was their first victory since the season opener against Tampa Bay. For the Saints (4-5), the loss ended a three-game winning streak. The loss came as rumors continue to fly about the future of Saints coach Sean Payton. There were reports Sunday morning that the Saints would allow Payton to explore other jobs in the offseason. Payton, who has been with the Saints since 2006, reportedly could draw interest from the Miami Dolphins and other teams. ",
            "3": "Mariota had the best game of his young career. He completed 28-of-39 passes for 371 yards and four touchdowns with no interceptions. Mariota was calm and composed throughout the game. Despite his team's record, Mariota is worth starting on your fantasy team in favorable matchups. ",
            "4": "Tight end Delanie Walker is a solid fantasy starter with a healthy Mariota in the lineup. Walker had two touchdown catches. He finished with seven receptions for 95 yards. ",
            "5": "Rookie wide receiver Dorial Green-Beckham also might be worth starting in fantasy sometime in the near future. Green-Beckham had five catches for 77 yards, but didn't get into the end zone. ",
            "6": "Second-year running back Antonio Andrews was impressive and could serve as a flex option going forward. Andrews had 19 carries for 88 yards. ",
            "7": "For the Saints, their defense continued to be a major liability. A week after giving up 49 points in a win against the New York Giants, the New Orleans defense was shredded by a rookie quarterback. ",
            "8": "The Saints weren't able to do much of anything on the ground. Mark Ingram rushed 21 times for 52 yards. He could rebound next week against the Redskins. ",
            "9": "New Orleans wide receiver Willie Snead continues to put up decent fantasy numbers. He had six catches for 95 yards, but didn't score a touchdown. Brandin Cooks also is worthy of consideration in fantasy leagues. Cooks had four catches for 73 yards with one touchdown. ",
            "10": "Saints tight end Benjamin Watson, who had been red hot in recent weeks, was fairly quiet. Watson was held to 60 yards on five catches. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "35"
        },
        "comments": {
            "amount": "13",
            "1": "<i> EDITOR'S NOTE: </i> You have to wonder what the Steelers did to deserve all of these injuries. Did Mike Tomlin urinate on an Indian burial ground, or something? Then again, the man did yell at Santa Claus... Still, it's almost inexplicable that they've had so many prominent players go down this year. ",
            "2": "Probably the biggest news in this game was Ben Roethlisberger going down again with an injury. This time it was to his foot, as he planted the ball of his foot while getting sacked and had his heel landed on by Aldon Smith, squeezing his foot like a grape in a wine press. ",
            "3": "The initial speculation was dire, especially after he was transported to the hospital, but it appears he once again dodged a season-ending injury, but he will be out roughly two weeks with a mid-foot sprain. That's great news for Steelers fans and many fantasy players alike, as the Steelers take on the Browns next week and then have a bye. Then, it looks like he'll have a decent chance to return for the game at Seattle in Week 12. ",
            "4": "These two teams did play a game on Sunday, and a pretty great game at that. There were three early lead changes before halftime and then, after the Steelers took a two-touchdown lead with 11:28 left in regulation, the Raiders came back to tie it up 35-35 with 1:21 to go. That's when one Mr. Antonio Brown stepped up, just as he had all day, and took a Landry Jones pass deep into Raiders' territory to set up the decisive Chris Boswell field goal. ",
            "5": "That reception put Brown at 17 catches for the day, which he managed to take for a Steelers-record 284 yards and the seventh-most receiving yards in a game, while somehow not finding the end zone. But I don't think Brown backers are going to get to picky there. Besides the 284 yards, he also ran the ball twice for 22 yards, putting him at 306 total yards on the day. That's a month's worth of work for most receivers in the league. ",
            "6": "Before Roethlisberger left midway through the fourth quarter with his foot injury, he was already up to 334 yards, two touchdowns and one interception. Of course, the majority of his 44 passes had gone to Brown, who had 23 targets, while Martavis Bryant was second with seven. On the whole, the Steelers passed for 402 yards and put up 597 total yards, the most the Raiders have allowed as a franchise. ",
            "7": "Of course, it wasn't all the Steelers' passing game putting up yards and points, as Le'Veon Bell backup DeAngelo Williams, who had a huge day, carrying the ball 27 times for 170 yards and two touchdowns, while also catching two passes for 55 more yards, giving him a total of 225 yards. There's little doubt this Steelers team wouldn't even have an inkling of a chance this season without the play of 31-year old backup Williams, and they can probably thank Le'Veon Bell's pot suspension for them going after Williams last offseason. ",
            "8": "So, the Steelers had no trouble putting up big yardage on the Raiders, but the Raiders also had a pretty easy time of it themselves. Derek Carr continues to show that he has the goods, and this week he almost went into Pittsburgh and pulled off the upset. ",
            "9": "Carr's game started out strongly as he led his team down the field on their first drive and hit Michael Crabtree for a 22-yard score and then again to tie it up in the waning minutes of the game with a 38-yard strike. The latter pass was perfect. Crabtree made a nice catch surrounded by defenders, but he could have been completely covered and the ball wouldn't have been touched by anyone else. ",
            "10": "Carr had thrown an interception in the end zone earlier in the fourth quarter, which set him up as the fall guy, but returning with that pass to Crabtree erased that pick and pushes anyone to realize that Carr is for real. Of course, his 300-plus yards and four touchdown passes helps us realize that as well. He's now thrown for multiple touchdowns in 6-of-8 games and now has 11 touchdowns to one interception and 923 yards passing over his last three games. These aren't numbers that average quarterbacks put up consistently, even against sub-par defenses. ",
            "11": "So, Crabtree put up the best numbers on the day, but Amari Cooper had one more target with 13, but did not look as sharp as Crabtree this week. Crabs caught 7-of-12 targets for 108 yards and the two touchdowns, while also making two pretty grabs on the sideline that were just out of bounds. On the other hand, Cooper had a couple drops and did not look on top of his game. He ended up with a good stat line with seven receptions for 88 yards and a touchdown, but the touchdown was a complete blown coverage by the Steelers. ",
            "12": "Latavius Murray started the game hot with a 44-yard run and picked up good yardage on the ground, but ended up getting knocked out of the game with a concussion, which also caused a fumble that he lost. He had fumbled earlier in the game as well, which almost cost Oakland a score, as it was returned for a touchdown, but the Steelers defender hadn't reestablished himself in-bounds before picking up the fumble. ",
            "13": "On the whole, there wasn't much defense to be had, but the Steelers did pick off Carr in the end zone late, which was a huge play to help them get the win, while the Raiders came into this game with one of the best rush defenses in the league. They were allowing 76 yards rushing for 3.6 yards per attempt and have given up just three rushing touchdowns; all three in the first two weeks. That is, until Williams put up 170 yards and two touchdowns at 6.3 yards per carry. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Giants",
            "Points": "32"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "18"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> How about that touchdown at the end of this game? Inconsequential to most, but I had the Giants' defense on my FanDuel team. I know this means so much to all of you, so I thought I should tell you about it. ",
            "2": "This time, there was no shootout. This time, the New York Giants' defense showed up. Unlike a week ago when the Giants lost, 52-49, to the New Orleans Saints, the Giants got the job done defensively. The numbers might be a little misleading. The Bucs did manage 385 yards of total offense. But the Giants (5-4) played solid defense when it mattered most. The Bucs (3-5) were just one for four on red-zone opportunities. The Giants, who were boosted by the return of defensive end Jason Pierre-Paul from an injury, held the Bucs to field goals most of the game. Tampa Bay's only touchdown came in the fourth quarter on a run by quarterback Jameis Winston. For the Bucs, the game represented a lost opportunity. Tampa Bay had a chance to get its record to .500 and win back-to-back games for the first time since Lovie Smith took over as coach last year. Tampa Bay was plagued by dropped passes, untimely penalties and the woes in the red zone. ",
            "3": "New York quarterback Eli Manning had an up-and-down day. He completed 26-of-40 passes for 213 yards with two touchdowns. But Manning was intercepted twice. ",
            "4": "Wide receiver Odell Beckham Jr. continues to be the Giants' best fantasy player. Beckham was targeted 17 times and finished with nine catches for 105 yards. ",
            "5": "The Giants finished with 114 rushing yards, but they were spread out among a committee of running backs. Rashad Jennings led the way with 13 rushes for 48 yards. ",
            "6": "For Tampa Bay, dropped passes were the big story of the day. Mike Evans finished with eight catches for 152 yards. But don't be fooled by the numbers. Evans had a miserable day. Unofficially, Evans dropped six passes. If he had made those catches, his numbers would have been outrageous. ",
            "7": "With wide receiver Vincent Jackson out with a knee injury, Tampa Bay's receiving corps was pretty much limited to Evans' production. Rookie Adam Humphries had five catches for 55 yards, but he's not someone you want on your fantasy team. ",
            "8": "Winston showed more maturity than the rest of the Bucs. He had a solid day, completing 19-of-36 passes for 249 yards. Winston's numbers would have been much better if the Bucs didn't drop so many passes. Winston had his fourth-straight game without an interception and also scored on the rushing touchdown. ",
            "9": "Tampa Bay finished with 136 rushing yards, but that total is misleading because 59 of those yards came on a run by Charles Sims. Doug Martin, who had been hot in recent weeks, was bottled up by the New York defense. Martin gained just 31 yards on 11 carries. Martin, however, remains a solid fantasy starter. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "I received a ton of flak for knocking the Falcons out of the top 10 of my , but as it turns out, I may not have dropped them far enough. They've played very pedestrian football ever since demolishing the Texans. They barely beat the Redskins, lost to the Saints, squeaked by the Zach Mettenberger-led Titans, dropped a game to the Buccaneers, and now they can add losing to Blaine Gabbert to their resume. The Falcons had a dream matchup against San Francisco's porous defense, but they simply couldn't produce at all. It seemed like everyone was to blame. Matt Ryan posted quality stats - 30-of-45, 303 yards, one touchdown - but he left several points off the board with some bad throws. One play that stood out was when he missed a wide-open Devonta Freeman in the first half. Had Ryan converted, it would've been an easy six. Ryan also had some sketchy passes in the red zone, as Atlanta seldom converted while deep in San Francisco territory. Ryan struggled for a couple of reasons. First, he was constantly under siege. His offensive line wilted against the 49ers' pass rush. The unit surrendered just two sacks, but it easily could've been a much higher number had Ryan not thrown the ball away so quickly. The pressure forced Ryan into those errant throws, one of which could've been intercepted by NaVorro Bowman. Ryan's pass flew right toward Bowman, but he dropped the easiest interception of his life. Also, Ryan didn't get much help from his receiving corps, which dropped several passes. Even Julio Jones let a ball fall through his hands. ",
            "2": "Speaking of Jones, he still put together a strong fantasy outing, particularly for PPR formats. Jones saw 17 targets go his way, and he caught 10 balls for 137 yards. Freeman and Jacob Tamme also saw double-digit targets; Freeman caught eight passes for 67 yards and a touchdown, but would've had a much bigger day had Ryan seen him on that one aforementioned play. Tamme, meanwhile, collected six receptions for 61 yards. He was guilty of a crucial drop. ",
            "3": "Another rough outing for Roddy White: Despite Leonard Hankerson being out, White caught just one pass for 20 yards. He's not even close to any sort of fantasy radar. ",
            "4": "Before I move on to the Falcons, I need to mention Dan Quinn and his horrible mistake late in the game. The Falcons, down 17-13, had a fourth-and-goal on the San Francisco 2-yard line. Quinn opted for a field goal with three minutes remaining. The Falcons drew to within one, but after kicking the ball away, they never obtained possession again. I thought this was horrible. Ryan and Jones are the strength of the team. Why not rely on them rather than a defense that had been shaky at best throughout the afternoon? Even if Atlanta wouldn't have converted, the 49ers would've been stranded deep inside their own territory. ",
            "5": "San Francisco was able to keep possession with a Blaine Gabbert designed scramble on a third down. Gabbert played well throughout, going 15-of-25 for 185 yards, two touchdowns and a couple of interceptions to go along with nine scampers for 32 rushing yards. One of the picks wasn't his fault, as Jerome Simpson was responsible for bobbling the ball, but Gabbert's second interception was a horrendous underthrow. Still, it was one of his few terrible plays, as he did a terrific job of moving the chains with a depleted receiving corps missing Anquan Boldin (injury) and Vernon Davis (trade). ",
            "6": "Gabbert nearly had a rushing touchdown, but was ruled down at the 1-yard line. In a hilarious sequence of events, Gabbert spiked the ball, thinking that he scored, doing so just as the official was spotting the ball short of the goal line. Mike Tomsula then threw the red challenge flag when it painfully obvious that Gabbert didn't reach the end zone. Still, Gabbert came back to throw a touchdown pass to Garrett Celek, who actually scored twice. Before you think about adding him to your fantasy team, Celek logged just two receptions. ",
            "7": "With Boldin out, Torrey Smith had a chance to step up, but he caught just two passes for 44 yards. Quinton Patton was the 49ers' only effective receiver; he snared three passes for 70 yards on five targets. ",
            "8": "Carlos Hyde was missing as well, allowing Shaun Draughn to come out of nowhere to rush for 58 yards on 16 carries. Draughn was effective in the passing game as well, tallying four catches for 38 receiving yards. <!--/* Switch 3.5.25 - WalterFootball.com - WalterFootball.com - 300x250 - 300x250 */--> <!-- TreatRequestAsMobileOrTables = False --> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Colts",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "24"
        },
        "comments": {
            "amount": "9",
            "1": "So much for Peyton Manning being back to dominant form. The media was quick to jump back on the Manning bandwagon after he finally put together a quality outing last week, ignoring his interceptions and many dead ducks. It was more of the same from Manning in this contest, as he struggled to move the chains for most of the afternoon. He put together some strong drives in the second half, but it wasn't nearly enough, as Indianapolis' mastery over Denver continued. Manning finished 21-of-36 for 281 yards, two touchdowns and a pair of interceptions. The first half was very ugly, as the Broncos were shut out, save for an inexplicable punt return as time expired. Manning was just 9-of-22 for 80 yards and an ugly interception on a high pass prior to intermission, as he constantly sailed horrible passes wide of the mark. He was sharp at times afterward, thanks in part to safety Mike Adams' injury. but it wasn't enough, as an interception at the 6-minute mark was the final snap of his in this defeat, ruining his chances of breaking Brett Favre's career passing yardage record in his former stadium. ",
            "2": "Of course, it wasn't all on Manning, as the defense couldn't force the Colts to punt in the final six minutes. They were horrible all game, showing little ability to slow down Andrew Luck. It got uglier as the game progressed, with many Broncos showing bad sportsmanship in their first defeat. Aqib Talib was flagged for poking a player in the eye, while Von Miller drove his knee into someone's throat. The Colt player was on the ground, yet Miller held his knee of that individual's throat and drove it down, suffocating him. It was a disgusting display, and if Roger Goodell had a soul, he would suspend the Denver linebacker. Speaking of Denver linebackers, DeMarcus Ware left the game early when he aggravated his back injury. He's expected to be out for the next week or two. ",
            "3": "Moving on, Manning's two touchdowns went to Owen Daniels (6-102) and Emmanuel Sanders (6-90). Yes, you read that right - Daniels caught six passes for 102 yards. Vernon Davis saw just one target, which he couldn't reel in. Sanders, by the way, dropped a pass. ",
            "4": "Demaryius Thomas caught five passes for 50 yards. He saw seven targets, a lesser amount than Sanders and Daniels. ",
            "5": "Both C.J. Anderson and Ronnie Hillman received seven carries, with the former outgaining the latter, 34-1. Anderson was the better runner for the second-straight week, so the Broncos should think about moving back to him as the primary ball-carrier. ",
            "6": "As for the winners, Andrew Luck continued his great momentum from his second-half surge at Carolina. Despite losing his offensive coordinator on a short week, Luck went 21-of-36 for 252 yards and two touchdowns to go along with 34 rushing yards on six scampers. There were reports earlier during the week that he was healthy, and that seemed apparent when he took off on a third-and-10 scramble and dived for the first down. Luck was nearly intercepted twice, but considering the caliber of defense he was battling, he had a terrific showing, and all Indianapolis fans should be optimistic going forward. ",
            "7": "While Luck's good health was reported, T.Y. Hilton was not expected to play on all accounts. Despite this, Hilton paced the team with 82 receiving yards on five catches and six targets. The latter two numbers tied for the team lead. ",
            "8": "Griff Whalen was thought to be someone who would step up in Hilton's absence, but he was a factor anyhow. He logged five balls for 73 yards. No other Colt had more than 30 receiving yards, with Donte Moncrief matching that figure on three catches. ",
            "9": "With Luck throwing well, things opened up for Frank Gore against the league's top rush defense. Gore tallied 83 yards and a touchdown on 28 carries. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "The Cowboys have had some terrible luck ever since losing Tony Romo. They blew huge leads to the Falcons in Week 3; lost to the Saints in overtime after Sean Lee got hurt the following week; outplayed the Giants, but sustained a defeat because of special teams after the bye; dropped a game to the Seahawks by one point last week; and now this. This latest loss felt a lot like the New Orleans defeat. In fact, it was exactly like that loss. The Cowboys played evenly - or perhaps even better - with the opposition until losing Sean Lee to an injury. Lee was knocked out with a concussion yet again, and Philadelphia's offense was unstoppable after that, with the offensive coordinator, much like Sean Payton, constantly targeting Lee's replacement. Despite this, the Cowboys still took the game to overtime. However, like New Orleans, Philadelphia won the coin toss and went the distance for a touchdown. Not only did it win, but it covered the three-point spread - the exact number in the Saints contest. The Cowboys, and those who bet on them, have been snake-bitten this year. Believe me, I know. ",
            "2": "With Lee out of the lineup, the Cowboys wilted against the run. As a result, the three primary Philadelphia backs combined for 173 rushing yards on 34 carries. DeMarco Murray, battling his old team, led the way with 83 yards and a touchdown on 18 attempts. He also did great work as a receiver out of the backfield, catching six balls for 78 receiving yards. Dallas had no answer for him; once Lee was gone, it seemed like Murray picked up double-digit yards every time he touched the ball. As for the other backs, Ryan Mathews tallied 67 yards and a touchdown on 11 tries. He didn't catch a pass, thanks to a drop. Darren Sproles (5-23) was also mixed in. ",
            "3": "With the running game humming, play-action opportunities opened up for Sam Bradford, who had a solid evening. He went 25-of-36 for 295 yards and a touchdown to seal the victory in overtime. Bradford didn't throw an interception, which is a positive development, but the Cowboys don't have a very opportunistic defense. Dallas also couldn't get to Bradford very effectively, despite the absence of Jason Peters. ",
            "4": "Bradford's game-winning touchdown was fired to Jordan Matthews, who zoomed past a gassed Dallas defense. Matthews notched nine receptions for 133 yards. Dropping passes has been an issue for him all year, but that wasn't prevalent at all in this contest. ",
            "5": "Other Eagles of note include Zach Ertz (5-44), who made a terrific catch along the sideline late in the game, and Josh Huff (2-10) who had a terrible drop in the red zone that nearly popped into the arms of a Dallas defender. ",
            "6": "The Cowboys, meanwhile, did a good job of moving the chains themselves, but they shot themselves in the foot a couple of times. For instance, Matt Cassel threw a pass behind Dez Bryant early on, which forced a punt. Terrance Williams dropped a pass. Williams was flagged for offensive pass interference, negating a touchdown. The ultimate killer, however, was a Cassel pick-six as the Cowboys were driving to take the lead in the fourth quarter. Just outside of the red zone, Cassel fired a horrible out pass that was snatched by Jordan Hicks and taken the other way. There was no excuse for Cassel making that throw; he has too weak of an arm, and he has never been able to convert on an attempt like that at any point in his career. He and his coaching staff have to take blame for not knowing his limitations. Cassel still finished with solid numbers, however, going 25-of-38 for 299 yards, three touchdowns and that pick. One of Cassel's scores was inexplicable, as he lofted a Hail Mary into the end zone, which Dez Bryant somehow came up with. Bryant snared five balls for 104 yards and that touchdown. He also drew two pass interference flags on Byron Maxwell, though both calls were ticky-tack. ",
            "7": "Cassel's other two touchdowns were fired to Cole Beasley, who had a huge evening. Cassel made a point to torch Nolan Carroll, which would explain why Beasley led the team with 11 targets. He reeled in nine of them for 112 yards. ",
            "8": "Jason Witten had six receptions for 43 yards. Williams (3-27) was inefficient once again, thanks to a drop and an offensive pass interference. I have the Cowboys taking a receiver in my to replace him. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bears",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "19"
        },
        "comments": {
            "amount": "1",
            "1": "Some things never change. That was the theme of this game, as it was more of the same for both the Bears and Chargers in this upset victory by the visitor. For Chicago, it was Jay Cutler's turnovers early on. Following a Matt Slauson false start in the red zone, Cutler was strip-sacked, negating a chance for any sort of points while trailing. In the second quarter, Cutler launched a pick-six in which Jason Verrett read his eyes and recognized the predictable route. The Bears made numerous errors elsewhere. Robbie Gould whiffed on two field goals, one of which was just from 34 yards; Kyle Long was flagged for an unsportsmanlike penalty to take the team out of field-goal range just prior to halftime; a roughing-the-passer penalty allowed San Diego to score right before intermission; and a false start should've negated a Jeremy Langford touchdown run, but the officials missed it. Despite all of these errors, the Bears were able to prevail because things didn't change for San Diego either. The Chargers' issue this year has been injuries, and they saw more players get knocked out in this contest. It started when Malcom Floyd hurt his shoulder when he dived for the ball in the second quarter. After that, Verrett exited with a hamstring, which was a massive blow because he was covering Alshon Jeffery so well. Verrett wasn't the only corner who sustained an injury, as Patrick Robinson also had to leave the contest. Defensive lineman Kendall Reyes got hurt after that. It's ridiculous. I remarked earlier that the Steelers are so snake-bitten this year, but the Chargers actually have it worse. This look by Philip Rivers says it all: "
        }
    },
    "numberOfGames": "13"
}