{
    "year": "2015",
    "week": "19",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "20"
        },
        "comments": {
            "amount": "10",
            "1": "The Patriots limped toward the end of the season, losing to both the Jets and Dolphins, which ultimately cost them home-field advantage. They were so incredibly banged up that Bill Belichick didn't even want to risk Tom Brady's health in an overtime contest against a fierce Jets defense. Belichick was willing to concede those games for a chance at the ultimate prize, and as always, he made the correct decision. Most of New England's players were set to return for this contest, though there was some concern with Rob Gronkowski and his back. That turned out to be a non-factor, as Gronkowski was completely dominant. Brady, meanwhile, seemed to be back to form - though there were a few shaky moments early on. The Patriots scored on their opening drive, throwing on every single play. Brady's first pass was way behind Julian Edelman, but he then hit Edelman on a sharp, 11-yard throw on a third-and-10. Brady went back to Edelman for 13 on the next play, as their chemistry was still so strong that a clueless football fan wouldn't have known that Edelman missed any time. However, the Patriots stumbled a bit after that. For instance, Brady missed Edelman for what would've been a huge gain. Edelman then dropped a pass that was nearly intercepted, and James White followed that up with a drop of his own. The Patriots went into the break with a 14-6 lead, which should've been much greater. However, they were able to convert most of their drives into points by finally getting their act together. They ultimately went up two touchdowns, though the Chiefs scored at the end to decrease the margin to seven. ",
            "2": "Brady, as mentioned, was guilty of some errors early, but had a great performance overall. He went 28-of-42 for 302 yards and three touchdowns (two passing, one rushing). He was nearly picked once by Marcus Peters, but that was one of his few blemishes in the second half. ",
            "3": "Both of Brady's scores went to Gronkowski, who showed no signs that he had any sort of back issue. He caught seven of the eight passes thrown to him for 83 yards and the touchdowns. He trailed only Edelman in the receiving department; Edelman saw a whopping 16 targets and hauled in 10 of them for an even 100 yards. As mentioned, he had a drop, and Brady missed him for what would have been a huge gain. ",
            "4": "Danny Amendola is worth noting, but not because of his stat line, which was a meager two catches for 18 yards. He lit up a Kansas City special-teams player on an absolutely dirty hit on a punt return. It wouldn't surprise me if he happened to be suspended for that, especially with what happened last week in the Cincinnati-Pittsburgh blood bath. ",
            "5": "The Patriots barely ran, but why would they? The Chiefs are stout versus the rush, and Steven Jackson isn't any good. Jackson was limited to just 16 yards on six carries. ",
            "6": "The Chiefs, meanwhile, couldn't run the ball as much as they wanted to because they were constantly trailing. They rushed 23 times, excluding Alex Smith's scrambles, compared to 50 pass attempts. Charcandrick West dropped a pass, but scored a touchdown to complement his 17-61 line. Spencer Ware, meanwhile, was nowhere to be seen for some reason. Knile Davis (6-30) shared the workload with West, but was guilty of a key fumble when the score was 14-6 in the third quarter. ",
            "7": "As for Smith, he played the best he could have, but proved to be just too limited. He made some sharp throws, even converting some third-and-long situations, including one play in which he dodged three potential sacks to find Jason Avant for a 26-yard gain. However, Smith struggled in the red zone, which was expected. Smith went 29-of-50 for 246 yards and a touchdown, which doesn't look that bad at first glance, but his YPA (4.92) is pretty brutal. Smith did, however, make up for it by picking up 44 yards on the ground. That said, Smith is just way too limited to lead a team deep into the playoffs. He can beat up on bad teams during the regular season, but he'll never overcome top-level competition. ",
            "8": "It didn't help Smith's cause that Jeremy Maclin barely played. Maclin was constantly on and off the field. It appeared as though he would be fine after reeling in an early catch on a third down to move the chains, but he limped off at one point and wasn't heard from again. He caught two passes for 23 yards. ",
            "9": "The trio of Jason Avant (4-69), Albert Wilson (5-57, TD) and Chris Conley (5-33) tried their best to replace Maclin, as well as Travis Kelce (6-23), who was erased by Belichick's schemes. Avant was the best of the bunch, as he showed off some great hands. ",
            "10": "Andy Reid's abysmal clock management needs to be mentioned. Down 14, the Chiefs took their time on a drive late in the fourth quarter. They were ultimately set up with a first-and-goal at the 1-yard line with 2:50 remaining. However, they somehow ran just one play prior to the 2-minute warning. After that, the Chiefs actually huddled up with 1:40 on the clock, as it ticked down. It reminded me so much of the Patriots-Eagles Super Bowl 11 years ago when the Eagles took their time and Donovan McNabb puked all over the field. It's astonishing that Reid hasn't fixed this problem after more than a decade. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "20"
        },
        "comments": {
            "amount": "1",
            "1": "I posted the following on my Facebook wall at the very end of regulation: "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "This game appeared to be over before it started. Jonathan Stewart broke free for a 59-yard burst on the very first snap, setting up a touchdown of his own three plays later. Seattle then gave Carolina another touchdown immediately right after that, as Russell Wilson, who was under pressure from Kawann Short, panicked, released the ball inaccurately, and watched it get intercepted and taken back by Luke Kuechly for six. Just like that, Carolina up was 14-0. The Seahawks didn't seem to have any hope of coming back either; they were completely out of whack, as they were both half-asleep because of the early start time, and it didn't help that they complained about the field turf on Carolina's sloppy surface, which was absolutely inexcusable. I don't get how the NFL allowed it to be that bad, but Roger Goodell always seems content with screwing over Seattle in every way imaginable because he doesn't want them in the Super Bowl. The horrible turf appeared to be in the Seattle players' heads, as they were heard shouting about needing different cleats throughout the first quarter. It was completely ridiculous and highly unprofessional on the NFL and the Panthers' part. At any rate, the Panthers continued to dominate throughout the first half. They generated their longest drive of the season, time-wise, and then Wilson threw an interception because he was hit as he released the ball. On that very play, Russell Okung was knocked out with an injury, which severely diminished Seattle's pass protection. The Panthers ultimately went up 31-0, and at that moment, Wilson was 2-of-5 for 34 yards and two interceptions with no rushing yards. Wilson led an incredible charge to shorten the margin to 31-24, but simply made too many mistakes and ran out of time. Carolina hung on and will battle the Arizona Cardinals in the NFC Championship next week. ",
            "2": "Cam Newton had a strong performance, especially considering that the Seahawks did a great job of limiting him on the ground. Newton scrambled 11 times for only three rushing yards, but he made up for it aerially. Newton misfired just six times, going 16-of-22 for 161 yards and a touchdown. Newton was great, showing no fear when throwing in Richard Sherman's direction. Sherman was especially bad, struggling to cover Philly Brown, and Seattle's soft zone was especially horrific, as Panther players were open all afternoon. ",
            "3": "Carolina's leader in receiving yardage was predictably Greg Olsen, who snatched all six of his targets for 77 yards and a touchdown, had a scary moment when he left the game with a shoulder injury after securing a first-down reception in the final quarter. Fortunately for the Panthers, Olsen was able to return near the end of the game. ",
            "4": "I mentioned Stewart's 59-yard gain at the very beginning. He didn't break any big ones after that, but he did a solid job of picking up decent chunks and ultimately finished with 106 yards on just 19 carries. ",
            "5": "Meanwhile, the Seahawks were able to compile some great passing stats because they were down big and had to throw on almost every down. Marshawn Lynch, perhaps in his final game with the Seahawks, rushed just six times for 20 yards. He didn't get much of an opportunity, but he didn't look good when given the ball. He appeared to be the same, worn-down back who struggled earlier in the year. So, how good were the passing numbers? Wilson went 31-of-48 for 366 yards, three touchdowns and the two early picks to go along with three scrambles for 32 rushing yards. However, stats can be misleading, and Wilson didn't have a great game, even if you don't take the interceptions into account. Wilson simply blew lots of opportunities. For example, he missed a wide-open Doug Baldwin for a 63-yard touchdown in the third quarter. Wilson failed to hit Baldwin again after that, and then he misfired to an open Jermaine Kearse for a big gain. Wilson was also guilty of a horrible delay-of-game infraction on the final drive. The Seahawks were also inexplicably guilty of a false start and an illegal motion on that very same possession. The Seahawks just lacked focus all afternoon, and Pete Carroll was guilty of this as well. He could've kicked a field goal at the end of the first half, but passed up on the opportunity. Had he tried the three, Seattle could've focused on scoring a touchdown at the end to tie the game. ",
            "6": "Baldwin had a solid stat line despite the failed connections, catching eight balls for 82 yards. He trailed only Kearse in the box score, as Kearse logged 11 receptions for 110 yards and two touchdowns. Tyler Lockett (3-75), who dropped a pass, hauled in Wilson's third score. ",
            "7": "The Seahawks need offensive line help, badly. That was evident in this game, as Carolina's pressure forced two interceptions. I have them taking a tackle in my . <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "16"
        },
        "comments": {
            "amount": "9",
            "1": "The Broncos have been one of the luckiest teams in the NFL this season. It began early when Steve Smith dropped a game-winning touchdown in the opener, and Jamaal Charles lost a fumble at the end of regulation the following week. That has continued into the playoffs, as Denver, despite the seven-point margin, was extremely fortunate to escape this contest with a victory. Pittsburgh took a 7-6 lead at the end of the first quarter and maintained a lead until the final frame. Up 13-12, the Steelers were driving and entered Denver territory. Appearing ready to go up four or eight, Fitzgerald Toussaint was given the ball, but was hit hard by Bradley Roby. He lost the fumble, and Denver recovered on its own 35. Peyton Manning had a chance to take the lead, but threw a pass right to Steelers' corner William Gay - not that there's anything wrong with that - but Gay dropped the ball, though Emmanuel Sanders helped by grazing it. An interception there in Denver territory would've all but sealed the victory for Pittsburgh, but the Broncos were given second life. They took advantage of it and drove down the field. They scored a touchdown, converted the two-point conversion, and then stopped the Steelers, who called a couple of dumb plays that went no where. A front-door covering field goal and a back-door pushing kick later, and the Broncos walked away with a seven-point victory. I say the Broncos were fortunate to prevail because Manning and his receivers struggled immensely. Manning had a couple of nice passes, but most of his attempts were wobblers that either sailed out of bounds or bounced in front of his targets. Meanwhile, his supporting cast was guilty of a whopping five drops. Also, Manning's longest pass, a 34-yarder to Emmanuel Sanders, should've never happened. Manning, who was about to be sacked, gave himself up to avoid a hit, like he usually does. However, he realized he wasn't touched, so he got up and fired a shot to an open Sanders despite the fact that some Steelers stopped playing. An irate Mike Tomlin tried to challenge the call, but it was ruled unreviewable for some reason. Manning's final numbers weren't terrible, but they resembled his other playoff choke-job performances. He went 21-of-37 for 222 yards and no touchdowns. Again, Manning was extremely lucky to get away with a victory and no turnovers, and a big chunk of his yardage was a complete fluke. If the Steelers hadn't fumbled deep in Denver territory, he would've been one-and-done once again. ",
            "2": "Of the five drops, Demaryius Thomas was guilty of the first one. Thomas struggled for the most part, catching just four passes for 40 yards. He left temporarily with an injury in the third quarter, but managed to return a bit later and eventually caught a two-point conversion following Denver's sole touchdown. ",
            "3": "Sanders had the second drop, but he led the team with five catches for 85 yards. With Manning struggling, Sanders and Thomas were the only players who logged more than two receptions. ",
            "4": "C.J. Anderson and Ronnie Hillman both committed drops as well. They had an equal workload, but Anderson was once again the better back. Anderson gained 72 yards and a touchdown on 15 carries, while Ronnie Hillman's 16 attempts went for just 38 yards. Most of Anderson's yardage came on a 34-yard burst, and he also had another big gain (28 yards), but that was called back because of a holding penalty by Michael Schofield, who couldn't break free from the opposing pass-rusher. ",
            "5": "As for the Steelers, there was some question as to Ben Roethlisberger's health heading into this contest. Roethlisberger proved his arm strength wasn't an issue on his first throw, as he launched a bomb to Markus Wheaton, which was overthrown. Roethlisberger played well for the most part, considering that A) he didn't have Antonio Brown, and B) he was battling one of the top defenses in the NFL. Roethlisberger went 24-of-37 for 339 yards. His numbers would've been even better had Markus Wheaton not dropped a touchdown on a fourth-down attempt in the first quarter. Like the Broncos, Pittsburgh was guilty of numerous drops as well. ",
            "6": "Martavis Bryant, who was guilty of a drop, was an absolute monster. The Broncos had no hope of covering him, as Bryant snatched nine passes for 154 yards. He also ran for 40 yards on a reverse, which set up Pittsburgh's first touchdown. ",
            "7": "With Brown out, some other Steelers had to pick up the slack. Third-round rookie Sammie Coates appeared to be that guy when he caught a deep pass early, but he finished with just two receptions for 61 yards. Wheaton (5-30), as mentioned, should've caught a touchdown. ",
            "8": "Bryant was actually the Steelers' leading rusher. Toussaint had no room to do anything, though he did score a touchdown. He finished with 39 yards on 12 carries, but was guilty of that horrible fumble that gave Denver the victory. ",
            "9": "The Steelers need to upgrade their punter, who struggled mightily. The secondary is a more pressing issue, so I have them addressing that area in my . <div class=dfpAdSlots> <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "4"
}