{
    "year": "2009",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "Even if you're a Bears, Packers or Vikings fan, it's hard not to feel sorry for the Lions. Despite what the final score may say, this game was very close for three quarters, and Detroit even dominated the first half. The Lions had 11 of the initial 14 first downs, and were outgaining the Vikings in yardage, 150-113, at halftime. Unfortunately, an NFL game is 60 minutes. Matthew Stafford tossed two picks - one late over the middle - and the Lions forgot how to tackle on an Adrian Peterson 27-yard touchdown run. ",
            "2": "Stafford finished 18-of-30 for 152 yards, one touchdown and two picks. One of the interceptions came late when Stafford was trying to make a play, so it's hard to fault him for that. Stafford made some nice throws, so even though he played poorly late in the game, Lions fans should be encouraged. ",
            "3": "Detroit was able to outgain the Vikings early by involving Kevin Smith and Calvin Johnson as much as possible. Smith touched the ball 26 times out of 66 plays (83 rushing yards, 10 receiving yards). Megatron, meanwhile, had five grabs for 51 yards and a touchdown. ",
            "4": "Brandon Pettigrew also took part in the passing game, catching four balls for 40 yards. ",
            "5": "Brett Favre's numbers look pretty, but it was hard to be impressed watching this game. Favre was 23-of-27 for 155 yards and two touchdowns. His YPA is 5.7, and that doesn't even tell the entire story. Favre should have thrown multiple interceptions. He launched what looked like a punt toward his target in the third quarter. If Anthony Henry had turned around, he would have caught an easy pick. A few plays later, Favre lollipopped the ball downfield and nearly tossed another interception. He also took too many sacks early on. ",
            "6": "Favre has played the Lions and Browns thus far. Things are going to get a lot uglier when the opposing defense can actually take the run away and Adrian Peterson can't bail him out. Unfortunately, Detroit could not contain Peterson, who rushed for 92 yards and a score on just 15 carries. Of course, one has to wonder why Peterson got only 15 carries. ",
            "7": "Two games and two touchdowns for Percy Harvin. Harvin caught five balls for 41 yards and the score. Bernard Berrian grabbed six balls for 46 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "24"
        },
        "comments": {
            "amount": "2",
            "1": "This was an insane game in which a bunch of crazy things happened: - The Packers, down seven with less than a minute remaining, recovered an onside kick. Aaron Rodgers (21-of-39, 261 yards, TD) drove the Packers down to Cincinnati's 10-yard line. Fortunately for the sanity of all Bengals fans, Green Bay ran out of time; Jermichael Finley (4 catches, 56 yards) committed a false start penalty with less than 10 seconds left. By rule, the game concluded with a 10-second runoff. - Bengals defensive end Antwan Odom had FIVE sacks. Packers left tackle Chad Clifton suffered an injury and had to go into the locker room for X-rays for his ankle. Right tackle Allen Barbre, meanwhile, was just as horrible as he was Sunday night. In total, Aaron Rodgers was sacked six times. - Cedric Benson (29 carries, 141 yards) gained 4.9 yards per rush! Yes - CEDRIC BENSON gained 4.9 yards per rush! - Chad Ochocinco (4 catches, 91 yards) caught a touchdown in the second half. Ochocinco kept his word and made a Lambeau Leap. However, there's a bit of an asterisk there, as Ochocinco leaped into the arms of three Cincinnati fans sitting in the front row. Scott Hanson of the NFL Red Zone called it the Bengal Bounce. - Believe it or not, the Bengals converted a 3rd-and-34 in this contest. Carson Palmer (15-of-23, 185 yards, 3 TDs, 2 INTs) passed to Daniel Coats for 25 yards. Coats fumbled the ball, which was picked up by Laveranues Coles, who gained the extra yardage. ",
            "2": "Other notes: - Ryan Grant gained 46 yards and a touchdown on 14 carries. Cincinnati's defense is for real. - Donald Driver made a couple of impressive catches on Green Bay's final drives. He finished with six grabs for 99 yards and a score. - Greg Jennings failed to catch a single ball. He was targeted five times. - Chris Henry scored a touchdown, but it was his only reception (5 yards). He was targeted thrice. - Laveranues Coles was also targeted three times. He came up with two grabs for nine yards and a touchdown. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "I'm not even going to talk about the Jaguars except for this - I've never seen a more lazy, slow and sluggish team this early in the year in my 10 years covering the NFL for this Web site. Jacksonville has already given up. I'll have more on this tomorrow. ",
            "2": "Quick Jacksonville stats: David Garrard was 23-of-43 for 282 yards, two touchdowns, (most of that late in the game) a pick and three fumbles. Torry Holt had six catches for 65 yards. Mike Sims-Walker collected six receptions for 106 yards and a score. Maurice Jones-Drew managed 66 yards on just 13 carries (WTF?) and four catches for 17 more yards. ",
            "3": "Now let's discuss a real team that actually showed up to play. Kurt Warner set an NFL record for completion percentage in game, going 24-of-26 for 243 yards and two scores. Warner looked like he was 50 years old last week, but he seemed rejuvenated on Sunday, though it should be noted that his longest completion was only 22 yards. It's amazing what playing a quitting team can do for you. ",
            "4": "Chris Wells ran well in this game - seven carries for 44 yards - but he fumbled twice and wasn't given the ball much late in the contest. Tim Hightower stole his touches, gaining 72 yards and a score on 15 attempts. ",
            "5": "Anquan Boldin and Steve Breaston, who did nothing last week because of injuries, are finally healthy again. Boldin had eight catches for 69 yards. Breaston managed five receptions for 83 yards. Larry Fitzgerald was the only wideout who caught a touchdown (4 catches, 34 yards). <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Raiders won, so I shouldn't criticize them too much. Actually... nah, I'll criticize. After all, Kansas City crushed Oakland in terms of yardage, 409-166. - I don't know why the Raiders aren't giving the ball to Michael Bush. Bush is easily the team's best runner, yet he had just nine carries for 35 yards. Bush didn't even get his first attempt until three minutes into the second quarter. When Bush got the ball, he rushed four times for 14 yards and caught a 17-yard pass on one drive. The Raiders, as you might expect, scored their first points of the day (48-yard Sebastian Janikowski field goal) on that possession. - Until the last minutes of the contest, JaMarcus Russell was terrible. Before the final drive, he was 3-of-17 for 42 yards. Oakland fans must have celebrated when he notched his fourth completion, but they were even more gleeful when he inexplicably led Oakland to a game-winning touchdown. Russell was 4-of-7 for 67 yards on the final sequence. - Darrius Heyward-Bey caught the first pass of his career, which was an 18-yarder. However, Heyward-Bey was targeted six times. It seemed like Russell was trying too hard to force him the ball. Coincidentally, the Raiders scored the winning touchdown after Heyward-Bey left the game with an injury. ",
            "2": "If I'm to criticize the Raiders, I have to do the same to the Chiefs: - The Chiefs wasted two timeouts early in the first half. Late in the second quarter, Cassel threw a short pass (shocker) to a receiver who couldn't get out of bounds deep in Oakland territory. The Chiefs didn't have a timeout, so they couldn't stop the clock and the half expired. - Matt Cassel was 24-of-39 for 241 yards, one touchdown and two picks. Cassel began the game 11-of-20 for 75 yards (a YPA of less than 4). He opened things up in the second half, but that's when he tossed both interceptions. ",
            "3": "I will give Todd Haley credit for being aggressive. In the first quarter, he went for it on fourth down and attempted an onside kick a few minutes later. Unfortunately, it's tough to be too aggressive with a quarterback with no arm strength. ",
            "4": "Larry Johnson had a lackluster day versus Oakland's stout front seven, gaining 78 yards on 24 carries. ",
            "5": "Bobby Wade actually led the Chiefs wideouts in receptions with six for 72 yards. Dwayne Bowe had five catches for 56 yards and a touchdown. Bowe's 29-yard score came when Nnamdi Asomugha was out of the game with dehydration. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "9"
        },
        "comments": {
            "amount": "3",
            "1": "The Jets talked all week, but the important thing is they backed it up. They didn't quite embarrass the Patriots, but they beat them up pretty soundly. Tom Brady didn't look right all game. He was constantly pressured and was frequently off-target on downfield shots. He also looked very uncomfortable and hesitant. Brady was an anemic 8-of-20 for 66 yards in the second half. It was so bad that Julian Edelman led the team in receptions. Edelman, playing in the slot in place of an injured Wes Welker, had eight catches for 98 yards. Even Joey Galloway (5 catches for 53 yards) out-produced Randy Moss. Moss caught four balls for 24 yards, as he was completely shut down by Darrelle Revis. Aside from Nnamdi Asomugha, it's very clear that Revis is the top corner in the NFL. ",
            "2": "Mark Sanchez didn't have pretty stats - he was 14-of-22 for 163 yards and a touchdown - but he once again did a great job moving the chains and avoiding turnovers. Sanchez was at his best when it counted; he was 11-of-17 for 148 yards and the score in the second half. Sanchez nearly had a second touchdown twice; Chansi Stuckey caught the ball with a foot out of bounds and then slipped a few plays later. ",
            "3": "The Jets' skill-position players had equal touches. Leon Washington and Thomas Jones had 14 carries each for 58 and 54 yards, respectively. Washington will continue to take more of Jones' work. Meanwhile, both Jerricho Cotchery and Chansi Stuckey caught four balls for 87 and 37 yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Saints",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "22"
        },
        "comments": {
            "amount": "8",
            "1": "During the pre-game player introductions, Sheldon Brown came out of the tunnel wearing a Michael Myers mask. I don't think Brown expected that his own team would be murdered that afternoon. ",
            "2": "The Eagles could not contain Drew Brees, and I'm not sure anyone can. Brees was 25-of-34 for 311 yards, three touchdowns and a pick. Brees is now on pace to throw 72 touchdowns, which would beat Tom Brady's record by only 22. ",
            "3": "Marques Colston dominated Philadelphia's secondary, catching eight passes for 98 yards and two touchdowns. Jeremy Shockey chipped in with four grabs for 49 yards. Devery Henderson hauled in three balls for 71 yards. Unfortunately for Lance Moore owners, their guy didn't log a single catch. ",
            "4": "Pierre Thomas was active, but didn't really do much. The Frenchman caught one pass for a loss of four yards. He didn't carry the ball at all. Instead, Mike Bell garnered 86 yards and a touchdown on 17 attempts. ",
            "5": "The big story going into this game was Donovan McNabb's rib injury. Kevin Kolb started and threw for 391 yards and two touchdowns, including a beautiful 71-yard bomb to DeSean Jackson. Unfortunately, he also tossed an ugly pick (he should have had more that were dropped) and took untimely sacks. He had two interceptions later in the game when the Saints up big. The Eagles didn't need a quarterback three years ago, so it's now apparent that their No. 1 selection in 2007 was an epic fail on all levels. It could be Jeff Garcia time in Week 3. ",
            "6": "With a backup quarterback at the helm, Andy Reid did a poor job not getting the ball into the hands of Brian Westbrook. Westbrook had just 17 touches (52 rush yards, 14 receiving yards) out of 75 plays. ",
            "7": "Jackson had the long touchdown and finished with 101 yards on four receptions, but he wasn't the Eagles' leading receiver. That was Brent Celek, who hauled in eight grabs for 104 yards. Jason Avant, meanwhile, notched seven catches for 79 yards and a score. ",
            "8": "Sean Payton is now 9-2 against Andy Reid when he's coaching a winning team. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Texans",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "What a difference a week makes. Last Sunday, the Texans couldn't score a single offensive touchdown. This Sunday, they hung 34 on Tennessee's supposed great defense. ",
            "2": "Matt Schaub was terrific, going 25-of-39 for 357 yards and four touchdowns. He did a great job moving the chains and helping the Texans win the time-of-possession battle by nine minutes. ",
            "3": "Andre Johnson, shut down by Darrelle Revis last week, exploded against the Titans, catching 10 balls for 149 yards and two touchdowns. In the past two seasons, the Texans are now 8-2 when Johnson accumulates at least 75 yards. ",
            "4": "The only offensive blemish for the Titans was their inability to run the ball. Steve Slaton had at least 100 rushing yards in both meetings against Tennessee last year, but managed only 34 yards on 17 carries on Sunday. ",
            "5": "Of course, a huge blemish for Houston was its defense, which gave up three huge plays to Chris Johnson early in the game. Johnson had scores of 57, 69 and 91 yards. The Texans looked like they had only six men on the field on the first one. Johnson was uncovered when he was split out wide on the second. And the last was a long burst from Tennessee's 9 on a 3rd-and-10. Johnson finished with 197 rushing yards and 87 receiving yards, destroying all of his fantasy opposers. ",
            "6": "Kerry Collins was an economical 21-of-33 for 216 yards, two touchdowns and a pick. Nate Washington was his leading receiver with four catches for 36 yards and a score. Justin Gage and Kenny Britt caught two balls each. ",
            "7": "There was a fight in this game in the fourth quarter. On a Slaton run, one of the Texans ripped off Keith Bulluck's helmet. When players from both teams started pushing each other around, it looked like Bulluck spit on one of the Texans who was on the ground. There was a huge brawl on the sidelines, but both teams were given offsetting penalties. Jason Jones was kicked out of the game. I made a note during this fight: Even if the Texans lose, give them credit for showing grit and toughness on the road. Well, the Texans deserve major credit. Now they just have to get over the Indianapolis hump. The Titans, meanwhile, are 0-2. Once again, they could not get any pressure up the middle with their front four. Albert Haynesworth is very missed. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "9"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "The reason I didn't have the Redskins making the playoffs is because I don't trust them. Last year, they lost at home to a winless Rams team after two tough road victories. They once again didn't show up for this matchup, but at least they won this time. ",
            "2": "Just as I don't trust the Redskins, the Redskins don't trust Jason Campbell (23-of-35, 242 yards). Jim Zorn once again took the ball out of Campbell's hands when it mattered most. For example, on one red-zone trip, Clinton Portis ran left guard for a loss and up the middle for no gain. On third down, Portis was given the ball and he threw an incompletion to Chris Cooley. Washington has yet to score 30 points under Zorn, and it's not hard to see why. ",
            "3": "Zorn almost made a huge gaff in this game. Up 9-7 with two minutes remaining in regulation, Zorn went for it on 4th-and-1 on the St. Louis 5, eschewing a field goal. The Redskins failed, so all the Rams needed was a field goal to win. Fortunately for Washington, Marc Bulger couldn't convert a single first down. ",
            "4": "Campbell needs to get the ball more to Santana Moss. Moss once again had a lackluster performance, catching just three balls for 35 yards. Chris Cooley led the team with seven receptions for 83 yards. ",
            "5": "Clinton Portis ran well, gaining 79 yards on 19 carries. However, fantasy owners were expecting a lot more. There's no reason Portis should have received less than 25 attempts in this game. This was yet another of Zorn's errors. ",
            "6": "Two guys who didn't disappoint were Steven Jackson and Laurent Robinson. The former mustered 104 yards on 17 rushes, while the latter hauled in six balls for 54 yards and a touchdown. ",
            "7": "Marc Bulger was a horrific 15-of-28 for 125 yards and a score, giving him a YPA of 4.5. There is no doubt that Bulger's starting days in the NFL are numbered. ",
            "8": "Donnie Avery disappointed with one catch for four yards. It might be time to consider Robinson as the better fantasy option. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bills",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "This was billed as the Battle of the Teams That Fired Their Offensive Coordinators a Week Before the Season. Catchy title, I know. While the Bills have looked solid in two games, the Buccaneers have done a great job embarrassing themselves for the past 120 minutes. ",
            "2": "There is no reason Byron Sandwich should be a starter in this league. Luke McCown out-performed Sandwich in the preseason (despite lesser stats), and now the Buccaneers are paying the price. Sandwich's numbers look nice (26-of-50, 296 yards, 3 TDs), but a lot of that was junk yardage late in the game. He tossed two ugly interceptions, including a pick-six while he was falling down to Donte Whitner. ",
            "3": "With Antonio Bryant, Sandwich's favorite target was Kellen Winslow, who had seven catches for 90 yards and a touchdown. Michael Clayton had just two receptions for 27 yards. ",
            "4": "The Buccaneers couldn't run the ball because they were down early (get used to it, Tampa fans). Derrick Ward had nine attempts for 32 yards, while Cadillac Williams gained only nine yards on seven rushes. Cadillac - not Ward - contributed with seven receptions for 56 yards and a score. ",
            "5": "Fred Jackson is a stud. He rushed for 163 yards on 28 carries against Tampa Bay's anemic defense. At this point, it would be a huge error on Dick Jauron's part to give Marshawn Lynch the starting job once he returns from his suspension. ",
            "6": "Trent Edwards picked up where Tony Romo left off as he torched the Bucs' secondary, going 21-of-31 for 230 yards, two touchdowns and a pick. ",
            "7": "Amazingly, Edwards completed more passes to Derek Schouman than he did to Lee Evans and Terrell Owens combined. Schouman had six grabs for 62 yards; Owens hauled in three balls for 52 yards and a score; and Lee Evans had only a 32-yard touchdown. Owens was shut out early because he dropped a long bomb, but came back to score on a 43-yard reception. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "It's hard to believe, but the 49ers are alone atop of the NFC West. An outside observer may look at this and attribute San Francisco's victory to Matt Hasselbeck's injury, but San Francisco actually led 13-3 before he left the game. Speaking of Hasselbeck, he took a similar shot to the ribs that knocked Donovan McNabb out last week. Hasselbeck could be out a few games if he hurt his lower ribs. ",
            "2": "But sticking with the 49ers, there was a great example of Mike Singletary ball in the second half. Singletary is all about pounding the rock, controlling the clock and playing tough defense. Beginning with 1:20 remaining in the third quarter, the 49ers maintained possession until the 6:58 mark of the fourth quarter, as the drive concluded with a Joe Nedney field goal. San Francisco won the time-of-possession battle by nine minutes. ",
            "3": "The star for the 49ers was Frank Gore, who looked like he was going to break Adrian Peterson's single-game rushing record. Gore had 206 rushing yards just 12 seconds into the third quarter. Unfortunately, he carried the ball only four more times after that, as he left the contest with a minor injury. ",
            "4": "Another efficient day for Shaun Hill, who was 19-of-26 for 144 yards. Hill once again did a great job moving the chains when necessary. ",
            "5": "Because the 49ers are running such a conservative offense, their receivers aren't doing anything. Gore was the team's leading receiver with five catches for 39 yards. Isaac Bruce led the wideouts with four grabs for 35 yards. Josh Morgan failed to catch a single pass. ",
            "6": "Julius Jones was an epic failure on the ground, rushing for just 11 yards on eight carries. It's too bad Jones can't play the Rams every week. Meanwhile, Justin Forsett rushed for 35 yards on five attempts. Forsett is probably the better all-around running back even though he can't break a single tackle. Forsett chipped in with six receptions for 57 more yards. ",
            "7": "T.J. Houshmandzadeh caught four balls for 62 yards. John Carlson had six grabs for 46 yards. Seattle's aerial attack was pretty much non-existent when the Backdoor Bandit took over. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bears",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Jay Cutler deserves a ton of credit. A week after carelessly launching interceptions late across the middle of the field, Cutler was sharp and accurate against arguably the top defense in the league. Cutler went 27-of-38 for 236 yards and two touchdowns. ",
            "2": "Amazingly, Cutler's top receiver wasn't Greg Olsen (3 catches, 41 yards), Earl Bennett (2-22) or Devin Hester (4-21). It was rookie Johnny Knox, who hauled in six grabs for 70 yards and a score. Knox was responsible for an interception last week, but he more than made up for that in this contest. On a team with no true No. 1 wideout, Knox could be emerging as that guy. ",
            "3": "Matt Forte couldn't get anything against Pittsburgh's vaunted defense. Forte rushed for only 29 yards on 13 carries. Forte also chipped in with five receptions for 33 more yards. He'll play well when he's not going against a top-ranked stop unit. ",
            "4": "Ben Roethlisberger was his usual self, going 23-of-35 for 221 yards, a score and a pick. Roethlisberger went to Santonio Holmes five times (83 yards) and Hines Ward six times (57 yards). Holmes had a key touchdown drop on Pittsburgh's final drive. ",
            "5": "The Steelers once again couldn't run the ball. Willie Parker gained just 47 yards on 14 attempts. Rashard Mendenhall had a 39-yard rush, but didn't do anything outside of that. Mewelde Moore, meanwhile, was once again the man on third downs and in the fourth quarter. Moore had five touches for 28 yards. ",
            "6": "While the hero of this game was Cutler, the goat was clearly Jeff Reed. Reed missed two fourth-quarter field goals from 38 and 43 yards. When Robbie Gould knocked in the game-winner on Chicago's final drive, Reed seemed to be in tears on the sideline. I'm sure he wasn't crying, but it certainly looked like he was. Maybe it was the rain, right Jeff? "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "6",
            "1": "Another loss and another game without an offensive touchdown for Cleveland. The Browns' 27-6 defeat at the hands of Denver marked the seventh time in eight contests that they've failed to score an offensive touchdown. This stat is probably more embarrassing than Detroit's 19-game losing streak. ",
            "2": "I said last week that it might be time for the Brady Quinn era to come to an end. Well, I'm going to say it again, only this time without the might. Quinn is awful; he's a turnover machine (one interception, one fumble) and he refuses to take any downfield shots. Furthermore, he led Cleveland to just 11 first downs. Derek Anderson is the better option despite his accuracy issues. ",
            "3": "Braylon Edwards was the lone bright spot for Cleveland's offense, catching six balls for 92 yards. Jamal Lewis, meanwhile, mustered 38 yards on 14 carries. James Davis will have to be the starter once he's healthy again. ",
            "4": "Kyle Orton is now 2-0, but he was brutally mediocre once again. Orton went 19-of-37 for 263 yards and a touchdown. All of his yardage came via the receivers after the catch. ",
            "5": "Of course, Orton didn't really need to throw at all because the Browns couldn't stop the run. Correll Buckhalter rushed for 76 yards on nine carries, including a 45-yard score in which Denver's offensive line blew open an enormous hole. Meanwhile, Knowshon Moreno collected 75 yards on 17 rushes and 22 more yards on two receptions. He'll continue to gain more work as we go on. ",
            "6": "Brandon Stokley led the Broncos with five receptions for 70 yards. Jabar Gaffney (82 yards), Brandon Marshall (34) and Eddie Royal (20) all hauled in three catches. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "I've had the Ravens No. 2 in my <b> <a href=/nflpowerrankings.php> 2009 NFL Power Rankings</a></b> for a few weeks now, and they didn't disappoint me with a victory here. Baltimore is one of the most underrated teams in the league because most casual football fans don't understand how potent their offense is. The Ravens went stride for stride with the high-flying Chargers, beating them in first downs, 22-20. ",
            "2": "Joe Flacco wasn't great, but he was very solid, going 17-of-26 for 190 yards, two touchdowns and a pick. The interception wasn't his fault; a Chargers defender was offside and caused Flacco's pass to be errant. The official missed the call. ",
            "3": "A frustrating day for Ray Rice owners. Rice rushed for 36 yards on eight carries and chipped in with five receptions for 46 yards. The yardage wasn't bad, but Rice once again relinquished goal-line opportunities to Willis McGahee. McGahee gained 79 yards on 15 rushes and scored twice. Rice is the more talented player, but it's hard to argue with a team that's winning. ",
            "4": "Kelley Washington was Baltimore's leading receiver with four catches for 58 yards and a touchdown. Derrick Mason had just three receptions for 31 yards. Mark Clayton did nothing (one 20-yard catch). ",
            "5": "Despite not having LaDainian Tomlinson and a couple of his offensive linemen, Philip Rivers was brilliant, going 25-of-45 for 436 yards, two touchdowns and a pair of picks against Baltimore's prolific defense. Rivers did a great job shaking off the rust he had against Oakland. ",
            "6": "Rivers' favorite target was Vincent Jackson, who snatched six balls for 141 yards and a touchdown. Chris Chambers did nothing again (2 rec., 30 yards). ",
            "7": "Though the point total and the net yardage says otherwise, the Chargers really missed LaDainian Tomlinson. They had to kick field goals every time they reached the red zone because they couldn't run the ball. Sproles is a terrific weapon out of the backfield (7 catches, 124 receiving yards, TD) but he's a very poor inside runner. Sproles managed just 26 yards on 10 carries. "
        }
    }
}