{
    "year": "2009",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "Poor Browns. After scoring only one touchdown since November 2008, they were finally able to get on the board. Overcoming a 14-0 lead, they managed to hold a 20-14 advantage until Carson Palmer threw a game-tying touchdown to Chad Ochocinco with two minutes remaining (the extra point was blocked). The Bengals subsequently won with three seconds remaining in overtime. ",
            "2": "This was a weird game. If Donovan McNabb were watching, he may have thought that the Browns and Bengals would take about 100 overtime periods to score; neither offense could anything. Earlier, Shaun Rogers managed to block two kicks: a field goal and an extra point to send it to overtime. And even earlier, it appeared as though Cleveland always had the ball. Starting on the last play of the first quarter, the Browns held possession for 17.5 of the next 27.5 minutes. ",
            "3": "As you can probably surmise, Derek Anderson did a great job moving the chains in those two quarters. He was 26-of-48 for 269 yards, one touchdown and a pick. Anderson made a stupid throw into the end zone which resulted in an interception, but it was very evident that Cleveland's offense was actually a threat with him under center. He needs to be the starting quarterback going forward. ",
            "4": "As great as Anderson played, it's hard to believe that Braylon Edwards failed to log a single reception. He did drop a pass, but it was refreshing to see some other Browns step up. Mohamed Massaquoi somehow caught eight balls for 148 yards. Steve Heiden and Jerome Harrison both snatched five receptions. Mike Furrey had four catches for 37 yards. Unfortunately, Kellen Winslow Jr.'s replacement, Robert Royal, had a pass hit him right on the helmet on Cleveland's final drive of regulation that would have given the team a huge first down. ",
            "5": "Speaking of Jerome Harrison, Cleveland's new starting running back had 121 yards on 29 carries. He'll share time when Jamal Lewis comes back, but it's good to know that Cleveland has a viable option with James Davis on IR. ",
            "6": "Carson Palmer wasn't on the field much in regulation, but thanks to overtime, he was able to pad his stats. He was 23-of-44 for 230 yards, two touchdowns and a pick. Palmer's best play was a clutch 15-yard scramble on fourth down in overtime that put Shayne Graham in position for the game-winning field goal. ",
            "7": "Chad Ochocinco caught only three passes for 24 yards, but he hauled in both of Palmer's touchdowns. Meanwhile, Chris Henry, Andre Caldwell and Laveranues Coles all had two receptions. ",
            "8": "Cedric Benson rushed for 74 yards on 18 carries. Again, Benson wasn't able to get many touches because the Browns controlled the clock for most of regulation. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Texans",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "You can't really take away much from beating the Raiders, but the good news for the Texans is that they got their running game going. Steve Slaton rushed for 65 yards on 21 carries, including a 32-yard touchdown. Ryan Moats, meanwhile, gained 56 yards on 15 attempts. I know Slaton's rushing average isn't impressive, but he really ran tough and was able to help the Texans move the chains throughout the game. He also had two catches for 24 receiving yards and a second score. ",
            "2": "Going against a tough secondary, Matt Schaub was just 11-of-22, but managed to compile 224 yards, one touchdown and a pick. ",
            "3": "Like the last time Oakland and Houston met, Nnamdi Asomugha held Andre Johnson to just two catches. However, one of Johnson's receptions went for 62 yards. He finished with 66 yards. ",
            "4": "Rounding out the rest of Houston's skill players, Owen Daniels grabbed two balls (not that there's anything wrong with that) for 48 yards, while Kevin Walter had just one 41-yard reception. As you can tell, the Texans didn't have to throw much, thanks to their running game and the fact that they had a lead the whole time. ",
            "5": "JaMarcus Russell came into this contest with a great completion percentage of 41. It's hard to imagine, but it actually got worse. Russell was 12-of-33 for 128 yards. Against the Texans. Yep. ",
            "6": "The good news is that Darrius Heyward-Bey actually caught a pass (one for 18 yards). He also had a 20-yard end-around. I don't know about you, but he looks like a Hall of Fame receiver to me. ",
            "7": "The Raiders once again avoided giving the ball to their best option; Michael Bush had only three carries for 10 yards, though he did fumble. Justin Fargas ripped off 24 yards on 10 attempts, while Darren McFadden actually managed to lose three yards on his six tries. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Colts",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "A bunch of points were scored in the fourth quarter of this game, so with that in mind, this contest should have been a 28-3 Indianapolis victory. The disparity between these two teams can be measured down to the quarterback position. At halftime, Seneca The Backdoor Bandit Wallace was 14-of-17, but for only 107 yards. Peyton Manning, meanwhile, was 17-of-20 for 220 yards. Indianapolis led 21-3 at the time. ",
            "2": "Manning finished the game 31-of-41 for 353 yards, two touchdowns and a pick. Manning has eclipsed 300 yards in every game this year. There's no hotter quarterback in the NFL, and it's not even close. ",
            "3": "As you might suspect, Manning distributed the ball evenly to all of his weapons. Dallas Clark led the squad with eight receptions for 80 yards. Reggie Wayne grabbed six balls for 74 yards and a touchdown. Austin Collie caught the other score, and also had six receptions for 65 yards. Pierre Garcon logged three catches for 71 yards. Even Joseph Addai notched seven receptions for 50 yards. ",
            "4": "Addai led the team in rushing with 46 yards and a score on 12 attempts. Donald Brown had 33 yards and a touchdown on nine carries, but once again looked like the more talented runner. ",
            "5": "Shame on the fantasy owners who started Julius Jones because the Colts couldn't stop the run. Jones rushed for just 25 yards on 11 tries. ",
            "6": "T.J. Housmandzadeh finally broke out, catching eight balls for 103 yards from the Backdoor Bandit. John Carlson had five receptions for 39 yards. Nate Burleson disappointed, finishing with four catches for 31 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "I had the Jaguars winning this game, but never in my wildest dreams did I imagine that Jacksonville would be up 30-3 at some point. I also had the Titans missing the playoffs this year per my season previews, but likewise, I didn't think they'd be 0-4 at this point. ",
            "2": "We saw it in the opener - Tennessee's front four could not get to the quarterback on its own. That has held true since, and the secondary has consequently struggled. David Garrard was nearly flawless in this contest, going 27-of-37 for 323 yards and three touchdowns. ",
            "3": "Garrard continues to go to Mike Sims-Walker. Walker-Sims caught seven balls for 91 yards and two touchdowns. Torry Holt, meanwhile, had just three receptions for 42 yards. Marcedes Lewis (4 catches, 76 yards) caught Garrard's other score. ",
            "4": "As dominant as Jacksonville was in this contest, it was shocking to see Maurice Jones-Drew so limited on the ground. Drew-Jones gained 14 yards and a touchdown on six carries. Rashad Jennings cleaned up in garbage time with 53 yards on nine attempts. ",
            "5": "Chris Johnson, like Jones-Drew, didn't get as many carries as his fantasy owners would have wanted - but obviously for a different reason. With a big deficit, Johnson was able to rush the ball only 16 times for 83 yards. ",
            "6": "Kerry Collins was forced to throw a ton and he finished 29-of-48 for 284 yards, one touchdown and two picks. Tennessee's 0-4 start is not Collins' fault, but Jeff Fisher will need to go to Vince Young soon for some sort of spark. I thought the switch would happen during the Titans' second meeting against the Jaguars in Week 9, but it may occur sooner. ",
            "7": "The silver lining here for the Titans is that Kenny Britt continued to emerge. Britt caught seven balls for 105 yards. Nate Washington also had seven receptions for 66 yards and a score. Justin Gage notched only one catch. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Giants",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "That score is deceiving; the Giants led 27-3 before the Chiefs scored two late touchdowns and nearly scared the crap out of anyone who bet on New York. If that fact doesn't tell you how much of an embarrassment this was for Kansas City, consider these numbers: - The Giants had 11 of the first 12 first downs in this game. - Four of Kansas City's first five possessions were three-and-outs. - At the 6-minute mark of the second quarter, Matt Cassel was 3-of-7 for a whopping nine yards. ",
            "2": "Cassel finished 15-of-32 for 127 yards and two touchdowns, but most of that came late in garbage time. At least the Chiefs didn't spend $60 million on this system quarterback, right? (It was $63 million.) Oh, and by the way, Cassel was sacked five times. Good thing the Chiefs are protecting their $63 million investment. ",
            "3": "Dwayne Bowe started, but had only one catch for 11 yards. Bowe will have days like this as long as Cassel is under center. His ailing hamstring didn't help. ",
            "4": "For some reason, Larry Johnson received 18 carries (53 yards) compared to Jamaal Charles' two (24 yards). Charles didn't even catch a pass. Someone needs to send Todd Haley a memo telling him that Charles can be an effective weapon for him; he doesn't seem to realize that. ",
            "5": "Eli Manning easily shredded Kansas City's pathetic defense, going 20-of-34 for 292 yards, three touchdowns and a pick. The important thing here is that Manning left the game in the fourth quarter with a heel injury. It was characterized as a bruise, so he should be OK. I'm basing this on my vast medical expertise. ",
            "6": "Steve Smith is a stud. He caught 11 balls for 134 yards and two touchdowns. Mario Manningham and Hakeem Nicks had only one reception each for 43 and 54 yards, respectively. Nicks, who was seeing his first action since his Week 1 injury, was able to score a touchdown on that catch. He'll continue to evolve into a dangerous weapon for Manning. ",
            "7": "The Giants also abused the Chiefs on the ground with Brandon Jacobs (21 carries, 92 yards) and Ahmad Bradshaw (12-64). I'm actually surprised they didn't gain more yardage. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "This was a tough game that literally went down to the last few yards. The Ravens were down 27-21, but were in the red zone with less than a minute remaining. On fourth down, Joe Flacco threw a perfect pass to Mark Clayton. Clayton simply dropped it. A reception would have given the Ravens a first-and-goal inside the 10 with 30 seconds left. ",
            "2": "Both offenses seemingly moved down the field at will. Baltimore converted 9-of-14 first downs, as Flacco was 27-of-47 for 264 yards, two touchdowns and a pick. ",
            "3": "Flacco's No. 1 target, Derrick Mason hauled in seven catches for 88 yards and a score. Todd Heap logged four receptions for 46 yards. Along with his big drop, Clayton snagged five balls for 45 yards. ",
            "4": "Ray Rice was the star for the Ravens in this contest. He rushed for 103 yards on 11 carries and caught five balls for 49 more yards. Of course, Willis McGahee stole a touchdown away from Rice and his fantasy owners despite the fact that he had only six touches. ",
            "5": "I guess it's nice to have Wes Welker back again, huh? Tom Brady was 21-of-32 for 258 yards and a score. The Patriots, who had struggled in the red zone coming into this game, scored three touchdowns on five red zone trips. ",
            "6": "As you may think, Welker led the team with six receptions for 48 yards. And as you also may guess, Randy Moss had more yards (50) and a touchdown on less catches (3). ",
            "7": "The running game worked really well last week, but the Ravens weren't going to have any of that in this contest. Fred Taylor led the Patriots with 25 yards on seven carries. Laurence Maroney, meanwhile, managed a laughable six yards on seven attempts, and was booed by the home crowd. Running laterally has once again escaped him. ",
            "8": "Scary moment in this game: Ravens left tackle Jared Gaither suffered a head injury and had to be carted off the field on a stretcher. The good news is that Gaither later had feeling in his arms and legs. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "It's hard to blame a kicker for missing 49- and 48-yard field goals, but you might wonder what could have happened if Mike Nugent nailed one of those. Nugent's two errant kicks allowed the Redskins to escape with a 3-point win. And speaking of field goals, the Buccaneers became the last team in the NFL to convert one this season when Nugent kicked a chip-shot right before halftime. Yay, Tampa Bay! ",
            "2": "Of course, Nugent wasn't the only Buccaneer who failed Sunday. Perhaps epitomizing the season thus far, Raheem Morris gave the ball to Clifton Smith on an important carry on the final drive. Smith predictably fumbled the ball away, allowing Jason Campbell to kneel down a few times. With Cadillac Williams and Earnest Graham, why was Smith getting the ball? Was this part of Morris' great RBBC rotation? Pretty ridiculous. Cadillac had 77 yards on 16 carries, so it's not like he was ineffective. Graham had just five rushes for eight yards, while Smith had two attempts for three yards. So yeah, why was Smith getting the ball again? ",
            "3": "It's sad, but Josh Johnson's 13-of-22 for 106 yards, one touchdown (to Antonio Bryant) and a pick was better than anything Byron Leftwich could have hoped for. Johnson's horrid 4.8 YPA speaks for itself, but at least he could move around; he had 41 yards on seven carries. ",
            "4": "The Redskins may have won the game, but Campbell was not any better than Johnson. Campbell was just 12-of-22 for 170 yards, two touchdowns and three picks. He also had a fumble deep in his own territory at the beginning of the game to give the Buccaneers an easy opportunity to score. Apparently, Jim Zorn had Campbell watch some film on Jake Delhomme. ",
            "5": "Santana Moss and Chris Cooley caught both of Campbell's touchdowns. Cooley had five catches for 65 yards, while Moss garnered 74 yards but on just two receptions. Campbell was too epically inept to get Moss the ball more often. ",
            "6": "Playing with two screws in his ankles and a calf injury, Clinton Portis was man enough to carry the ball 25 times, gaining 98 yards in the process. Glad to see that Zorn learned that getting the ball to his best player can pay dividends. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The good news for Buffalo is that Terrell Owens is happy. Given that he actually got involved on offense (3 catches, 60 yards), Owens was thrilled and didn't have any negative comments to share with the media. The bad news? Well, just look at the score. ",
            "2": "The Bills couldn't get in the end zone or convert third downs (1-of-11) because of their offensive line. The front five surrendered six sacks and couldn't open up any running lanes for Marshawn Lynch. Jackson was solid, gaining 42 yards on nine carries, but Lynch had four pathetic yards on eight attempts (though he did chip in with five catches for 43 yards). All of Lynch's carries came in the first half. I predicted that Dick Jauron would make a dumb choice by going to the inferior Lynch over Jackson, and I was correct. But I'm not going to take any credit; it was an easy call because Jauron can't make simple and obvious decisions, and doesn't know how to be a head coach in the NFL. ",
            "3": "With no protection and a large deficit to come back from, Trent Edwards struggled, going 14-of-26 for 192 yards, one touchdown and three picks. Two of the interceptions came in the second half, but I'm not going to tell you that Edwards was worse than advertised; his first pick was a horrible throw returned by rookie Vontae Davis for a touchdown. It's a big part of the reason the Dolphins had a huge lead in the first place. ",
            "4": "Chad Henne obviously had much less experience than Edwards going into this game, but he out-performed his counterpart, going 14-of-22 for 115 yards and a touchdown. Like Chad Pennington would have done, Henne did a great job managing the contest, converting 9-of-17 of his third downs. The difference was that Henne actually took some downfield shots. Henne didn't convert any of them, but he stretched the field and opened up room for his running game. ",
            "5": "Speaking of Miami's ground attack, Ronnie Brown burst through Buffalo's defense for 115 yards and two touchdowns on 20 carries. Ricky Williams got some garbage yardage in the second half, gaining 85 yards and a score on 16 attempts. ",
            "6": "Miami's receivers didn't contribute anything, but that's only because Henne didn't have to throw that much. Davone Bess logged three catches for 17 yards, while Ted Ginn came up with just a 4-yard reception. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Saints",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "Darren Sharper is the man. Not because he picked off Mark Sanchez twice, including one which went 99 yards for a touchdown; but because before the game, Sharper told hot reporter Rachel Nichols that he could read Sanchez's eyes to know exactly where he would go with the ball. Sharper backed up his talk and helped the Saints improve to 4-0. ",
            "2": "Sanchez really struggled. After turning the ball over just three times in his first three starts, Sanchez coughed it up four times in this contest. He was just 14-of-27 for 138 yards with three picks and a fumble. ",
            "3": "Despite Sanchez's poor performance, Jerricho Cotchery still had a solid game, catching five balls for 71 yards. Dustin Keller had only three receptions for 31 yards, while Chansi Stuckey walked away with a sole 8-yard reception. ",
            "4": "Jets offensive coordinator Brian Schottenheimer did a terrible distributing the ball between Thomas Jones and Leon Washington. Jones rushed 13 times for 48 yards, while Washington only had four attempts for 17 yards. Washington also logged four receptions for 24 more yards. Washington is the superior player and should be getting the ball more than Jones. ",
            "5": "The best running back on the field was Pierre Thomas, who led the team in rushing yards (86), receptions (4) and receiving yards (46). The Frenchman also scored a touchdown. ",
            "6": "Drew Brees was 20-of-32 for 190 yards. He didn't throw a touchdown. Remember when Brees was on pace to toss 96 scores? What happened to him? He sucks! ",
            "7": "In all seriousness, Marques Colston doesn't suck despite his meager stats (2 catches, 33 yards). Colston is just the latest receiver to run into Darrelle Revis. ",
            "8": "Rounding out the rest of New Orleans' skill players, Jeremy Shockey notched four catches for 34 yards; Devery Henderson logged three receptions for 21 yards; Lance Moore caught his first pass since Week 1 for a whopping one yard; and Reggie Bush collected 44 total yards and fumbled once. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "I had the Broncos covering this game for five units, but I'll admit that when the Cowboys took a 10-0 lead early on, I pretty much gave up on Denver and counted this as a loss in my mind. With Kyle Orton under center and horrible play-calling early on (five of the first six plays were passes), how could the Broncos win this game? Well, they did it in the trenches, as they've been doing all year. Knowshon Moreno (14 carries, 65 yards) and Correll Buckhalter (6-37) both had plenty of room to run, setting up easy short-yardage opportunities for Kyle Orton, who was 20-of-29 for 243 yards and two touchdowns. ",
            "2": "One of Orton's touchdowns went to Moreno, who also had two receptions for 11 more yards. Buckhalter was more active in the passing game with five receptions for 55 yards. ",
            "3": "The hero of the offense was Brandon Marshall, who finished with four receptions for 91 yards, including a 51-yard score where he juked five Cowboys to get the decisive touchdown. ",
            "4": "Eddie Royal had two receptions for 16 yards. Orton and Josh Mishandles have ruined his fantasy production by taking him out of the slot for some reason. I'd love to criticize, but I can't because the Broncos are 4-0. ",
            "5": "This was yet another game in which Tony Romo failed to throw a touchdown. Before this contest, Romo had never gone back-to-back games without a score in his career. That has now changed. Romo was 25-of-42 for 255 yards, a pick and two fumbles. He missed wide-open receivers all afternoon. ",
            "6": "Romo is really struggling without Terrell Owens. Roy Williams is not a No. 1 receiver; Williams garnered only three receptions for 35 yards. Jason Witten had just four catches for 31 yards. Sam Hurd actually led the team in receiving yards (62), though he couldn't come up with the tying score at the end, thanks to great coverage by Champ Bailey, Denver's hero on defense. ",
            "7": "Aside from Romo and Williams, Dallas' offensive struggles are stemming from the left tackle position. The team gave up five sacks to the Broncos. ",
            "8": "Marion Barber and Tashard Choice both had a good amount of touches in this contest. Choice carried the ball 14 times for 33 yards, but also caught five balls for 47 more yards. Barber, meanwhile compiled 41 yards and a touchdown on 11 rushes, as well as 27 receiving yards on two receptions. With that in mind, most of Barber's work came in the first half. He grimaced on some of his touches, and it was evident that he wasn't 100 percent. Perhaps Mr. Turkey Neck should have rested Barber and used Choice exclusively. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "49ers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "The Rams have to be the worst team in the league. The 49ers, despite what the score may say, didn't bring their A game. They showed up flat off an emotional loss like I expected them to. But the Rams suck so bad that they couldn't even score a single point in this contest. Good thing they had so much money invested in Marc Bulger that they couldn't draft Mark Sanchez in April. ",
            "2": "The 49ers scored two offensive touchdowns; the other three came via an interception return by Patrick Willis and two fumble returns. Willis dominated this game with eight tackles, 2.5 sacks and the pick-six. ",
            "3": "San Francisco's defense completely shut down Steven Jackson; Jackson managed 79 yards, but it took him 23 carries to get there. Of course the 49ers were able to stack the run because Kyle Boller (13-of-24, 108 yards, TD) is a joke, while the receiving corps is devoid of talent now that Laurent Robinson is out for the year. Other than that? Rams offense - awesome. ",
            "4": "Glen Coffee did a great job in place of Frank Gore. He didn't put up dazzling numbers, but he mustered 74 rushing yards, and four catches for 32 receiving yards. He also didn't fumble the ball away. ",
            "5": "Shaun Hill managed the game well yet again. Hill was 14-of-24 for 152 yards and two touchdowns. Hill's scores went to Vernon Davis (3 catches, 42 yards) and Josh Morgan (2-39). Unfortunately, Morgan also dropped another potential touchdown, which goes to show that this score could have been a lot uglier. "
        }
    }
}