{
    "year": "2008",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Jets",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "It's official: Eric Mangini has no idea what he's doing. The Jets stopped the Bills on third-and-11. Buffalo was penalized five yards. Though he had the option of declining the penalty and forcing a field goal, Mangini, in his infinite wisdom, pushed Buffalo back to make the kick tougher. Instead, Trent Edwards threw a 22-yard dart to Roscoe Parish. Fortunately for Mangini's job security and further scrutiny in this column, Edwards tossed a pick-six a couple of plays later. ",
            "2": "I guess I shouldn't bash Pizza Delivery Boy that much; the Jets won at Orchard Park for only the second time since 2002. ",
            "3": "Brett Favre did his usual great job keeping both teams in the game. Favre was 19-of-28 for 201 yards, leading the team to multiple scoring drives, but he also tossed a pick-six right into the hands of Jabari Greer. Favre went to Jerricho Cotchery the most; the wideout caught six balls for 62 yards. Laveranues Coles had three grabs for 40 yards. ",
            "4": "Like Favre, there was good and some bad from Edwards. Edwards threw the aforementioned pick-six and another interception, but he was also 24-of-35 for 289 yards and a touchdown. Amazingly, Lee Evans barely did anything; Evans had four catches for 41 yards. Robert Royal led all of Edwards' targets with five receptions and 70 yards. ",
            "5": "Marshawn Lynch had just nine carries for 16 yards. Don't panic, Lynch owners. Your workhorse running back is battling flu-like symptoms. Besides, Lynch also had three catches for 52 receiving yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "19"
        },
        "comments": {
            "amount": "4",
            "1": "I was convinced I was losing my mind around 2 p.m. Eastern. In one game, Ryan Fitzpatrick was 7-of-8 for 41 yards and a touchdown. In another game, Tyler Thigpen was 5-of-7 for 71 yards and a score. Meanwhile, Dan Orlovsky jumped out to a huge lead against the Bears. At that point, I was expecting my walls to start bleeding and my dogs to begin talking to me in Portuguese. If Fitzpatrick, Thigpen and Orlovsky could all light it up on the same day, the world has to be coming to an end, right? ",
            "2": "Meanwhile, David Garrard, the more established quarterback, struggled mightily. He tossed an interception on second-and-long after an untimely Tutan Reyes hold. What makes it even worse is that Garrard's errant throw went to Dhani Jones. Joey Potter said it best: Garrard sold a football to a bow tie salesman. Oh the irony. Garrard eventually managed to pad his stats - he finished 23-of-38 for 229 yards - but the fact remains that he couldn't consistently move the chains against one of the worst defenses in the NFL. Matt Jones was once again Garrard's sole effective target; Jones caught seven passes for 69 yards. ",
            "3": "Even more surprising is that Cincinnati's Cedric Benson - yeah, the guy who sucked so bad, he was nearly forced into very early retirement - had more than double the rushing yards than Maurice Jones-Drew and Fred Taylor combined for. Jones-Drew totaled 33 yards and a touchdown on 10 rushes. Taylor had just 12 yards on five attempts. I know Jacksonville has problems on its offensive line, but how can you not run on the Bengals? That's just inexcusable. ",
            "4": "As mentioned, Benson carried the Bengals to victory. T.J. Houshmandzadeh led the team with seven receptions and 65 yards. Chad Ocho Cinco, meanwhile, had five grabs, 37 yards and two touchdowns. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "Typical Lions - despite leading 20-10 in the second quarter and 23-13 at halftime, and knocking out the opposing team's quarterback, they allowed Chicago to come back and win, 27-23, saving thousands of survivor players everywhere from jumping off roof tops. ",
            "2": "Typical Lions - after surrendering a pick-six that was called back and 10 subsequent points, the Lions finally found the end zone against the Bears. I guess they weren't used to this because they botched the extra point. ",
            "3": "Things looked really bleak for the Bears prior to halftime. Orton was carted off the field with an ankle injury, while the Bears were making Dan Orlovsky look like the second coming of... umm... trying to think of Detroit's last good quarterback... uh... Charlie... no... umm... Scott... no... Bobby Layne? He played in the 1950s! Orlovsky somehow went 28-of-47, 292 yards and two touchdowns, going to Calvin Johnson eight times for 94 yards and a score. Orlovsky tossed a pair of picks, so at least we know that we're not in the Twilight Zone or anything. ",
            "4": "Meanwhile, Rex Grossman, stepping in for Orton (8-of-14, 108 yards), looked awful as usual, completing 9-of-19 passes for 58 yards, one touchdown and an interception. Orton suffered a high ankle sprain and will be out for a month. ",
            "5": "So, how did the Bears win? Besides Orlovsky self-destructing, Matt Forte willed his team to victory, gaining 126 yards on 22 carries. Forte's effort was his first 100-yard rushing performance since the first weekend of the season. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "I thought rookie quarterbacks were supposed to suck? What happened? Matt Ryan is destroying everyone, while Joe Flacco just went 17-of-29 for 248 yards and two touchdowns against the Browns. More importantly, Flacco neither fumbled nor threw a pick. ",
            "2": "You can't say the same thing about Derek Anderson. Anderson certainly wasn't awful (17-of-33, 219 yards, two touchdowns), but he tossed a disgusting pick-six in the fourth quarter, throwing the ball right to Terrell Suggs. After the pick, the crowd chanted for Brady Quinn. The fans may have their wish soon enough. ",
            "3": "Despite the crowd's disdain for Anderson, Braylon Edwards and Kellen Winslow Jr. both put up solid numbers. Edwards caught four passes for 86 yards and a touchdown, while Winslow had five grabs for 64 yards. It should be noted, however, that Edwards dropped numerous catches, including a potential long touchdown. ",
            "4": "On the Baltimore side, Derrick Mason debacled Cleveland's inept secondary, catching nine passes for 136 yards and a score. ",
            "5": "Willis McGahee was active, but didn't touch the ball at all. Not that Baltimore even needed him; Ray Rice ran for 154 yards on only 21 carries. LeRon McClain was the only running back in the game to find the end zone. McClain also had 34 yards on 14 attempts. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "For those of you following my <b> <a href=/picks.php> NFL Picks</a></b>, you know that I thought the Buccaneers were going to debacle the Chiefs. Whoops. It's really disturbing how poorly the Buccaneers played. As an example to how unfocused Tampa Bay was, a lineman had a false start on a spiked ball. How do you false start on a spike!? You don't even have to move because it's a spike! ",
            "2": "I seriously can't believe that the Buccaneers were able to come back and win. Apparently, I'm not alone. Check out this exchange in the Live In-Games Thread on the forum: Holder Account: Yup. That's it for Tampa. Somebody bring in Rosie O'donnell to sing. Wraith: Is Rosie still female? ",
            "3": "Going over how poorly Tampa Bay played, the defense made Tyler Thigpen look like the second coming of Joe Montana, as Thigpen was able to lead the Chiefs to 24 first-half points. Thigpen had two touchdowns. One he threw to Dwayne Bowe (two catches, 29 yards). The other he caught from former Bears crappy receiver Mark Bradley. Bradley had four grabs for 65 yards. I guess he was the Jerry Rice to Thigpen's Montana. Tony Gonzalez had seven receptions for 62 yards. ",
            "4": "Jamaal Charles, meanwhile, eclipsed the century plateau (106 yards) on just 18 carries. Kolby Smith chipped in with 46 yards on 10 rushes. ",
            "5": "I expected Earnest Graham, also known as Top 10 Running Back on this Web site, to trample Kansas City's last-ranked rush defense. Graham had just 62 yards on 19 carries. On the bright side, Graham threw a 3-yard touchdown pass to Alex Smith in the third quarter. Unfortunately, that didn't make up for Graham's two fumbles. ",
            "6": "Jeff Garcia threw an interception, but finished the game 31-of-43 for 339 yards and a score. Antonio Bryant came up huge, catching eight balls for 115 yards and the game-tying touchdown. ",
            "7": "Prior to December 2007, the Buccaneers hadn't returned a kickoff for a touchdown. Michael Spurlock took one back against Atlanta last year, and this week, Clifton Smith returned one for 97 yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "I can't believe the Texans didn't cover in this game. Matt Schaub threw an interception in the red zone in the first half. Sage Rosenchoker then tossed a pick in the end zone in the second half. If one of those turnovers was actually a field goal, Houston would have been in position to cover. I seriously can't believe this team has blown so many covers in a single season. The Sage Rosenchoker debacle against the Colts... The crazy Lions backdoor cover a couple of weeks ago. Now this. It's pathetic. I really don't know what to do with the Texans anymore. If I pick them, they'll blow another game. If I go against them, they'll win by 50. My hands are shaking right now and I caannnsn barreeelllyyly tttyyypppeeee....13.. ",
            "2": "Speaking of Schaub, the red-hot quarterback managed only 139 yards and the aforementioned pick because he hurt his knee. He was limping around in the first half, so Gary Kubiak decided to pull him at halftime in favor of Rosenchoker. Save for the interception, Rosenchoker did well, going 21-of-29 for 224 yards and two touchdowns. ",
            "3": "Andre Johnson didn't dominate - he caught four balls for 62 yards and a score. Instead, the star for Houston was tight end Owen Daniels, who had 11 receptions for 133 yards. Steve Slaton, meanwhile, totaled 62 rushing yards and 56 receiving yards. ",
            "4": "One thing we knew going into this game was that Houston's secondary is an abomination. While Gus Frerotte compiled just 182 yards, he managed that total on just 18 attempts, giving him a YPA of 10.1. Houston allowed 55- and 49-yard receptions to Bernard Berrian. ",
            "5": "Frerotte didn't really need to throw that much because Adrian Peterson trampled the Texans' defensive front, churning out 139 yards and a touchdown on 25 carries. ",
            "6": "Jared Allen tallied two sacks and a forced fumble; Allen now has seven sacks on the year. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Titans",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "I've said it a million times, but this time I'm really angry! I hate the NFL TV contract! I had the Titans-Packers game on FOX. Rob Bironas was setting up for a game-winning field goal in overtime. But the game went off the air because it was 4:15, and FOX was obligated to switch to another contest. I thought about throwing my laptop out of the window, but then I wouldn't be able to rant about this. ",
            "2": "Chris Johnson's fantasy owners were thrilled when the electrifying rookie scored a touchdown in the second quarter. Is this a new trend? Will Johnson get all the red-zone carries from now on? Don't count on it - the reason LenDale White wasn't in the game was because he had an inexplicable 54-yard run two plays earlier and was consequently sucking the air out of an oxygen tank. It's a good thing that White is on a diet (according to Jeff Fisher), or he would have just collapsed. Johnson was really instrumental in Tennessee's eighth victory of the season. In addition to his touchdown, Johnson had 161 total yards (89 rushing, 72 receiving) and accounted for 45 total yards in overtime. ",
            "3": "Besides Johnson and White's 54-yard sloth-like run, no one else on Tennessee's offense did much. Kerry Collins didn't even complete 50 percent of his passes, going 18-of-37 for 180 yards. Justin McCareins led all wideouts with three grabs and 42 yards. ",
            "4": "I was pretty surprised that Aaron Rodgers had so much success against the Titans. Rodgers was 22-of-41 for 314 yards and a touchdown. Still, Rodgers had a deep interception and fumbled in his own territory, which set up a field goal. ",
            "5": "With Cortland Finnegan draped all over Greg Jennings (three catches, 79 yards), Rodgers went to Donald Driver most often; the old veteran caught seven passes for 136 yards and a touchdown. Ryan Grant, meanwhile, performed well versus one of the league's top rush defenses, gaining 86 yards on 20 carries. <div class=dfpAdSlots> '); "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "For those of you following my <b> <a href=/picks.php> NFL Picks</a></b>, you know that I thought the Buccaneers were going to debacle the Chiefs. Whoops. It's really disturbing how poorly the Buccaneers played. As an example to how unfocused Tampa Bay was, a lineman had a false start on a spiked ball. How do you false start on a spike!? You don't even have to move because it's a spike! ",
            "2": "I seriously can't believe that the Buccaneers were able to come back and win. Apparently, I'm not alone. Check out this exchange in the Live In-Games Thread on the forum: Holder Account: Yup. That's it for Tampa. Somebody bring in Rosie O'donnell to sing. Wraith: Is Rosie still female? ",
            "3": "Going over how poorly Tampa Bay played, the defense made Tyler Thigpen look like the second coming of Joe Montana, as Thigpen was able to lead the Chiefs to 24 first-half points. Thigpen had two touchdowns. One he threw to Dwayne Bowe (two catches, 29 yards). The other he caught from former Bears crappy receiver Mark Bradley. Bradley had four grabs for 65 yards. I guess he was the Jerry Rice to Thigpen's Montana. Tony Gonzalez had seven receptions for 62 yards. ",
            "4": "Jamaal Charles, meanwhile, eclipsed the century plateau (106 yards) on just 18 carries. Kolby Smith chipped in with 46 yards on 10 rushes. ",
            "5": "I expected Earnest Graham, also known as Top 10 Running Back on this Web site, to trample Kansas City's last-ranked rush defense. Graham had just 62 yards on 19 carries. On the bright side, Graham threw a 3-yard touchdown pass to Alex Smith in the third quarter. Unfortunately, that didn't make up for Graham's two fumbles. ",
            "6": "Jeff Garcia threw an interception, but finished the game 31-of-43 for 339 yards and a score. Antonio Bryant came up huge, catching eight balls for 115 yards and the game-tying touchdown. ",
            "7": "Prior to December 2007, the Buccaneers hadn't returned a kickoff for a touchdown. Michael Spurlock took one back against Atlanta last year, and this week, Clifton Smith returned one for 97 yards. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "I can't believe the Texans didn't cover in this game. Matt Schaub threw an interception in the red zone in the first half. Sage Rosenchoker then tossed a pick in the end zone in the second half. If one of those turnovers was actually a field goal, Houston would have been in position to cover. I seriously can't believe this team has blown so many covers in a single season. The Sage Rosenchoker debacle against the Colts... The crazy Lions backdoor cover a couple of weeks ago. Now this. It's pathetic. I really don't know what to do with the Texans anymore. If I pick them, they'll blow another game. If I go against them, they'll win by 50. My hands are shaking right now and I caannnsn barreeelllyyly tttyyypppeeee....13.. ",
            "2": "Speaking of Schaub, the red-hot quarterback managed only 139 yards and the aforementioned pick because he hurt his knee. He was limping around in the first half, so Gary Kubiak decided to pull him at halftime in favor of Rosenchoker. Save for the interception, Rosenchoker did well, going 21-of-29 for 224 yards and two touchdowns. ",
            "3": "Andre Johnson didn't dominate - he caught four balls for 62 yards and a score. Instead, the star for Houston was tight end Owen Daniels, who had 11 receptions for 133 yards. Steve Slaton, meanwhile, totaled 62 rushing yards and 56 receiving yards. ",
            "4": "One thing we knew going into this game was that Houston's secondary is an abomination. While Gus Frerotte compiled just 182 yards, he managed that total on just 18 attempts, giving him a YPA of 10.1. Houston allowed 55- and 49-yard receptions to Bernard Berrian. ",
            "5": "Frerotte didn't really need to throw that much because Adrian Peterson trampled the Texans' defensive front, churning out 139 yards and a touchdown on 25 carries. ",
            "6": "Jared Allen tallied two sacks and a forced fumble; Allen now has seven sacks on the year. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Titans",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "I've said it a million times, but this time I'm really angry! I hate the NFL TV contract! I had the Titans-Packers game on FOX. Rob Bironas was setting up for a game-winning field goal in overtime. But the game went off the air because it was 4:15, and FOX was obligated to switch to another contest. I thought about throwing my laptop out of the window, but then I wouldn't be able to rant about this. ",
            "2": "Chris Johnson's fantasy owners were thrilled when the electrifying rookie scored a touchdown in the second quarter. Is this a new trend? Will Johnson get all the red-zone carries from now on? Don't count on it - the reason LenDale White wasn't in the game was because he had an inexplicable 54-yard run two plays earlier and was consequently sucking the air out of an oxygen tank. It's a good thing that White is on a diet (according to Jeff Fisher), or he would have just collapsed. Johnson was really instrumental in Tennessee's eighth victory of the season. In addition to his touchdown, Johnson had 161 total yards (89 rushing, 72 receiving) and accounted for 45 total yards in overtime. ",
            "3": "Besides Johnson and White's 54-yard sloth-like run, no one else on Tennessee's offense did much. Kerry Collins didn't even complete 50 percent of his passes, going 18-of-37 for 180 yards. Justin McCareins led all wideouts with three grabs and 42 yards. ",
            "4": "I was pretty surprised that Aaron Rodgers had so much success against the Titans. Rodgers was 22-of-41 for 314 yards and a touchdown. Still, Rodgers had a deep interception and fumbled in his own territory, which set up a field goal. ",
            "5": "With Cortland Finnegan draped all over Greg Jennings (three catches, 79 yards), Rodgers went to Donald Driver most often; the old veteran caught seven passes for 136 yards and a touchdown. Ryan Grant, meanwhile, performed well versus one of the league's top rush defenses, gaining 86 yards on 20 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "I liken this Arizona team to last year's Packers squad. Why? Think about it - the Cardinals are led by a grizzled, veteran quarterback despite the fact that a young signal caller is sitting on the bench. Arizona, like Green Bay, has tons of young talent at the wide receiver position. The Packers couldn't run the ball last year until they discovered Ryan Grant. Well, it looks like Arizona may have found a stud back of its own: Tim Hightower, starting the first game of his career in favor of the decrepit Edgerrin James, gained 109 yards and a touchdown on 22 carries. I know he was playing the pathetic Rams defense, but I seriously doubt the declining James could have eclipsed the century plateau. ",
            "2": "As for the grizzled quarterback, Kurt Warner finished 23-of-34 for 342 yards and two touchdowns. ",
            "3": "Anquan Boldin and Larry Fitzgerald each caught six passes. Boldin had 85 yards and a touchdown, while Fitzgerald accumulated 81 yards. Steve Breaston disappointed, grabbing two balls for 39 yards. ",
            "4": "Was St. Louis' magical three-week run - which included victories over Washington and Dallas, and a close game at New England - just a fluke? Based on how they played on Sunday, apparently so. To be frank, the Rams were just stupid. Up 7-0 with the ball, Marc Bulger tossed an ugly pick-six right to Antrel Rolle. On the next possession, Bulger fumbled the ball away, which led to an Arizona field goal. That 10-point surge was part of a string of 31 unanswered points for the Cardinals. ",
            "5": "Throw away what looked like a fluke 80-yard touchdown to Derek Stanley (Side note: Why did I not start Stanley in fantasy!?!? I'm an idiot!!!) and Bulger was completely abysmal; if you take away that score, Bulger was 3-of-12 for 15 yards and the aforementioned pick-six in the first half. Bulger finished with 186 yards, two scores and a pair of interceptions. ",
            "6": "Bulger's other touchdown went to Torry Holt, who had six grabs for 58 yards. Donnie Avery didn't do much, registering three catches for 26 yards. ",
            "7": "Steven Jackson also had fantasy owners and Rams backers crying in despair. Jackson carried the ball only seven times, gaining just 17 yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "OK, I guess Jay Cutler's finger hasn't healed... Despite positive reports all week, Cutler was intercepted on his first pass, which set up a Miami field goal. On his next two drives, Culter completed one of five passes for five yards, including a pick-six to Will Allen. In total, Culter began the game 1-of-7, five yards and two interceptions. ",
            "2": "Though he had another pick later in the game, Cutler eventually settled down, finishing 24-of-46 for 307 yards an two touchdowns. ",
            "3": "To the dismay of Brandon Marshall's fantasy owners, Cutler went to Peyton Hillis seven times for 116 yards and a score. Cutler also found Eddie Royal seven times. Royal had 69 yards and Cutler's other touchdown. Marshall managed two receptions for 27 yards. ",
            "4": "I blamed Cutler's finger for his slow start. The broken running game can be blamed as well. Andre Hall led the team in rushing - and he carried the ball only once (for seven yards)! Michael Pittman ran the ball seven times for four yards. Rookie Ryan Torain had three carries for only one yard. ",
            "5": "Speaking of running games, I was disappointed to see that Ronnie Brown gained just 59 yards and a touchdown on 20 carries versus Denver's 31st-ranked rush defense. Most of Brown's yardage came on a 30-yard run. Ricky Williams also didn't do much, gaining 16 yards on six rushes. ",
            "6": "Luckily for the Dolphins, they were able to take advantage of a Denver secondary that was missing Champ Bailey. Greg Camarillo torched the Broncos, catching 11 balls for 111 yards. Ted Ginn managed 38 yards on three receptions. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "This was a game of complete futility for the Raiders. Though a score of 24-0 doesn't sound too terrible, the Raiders were dominated in every facet of the contest. Oakland managed minus-2 yards of total offense in the first half, marking the first time since 1992 that a team couldn't muster positive yardage in a half. On defense, Oakland simply couldn't get off the field, allowing Matt Ryan to move the chains with ease throughout the entire afternoon. It was so bad, Atlanta won the time-of-possession battle, 45:15-14:45. The Falcons converted 9-of-17 third downs. The Raiders, meanwhile, were 1-of-9 on third down. ",
            "2": "Russell finished the game 6-of-19 for 31 yards, an interception and two fumbles. It's a good thing JaMarcus Russell is such a great player and that people are getting over it! ",
            "3": "Justin Fargas didn't exactly get a chance to help establish Oakland's ground attack; he had just three carries in the first half for five yards. He finished with 23 yards on six rushes. ",
            "4": "Michael Turner, on the other hand, trampled Oakland's front seven, gaining 139 yards on 13 carries. Ryan fed off of Turner's successful running; the rookie quarterback was 17-of-22 for 220 yards and two touchdowns. ",
            "5": "Unfortunately for Roddy White fantasy owners, Michael Jenkins caught both of those scores. White had five receptions for 54 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Giants",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "If you read my Texans-Vikings breakdown, you know how frustrated I am with the fact that two quarterbacks that I backed threw interceptions in the red zone. Make that three. Johnson lobbed one up for Giants corner Corey Webster in the first quarter, prompting forum user Clutch92 to state, You hear that? That's the sound of Brad Johnson's career ending. I thought the same thing as Clutch, until I realized that Wade Phillips is the worst head coach in the NFL not named Tom Cable. Instead of benching Johnson when the game was still in hand, Phillips stuck with the 80-year-old, who later threw another pick. Johnson finished the first half 5-of-11 for 71 yards. In all seriousness, Johnson is now the worst player in the NFL, and I doubt he could even make half the rosters in the CFL. ",
            "2": "Phillips finally made the switch after halftime. Unfortunately, Brooks Bollinger launched an interception on his first throw, setting up a Giants touchdown. Bollinger's next pass was a 12-yard loss to Marion Barber. Bollinger eventually settled in and led the Cowboys to a touchdown, but it obviously wasn't enough. Terrell Owens, who caught five passes for 36 yards and a score, refused to vent his frustration to the media after the game, but he looked really angry. Note to Bollinger: Expect a long meeting with Owens sometime soon. ",
            "3": "Because Dallas' passing attack is so limited, Marion Barber didn't have any running room against a very good defense. Barber managed just 54 yards on 19 carries. ",
            "4": "Barber's counterpart, Brandon Jacobs, pummeled Dallas' mediocre defensive front for 117 yards and a touchdown on just 17 rushes. ",
            "5": "Meanwhile, Eli Manning compiled only 147 yards on 16-of-27 passing, but tossed three scores. Manning also had a pick-six to rookie corner Mike Jenkins. ",
            "6": "Manning went to Steve Smith the most (five receptions, 29 yards). He also found Plaxico Burress and Kevin Boss thrice. They had 34 and 30 yards, respectively. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "NOTE: The Sunday night game will be covered in my <b> <a href=/nflpowerrankings.php> NFL Power Rankings</a></b>, released on Tuesday morning. ",
            "2": "It's a good thing the Phillies won the World Series - or there may have been thousands of frustrated Philadelphians at the beginning of this game. Seneca Wallace began the contest by throwing a 90-yard pass off his back foot from his own end zone to Koren Robinson. ",
            "3": "The Eagles did a great job limiting the Seahawks after that, but Donovan McNabb really struggled, completing just three of his first 13 passes for 57 yards and an end-zone interception. Part of McNabb's problem was that he kept throwing the ball to a double-covered Kevin Curtis, despite the fact that DeSean Jackson had single coverage on struggling corner Kelly Jennings. McNabb eventually figured things out, finishing 28-of-43, 349 yards, two touchdowns and an interception. ",
            "4": "While Curtis led all wideouts with six grabs for 83 yards, the star for the Eagles was second-year tight end Brent Celek, who had six receptions for 131 yards in relief of L.J. Smith. Jackson had two catches for 20 yards. ",
            "5": "Brian Westbrook wasn't as prevalent in the box score, offering his services as a decoy. Westbrook had 61 yards on the ground and 35 yards as a receiver. ",
            "6": "As for the Seahawks, they couldn't do anything right after that 90-yard bomb. Seneca Wallace had 79 passing yards if you exclude that play. Maurice Morris and Julius Jones, meanwhile, had 43 and 41 rushing yards, respectively. ",
            "7": "To epitomize Seattle's struggles, Mike Holmgren decided to go for it on a fourth-and-10 in the third quarter. Unfortunately, guard Mike Wahle false started, forcing the Seahawks to punt the ball away. "
        }
    }
}