{
    "year": "2012",
    "week": "06",
    "Game 1": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Matt Ryan had the matchup of a lifetime against the Raiders. Everyone has been throwing successfully on an Oakland defense missing its starting cornerbacks. There was no way Ryan wasn't going to pass for at least 300 yards and four touchdowns. Well, I guess that's why Chris Berman invented the saying, That's why they play the games. Ryan, who had just three interceptions entering this contest, tossed three picks in the first half alone. Though the first two were his fault - he was hit as he heaved the third one - pass protection was the main culprit. The Raiders, who have struggled getting to the quarterback all season, somehow put good pressure on Ryan. It really looked like the Falcons were going to lose. Ryan couldn't really get anything going for the most part (24-of-37, 249 yards, TD, 3 INTs), especially in the red zone where his team squandered several opportunities. The Raiders, who were gashing the Falcons on the ground all afternoon, decided to throw the ball for some strange reason inside the Atlanta 30-yard line with only a few minutes remaining. Carson Palmer was pick-sixed by Asante Samuel, which gave the Falcons a touchdown lead. The Raiders would tie it up, but left too much time on the clock for Ryan, who engineered a 43-yard drive in just 39 seconds, setting up Matt Bryant's decisive 55-yard field goal. ",
            "2": "It was a shame for Palmer because he had a great game outside of that pick-six. He went 23-of-33 for 353 yards, one touchdown and that interception. He nearly threw a second score, but tight end Brandon Myers dropped the ball. Darren McFadden was stuffed at the goal-line on the next play, which completely ruined the Raiders' end-zone opportunity. ",
            "3": "Palmer's sole aerial score went to Denarius Moore, who found the end zone because linebacker Mike Peterson whiffed badly on a routine tackle. Moore led the team with five catches for 104 yards. ",
            "4": "As mentioned, Oakland had its way on the ground. McFadden had just 70 yards and a score on 27 carries (along with a lost fumble), but Mike Goodson did most of the damage, picking up 59 yards on just four attempts. Darrius Heyward-Bey also had 20 yards on an end-around. ",
            "5": "As for Atlanta's rushing attack, Michael Turner once again looked like he was running in quicksand, gaining just 33 yards on 11 carries. ",
            "6": "Ryan's only touchdown went to Roddy White (6-72). Both Julio Jones (4-63) and Tony Gonzalez (4-42) disappointed their fantasy owners. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "29"
        },
        "comments": {
            "amount": "4",
            "1": "Jason Garrett's not the answer and must be replaced. The Cowboys have too much talent to be underachieving like this. Something is clearly wrong, and that something is coaching. Dallas makes stupid mistakes, week after week. That was especially apparent in this contest, as its numerous errors capsized what should have been a victory in Baltimore. The most egregious mistake the Cowboys continuously made had to do with the play clock. It seemed like they barely got the play off every single time. The signals were constantly getting into Tony Romo late for some reason. I don't know how many times I heard the announcers shriek, I don't think the Cowboys are going to get the snap off in time! Dallas also committed 13 penalties, many of which occurred deep in Baltimore territory. Here were some of the specific gaffes: - Tony Romo played well overall (25-of-36, 261 yards, 2 TDs, INT), but his interception was a brutal one, as he made a very poor decision in scoring position. - Dallas surrendered a 108-yard kickoff return to Jacoby Jones. - A defensive penalty gave the Ravens new life near the goal line in the fourth quarter. Baltimore would score a subsequent touchdown. - Tyron Smith had a hold on the Cowboys' penultimate drive that wiped out a big gain. - On one play, Kevin Ogletree dropped a touchdown and Felix Jones committed a chop block penalty. - Dez Bryant, who caught 13 balls for 95 yards and two touchdowns, dropped the game-tying two-point conversion. - One of the aforementioned play-clock issues forced the Cowboys to call a timeout on their final drive. This forced a long, game-winning attempt for Dan Bailey, which sailed wide left. Game over. I'm sure I forgot to list some other pretty bad errors, but despite them, the Cowboys were still in position to come away with a win because they moved the ball at will against Baltimore's defense. They completely gashed the Ravens, as both DeMarco Murray (14-93) and Felix Jones (18-92, TD) ran right at Ray Lewis, who was terrible yet again when he was in the game (more on this later). Murray would've enjoyed a monstrous afternoon if he didn't leave with a foot sprain. It's just a reminder of how brittle Murray is. ",
            "2": "Murray wasn't the only star player who got hurt. Haloti Ngata was banged up and limping around, while Lardarius Webb suffered a torn ACL. Oh, and then there was Lewis, who tore his triceps. Lewis could be out for the year. ",
            "3": "As for the Ravens, they had success throwing the ball against Dallas' struggling secondary. Joe Flacco went 17-of-26 for 234 yards and a touchdown. His score went to Torrey Smith (2-24), but Anquan Boldin was the bigger factor. Boldin caught five balls for 98 yards, and most of his receptions were meaningful. He converted a 3rd-and-15 with a 20-yard reception, for instance. ",
            "4": "Ray Rice rushed for just 63 yards on 16 attempts. He helped his fantasy owners, however, with two touchdowns and a 43-yard receptions. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Browns won their first game of the season on Brandon Weeden's birthday. How fitting that they would finally achieve a victory as their young quarterback aged up. Imagine how good they'll be when Weeden matures in five years or so. Cleveland will be Super Bowl-bound just as Weeden is at the ripe, young age of 34. OK, OK, Weeden played well, so I won't completely rain on his parade. He went 17-of-29 for 231 yards, two touchdowns and an interception that wasn't really his fault because it was tipped at the line of scrimmage. Weeden dissected Cincinnati's struggling secondary that is forced to start has-beens like Terence Newman and players out of position like Nate Clements, who has to be used at safety because Taylor Mays sucks so much. ",
            "2": "It's pretty amazing that the Browns won this game without Trent Richardson's services. Richardson gained 37 yards on 14 attempts before leaving the contest with some sort of a flank injury. Sounds fake to me. Montario Hardesty picked up the slack, tallying 56 yards and a touchdown on 15 carries. ",
            "3": "Weeden's lone touchdown was a beauty, as he found Josh Gordon 71 yards downfield. Gordon (3-99, TD) outproduced Greg Little (3-18). ",
            "4": "Andy Dalton had better fantasy numbers than Weeden, but the old man easily outplayed the youngster. Dalton went 31-of-46 for 381 yards, three touchdowns and three interceptions, one of which was a pick-six to Sheldon Brown. Dalton's stats were the byproduct of poor tackling on one long Jermaine Gresham touchdown and compiling garbage-time numbers when the game was out of hand. Dalton had extreme difficulty moving the chains, particularly in the second half after third-down back Brian Leonard went down with an injury. ",
            "5": "I mentioned that Gresham scored. Dalton's other two touchdowns went to A.J. Green, who snagged seven balls for 135 yards. Green, however, made a terrible error at the end of the first half when he failed to get out of bounds as the clock was running down. Dalton lined everyone up quickly and spiked it with one second remaining, but the officials incorrectly ruled that time expired. It was not reviewed for some strange reason. ",
            "6": "The Bengals did not get a good game out of BenJarvus Green-Ellis. A week after Ahmad Bradshaw gained 200 yards on the Browns, the Law Firm failed to rush for more than four yards per carry, finishing with 62 yards on 16 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "The Rams are never good in the red zone. Sam Bradford just doesn't have a quality target to throw to deep in opposing territory. It also doesn't help that his offensive line is in shambles. St. Louis has at least been successful kicking field goals, as rookie Greg Zuerlein hadn't missed on a single occasion entering this contest. That's no longer the case, as Zuerlein whiffed three times. Thanks to a strong wind, Zuerlein missed from 52, 37 and 66. Yes, 66. After Bradford took a sack near midfield with less than half a minute remaining in regulation, Jeff Fisher let the clock run down before calling a timeout. He had Zuerlein attempt a kick from 66 yards out, which would have set the record for the longest field goal in NFL history had the attempt gone through the uprights. It was wide left, unfortunately, though it had the distance. ",
            "2": "The silver lining in this loss for St. Louis is that Bradford performed well despite the absence of Danny Amendola. Bradford went 26-of-39 for 315 yards (and 34 rushing yards), as he looked toward Brandon Gibson most often. Gibson, who caught seven balls for 91 yards, performed well save for a sideline drop in the red zone. Of course, Bradford completed his usual one-time deep shot to Chris Givens for 65 yards. Givens (3-85) didn't do much else. ",
            "3": "What was most remarkable about this game for St. Louis' offense is that Steven Jackson (12-52) and Daryl Richardson (11-76) ran the ball so well against a Miami rush defense that was ranked No. 1 entering this weekend. If you're wondering, Jackson did not suffer any sort of injury; he and Richardson split carries evenly. ",
            "4": "Conversely, it was almost as shocking to see the Dolphins have absolutely no success with their ground attack. Reggie Bush (12-17) struggled mightily. In fact, take away his longest run of nine yards, and he mustered just eight yards on 11 attempts. He at least had five catches for 44 receiving yards to help his PPR fantasy owners. ",
            "5": "Ryan Tannehill was very sharp despite getting nothing from Bush and having his No. 1 wideout, Brian Hartline, completely erased by Cortland Finnegan. Tannehill went 21-of-29 for 185 yards and two touchdowns. ",
            "6": "Tannehill's scores went to Marlon Moore (3-46) and Anthony Fasano (4-33). Hartline, who didn't catch a single ball, was targeted just twice. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "It really appeared as though it would be more of the same for the Jets. They went three-and-out on their opening drive, as Mark Sanchez overthrew Jeremy Kerley on a 3rd-and-4. The crowd booed Sanchez as he ran off the field. New York, however, quickly realized that it had a huge advantage in the running game, which is how it tallied 185 total yards of offense for the rest of the first half. It was ugly for the Colts. They looked completely helpless trying to stop a very mediocre Shonn Greene. Greene rushed for 161 yards and three touchdowns on 32 carries, but don't think he did anything spectacular; on the contrary, he ran straight forward, as he usually does, showing absolutely no elusiveness, save for some stiff-arms and one play in which he spun away from safety Antoine Bethea. He was simply able to accumulate yardage because New York's offensive line blasted open massive holes for him. ",
            "2": "Thanks to Greene (as well as Joe McKnight, who had a 61-yard burst), Sanchez didn't have to do much. He went 11-of-18 for 82 yards and two touchdowns, as he constantly had defenders in his face - Jerry Hughes had a good game - whenever he dropped back to throw. He's pretty fortunate that his team was able to run the ball as well as it did; otherwise, he would have struggled to move the chains and may have been replaced by Tim Tebow, who completed a 23-yard pass on a fake punt. Tebow also had four scrambles for seven rushing yards. ",
            "3": "Sanchez's scores went to Stephen Hill (3-23) and Jason Hill (1-5). Jeremy Kerley (3-24) was the team's leading receiver. ",
            "4": "As for the Colts, Andrew Luck led a tremendous comeback last week, but couldn't sustain any drives in this contest, converting just 3-of-11 third downs. Luck finished 22-of-44 for 280 yards and two interceptions. Luck, who had several ugly overthrows, should've thrown a third pick (returned for a touchdown by Antonio Cromartie), but that was wiped out by a questionable pass-interference penalty. Luck almost had another pick-six, also by Cromartie, but an illegal block brought it back. ",
            "5": "Reggie Wayne, coming off the game of his career, had a decent statistical performance, catching five balls for 87 yards. However, he compiled most of his stats in garbage time, as Antonio Cromartie shut him down. ",
            "6": "With Donald Brown out, the Colts didn't have a single rush longer than five yards. Vick Ballard (8-25) led the very weak charge. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Lions",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "It's amazing how quickly this game turned. The Eagles had two 10-point leads (16-6, 23-13) in the fourth quarter and seemed to be in complete control. The Lions couldn't sustain any drives, as Matthew Stafford completed just seven of his first 21 passes. The Eagles, meanwhile, hit some big plays, particularly deep throws. QB Dog Killer sailed a 70-yard bomb to Jeremy Maclin in the final period, thanks in part to a completely busted coverage by Detroit's secondary. QBDK had a very mixed game, going 28-of-46 for 311 yards, two touchdowns and a pair of picks. He did some great things, like complete that long pass to Maclin (6-130, TD) and others, including a 30-yarder to DeSean Jackson (5-74). He also showed no hesitation when scrambling, rushing for 59 yards on nine carries. He was screwed over in some instances as well. For example, a touchdown to Brent Celek was nullified because of a very shaky offensive pass interference. There were some drops as well, including one by Celek that would have moved the chains on a 3rd-and-7. It also has to be noted that the offensive line continued to function like a turnstile. Detroit's defensive line flooded the backfield, including twice on consecutive occasions in overtime. Nick Fairley, who had one of those sacks, was a monster. QBDK took many fierce hits in this contest. I was shocked that he somehow survived the afternoon, as he was slow to get up sometimes. However, there was plenty of bad QBDK. Despite carrying a ball around with him all week, he was guilty of a fumble (his ninth of the year), though he recovered it. Meanwhile, his interceptions were terrible. He overthrew the first one and walked off the field to a chorus of boos. The second one was badly underthrown. ",
            "2": "QBDK can't really be blamed for this loss though, as Philadelphia's defense was pathetic in the fourth quarter and overtime. Of course, the fact that the Lions stopped making dumb mistakes, including offsides, false-start, personal-foul and helmet-to-helmet hits penalties, contributed to the comeback victory. ",
            "3": "Stafford was unstoppable in the final quarter plus, finishing 22-of-45 for 311 yards, one touchdown and a poor interception forced to Calvin Johnson into double coverage. Ser Stafford still hasn't thrown a score to Megatron this season, but he did manage to complete six balls to him for 135 yards, including an amazing sideline grab in which Johnson somehow tapped both feet inbounds. Megatron actually caught a ball in the end zone once, but it was wiped out by an offensive pass interference. ",
            "4": "Stafford's sole touchdown went to Nate Burleson (4-24, TD). Brandon Pettigrew (3-38) and Titus Young (2-6) both disappointed. Young dropped a 40-yard reception in the middle of the second quarter. ",
            "5": "Taking quarterback scrambles out of the equation, the Lions surprisingly ran the ball better than the Eagles. Mikel Leshoure gained 70 yards on 15 carries, while LeSean McCoy (14-22) couldn't even get two yards per carry. McCoy seemed to suffer an injury at one point, but walked off the field on his own strength and returned to the game soon after. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: Brady Quinn sucked. It's too bad the Kansas City fans can't boo him during the next home game. </i> ",
            "2": "The Chiefs are a horrible football team. They completely mailed this game in and played pathetic football. They featured an inept offense that was completely incapable of producing points and a disinterested defense that repeatedly gave up big plays. ",
            "3": "Brady Quinn got the start and was incapable of making any plays against a Bucs secondary playing without suspended corner Aqib Talib. Kansas City's play calling was terrible as the team took zero shots downfield. Quinn had some bad luck with a deflected interception to Mark Barron. The signal-caller had another pass bounce off two players before Ronde Barber made a shoestring catch for an interception that was returned 78 yards for a touchdown. Quinn proved he isn't worth starting as he completed 22-of-38 passes for 180 yards and two picks. Jamaal Charles (12-40), Dwayne Bowe (3-21) and Jon Baldwin (2-19) were all held in check. ",
            "4": "The catalyst for the Bucs' win was wide receiver Mike Williams. He beat Stanford Routt for a deep jump ball and outraced the defense to the end zone for a 62-yard score. Williams came back with another catch, versus Brandon Flowers, of over 40 yards. Williams (4-113) also caused a holding penalty on Flowers on a go route. ",
            "5": "Josh Freeman had a good day. It didn't start well as he blew a drive that started at the Kansas City 30-yard line. He threw a terrible pass in the flat that was picked off by linebacker Justin Houston inside the 20. Later, a 42-yard pass to Doug Martin (13-76 rushing, 2-55 receiving) set up a 19-yard touchdown pass to Vincent Jackson (4-66). Jackson had a 17-yard touchdown catch as well. Freeman was 15-of-26 for 328 yards, three touchdowns and an interception. LeGarrette Blount (7-58) had a 12-yard score in garbage time. Tiquan Underwood (2-68) caught a deflected pass off of Routt for a gain of 62. ",
            "6": "Kansas City's secondary was horrible at defending the deep part of the field. Safeties Eric Berry and Kendrick Lewis were picked on for big plays along with the cornerbacks. Tamba Hali had a strip-sack, but the rest of the front seven struggled. Shockingly, the Chiefs have not had a lead in regulation in any game this season. ",
            "7": "There was a crazy blooper-reel play for Tampa Bay in the fourth quarter when Bucs' punter Michael Koenen had his punt blocked. He picked the ball up in his own end zone and tried to throw a pass while being tackled. The ball was intercepted by Chiefs defensive lineman Edgar Jones, who dove into the end zone for their only touchdown. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bills",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "Both teams tried their hardest to lose this game, but Arizona ultimately prevailed, thanks to an injury to the quarterback position. When Kevin Kolb went down on the penultimate drive and John Skelton took over, I thought we'd see a reversal of what occurred back on Week 1. Kolb led the Cardinals to victory over Seattle when Skelton suffer an injury, so why couldn't Skelton do the same, especially against a defensive unit that had surrendered more than 1,200 total yards of offense in the two games prior to this contest? Well, Skelton did put Arizona in position to win. He set up Jay Feely with a 61-yard field goal attempt, which he converted for a career record. Feely later had a 38-yard try to win the game, but hit the left upright. I don't understand how he made a 61-yarder and whiffed on a 38-yarder, but the Cardinals still had a chance to earn a victory in overtime. However, Skelton, who went 2-of-10 for 45 yards, stared down his tight end in his own territory and threw a terrible interception. There were many mistakes throughout. Fred Jackson fumbled in his own territory on the opening drive, which led to a field goal. Soon after, Kolb took a safety. Kolb also tossed a weird, side-armed throw into traffic for his pick and wasn't helped with an Andre Roberts drop on a crucial third down at the end of the third quarter in Buffalo territory. Meanwhile, the Bills made the mistake of not running the clock out when they had the lead late in regulation. Instead of giving the ball to Jackson (16-53, TD), who ran well, or C.J. Spiller (12-88, TD), who was even better, Buffalo opted to have Brad Smith throw a deep ball into the end zone. It was picked off, giving the Cardinals new life. ",
            "2": "Kolb went 14-of-26 for 128 yards, one touchdown and the aforementioned interception. He was constantly under siege by a Buffalo defensive front that showed signs of life for the first time in weeks. The Cardinals surrendered four sacks - including a pair to Mario Williams - and it would have been way more if Kolb didn't do a good job of running out of the pocket. Attempting his best QBDK impression, Kolb picked up 66 rushing yards on five scrambles. ",
            "3": "Kolb's lone score went to Larry Fitzgerald (6-93). Roberts, who had that aforementioned drop, disappointed with just two catches for 18 yards. ",
            "4": "I really liked what I saw out of William Powell. Replacing Ryan Williams in Arizona's backfield, Powell showed nice running skills, gaining 70 yards on just 13 carries. He needs to be added in all fantasy formats. ",
            "5": "As for the Bills, Ryan Fitzpatrick was an economical 18-of-32 for 153 yards. He didn't make any mistakes, but he didn't threaten Arizona's defense with anything downfield. His deepest pass was a 23-yarder to Steve Johnson (6-82). <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "23"
        },
        "comments": {
            "amount": "4",
            "1": "As I tweeted <a href=https://twitter.com/walterfootball target=blank> @walterfootball</a>, Ruskell Wilkens, MVP canadate. Russell Wilson outplayed Tom Brady. I feel like I'm in the Twilight Zone typing that, but it's true. Wilson went 16-of-27 for 293 yards and three touchdowns. The Patriots focused so much on shutting down Marshawn Lynch (15 carries, 41 yards) that they allowed Wilson to try whatever he wanted downfield. It's tough to blame Bill Belichick for that strategy, given that Pete Carroll's previous conservative game plans limited Wilson from going deep. Give Carroll credit for adjusting though because Wilson hit numerous downfield throws. He had three completions of at least 46 yards. Wilson, who also had 17 rushing yards (13 of which came on a crucial 3rd-and-4 just prior to a score), threw touchdowns to Sidney Rice (3-81) and Doug Baldwin (2-74). Golden Tate (3-47) also caught a deep ball. Of course, Wilson was most impressive at the very end, scoring consecutive touchdowns in the final 7-and-a-half minutes to comeback from 23-10. It almost didn't happen though; the Seahawks had a fourth-and-short in their own territory with slightly more than three minutes remaining. Carroll opted to punt, which I completely disagreed with at the time. I didn't think Seattle was going to get the ball back even though it was armed with three timeouts, but the defense did a great job of forcing the Patriots to give back possession. ",
            "2": "Brady, meanwhile, went 36-of-58 for 395 yards, two touchdowns and a couple of interceptions. Those are awesome fantasy numbers, but Brady made a number of mistakes. One of the picks wasn't fault because Wes Welker tipped it, but he cost his team three points by committing an intentional grounding penalty at the end of the first half, which forced the clock to expire. Brady also had some dropped interceptions in the end zone. Earl Thomas, who had one pick, nearly had a couple more. ",
            "3": "Brady threw scores to Wes Welker (10-138) and Aaron Hernandez (6-30), who looked pretty healthy in his first action since the opening quarter of Week 2. Hernandez actually saw one more target (9) than Rob Gronkowski (6-61). Brandon Lloyd, meanwhile, had six grabs for 80 yards, but hurt his shoulder when he landed awkwardly out of bounds in the fourth quarter. ",
            "4": "The Patriots struggled to run the ball with Stevan Ridley (16-34) and Brandon Bolden (6-28), but strangely had success giving the rock to Danny Woodhead. Woodhead rushed for 25 yards on four attempts and chipped in with five catches for 46 receiving yards. Woodhead was very tough and broke numerous tackles. Watching him abuse Seattle's defense, particularly in the third quarter, I was convinced that the Patriots wanted it more and that the Seahawks were destined to lose this game. Apparently not. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Giants",
            "Points": "26"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: I hope people stop criticizing me for having the Giants in the top four of my <a href=/nflpowerrankings.php> NFL Power Rankings</a> all year. Actually, no, I hope they don't. I love the hate mai because it's great writing material. </i> ",
            "2": "Is there any disrespect still out there for the defending champs? If so, it is only out of jealousy, as the Giants went across the country to lay a beatdown on the highly touted 49ers. New York was an underdog, but showed that to be foolish with a complete dismantling of San Francisco. The Giants dominated the line of scrimmage on both sides of the ball. Their defense shut down the 49ers' running game and crashed their pass protection. Offensively, New York blasted open running lanes and locked down San Francisco's pass-rushers (zero sacks). This was a statement win for the Giants in no uncertain terms as they out-physicaled the 49ers. ",
            "3": "Eli Manning hit Dominik Hixon for a 39-yarder in the first half. Hixon (4-78) had another good gainer to set up Manning for a quick bullet to Victor Cruz (6-58) for a six-yard touchdown on a quick slant. The banged-up Hakeem Nicks (3-44) and Martlellus Bennett (1-9) had minor contributions. ",
            "4": "Manning had a great running game to take the pressure off, and the Giants' offensive line really stepped up with a fabulous game. The line played well in pass protection and was outstanding in run blocking for Ahmad Bradshaw (27-116). ",
            "5": "New York took firm control of this game in the third quarter. David Wilson (7-35) ripped off a kick return of 66 yards after halftime. That led Bradshaw to score the first rushing touchdown against the 49ers in San Francisco's last 14 home games. Safety Antrel Rolle had two interceptions in the third quarter to lead to easy field goals for the Giants. Both were overthrows off the mark; the first he tipped to himself. Rolle added a tackle for a loss on the final play of the quarter. ",
            "6": "Alex Smith looked to have turned the corner from game manager to difference-maker, but the Giants shut him down. Smith started out well and had two good drives end with missed field goals. After falling way behind, he hit Randy Moss for a 55-yarder on a deep post. Moss (2-75) got behind Rolle on the play, but San Francisco failed to continue the drive after being stopped on a fourth-and-15. Smith completed 19-of-30 passes for 200 yards with zero touchdowns and three interceptions. Running back Frank Gore (8-36) and tight end Vernon Davis (3-37) were both held in check. Mario Manningham (5-72) was solid against his old team. ",
            "7": "New York's defense was truly tremendous. Rolle played a phenomenal game, as did the rest of the secondary. Cornerback Prince Amukamara intercepted a ball that Smith hung up in the air down the sideline. Jason Pierre-Paul had two of the team's six total sacks. He, among others, whipped right tackle Anthony Davis. The 49ers lost left tackle Joe Staley to a concussion, and that didn't help anything. ",
            "8": "San Francisco put Colin Kaepernick (4-7 for 82 passing, 2-6 rushing) in the game a fair amount and at some critical times. It gave a feeling that Jim Harbaugh is preparing to have Kaepernick eventually take over at quarterback. Maybe not this year, but it seems to indicate a lack of confidence in Smith to bring his team back from a deficit. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "26"
        },
        "comments": {
            "amount": "6",
            "1": "Concussion? What concussion? It was unclear if Robert Griffin would even play in this game until Sunday morning. Griffin completely dominated the Vikings, both on the ground and through the air. Aerially, Griffin went 17-of-22 for 182 yards, one passing touchdown and an interception that was a poor decision. He heaved the ball late on the sideline in the first quarter, which helped set up one of Blair Walsh's three opening-quarter field goals. Young Griff was even better when he kept the ball himself; showing no hesitation in the wake of his concussion, he scrambled 13 times for 138 yards and two touchdowns, including a 76-yard score amid a late Minnesota attempted comeback. ",
            "2": "It's pretty amazing that Griffin fired just five incompletions despite not having his No. 1 receiver, Pierre Garcon. Griffin spread the ball around as a result, as the leading receivers were Fred Davis (3-46) and Santana Moss (4-46). ",
            "3": "The Vikings have a tough run defense, so it wasn't shocking to see Alfred Morris barely do anything on the ground. He rushed for just 47 yards on 16 carries, though he saved his fantasy owners with a 1-yard plunge into the end zone. ",
            "4": "New Redskins' kicker Kai Forbath drilled his only attempt, a 50-yarder. This is key because he was just signed this week to replace the woefully inept Billy Cundiff. ",
            "5": "As for Minnesota, Christian Ponder's stats look good - 35-of-52, 352 yards, two touchdowns, two interceptions - but he was pretty inaccurate all afternoon. He had a number of overthrows, one of which seemed to sail 50 yards over his intended target's head for a pick-six. Most of Ponder's passing yardage came in garbage time. ",
            "6": "Ponder's touchdowns went to Michael Jenkins (6-67) and Kyle Rudolph (6-56). Neither Adrian Peterson nor Percy Harvin scored, but both had solid fantasy outings. Harvin caught 11 balls for 133 yards, while Peterson notched 129 total yards (79 rushing, 50 receiving). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "What's wrong with the Packers!? What's wrong with Aaron Rodgers!? TEH GREEN BAY IS SUCK OMG OMG OMG!!! Sorry, I thought I was an ESPN analyst for a second. The Packers, who were four-point underdogs entering this contest, felt completely disrespected. In fact, Cris Collinsworth revealed that Rodgers was steaming in the pre-production meetings during the week, expressing anger that everyone was doubting him and his team. Rodgers was amazing in this contest. He went 24-of-37 for 338 yards and six touchdowns despite the fact that he was hurt by three drops, one each by Randall Cobb, Jordy Nelson and Jermichael Finley. His only poor throw was a complete miss of James Jones (3-33, 2 TDs) for a potential third touchdown, as he beat Kareem Jackson downfield. Of course, Rodgers' outstanding performance is just one reason why the Packers were victorious. The other is Houston's unbelievable lack of discipline. The Texans gave Green Bay 14 free points because of a trio of dumb penalties. DeVier Posey was offside on a punt, which allowed Rodgers to find Nelson for a 41-yard score on the very next play. In the third quarter, a Mason Crosby field goal was wiped off the board because of a Connor Barwin leaping penalty. Houston stopped them again, but Danieal Manning hit a Packer in the head for an unsportsmanlike penalty. Rodgers then found Nelson for another score. ",
            "2": "Nelson had three of Rodgers' six touchdowns. He finished with nine catches for 121 yards. Jones found the end zone twice, while Tom Crabtree had the sixth score. Randall Cobb (7-102) had a nice performance without crossing the goal line, while Finley (2-12) sucked yet again. ",
            "3": "Alex Green took all of the carries for the Packers until this game was out of hand. He couldn't gain three yards per carry (22 rushes, 65 yards), but he still ran well. He was just stymied by a tough Houston defense. It's awesome, by the way, to see A. Green in Green Bay's box score because it makes me think of the good old days when the team had Ahman Green on the roster. ",
            "4": "Arian Foster scored twice, but his YPC was even worse than Green's. He gained just 29 yards on 17 carries, as the Packers did a tremendous job of putting the clamps on the run without B.J. Raji. ",
            "5": "Without a successful ground attack, Matt Schaub couldn't perform any of his patented play-action bootlegs. Combine that with poor pass protection and the lack of a deep downfield threat, and the Texans consequently struggled to move the chains for most of the evening. Schaub finished 20-of-33 for 232 yards and a pair of interceptions. ",
            "6": "Andre Johnson (8-75) had a decent outing, while Owen Daniels (3-46) disappointed. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}