{
    "year": "2012",
    "week": "20",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "NFL teams don't like to blame losses on injuries, but three key Patriot players got hurt in the AFC Championship, which greatly impacted the result of the game. The first Patriot to go down was Aqib Talib. The mid-season signing had great coverage on Anquan Boldin early on, and that's why Joe Flacco began the contest just 1-of-6. Talib grabbed his hamstring after an incompletion and then headed to the locker room. He returned to the sidelines, but never saw the field again. Later in the first half, safety Patrick Chung was knocked out after Baltimore's first touchdown. Talib and Chung being out made life extremely easy for Flacco, who finished 21-of-36 for 240 yards and three touchdowns. He was 20-of-30 for 223 yards following that slow start, hitting so many key throws. It seemed like Bill Belichick had a great game plan in place for stopping Flacco, but that was thrown out the window when two starters in his secondary went down. The third injury was to Stevan Ridley, who was knocked out with a concussion during a fierce Bernard Pollard hit. Ridley (18 carries, 70 yards) simply collapsed and lost control of the football as a consequence. The Ravens pounced on it and would go on to score a touchdown to put the game out of reach. By the way, how happy will Patriot fans be when Pollard retires? He's already been responsible for tearing the ACLs of Tom Brady and Wes Welker, and he also caused an injury to Rob Gronkowski last year. Now, Ridley was victimized. He's a monster. <div class=dfpAdSlots> ",
            "2": "The injuries were just one of the two main storylines. The second was the ineptness of Brady. He was just extremely off in this contest. He missed open receivers all evening, whether it was via overthrows or short hops in front of them. Brady was especially bad in the second half, going 15-of-30 for 181 yards and two interceptions. Brady's overall numbers weren't bad - 29-of-54, 320 yards, one touchdown and the picks - but he made several uncharacteristic mental mistakes outside of the poor throws. He squandered an opportunity to get into the end zone at the end of the first half when he was too hesitant to take a timeout as the clock was running out. There was finally a stoppage with four seconds remaining, so New England had to settle for a field goal. I also don't understand why Brady refused to run on a key fourth down in the final quarter. All he had to do was outrun Haloti Ngata for four yards on a 4th-and-4, but he instead skipped a weak throw to no one in particular. It's almost as if he quit. ",
            "3": "Brady didn't seem pleased with Brandon Lloyd in this contest. He gave the receiver dirty looks on two incompletions, though Lloyd still finished with seven grabs for 70 yards, which included some impressive diving catches. Wes Welker (8-117, TD) and Aaron Hernandez (9-83) led the way for the Patriots. ",
            "4": "As for the Raven receivers, Boldin scored twice, as he finished with five receptions for 60 yards. He humorously stood over Devin McCourty, pointed at him and laughed following one of the touchdowns. Dennis Pitta (5-55) had the other touchdown. Torrey Smith finished with four grabs for 69 yards. ",
            "5": "The Ravens ran the ball on first down on nearly every series in the first half. It wasn't very effective at first, but they eventually wore the Patriots down. Ray Rice had 48 yards and a touchdown on 19 carries, while Bernard Pierce finished with 52 yards on just nine attempts. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> <div class=dfpAdSlots> "
        }
    }
}