{
    "year": "2010",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "26"
        },
        "comments": {
            "amount": "5",
            "1": "Who wanted to see the 4-10 Cardinals host the 5-9 Cowboys with John Skelton and Stephen McGee as the quarterbacks? This couldn't possibly be a good matchup, right? Actually, it's a shame that barely anyone saw it, but this battle may have been the best game of the weekend. McGee stepped in for an injured Jon Kitna (12-20, 115 yards, 1 TD, 2 INTs), who had two pick-sixes, neither of which was his fault. On the first, Miles Austin-Jones (6-115, TD) fell down. On the second, Roy Williams (0 catches) bobbled the ball into the hands of Greg Toler. McGee was shaky throughout until a perfect 37-yard touchdown to Austin-Jones with about a minute remaining in regulation. The score should have been 27-24, but kicker David Buehler hit the left upright on the extra point. After that, Skelton had his chance. On a 4th-and-15, Skelton hit Larry Fitzgerald with a 26-yard laser. A few players later, Jay Feely nailed the game-winning 48-yard field goal. ",
            "2": "I really liked what I saw out of Skelton (11-25, 183 yards, TD). His completion was pedestrian, but that's because he endured four drops. Skelton started well, struggled in the third quarter, but bounced back with a brilliant final drive in which he looked very poised. I believe the comparison to Joe Flacco is very apt. ",
            "3": "Skelton hit a receiver five times for 110 yards and a 74-yard touchdown (Mike Jenkins fell down), but it wasn't Fitzgerald. It was Andre Roberts, a rookie out of the Citadel. Fitzgerald had only one catch, and wasn't targeted very much. ",
            "4": "The Cowboys ran the ball really well against the Cardinals, who have sucked against ground attacks all year. Felix Jones had 77 yards on 16 attempts, while Marion Barber rushed for 58 yards and a touchdown on eight tries. After Barber's score, he ripped off his helmet, drawing a 15-yard penalty. It's almost as if the Cowboys haven't learned anything from their 1-7 start. ",
            "5": "I was hoping we wouldn't get the same NFL Network crew for Christmas. When I saw Bob Papa, Joe Theismann and Matt Millen on my TV set, I tweeted (<a href=https://twitter.com/walterfootball target=blank>@walterfootball</a>) the following: <i> I was hoping for Santa to kidnap Bob Papa, Joe Theismann and Matt Millen. My Christmas wishes have not come true. </i> Later, Theismann broke some news: The Cowboys will let the clock run down and then Jason Campbell will call the timeout. Jerry Jones has found his new head coach, and it's Jason Campbell! As if being the new Adam Schefter wasn't enough, Theismann also established himself as the next Emmitt Smith when he said: Everything now is just speeded up. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "Ah, what could have been. The Bills had a chance to make this game close and knock off the Patriots for the first time since September 2003. Instead, God intervened and ruined Buffalo's chances. Stevie Johnson has been great at times this year. But he's really hurt his team with big drops. Johnson ruined a potential win over Pittsburgh with a drop in overtime, and he once again spoiled a possible victory this Sunday. Johnson dropped what seemed like 5,000 passes in this contest; he bobbled a ball in the end zone in the first quarter, and then dropped a pass on 4th-and-long that would have given the Bills a first down when the game was still close. As a result, the Bills trailed 24-3 at halftime, even though the Patriots had just a slight edge in yardage at that juncture (238-206). ",
            "2": "Buffalo actually outgained New England by the time the game was over even though Ryan Fitzpatrick was committing turnovers on seemingly every possession. The Patriots debacled Fitzpatrick, who went 18-of-37 for 251 yards, three interceptions and two lost fumbles. It's a shame the Bills won themselves out of the Andrew Luck sweepstakes because it's painfully obvious now that Fitzpatrick is not the answer. ",
            "3": "On the bright side for Buffalo, C.J. Spiller finally did something of note. Spiller caught a 41-yard pass downfield along the sidelines. Unfortunately, he did very little after that aside from losing two fumbles. ",
            "4": "As for the winners, the Patriots clinched homefield with this victory. Tom Brady threw three touchdowns (15-of-27, 140 yards) and no interceptions, making this the 10th game in a row that Brady has not tossed a pick. He has to be the MVP. ",
            "5": "With no Aaron Hernandez, Brady's other tight ends scored. Rob Gronkowski (4-54) found the end zone twice. The other touchdown went to Alge Crumpler. ",
            "6": "Speaking of touchdowns, Wes Welker still has never scored against the Bills. He caught three balls for 19 yards. Deion Branch also disappointed fantasy owners (2-25). ",
            "7": "Buffalo's run defense sucked today; both BenJarvus Green-Ellis (19-104) and Danny Woodhead (13-93, TD) couldn't be stopped. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "34"
        },
        "comments": {
            "amount": "7",
            "1": "Two tough defenses. Snow and wind. Shaky, mistake-prone quarterbacks. This was bound to be a low-scoring game, right? Well, as Chris Berman would say, That's why they play the games! It's amazing that the Bears and Jets teams nearly went over the total (36) individually. Both quarterbacks were very sharp; Jay Cutler tossed a pick-six early, but bounced back with an incredible performance (13-of-25, 215 yards, 3 TDs, 1 INT). ",
            "2": "Cutler's touchdowns were all 25 yards or longer. Two went to Johnny Kevin Knox (4-92). The other was thrown to Devin Hester (3-48), who had returns of 38 and 40 yards despite the fact that Rex Ryan said he wouldn't kick to him. ",
            "3": "Matt Forte had a huge game; he rushed for 113 yards and a touchdown on 19 carries to go along with four catches for 52 receiving yards. ",
            "4": "As mentioned, Mark Sanchez also played well despite the cold weather and shoulder injury. Sanchez finished 24-of-37 for 269 yards, one touchdown and a late interception in desperation time. Sanchez was brilliant in the first half (13-of-15, 156 yards), so you have to wonder if his shoulder got sore at intermission to prompt a lesser second half. ",
            "5": "Santonio Holmes, who also had an injury going into this contest, caught four balls for 69 yards and a touchdown. Dustin Keller (7-79) and Braylon Edwards (6-78) also came up big. ",
            "6": "Rex Ryan made a crucial mistake in this game. On the first drive of the second half, Ryan opted to go for it on fourth-and-short. He called for a fake punt, which turned out to be an incomplete pass. Great call by Wraith about this: <i> It was fourth down and a foot, and we all know that Ryan cannot resist a foot. </i> ",
            "7": "The Jets lost, but still clinched a playoff spot in the wake of a Jacksonville loss. The Bears, meanwhile, need a victory in Week 17 or one loss from Philadelphia to earn a first-round bye. They can still get homefield with a win and two Atlanta losses. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "Some players talk and never back it up (looking at you, Chad Ochocinco). Ray Lewis does. Prior to this game, Lewis said of Peyton Hillis' 144-rushing yard performance in Week 3, Even a blind cat will find a meal every once in a while. Lewis promised to shut down the monstrous running back, and he lived up this word; Hillis rushed for just 35 yards on 12 carries. ",
            "2": "The Ravens also did a great job on Colt McCoy. McCoy went 15-of-29 for 149 yards and three interceptions, two of which were poorly thrown deep balls. McCoy was also nearly picked a fourth time by Jarret Johnson at the beginning of the third quarter. He also missed a wide-open receiver in the end zone at the end of the first half. ",
            "3": "Because his team was leading throughout, Joe Flacco didn't have to throw much; he went 12-of-19 for 102 yards, two touchdowns and a pick. His scores went to Derrick Mason (4-50) and T.J. Houshmandzadeh (4-32). Amid a very disappointing season, Anquan Boldin once again did nothing (2-15). ",
            "4": "With the victory, the Ravens clinched a playoff berth, with the division still up for grabs. Congrats to John Harbaugh, who made a brilliant move early in this game. Following a Cleveland touchdown, Harbaugh told his special teams to jump offsides on the extra point to give extra time to the guys upstairs to look at the play for a potential challenge. Harbaugh eventually threw the red flag, and even though he lost the challenge, give him credit for this sneaky maneuver. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Same old Jaguars. In my season preview this offseason, I criticized them for putting forth little effort when favored in non-divisional games. They seemed to improve in that department this year, but regressed against the Redskins. Jacksonville was clearly flat off an emotional loss at Indianapolis. The team made dumb mistakes (five penalties in the first 18 minutes), while David Garrard took four sacks and tossed two interceptions. Garrard also fumbled twice. He nearly coughed it up a third time to give Washington a touchdown, but the play was overturned after a booth review. ",
            "2": "Garrard had a great statistical game if you exclude all the picks and fumbles. He went 22-of-39 for 299 yards and two touchdowns (1 pass, 1 rush) along with 39 rushing yards on six scrambles. ",
            "3": "To be fair to Garrard, he was missing his top weapon. With Maurice Jones-Drew out, Rashad Jennings had only 32 yards on 15 carries, disappointing eager fantasy owners who plugged him into their lineup. ",
            "4": "Mike Sims-Walker, who was also banged up during the week, didn't start. He caught only pass for 31 yards. Mike Thomas stole the show with six receptions for 96 yards and a score. ",
            "5": "As for the Redskins, I thought Kyle Shanahan's play-calling was horrific. Prior to a Jacksonville field goal to make it 10-10 in the third quarter, Rex Grossman had 25 pass attempts to Ryan Torain's eight carries. Grossman wasn't very good. He went 19-of-39 for 182 yards, a touchdown and an interception that should have been ruled incomplete (even Scott Hanson said it shouldn't have been a pick; Jerome Boger, apparently was confused yet again by the replay system.) Grossman had a second interception dropped and was flagged for intentional grounding on 2nd-and-1. I don't think I've ever seen an intentional grounding on a second-and-short. ",
            "6": "Grossman's top targets were Santana Moss (5-85) and Chris Cooley (5-48), who dropped a touchdown. Meanwhile, Torain finished with 65 yards and a score on 20 attempts. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "I really don't understand why the Titans even got on the plane. They played as if they were sleepwalking the entire afternoon. They showed no effort in tackling. Not even the offense showed much interest in tackling following a drunkenly thrown interception by Kerry Collins right before halftime. Jeff Fisher and the Titans should be embarrassed, and I'm not going to spend any time talking about them. ",
            "2": "I really need to praise Matt Cassel because I've been down on him the past two years. Cassel was awesome in this contest, making great throws throughout the first half. He went 16-of-23 for 233 yards and three touchdowns prior to halftime. His final stats aren't much more impressive (24-34, 314 yards, 3 TDs) because the Chiefs were up 31-7 and didn't have to throw the ball in the second half. ",
            "3": "With Cassel at 100 percent again, Dwayne Bowe finally got back on track (though a little too late for most fantasy owners). He caught six balls for 153 yards and a 75-yard touchdown. ",
            "4": "Thomas Jones had way more carries (23) than Jamaal Charles (13), but with a huge lead throughout, it's hard to fault Todd Haley for preserving Charles. Of course, Charles still outgained Jones on the ground, 77-51. Charles also had four catches for 40 receiving yards and two touchdowns. Jones, meanwhile, fumbled twice. ",
            "5": "Thanks to San Diego's inexplicable loss to the Bengals, the Chiefs have won the AFC West. It's still hard to believe that they'll host a playoff game despite having no quality wins since the fluky opener. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Lions",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "27"
        },
        "comments": {
            "amount": "4",
            "1": "Going into this game, the Lions were 1-6 on the road. The Dolphins were 1-6 at home. Something had to give in the only early-afternoon game with no playoff implications. Detroit trailed by 10 in the fourth quarter before Miami self-destructed. The Dolphins surrendered a 53-yard touchdown to Jahvid Best and then saw Chad Henne toss a pick-six when his intended receiver (Davone Bess) fell down. The Lions now have five wins, which is impressive considering that they've suffered close, excruciating losses and barely had Matthew Stafford all year. ",
            "2": "Shaun Hill returned to the lineup and went 14-of-26 for 222 yards and two touchdowns against a very good Miami defense. Hill's scores went to Best and Brandon Pettigrew (4-74). Calvin Johnson had just four grabs for 52 yards, as he was in and out of the lineup with an ankle injury. ",
            "3": "As for Chad Henne, the erratic quarterback actually looked decent in this contest, which just shows you how pathetic Detroit's secondary is. Ultimately, Henne couldn't get the job done, prompting a delusional GameCenter member to comment: <i> Maybe the Dolphins can use Henne to trade up and draft a franchise qb in 2011! </i> Dream on, buddy. ",
            "4": "Bess (5-34) caught Henne's touchdown despite the fact that he was out of bounds prior to making the reception. Brandon Marshall, meanwhile, had 10 receptions for 102 yards, but had a key drop in the fourth quarter. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Rams",
            "Points": "25"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "I've defended Mike Singletary for a long time. But there's no question that he should be fired now that the 49ers have finally been eliminated from the playoffs. Singletary has just played way too many games with his quarterbacks, which cost him big time in this contest. Singletary inexplicably yanked Alex Smith after a solid two-game stint in favor of Troy Smith. Troy was awful, going 7-of-9 for 153 yards, one touchdown, an interception and three fumbles. After the pick, he and Singletary engaged in a heated argument on the sidelines. Troy remained the quarterback for a while until he was mercifully benched in favor of Alex. Alex predictably performed much better, going 10-of-15 for 120 yards. Singletary made a huge mistake by benching Alex in the first place. You can't play musical chairs with your quarterbacks and expect success. ",
            "2": "Troy's yardage total was high because he found Michael Crabtree for a 60-yard touchdown (a lot of yards after the catch). Crabtree inexplicably had a huge outing, catching six balls for 122 yards and a score. ",
            "3": "Sam Bradford had a great game. He went 28-of-37 for 292 yards and a touchdown. On one drive in the third quarter, Bradford went 7-of-7. The Rams didn't get anything on the drive, however, because of a bogus offensive pass interference penalty. Despite this, I don't like what the Rams' coaching staff is doing. They just aren't putting much faith in Bradford and instead are being way too conservative in the red zone. For example, St. Louis ran the ball on 3rd-and-7 deep in San Francisco territory. The Rams have no chance of winning a playoff game if they don't trust their own quarterback. ",
            "4": "Danario Alexander was just one yard short of reaching the century mark, catching six balls in the process. Alexander nearly scored a touchdown on a 46-yard bomb, but stepped out of bounds prior to reaching the end zone. ",
            "5": "As mentioned, the 49ers are finally done. The Rams will travel to Seattle next week to determine the winner of the NFC West. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "Adios, Norv Turner. Have fun on the unemployment line. Can we all agree that Turner should never be a head coach ever again? We've all gotten used to the slow starts, but this was inexcusable. The Chargers put forth no energy in this game. They were completely flat, perhaps assuming that they'd walk all over the three-win Bengals. ",
            "2": "Conversely, Cincinnati was playing with a sort of energy we haven't seen all year. I'd ask where it came from, but it's painfully obvious. With Chad Ochocinco and Terrell Owens out, Carson Palmer looked like he was actually having a lot of fun on the field for a change. He was 8-of-8 for 137 yards and two touchdowns in the first half, finishing 16-of-21 for 269 yards and four scores. Palmer's main receivers: Jerome Simpson (6-124, 2 TDs). Who? Andre Caldwell (4-87). He's still in the league? Jermaine Gresham (4-56, TD). A rookie tight end beating San Diego's defense? The Chargers should be ashamed of themselves. ",
            "3": "Credit Philip Rivers for trying to carry his team yet again. He went 27-of-40 for 256 yards, one touchdown and an interception. Rivers didn't have Antonio Gates and Malcom Floyd at his disposal, so aside from Vincent Jackson (4-54), Rivers was throwing to the likes of Legedu Naanee (4-59) and Kelley Washington (5-40, TD). ",
            "4": "Mike Tolbert had just four carries in this game because he suffered a neck injury. He was carted off on a stretcher. Ryan Mathews (12-55, TD) played well in his absence. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "23"
        },
        "comments": {
            "amount": "4",
            "1": "What are the excuses going to be this time? Did Tim Tebow take too long on his wind-up when he threw for 308 yards and a touchdown? Were his quarterback draws too ineffective when he rushed for 27 yards and another score? Is winning at Florida not going to translate at all into the NFL? Tebow's playing great. Yes, this was against Houston's anemic defense, but Tebow was only making his second start. He completed 16-of-29 passes and led a great comeback from down 17-0, showcasing very good deep accuracy. ",
            "2": "Tebow didn't have the services of Knowshon Moreno in the second half. Moreno had just 19 yards on seven carries, as he left the game early for the second week in a row with a rib injury. ",
            "3": "Tebow and Brandon Lloyd definitely have a connection; Tebow hit Lloyd five times for 111 yards. ",
            "4": "As for the Texans, it was just great fantasy numbers. Matt Schaub (23-33, 310 yards. 1 TD, 1 INT), Arian Foster (19-91, TD) and Owen Daniels (8-73, TD) helped some people win their fantasy championship. Andre Johnson's absence, meanwhile, cost others their championship (including yours truly). <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "Last week: How can the Colts beat the Jaguars? They won't be able to stop the run!!! This week: The Raiders have a good chance to beat the Colts. They'll run all over Indy!!! Indianapolis outgained both Jacksonville and Oakland on the ground. Very interesting. ",
            "2": "The Colts limited Darren McFadden to 45 yards on just 11 carries. You really have to wonder why Oakland didn't run more; the Raiders led until late in the second quarter, yet McFadden barely touched the ball. ",
            "3": "Jason Campbell attempted 42 passes, which will never be a recipe for success for Oakland. Campbell didn't play poorly (29-42, 231 yards, 1 TD), but took three sacks. ",
            "4": "Aside from Jacoby Ford (99-yard kickoff return touchdown to open the game), Oakland's main weapon was Sebastian Janikowski, who was 4-of-5 in this contest, including two made field goals from 59 and 51 yards. ",
            "5": "Peyton Manning started the game off well, but struggled in the second half. He suffered some drops, but threw two ugly interceptions. Manning finished 16-of-30 for 179 yards, three touchdowns and those picks. ",
            "6": "Manning's scores went to Jacob Tamme (7-78), Pierre Garcon (3-35) and Blair White (2-20). Reggie Wayne didn't do much (3-40) and even dropped yet another pass, further cementing his league lead in that department. ",
            "7": "Joseph Addai returned to the lineup and scored a touchdown (12-45). But it was Dominic Rhodes who trampled the Raiders, gaining 98 yards on 17 attempts. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "So much for my December NFL Pick of the Month. That's eight units down the drain. Actually, 8.8 units if you're keeping track at home. On the bright side, I still had a winning Sunday because I won all my other multi-unit picks except for the Bills +9 over the Patriots (2 units). As you can imagine though, I received tons of hate mail. For example, some guy on Twitter (<a href=https://twitter.com/walterfootball target=blank>@walterfootball</a>) wrote the following: nice pick of the month YOU EPIC F***ING FAIL. I'll have much more hate mail posted on Tuesday. ",
            "2": "As for this game, you can't turn the ball over six times and win. The NFL just doesn't work that way. Of course, I don't need to tell the Giants this; they've shot themselves in the foot all year. Four of the six turnovers occurred when the game was still up for grabs. Two came on ugly interceptions from Eli Manning. Two others were fumbles; one by each running back in Green Bay territory. Hakeem Nicks (4-93, TD) also fumbled, but Tom Coughlin challenged and the play was overturned. ",
            "3": "Manning was horrible. In addition to the picks he lobbed up for grabs, he completed just 17-of-33 passes, though he was victimized by several Kevin Boss drops. As one e-mailer wrote, I thought I saw Kevin Boss at the betting window. ",
            "4": "But enough about the loser Giants. Aaron Rodgers was unbelievable in the first game back from his concussion. Rodgers went 25-of-37 for 404 yards and four touchdowns. Those numbers could have been even better, but James Jones dropped a deep pass. Rodgers basically did whatever he wanted against a New York defense that still looked gassed from last week's fourth-quarter meltdown. ",
            "5": "Jones scored one of Rodgers' four touchdowns. Jordy Nelson had another, which was an 80-yard reception thanks to a blown coverage by the overrated Antrel Rolle. Greg Jennings didn't find the end zone, but caught seven balls for 142 yards. ",
            "6": "If you started John Kuhn in your fantasy championship, congratulations. Kuhn scored three times, rushing for 22 yards on six carries. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "15"
        },
        "comments": {
            "amount": "5",
            "1": "This game meant nothing to the Seahawks, yet it meant everything. Matt Hasselbeck rushed in for a no-contact touchdown in the first quarter. As he crossed the goal line, he grabbed his back and fell down. He left for the locker room and never returned. Afterward, Pete Carroll ruled Hasselbeck out of practice all week and said that his quarterback's injury was unusual. In other words, next week's battle for the divisional crown could feature a rookie quarterback (Sam Bradford) and another first-year starter (Charlie Whitehurst). Gotta love the NFC West. ",
            "2": "So, how did Whitehurst play? Well, the good news is that he completed 11-of-18 passes and didn't turn the ball over. The bad news is that Whitehurst couldn't move the chains. His 18 attempts went for just 66 yards, and Seattle gained just 112 yards of offense in three-and-a-half quarters with Whitehurst under center - and this was against a poor Tampa defense missing key players like Gerald McCoy and Aqib Talib. ",
            "3": "Meanwhile, Tampa Bay's offense mustered 439 total yards of offense. Josh Freeman was nearly flawless, going 21-of-26 for 237 yards and a whopping five touchdowns - two apiece to Kellen Winslow Jr. (7-98) and Mike Williams (3-44). ",
            "4": "LeGarrette Blount nearly lost a key fumble (Tampa luckily recovered), but was otherwise very impressive. He gained 164 yards on 18 attempts and even hurdled a Seattle defender on one long gain. ",
            "5": "With this victory, the Buccaneers control their own destiny if the Falcons beat the Saints on Monday night, and if either the Giants or Packers lose next week. If New Orleans wins, Tampa will need a win, and losses by both Green Bay and the Giants. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "postponed",
            "Points": "to"
        },
        "Team 2": {
            "Name": "Tuesday",
            "Points": "night"
        },
        "comments": {
            "amount": "1",
            "1": "Some thoughts on this game being postponed: - This game shouldn't have been scheduled for 8:20 on a Sunday night in the first place. NBC inexplicably flexed this matchup for QB Dog Killer versus Brett Favre, and instead could have went with Bears-Jets or Colts-Raiders. - Shame on the NFL and corrupt Philadelphia mayor Michael Nutter for moving this game to Tuesday night. They made the decision around noon when there was no snow on the ground. I tweeted the following at the time: <i> I live in Philly and It's barely snowing outside! The NFL should be ashamed of itself. </i> - I was glad to hear Tom Jackson and the rest of the ESPN analysts criticize the move as well. Some games have to be moved because of disasters (Hurricane Katrina, Metrodome roof collapsing, etc.) but this was just snow. Games have been played in snow before. It's freaking football for crying out loud. - Chris Mortensen also made a great point: With the Super Bowl being played outdoors at the Meadowlands in a few years, what if something like this happens then? Are they going to postpone the Super Bowl? And if they do, what about all the hotel rentals and stuff like that? - Great tweet by Alex_XXV: <i> I don't buy that fans security bulls***, NBC wants Favre vs. Vick so they gave Favre three more days to heal the concussion. </i> Given the fact that NBC stupidly moved this game in the first place, it wouldn't surprise me at all if this were the case. - One more glaring item: Pennsylvania Governor Ed Rendell, who is in charge of calling state of emergencies, said the following on FOX Philadelphia News: The Eagles game should have been played. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}