{
    "year": "2013",
    "week": "04",
    "Game 1": {
        "Team 1": {
            "Name": "49ers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "11"
        },
        "comments": {
            "amount": "6",
            "1": "It's amazing how public perception can change based on one week. Leading up to this matchup, all the media did was write off the 49ers. Bill Simmons said they'd be 6-9 heading into Week 17, while the analysts on the NFL Network seemingly gave the team no chance to rebound. But as the 49ers were walking off the field with a 35-11 victory in hand, Brad Nessler and Mike Mayock praised San Francisco and suggested that Harbaugh and the players did a great job of turning things around. Despite the 24-point victory, things were shaky for the 49ers early on. Things didn't look like they would go their way when the usually reliable Phil Dawson whiffed on a 53-yard field goal, and then Greg Zuerlein came back and attempted a 40-yarder that hit the goal post and still bounced in between the uprights. The 49ers were guilty of surrendering a couple of third-and-longs to the Rams in the first half. Anquan Boldin was whistled for offensive pass interference. Donte Whitner dropped an interception. Colin Kaepernick nearly tossed a pick himself. It was pretty ugly, but despite all of this, the Rams just led 3-0. The 49ers were fortunate St. Louis struggled to do anything following a promising first couple of drives; they eventually got into a groove and converted touchdowns, putting this game away. The 49ers were able to do this via the ground attack. After completely neglecting the run against the Colts, they made sure they rammed it down St. Louis' throat. Frank Gore rushed for 153 yards and a touchdown on 20 carries, while Kendall Hunter chipped in with 49 yards and a score on 11 attempts. Anthony Dixon (3-6) also found the end zone. San Francisco's offensive line pushed around a Rams' front that has been atrocious this season. ",
            "2": "Kaepernick misfired four times in each half, going 15-of-23 for 167 yards and two touchdowns. He was very sharp in the red zone, allowing his team to score sevens instead of threes. His flaw, however, is that he sometimes stares down his receivers. He's lucky James Laurinaitis didn't pick off a couple of his passes. Kaepernick's scores went to his main targets: Anquan Boldin (5-90) and Vernon Davis (2-18). Boldin's touchdown was a thing of beauty, as he converted a third-and-19 by tip-toeing the sideline and diving into the end zone. ",
            "3": "The Rams, meanwhile couldn't produce anything offensively - their sole touchdown came off a turnover - because their incompetent line was completely overwhelmed by San Francisco's front. Sam Bradford took five sacks, two of which were by Navorro Bowman, who was a beast without Patrick Willis in the lineup to play next to him. Bradford was pretty dreadful. He went 19-of-41 for 202 yards, one touchdown, an interception and a lost fumble. Bradford, who missed a wide-open Austin Pettis in the end zone during the first quarter, is extremely fortunate that he wasn't picked off at least four more times, as San Francisco defenders were dropping interceptions left and right. Bowman actually had a potential pick-six in his hands, but let the ball hit the turf. ",
            "4": "The Rams' offensive line also couldn't open up any holes for Daryl Richardson, who mustered only 16 points on 12 attempts. ",
            "5": "Mayock was screaming for the Rams to involve rookie receiver Tavon Austin more frequently. Mayock even suggested that Austin should get 20-25 touches in this game. I have no idea what Mayock was smoking because when does a receiver ever have his hands on the ball 20-25 times per contest? Austin ended up with just two catches for six yards and no carries. St. Louis' leading wideout was Pettis (5-59), followed by Chris Givens (4-49) and Jared Cook (4-45). ",
            "6": "There were several injuries in this game. The most prominent one looked to be to left tackle Joe Staley, who was screaming in agony while clutching his leg in the fourth quarter. Fortunately, Jim Harbaugh later said Staley was fine. Meanwhile, the Rams lost defensive backs Cortland Finnegan and T.J. McDonald to various leg ailments. Finnegan's wasn't as serious - the greater concern with him is why he has been playing like garbage all season - but McDonald fractured his leg and could be placed on injured reserve. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "What is it with the Ravens always playing down to their competition on the road? They lost that Monday night game to the Jaguars a few years ago, and they nearly went down to the Chiefs last season. They absolutely dominated the Texans last week, so how could they lose to lowly Buffalo? Well, it was apparent the Ravens were sleepwalking early on when they had three penalties on the very first drive. Joe Flacco converted a third-and-13 to Marlon Brown on the opening possession, but the infractions would ruin that play. Having said that, Flacco can definitely be blamed for this loss because he transformed into a turnover machine. He tossed a whopping five interceptions. The first was carelessly heaved into double coverage. Another was underthrown in the end zone. Flacco had some nice throws in this contest, particularly when he targeted inept Bills' cornerback Justin Rogers, but he was mostly erratic. Flacco went 25-of-50 for 347 yards, two touchdowns and five interceptions. Aaron Williams and rookie linebacker Kiko Alonso had two each. The latter's second pick sealed the victory, as Flacco had a nice drive going for a potential go-ahead score. The ball was tipped into Alonso's arms. ",
            "2": "Flacco's scores went to Torrey Smith and Brown. Smith had a huge game, especially when cornerback Aaron Williams exited with an injury, tallying five catches for 166 yards. Marlon Brown (4-34, TD) had a solid first half, but a thigh strain slowed him down after intermission. ",
            "3": "It's hard to believe, but the Ravens ran the ball only nine times. Ray Rice started, but gained just 17 yards on five carries. He didn't even catch a pass. Bernard Pierce (4-7) was an even greater disappointment. ",
            "4": "Speaking of frustrating running backs, C.J. Spiller managed to gain 77 yards on 23 carries, but left the game in the third quarter with an injury. Fred Jackson once again outgained him, registering 87 yards and a touchdown on 16 carries. ",
            "5": "E.J. Manuel had a mixed game. He displayed accuracy issues at times and nearly lost a fumble while trying to run out the clock. He also threw two picks and had an earlier strip that eventually turned into a Baltimore touchdown. However, all of this was mixed in with several impressive throws to move the chains; Buffalo outgained the Ravens, 350-345. Manuel went 10-of-22 for 167 yards, one touchdown and the two interceptions. He threw what looked like a second score to Robert Woods, but the rookie wideout bobbled the ball as he was going out of bounds. ",
            "6": "Manuel's lone score that stood was also to Woods, who was the only Bill who accumulated more than 32 receiving yards. Woods finished with four grabs for 80 yards and the touchdown. Stevie Johnson was a disappointment; his only catch went for minus-1 yards, as he had trouble separating from cornerback Jimmy Smith. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "The NFL is a copycat league, so perhaps many franchises will trade away some of their best players in an apparent attempt to tank. Utilizing this strategy apparently improves teams so much that they become invincible. Part of the reason the Browns planned to tank was because Teddy Bridgewater is available - click here for my <a href=/draft2014.php>2014 NFL Mock Draft</a>. However, the front office may soon believe that they already have their franchise signal-caller. Brian Hoyer doesn't have a good arm or anything, but he displayed excellent touch and accuracy in this contest. Completing 10 of his first 12 passes, Hoyer finished 25-of-38 for 269 yards and two touchdowns. It's worth noting that he did this against an injury-ravaged Cincinnati secondary, but I'm pretty confident that Brandon Weeden couldn't have duplicated this performance. At the very worst, Hoyer has cemented himself as a strong No. 2 NFL quarterback for years to come. Hoyer's first touchdown was a nice, touch fade to Jordan Cameron in the end zone. Cameron once again had a dominant performance, catching 10 balls for 91 yards. Josh Gordon also showed well, hauling in four grabs for 71 yards, including a beautiful touch completion from Hoyer. ",
            "2": "The Browns once again struggled to run the ball, though they were better in this regard than they were last week. Promising to improve upon his single-digit rushing performance, Willis McGahee mustered 46 yards on 15 attempts. Chris Ogbonnaya, meanwhile, tallied 27 yards on five tries and also caught five balls for 21 receiving yards and a touchdown. ",
            "3": "Meanwhile, the Bengals couldn't do anything offensively. There were two big problems. The first was the offensive line, which couldn't open up any holes for the running game against Cleveland's stout front. Giovanni Bernard was restricted to 37 yards on 10 carries, while BenJarvus Green-Ellis generated only 13 yards on six carries. Green-Ellis was stuffed on a fourth-and-1 in the red zone during the middle of the second quarter when the team was down 7-3. I'd have to question the wisdom of giving such an untalented player the ball in an extremely important situation. The second issue for the Bengals was that A.J. Green couldn't get open. I know that's hard to believe, but Joe Haden did an incredible job of limiting the ultra-talented wideout to seven catches and 51 yards. Haden made a great tackle on Green in the red zone early during the first half to force a field goal. ",
            "4": "With Green covered so well, it's no surprise that Andy Dalton struggled. Dalton went 23-of-42 for 206 yards and an interception. He was also strip-sacked on a cornerback blitz by Christopher Owens. Dalton's leading target was tight end Jermaine Gresham (3-53). Outside of Green, Bernard had the most receptions (6-38). ",
            "5": "The Browns are without kicker Phil Dawson for the first time in this new franchise's history, and it's safe to say that they miss him. Billy Cundiff missed two tries, though he did nail a 51-yarder. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "32"
        },
        "comments": {
            "amount": "4",
            "1": "It's hard to believe based on this score in the second half (Detroit led 40-16 at one point) that the Bears were up 10-6 in this game. The Lions were guilty of their usual stupidity. Reggie Bush dropped a pass in the red zone, Calvin Johnson had one foot inbounds in the end zone, Tony Scheffler dropped a pass on third down that could've moved the chains, and Matthew Stafford was throwing late and inaccurately. Matt Forte broke a long touchdown run, and Chicago looked like it was in control. And then Jay Cutler happened. Cutler was brutal throughout this entire contest. He started things off by throwing an interception into double coverage, setting up the Lions in the red zone. He later floated a pass into double coverage that was easily picked by Glover Quin and taken down to the Chicago 2-yard line. Mixed in were several poor sacks in which Cutler took big losses. And all of this was just in the first half when the game was still up for grabs. Cutler wasn't any better after the break. He tossed a third interception right to Louis Delmas on a blatant overthrow. He then came back and was strip-sacked by Ndamukong Suh. The ball was picked up by Nick Fairley and taken into the end zone. This put the Lions up by three touchdowns. Game, set, match. Cutler finished 27-of-47 for 317 yards, two touchdowns and the three picks, but those numbers are obviously deceiving. As of halftime, he was just 8-of-15 for 101 yards, two interceptions and a lost fumble. ",
            "2": "Cutler spread the ball out evenly to his four main targets: Alshon Jeffery (5-107, TD) led in receiving yardage, though he missed out on a second score because he couldn't stay inbounds on a deep completion. Martellus Bennett (8-90) had the most catches, but he dropped a touchdown. Brandon Marshall was somewhere in between (7-79), while Matt Forte caught his usual five passes for 22 yards. Forte also rushed for 95 yards and a score on 14 tries. Most of that came on a 53-yard touchdown in the second quarter. ",
            "3": "I don't want to take much away from the winning team, but as I mentioned earlier, Stafford was not at his best. Many of his passes were off the mark. He even threw an interception in the red zone because his pass was way behind Megatron. Stafford went 23-of-35 for 242 yards, one touchdown and an interception. He also lost a fumble on a strip-sack by Julius Peppers, who beat Riley Reiff. Stafford's numbers could've been a lot better though; he missed a wide-open Ryan Broyles for a touchdown, and as mentioned, Megatron (4-44, TD) just missed out on a score. ",
            "4": "With Stafford and Johnson not playing their best, Reggie Bush was a huge spark for this offense. He made the Bears look silly, rushing for 139 yards and a touchdown on just 18 carries. He also caught four balls for 34 receiving yards. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks seemed cooked. They were down 20-3 in the third quarter and 20-6 going into the final frame. It seemed so obvious that the Texans were going to win that I prepared the following lead for this capsule: <i> If there ever was any doubt that dominating the trenches is a big factor when it comes to winning football games, the Seahawks and Texans proved that to be the case this week. The Seahawks couldn't do anything when they had the ball - they mustered just 88 net yards in the first half - because their extremely banged-up offensive line just couldn't block the Houston front. Meanwhile, the Texans moved the ball with ease - they posted 324 yards prior to intermission - as they pushed around a sleepwalking Seattle stop unit that didn't seem to have any interest in winning this game. </i> I guess I was being stupid for counting out Russell Wilson. The second-year quarterback couldn't do anything for most of this contest, but he was magical in the fourth quarter and overtime. He was still seeing a ton of pressure in the pocket, but he did a great job of navigating around defenders. Wilson was able to scramble 10 times for 77 yards to help offset his poor passing numbers (12-of-23, 123 yards, interception) - a byproduct of all of the pressure. He was sacked a whopping on five occasions, with second-year rush linebacker Whitney Mercilus collecting 2.5 sacks. J.J. Watt, who collected half a sack, had blood gushing down his face throughout the entire afternoon. ",
            "2": "When there's a tremendous comeback, there's always the team on the other side of the coin. The Texans completely choked this game away. And by Texans, I mean Matt Schaub. Houston was in position to run out the clock, but Schaub inexplicably floated an interception toward Richard Sherman while under heavy pressure. Sherman took it back for six. The decision was so incredibly dumb, and it will only strengthen the fans' call for a new quarterback. I actually have Houston selecting a quarterback in the second round of my <a href=/draft2014.php>2014 NFL Mock Draft</a>. Schaub finished 31-of-49 for 355 yards, two touchdowns and a pair of picks. He looked good at times, but his turnovers were costly. The first interception occurred in the red zone, which obviously took at least three precious points off the board. The second was inexcusable. As a result, fans were burning his jersey in the parking lot afterward. ",
            "3": "Four of Schaub's targets caught at least five passes: Andre Johnson (9-110), Owen Daniels (6-72), Arian Foster (6-69, TD) and Garrett Graham (5-69, TD). Daniels had the best catch of the day when he made a great, diving reception in the end zone for 21 yards. As for Foster, he had way more carries than Ben Tate, though as usual, his YPC was much worse. Foster had 102 yards on 27 attempts, while Tate gained 44 yards on seven tries. ",
            "4": "The Seahawk ground attack wasn't as potent as Houston's, but Marshawn Lynch ripped off a 43-yarder in the first half. He lost a fumble on a great play by Brian Cushing, but he redeemed himself later when he found the end zone. Lynch finished with 98 yards on 17 carries. ",
            "5": "Because of Wilson's meager passing yardage, no receiver did much. Lynch actually led the team in aerial yards (3-45). Doug Baldwin (3-39) and Golden Tate (3-17) were the only other Seahawks with more than one reception. Sidney Rice had just a single catch, but he drew a 33-yard flag for pass interference. ",
            "6": "There was a devastating injury for the Seahawks in this contest. Michael Bennett had to be carted off the field with a lower back injury. Cushing, meanwhile, suffered a concussion. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "3"
        },
        "comments": {
            "amount": "4",
            "1": "There were rumors of the Jaguars giving out free beer to anyone who attended this game in order to increase attendance. This turned out not to be true, which is a shame because the people who were at this contest needed alcohol to endure the struggles of their favorite team. Having said that, it's not a surprise that half the stands were empty. Andrew Luck and the rest of the Indianapolis offense didn't even play that well, yet this was still a blowout. Luck had some accuracy issues, while Reggie Wayne uncharacteristically did some things to nullify big plays. For instance, Wayne missed out on a touchdown in the first half because one of his feet was barely out of bounds. He also let the ball hit the ground on what appeared to be a spectacular sideline catch. Wayne had a touchdown catch wiped out by a holding penalty. Of course, Indianapolis' sluggish offensive afternoon didn't matter because the Jaguars couldn't do anything when they had possession. That was predictable, however, because Blaine Gabbert is absolutely terrible. He went 17-of-32 for 179 yards and three interceptions. Gabbert's two first-half picks were both his fault. The first was underthrown. The second, which was returned for six, was telegraphed. As a result, Jacksonville had just 69 yards of offense prior to intermission. ",
            "2": "Some stats for the Jaguars: Maurice Jones-Drew could do nothing (13-23) because of Indianapolis' improved run defense. Cecil Shorts led the Jaguars with seven catches and 61 yards, but he dropped three balls. ",
            "3": "Enough about the losers. As mentioned, Luck didn't play all that well, but he still went 22-of-36 for 260 yards, two touchdowns and an interception. Wayne, who also didn't play his best, was like Luck in that he posted solid numbers (5-100, TD). Luck's other score went to Coby Fleener (5-77). ",
            "4": "With Ahmad Bradshaw out, Trent Richardson compiled 60 yards and a score on 20 carries. The YPC was disappointing, but the Jaguars also limited Marshawn Lynch to a 17-69 line last week. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "Arrowhead provides one of the greatest homefield advantages in the NFL when the Chiefs are good. The crowd was in full force for this contest. It was so loud that Eli Manning struggled to hear the plays as they were being called into his helmet. Combine this with the heavy pressure that Kansas City placed on him throughout the entire afternoon, and it should be no surprise that Manning had yet another off day. Manning was sacked three times - twice by Tamba Hali - but that number easily could've been much higher because he tried his best to get rid of the ball quickly. Manning was screwed out of two long completions because of deep Hakeem Nicks drops, but he was also at fault for this loss because of some poor throws. His interception was to no one, as he seemingly lobbed it up for grabs. He also lost two fumbles. ",
            "2": "Most of Manning's yardage came on one pass when Victor Cruz torched Dunta Robinson for a 69-yard score. Cruz (10-164, TD) turned out to be the only Giant to finish with more than 33 receiving yards. ",
            "3": "The Giants once again struggled to run the ball. David Wilson had 55 yards on 13 carries. That doesn't amount to a bad YPC, but 15 yards came on one attempt, while a 9-yarder came in garbage time. ",
            "4": "Despite the fact that the Chiefs have a superior team, it's still surprising to see the Giants 0-4 and Kansas City 4-0. There once again was nothing too flashy from Alex Smith, but as was the case against the Eagles, he did a tremendous job of moving the chains on third down. The Chiefs were 9-of-16 in such situations (by comparison, the Giants were a pathetic 1-of-14). On one instance, Smith used his legs on a 9-yard scramble to move the chains. This sparked Kansas City to eventually score a touchdown later on the same drive. Smith's final numbers were 24-of-41 for 288 yards, three touchdowns and two interceptions. The picks were the first for Smith on the season, though one wasn't his fault. The ball was tipped four times in crazy fashion and was ultimately hauled in by Antrel Rolle. ",
            "5": "Smith threw his three scores to different players: Dwayne Bowe (4-58), Jamaal Charles (5-62) and Sean McGrath (5-64). Bowe, in typical fashion, dropped a pass that would have been a gain of about 15 yards or so. Charles was once again instrumental in a Kansas City victory without doing much on the ground; he gained 65 yards on 18 attempts, but most of that yardage came on a gain of 24. His only blemish was a dropped pass in the red zone, though it ultimately didn't hurt the Chiefs because they went on to score a touchdown on the drive. ",
            "6": "It's worth noting that Eric Fisher, the No. 1 pick in the 2013 NFL Draft, left the game with a concussion. ",
            "7": "Two weird things with the announcers and officials. I didn't catch who the color analyst was, but he said that Arrowhead has louder fans than those in Seattle. It's nice that he credited the Chiefs' faithful for this, but the lunatics in Seattle just set the record for most crowd noise in any game ever. Meanwhile, the official announced after a challenge: Philadelphia will not be charged with a timeout. I guess the ref wasn't used to seeing Reid in his pretty bright red jacket. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "27"
        },
        "comments": {
            "amount": "6",
            "1": "Despite the fact that two 0-3 teams were battling each other, the London football fans did a great job of packing Wembley Stadium. There were 84,000 Brits in attendance, all waiving various Pittsburgh and Minnesota team flags. Those who bought those tickets were rewarded with a highly entertaining matchup in which both squads were fighting to keep their season alive. The Vikings led throughout, but the Steelers made things interesting by scoring 10 points in the fourth quarter. They put themselves in position to notch a game-tying touchdown in the final minute, but as observers saw through the entire afternoon, Ben Roethlisberger simply couldn't deal with the pressure. He was strip-sacked in the red zone. Minnesota recovered to seal its first victory of the season. ",
            "2": "There were two themes in this game. The first was the aforementioned pressure - Roethlisberger took five sacks, 2.5 of which came from Jared Allen - while the second was Pittsburgh's defense looking extremely slow. The box score shows that Matt Cassel completed 70- and 51-yard passes to Greg Jennings and Jerome Simpson, respectively, but those were intermediate passes that went for long gains because the Steelers were just so sluggish. Cassel went 16-of-25 for 248 yards and two touchdowns. Those numbers look good, but again, Pittsburgh's slow defense was mostly responsible for that. Outside of those two long gains, Cassel had just two completions longer than 13 yards, and just one that went beyond 16. Having said that, I don't want to take away everything from Cassel because he did good job of avoiding turnovers. ",
            "3": "I'm sure the Minnesota faithful was pleased to see Adrian Peterson break out of his funk. The All-Pro running back exceeded the century mark for the first time all season, rushing for 140 yards and two touchdowns. Part of the reason for this was Pittsburgh's slow defense, but the return of Pro Bowl fullback Jerome Felton was also a big factor. With Felton back permanently from suspension, look for Peterson to take off. ",
            "4": "The Steelers had some rushing success themselves. Le'Veon Bell, seeing his first professional action, gained 57 yards and two touchdowns on 16 carries. He also caught four passes for 27 receiving yards. The big development here was the two end-zone trips; this is the first time a Steelers running back has scored since Week 15 of the 2012 season. ",
            "5": "Ben Roethlisberger went 36-of-51 for 383 yards, one touchdown and an interception. He dealt with tons of pressure in his face, but performed well considering the circumstances. Not included in his stat line was a deep pass interference on a heave to Antonio Brown in the end zone. Roethlisberger's lone score went to Jerricho Cotchery (5-103), but he targeted Brown more than anyone else. His No. 1 wideout hauled in a whopping 12 balls for 88 yards. And as mentioned, Brown drew a deep flag on cornerback Josh Robinson in the end zone. ",
            "6": "Two other Steelers of note: Heath Miller made big strides this week, catching six passes for 70 yards. Rookie Markus Wheaton chipped in with three receptions for 26 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> If someone had recorded me when Carson Palmer continuously tossed red-zone interceptions, they would've had me committed. But it's nice to get lucky on a pick once. ",
            "2": "If you like ugly football with inept offenses, this was the game for you. Once again, the Bucs stole a loss from the jaws of victory. Stud cornerback Patrick Peterson dominated the fourth quarter with two interceptions to set up the Cardinals for a fourth-quarter comeback win. Tampa Bay had the game in hand, up 10-0 when Doug Martin fumbled the ball away at midfield. That spotted Arizona three points. With three minutes remaining, Mike Glennon was intercepted by Peterson on a poorly thrown pass as Peterson had Vincent Jackson (2-27) perfectly covered. Peterson's return set up the Cardinals at the Bucs' 13-yard line. The next play saw Carson Palmer throw a strike to Larry Fitzgerald (6-68) for a touchdown. He beat Darrelle Revis to get open in the end zone. That tied the game at 10 with three minutes remaining. Glennon was soon sacked by Dontay Moch at the 1-yard line and a punt set up Arizona at the Tampa Bay 38. Palmer hit Jaron Brown for 19 yards and a Dashon Goldson unnecessary roughness penalty set up an easy game-winning field goal for Jay Feely. Peterson iced the game with his second interception at midfield. ",
            "3": "The Bucs benched Josh Freeman because of turnover and accuracy problems, but got the exact same thing from Mike Glennon. Nobody should be surprised because Glennon was inaccurate and threw a lot of picks at N. C. State. The rookie completed 24-of-43 passes for 193 yards with two interceptions and a touchdown to Mike Williams (4-38). Glennon's score came after a Rashard Mendenhall fumble. ",
            "4": "The Bucs' defense played well, but blew a fourth-quarter lead for the third time in four games. Gerald McCoy was phenomenal for Tampa Bay. He had a sack, recovered a fumble and was in the backfield all day. Revis played well too, as he held Fitzgerald without a catch in the first half. In Buccaneers' territory, Revis picked off a pass intended for Fitzgerald in the third quarter. Revis also forced a fumble late in the fourth quarter. Tampa Bay rookie corner Johnthan Banks made an awesome interception in the end zone with a leaping catch to take points away from Arizona. ",
            "5": "Palmer was 21-of-38 for 248 yards with a touchdown and those two picks. Against a team with a decent offense, he wouldn't have played well enough to win. Michael Floyd was his top receiver as he caught five for 87 yards. WalterFootball.com caught up with Fitzgerald after the game, and he summed up the game nicely, The first half that [sic] was some ugly ball in the first half. All around. The defense kept fighting and fighting to keep the game manageable for us. Those guys played their tail off. They got banged up and we lost lots of bodies last week, but guys continued to step up in their roles and that is what a team is about. ",
            "6": "Mendenhall was terrible for the Cardinals. Early on, he dropped an easy pass and fumbled the ball away after running into Fitzgerald. Mendenhall also fumbled the ball out of bounds after a strip by Revis inside the Bucs' 10-yard line when Arizona was setting up the go-ahead field goal. The Cardinals should bench Mendenhall and let young backs Andre Ellington (4-29 rushing, 3-22 receiving) and Stepfan Taylor see if they can produce more. ",
            "7": "Cardinals linebacker Karlos Dansby played really well with nine tackles, but he dropped an interception that could have put up easy points for Arizona. Veterans Calais Campbell, Darnell Dockett and Yeremiah Bell all looked good for the Cardinals. ",
            "8": "Doug Martin ran for 45 yards on 27 carries. If he's on your fantasy team and you have a talented backup, you might want to bench Martin if you have solid, alternative options. Cardinals rookie Tyrann Mathieu told WalterFootball.com after the game that Arizona had a simple game plan, They had a rookie quarterback, so we knew they were going to try and establish the run, so we tried to stack the box and force them to pass. Every team is going to play Tampa Bay like this for the rest of the seasonm and Martin will probably fall well short of his anticipated totals. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Titans",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> I hope Jake Locker is OK. It'd be a shame if he misses a lot of time because things have really clicked for him. ",
            "2": "If Jake Locker can come back quickly, it would be time to give the Titans their due as playoff contenders. They handled the Jets in impressive fashion and improved to 3-1 on the season. Unfortunately, a third-quarter hip injury had Locker carted off the field and taken to the hospital for an MRI. On the play, he was hit late by Muhammed Wilkerson and bounced off Quinton Coples to fall awkwardly to the ground. Locker completed 18-of-24 passes for 149 yards and three scores in his abbreviated outing. His first score was a short touchdown toss to Delanie Walke (3-14). Another short field set up Locker to hit Nate Washington on a quick slant for another six. With the clock running out on the first half, Locker laid out a well-placed ball to Justin Hunter for a 16-yard touchdown. Hopefully Locker is okay and returns to the field quickly for the Titans. The injury brought in backup Ryan Fitzpatrick, who hit a 77-yard touchdown to Washington (4-105) after he beat Antonio Cromartie and ran over an offical. Fitzpatrick completed 3-of-8 for 108 yards. ",
            "3": "The Jets completely shut down Chris Johnson (15-21). Demario Davis was really tough while Antwan Barnes and Calvin Pace recorded sacks. New York's defense didn't play badly; the unit was just repeatedly put in impossible situations. ",
            "4": "Prior to this week, Geno Smith hadn't had a typical rookie meltdown performance, but that changed against the Titans. He was a turnover machine and the Tennessee defense was on fire. On the first drive of the game, Smith underthrew a ball that was picked off by Alterraun Verner. Smith took off on a run a little bit later and never tucked the ball in. Zach Brown slapped the ball out and Verner recovered it. Just before halftime, Smith forced a pass to Santonio Holmes and Verner was right there to outfight Holmes for another interception. Smith was strip-sacked by Karl Klug in the end zone early in the fourth quarter for a Titans touchdown. Smith's four turnovers led to 28 points for Tennessee. While it sounds like Mark Sanchez could have been under center, Smith moved the ball at times. He completed 23-of-34 passes for 289 yards, including a 34-yard touchdown to Jeff Cumberland after he burned Bernard Pollard and Michael Griffin. Kellin Winslow (6-73) and Jeremy Kerley (4-65) led New York through the air. Bilal Powell had a nice game rushing (14-66) and receiving (3-42). ",
            "5": "Tennessee's defense was very opportunistic. Aside from Verner's awesome performance, a number of others were excellent. Ropati Pitoitua was a beast with two sacks, while Jurrell Casey continued his phenomenal season by notching a sack and helping to create another. Zach Brown recorded six tackles and a sack to go along his forced fumble. Derrick Morgan had a tackle for a loss on a fourth-and-inches. The Titans' defensive line is talented and underrated. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "52"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Chip Kelly was confident heading into this game. He said that the altitude wouldn't be a factor because his Oregon offense excelled when his Ducks had to travel to take on Colorado. I wonder if he still feels the same way because his defense completely quit in the second half after forcing the Broncos' starting offense into just two punts. Peyton Manning was unstoppable. Playing just three quarters, he misfired on only six attempts. He finished 28-of-34 for 327 yards and four touchdowns before Brock Osweiler took over in mop-up duty in the final frame. It's really not fair. Manning is just way too good, and his supporting cast is far too talented. Vegas needs to start treating Denver as if it were the 2007 Patriots by posting 20-point spreads whenever the Broncos play average or worse competition. ",
            "2": "Manning threw touchdowns to two players. Demaryius Thomas (8-81) and Wes Welker (7-76) each caught two scores. Eric Decker (5-88) and Julius Thomas (4-43) also contributed, but they'll have to wait at least one more week to find the end zone - though it's worth noting that Decker drew an interference flag there. ",
            "3": "Knowshon Moreno handled most of the early workload. He gained 78 yards and a touchdown on 12 carries against a Philadelphia's poor-tackling defense that was pushed around by Denver's imposing front. Moreno's only blemish was a foolish unsportsmanlike penalty when he pushed an Eagle defender after the play was over. As for the other Denver backs, Ronnie Hillman (11-36) was the change-of-pace back, while Montee Ball didn't even see the field until there were two minutes remaining in the third quarter. The Broncos clearly don't trust him yet, as he pass protects poorly and tends to fumble the ball. Ball managed 24 yards on eight carries, but most of that was when Osweiler was under center. ",
            "4": "The Eagles moved the chains well in between the 20s in the first half, but sputtered in the red zone - a problem that has been prevalent for them throughout the season thus far. They settled for a pair of field goals early on, which is a recipe for disaster when Manning is scoring sevens for the opposition. Late in the first half, Philadelphia, in a fourth-and-6, had a curious delay of game when a long field goal was possible. Kelly opted to punt the ball and did manage to pin the Broncos inside the 10. This was all for naught, however, as the Broncos were in Philadelphia territory after just two plays. That's the type of game this was. ",
            "5": "QBDK went 14-of-27 for 248 yards before exiting the game in the fourth quarter. He was solid in the first half, but the Broncos made great adjustments during the break; he was limited to just 4-of-11 passing for 78 yards after intermission. It also didn't help QBDK that DeSean Jackson (2-34) suffered an injury in the second quarter. Jackson barely missed any time, but he didn't do anything after he got hurt. Foles saw some action in garbage time. ",
            "6": "LeSean McCoy rushed for 73 yards on 16 carries. He was mysteriously absent on a drive in the second quarter in which Chris Polk ran into the end zone. McCoy was on the field after that, so I can't say what that was all about. ",
            "7": "As if the Broncos didn't have enough trouble scoring, Trindon Holliday had a touchdown on a 105-yard kickoff return. It's still baffling that the Texans cut him last year. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "4",
            "1": "There were reports Saturday night that Terrelle Pryor would suit up for this game despite suffering a concussion in Monday's loss. Things changed just hours later when it was evident that Pryor was still experiencing concussion-like symptoms. Matt Flynn drew the start instead, but it was other injuries that did the Raiders in. Both Darren McFadden and Marcel Reece left the game in the first half. Oakland had success moving the ball early on - the team held a 14-0 lead, though one of the touchdowns came on a blocked punt in the opening quarter - but couldn't do anything once those backs exited the contest. Rashad Jennings, who replaced both McFadden and Reece, gained just 45 yards on 15 carries, though he did have eight catches for 71 receiving yards, as Flynn checked down frequently. McFadden saw just five carries, but nearly matched Jennings' rushing total (29 yards). ",
            "2": "As for Flynn, he went 21-of-32 for 227 yards, one touchdown and an interception which was returned for six by David Amerson (Flynn didn't see him). He also lost a fumble while trying to sneak it on fourth-and-inches and had an interception dropped. Flynn's lone score went to rookie tight end Mychal Rivera (2-44). Denarius Moore (4-66) led the wideouts. ",
            "3": "The Redskins also suffered some injuries. Brian Orakpo hurt his hand and missed some action. Alfred Morris, who gained 71 yards on 16 carries, suffered a rib contusion. Roy Helu took over and looked pretty good, compiling 41 yards and a touchdown on 13 carries to go along with two catches for 43 receiving yards. ",
            "4": "Robert Griffin didn't look like his old self, but he was good enough to pull off the victory. He went 18-of-31 for 227 yards and a touchdown. He scrambled thrice for 10 yards, as the Raiders were completely prepared for the read-option (understandably so because they have to defend Pryor in practice). In fact, Griffin was sacked on a fourth-down try in the second quarter. He had a gain of seven yards, but didn't do anything else on the ground. Griffin's one touchdown was tossed to Pierre Garcon (6-59). The only other Redskin with more than two catches was Leonard Hankerson (4-49). Logan Paulsen (2-46) ruined a promising drive in the second half by losing a fumble while carrying a few defenders. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "When the Chargers were up 23-21 in the fourth quarter, I texted Matvei (whom I enter the Las Vegas Hilton Supercontest with) and wrote, This is setting up for a heart-breaking 24-23 loss for San Diego. It's something we've all seen way too many times. The Chargers have a terrible habit of outplaying the opposition - they outgained Dallas, 506-317 - and then finding some way to lose at the very end. Minutes later, San Diego scored a touchdown to go up nine. They never looked back. Philip Rivers deserves all of the credit for this victory. He was absolutely incredible; he misfired just seven times despite missing both starters on the left side of his offensive line. His one blemish was a pick-six to Sean Lee, but he was hit as he threw the ball, so I wouldn't count that too much against him. Rivers finished 35-of-42 for 401 yards, three touchdowns and the interception. He was especially awesome after intermission: 15-of-17 for 183 yards and two scores. ",
            "2": "Rivers' first two touchdowns went to Danny Woodhead, who had five catches for 54 yards. The other score was thrown to Antonio Gates, who had a monstrous performance with 10 grabs for 136 yards. Other San Diego wideouts of note include rookie Keenan Allen (5-80) and Vincent Brown (7-41). ",
            "3": "The one dark cloud over San Diego's victory was an injury to Dwight Freeney, who left the game with a quad issue. ",
            "4": "As for the Cowboys, they also moved the chains pretty well. Tony Romo went 27-of-37 for 244 yards and two touchdowns. Interestingly, he was sacked more (3) than Rivers (1). Both of Romo's scores went to Dez Bryant (6-81). Bryant saw just nine targets despite seeing single coverage, so it's strange that Romo went to Terrance Williams as much. ",
            "5": "Two other Cowboys had five catches: Jason Witten (5-43) and DeMarco Murray (5-20). Speaking of Murray, he rushed for 70 yards on 14 carries. The Cowboys are going to regret not being more balanced because they moved the chains well on the ground. ",
            "6": "What hurt Dallas' chances for a come-from-behind victory - besides a shaky defense that couldn't get off the field - was a fourth-quarter Williams lost fumble inside the red zone while he was trying to reach for the goal line. Williams was too far away from the end zone, so while the effort should be applauded, he needs better awareness; regardless of a field goal or a touchdown, the Cowboys would've drawn to within one score. Williams made seven catches for 71 yards, filling in for the injured Miles Austin-Jones. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "The Patriots' uncomfortably close victory over the Jets that had everyone criticizing the team happened just two weeks ago, but it feels like that occurred in a previous lifetime. Tom Brady couldn't get anything going versus New York, but he seems so much more comfortable with his young wideouts. Brady went 20-of-31 for 316 yards and two touchdowns. He missed some throws - including one in the end zone to Kenbrell Thompkins - but his one real blemish was a botched snap when he was trying to sneak it on fourth-and-inches while trying to run out the clock. This allowed the Falcons to take over in great field position, but Aqib Talib made an awesome play to break up a potential touchdown to Roddy White to halt an Atlanta comeback from down 30-13 and seal the victory for New England. Brady's scores went to Thompkins and Matthew Mulligan. Thompkins had a huge outing, catching six balls for 127 yards, which included a great grab over stud safety William Moore. He wasn't perfect - he dropped a couple of passes - but it's extremely obvious that he has made big strides. The sky is the limit for him, as well as the Patriots, who will have Danny Amendola and Rob Gronkowski back in the next couple of weeks. ",
            "2": "New England's other receivers of note include Julian Edelman (7-118), who did all of his damage in the second half, and Aaron Dobson (1-10) who left the game in the middle of the third quarter with an injury. ",
            "3": "The Patriots ran the ball well against Atlanta's skeleton-crew defense that was missing Asante Samuel, as well as linebackers Akeem Dent and Paul Worrilow (both of whom left the game in the second half). Stevan Ridley gained 53 yards on 11 carries, while LeGarrette Blount (9-64) broke free for a 47-yard score. ",
            "4": "The Falcons, meanwhile, can blame this loss on themselves. They made numerous errors in this contest, including: - Left tackle Sam Baker ruined a drive in the first half with two penalties (holding, face mask). He would leave the game with an injury a little bit later. - The Falcons went for it on a fourth-and-2 inside the red zone in the middle of the second quarter. A field goal would've made a huge difference later on, though it's always difficult to know what would've happened. - Julio Jones dropped a big gain. He missed some time with a leg injury, but managed to finish with solid stats (6 catches, 108 yards). - Dent was whistled for a penalty that gave New England a first down on what would've otherwise been a punt attempt. The Patriots would go on to score a touchdown on that drive. - Atlanta surrendered a third-and-19. The team couldn't get any sort of pressure on Brady, who found Thompkins for a 26-yard completion. On top of that, the Patriots got 15 yards for a Moore hit to the helmet. - Roddy White was whistled for offensive pass interference on Talib in the red zone. - Talib came up with an interception when Matt Ryan targeted Jones downfield. - The replay system is not working. - Walt Coleman. OK, this wasn't on the Falcons, but it was funny to see the senile referee announce that to the crowd on an attempted challenge by New England. ",
            "5": "Ryan went 34-of-54 for 421 yards, two touchdowns and the aforementioned pick. He was decent for most of the contest considering the amount of pressure he had in his face was Baker was knocked out of the game. It has to be noted though that a couple of his big gains happened because Kyle Arrington and Steven Gregory missed what looked like easy tackles. Both of Ryan's scores went to Tony Gonzalez, who was unstoppable. He caught 12 balls for 149 yards and the two touchdowns. As Cris Collinsworth pointed out, the Patriots treated him like a gunner in the red zone late in the game. Roddy White, meanwhile, didn't seem any healthier; he had just three catches for 28 yards. He needs a bye week to heal up. ",
            "6": "The Falcons couldn't run the ball very well with Jacquizz Rodgers (7-32) or JasonSnelling (8-26). Rodgers did contribute with six grabs for 56 yards, however. ",
            "7": "New England had a big injury of its own. Vince Wilfork went down in the first quarter with an ankle. He was carted into the locker room and did not return. Sources told the Boston Globe that Wilfork tore his Achilles, which is a tough break for the Patriots. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Saints",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Dolphins started the year 3-0, but there were many skeptics. They could have silenced those critics with a win over the undefeated Saints in the chaotic Superdome. It looked like they were going to be competitive - they were moving the ball well, trailing 14-10 with possession in the second quarter - but Ryan Tannehill self-destructed. Tannehill was sharp early on, but lost a fumble in New Orleans territory. This was nothing new for Tannehill, as he leads the NFL in that category. Two possessions later, he tossed an interception. He was never the same after that. He looked completely rattled and went on to go 13-of-25 for just 121 yards, a garbage-time touchdown and two more picks after intermission. The Dolphins scored just once after the break, and that occurred when New Orleans was leading, 35-10. They just didn't look ready for primetime. The Saints, meanwhile, were unstoppable in the final three quarters. They scored 31 points before taking the air out of the ball, thanks to Drew Brees being in such a great rhythm. Finishing 30-of-39 for 413 yards and four touchdowns, Brees misfired on just three of his 18 second-half attempts. ",
            "2": "Two of Brees' touchdowns went to Jimmy Graham (4-100). One another went to Ben Watson. The fourth came from Darren Sproles. Miami had absolutely no answer for the tiny, pass-catching running back. He caught a 48-yard pass on the opening possession and then converted a third-and-20 on a screen in the second quarter. Sproles rushed for 28 yards on four carries to go along with his seven catches for 114 receiving yards. He found the end zone twice, and nearly scored on a third occasion, but lost a fumble late in the fourth quarter. ",
            "3": "Other stats for the Saints' offense: Khiry Robinson was fed the ball late in the game to bleed the clock. He gained 37 yards on 12 carries. The YPC isn't impressive, but Robinson was going up against one of the top defensive fronts in football. He looked good, so he could have some decent outings in the future. ",
            "4": "Going back to Tannehill, his final numbers were 22-of-35 for 249 yards, one touchdown, three interceptions and the aforementioned lost fumble. His offensive line let him down again in pass protection, surrendering four sacks. ",
            "5": "While Miami's blockers struggled to shield Tannehill, they did a good job of pushing around the Saints' front to open up running lanes for Lamar Miller, who gained 62 yards and a touchdown on 11 carries. The Dolphins were able to free up Miller out of some zone-read looks, which would explain why Tannehill scrambled four times for 48 rushing yards. The Dolphins had to go away from Miller in the second half because of the big deficit, but they did a poor job of not giving him enough carries prior to intermission. Daniel Thomas wasted four opportunities for five yards, including a stuff on third-and-inches during the first half on a poor play-call in which the sluggish Thomas ran outside. I'm not sure why Miami is even messing around Thomas. He's garbage and deserves to be on the bench. ",
            "6": "Mike Tirico and Jon Gruden talked about how Tannehill and Mike Wallace admitted they're not on the same page. It showed Monday night, as Wallace was limited to three catches for 24 yards. Wallace dropped a deep ball in the first quarter, and then Tannehill threw behind the former Steeler wideout. ",
            "7": "Tannehill's touchdown went to Charles Clay (6-42). Brian Hartline disappointed his fantasy owners (3-34), while Brandon Gibson was the surprise leader in receiving yardage (6-71). <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}