{
    "year": "2013",
    "week": "11",
    "Game 1": {
        "Team 1": {
            "Name": "Colts",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "The Colts said they wanted to get off to a hot start because of their poor habit of falling behind early, but they looked like they weren't prepared for this game in the first half. They were confused defensively on the opening Tennessee drive and had to waste a timeout. This did not help. as the Titans repeatedly beat them on crossing routes, with the possession culminating with a Chris Johnson touchdown. The Colts then were flagged for an illegal formation on a play where one of their receivers dropped a pass on third down that would've moved the chains. Tennessee took over, and Chuck Pagano hesitated to challenge a Ryan Fitzpatrick fumble in which the quarterback was not down by contact. Even the special teams were dreadful, as the kick returner didn't know whether or not to take the ball out of the end zone, as he was pinned inside the 5-yard line. Mistakes were prevalent throughout the first two quarters. Darrius Heyward-Bey and Weslye Saunders dropped passes. The defense, meanwhile, committed three penalties on one drive, including a head butt by Erik Walden (though if you watch the replay, you'll see the official actually throw the flag right before the head butt and right after Walden ripped the player's helmet off). With Chris Johnson running all over Indianapolis, the Titans led 17-3 just before a last-second Adam Vinatieri field goal prior to intermission. But then everything changed. Suddenly, the Colts were efficient on offense and strong versus the run on defense. They established the lead with the help of a fumbled kickoff return and eventually went up by 10 points, though Fitzpatrick easily torched the Colts on a drive to achieve the dreaded back-door push. If you're reading this, I hope you had Indianapolis -2.5. I had -3. Wah, wah. ",
            "2": "It really is amazing how much things changed in the second half. Here are some examples: - Andrew Luck went 12-of-21 for 108 yards before the break. He was 11-of-15 for 124 yards and a rushing touchdown afterward (his final numbers were 23-of-36, 232 yards along with 31 rushing yards on nine scrambles and the score). - Chris Johnson had 80 yards on 13 carries and two touchdowns in the first half. He finished with a 17-86-2 line. - The Colts barely ran the ball in the opening two quarters, accumulating just 35 yards on the ground. By the time the game was over, Donald Brown notched 80 yards and two scores on 14 carries. Trent Richardson, by the way, looked as sluggish as ever, gaining 22 yards on eight carries to go along with five catches for 31 receiving yards. - The Titans had 189 net yards prior to intermission. They had just 71 yards afterward before the aforementioned back-door drive. ",
            "3": "Some other numbers: Coby Fleener had a career night, catching eight balls for 107 yards. T.Y. Hilton had five receptions for just 44 yards. ",
            "4": "Fitzpatrick, who went 22-of-28 for 222 yards and a touchdown, remarkably threw to just two players until he targeted Craig Stevens in the fourth quarter. Pretty crazy. Those two players were Delanie Walker (10-91, TD) and Kendall Wright (9-80). Only one other Titan ended up finishing with a reception (Nate Washington, 2-53). Washington and Wright both had crucial drops. ",
            "5": "I like to poke fun of Brad Nessler. He's called Greg Little Mr. Dependable and referred Jay Feely as Jim Feely earlier in the season. He called Ryan Fitzpatrick Ryan Fitzgerald but quickly corrected himself. I'd be upset about not being able to make fun of him too much, but official Mike Carey picked up the slack. I thought Carey was corrupt, but the Colts covered, so he might just be terrible. He didn't see a challenge flag in the first quarter. He also made a mistake with the clock, as he advanced the first quarter to the second following a challenge. He also blew a roughing-the-passer penalty, stating that Fitzpatrick suffered a blow to the helmet when it wasn't even close. This was followed up by a weird personal foul penalty on Indianapolis that completely confused Mike Mayock. Carey then botched a Tennessee challenge on a Luck quarterback sneak. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "The Jets have followed a win-loss-win-loss pattern all year. They were coming off a win plus a bye, so there was some hope that this dynamic would be disrupted. Unfortunately for New York, that was not the case. The team suffered a horrifying defeat, as Geno Smith had the worst performance of his young career. Buffalo simply confused Smith. Defensive coordinator Mike Pettine dialed up numerous blitzes that perplexed the rookie signal-caller. Smith was sacked four times and lost a fumble deep in his own territory. He then stared down his receiver on an interception and had a later pick-six on an attempted screen. Smith finished 8-of-23 for 103 yards, three interceptions and the aforementioned lost fumble. He seemed to be injured in the first quarter when he took a fierce hit from Marcell Dareus, but he missed only one play. He was later benched for Matt Simms, but Rex Ryan said that Smith would remain the starter next week. ",
            "2": "Weather was projected to be a big factor in this game, and that certainly was the case early on, as the Jets were seemingly on the short end of all the wind-related incidents. For example, Nick Folk missed his first field goal of the season after drilling 23 in a row because the wind blew the ball way wide right, but later, on the same side of the field, Dan Carpenter hit his attempt - his first of three conversions. Right after that, E.J. Manuel aired out a deep pass for T.J. Graham. The wind seemed to stop the ball, but that helped Buffalo because Graham got away with a push-off. He snagged the reception for a 38-yard score, which turned out to be the first of two E.J. Manuel touchdowns on the afternoon. After struggling last week, Manuel was brilliant in this matchup. He let only eight passes hit the ground, going 20-of-28 for 245 yards and two touchdowns despite missing both of his starting receivers. Stevie Johnson and Robert Woods were both out with injuries, but that didn't matter at all because the Jets couldn't do anything about Marquise Goodwin (6-81) and Graham (2-74), both of whom found the end zone. The New York cornerbacks are terrible; Dee Milliner has been a disappointment thus far, while it's almost certain that Antonio Cromartie will be a cap casualty this upcoming offseason. ",
            "3": "It's remarkable that the Bills had so much success in windy conditions considering that neither Fred Jackson nor C.J. Spiller were very productive. Jackson gained 34 yards on 12 attempts to go along with two catches for five receiving yards. He tweaked his knee in the process, but stayed in the game. Meanwhile, it seems more and more like Spiller's performance against the Chiefs was a major fluke, as his 13 carries went for just six yards against New York. He also caught two balls for only 10 receiving yards. Fullback Frank Summers vultured a touchdown from both backs. ",
            "4": "The Jets, meanwhile, had their running back post solid numbers. Chris Ivory once again handled most of the workload, gaining 98 yards and a touchdown on 15 carries. However, most of Ivory's yardage came on a 69-yard burst in garbage time, so it's not like the Jets had much success on the ground. ",
            "5": "Santonio Holmes made his return to the lineup. He hauled in only two passes, but made them count, as they went for 38 and 33 yards. Jeff Cumberland (3-25) caught a garbage touchdown from Simms. Cumberland was the only Jet with more than two receptions. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "This game was all about the crazy weather conditions. The Ravens looked like they would run away with it; Chicago looked discombobulated - a low snap and miscommunications ruined things early on for the team - while Ray Rice was ripping off big runs. Thanks to a Rice 47-yard burst and an inexplicable 52-yard field goal by Justin Tucker in the rain and wind, Baltimore had established a 10-0 lead. And that's when the mega storm rolled in. The wind and rain were so fierce that the NFL paused this game for two hours. The end of the first quarter resumed around 3:25 Eastern. Conditions were now safe for the fans and players, but the strong wind was still wreaking havoc. There was trash blowing all around the field; the goal posts were swaying back and forth, and someone had to repair one of them during a stoppage; the field crew replaced divots on the field during timeouts; and to top it off, an official's hat humorously blew off. The wind had such a big impact on this game that I found it quite puzzling that the Ravens chose to have possession when winning the coin flip in overtime. It would've been a wise decision before the new rules, but Baltmore should have chosen the wind. As a result of not doing so, its first drive ended prematurely, allowing the Bears to take over and drive down the field to set themselves up for a pushing field goal. ",
            "2": "The weather is the big story, but a secondary plot line was Joe Flacco's ineptitude. Flacco went 17-of-31 for 162 yards, one touchdown and two interceptions. One pick, taken back for a score, was thrown right to a defensive lineman. The other was heaved recklessly into triple coverage. Flacco now has five interceptions in the three games since the bye. ",
            "3": "Flacco's awful outing ruined Ray Rice's best performance of the season. Rice was huge early, as mentioned, and the stoppage didn't slow him down. Rice, showing more power than ever all year, gained 131 yards and a touchdown on 25 carries. He also logged three catches for 17 receiving yards. ",
            "4": "Flacco's sole score went to Torrey Smith (5-32). Dallas Clark was also notable despite his meager stat line (2-31). His first reception was the 500th of his career. His second ws a pretty one-handed grab on a fourth-and-4 to keep the final drive in regulation alive. ",
            "5": "Baltimore's defense was missing Haloti Ngata, which would explain how Matt Forte was able to gain 83 yards on 18 carries. Forte was once again a huge in the passing game, snatching five catches for 42 receiving yards and a touchdown. ",
            "6": "Josh McCown once again didn't turn the ball over. He was solid enough to win this contest, going 19-of-31 for 216 yards and the score to Forte - impressive numbers considering the conditions. Considering how turnover-prone Jay Cutler is, the Bears should keep McCown at quarterback until Cutler is 100-percent healthy. ",
            "7": "Brandon Marshall disappointed his fantasy owners with four catches for 42 yards, but he wasn't getting anything downfield because of the wind. He also missed out on a touchdown because he was able to get just one foot inbounds. Alshon Jeffery paced Chicago with seven receptions for 83 yards. ",
            "8": "There was some serious news that came to light after the contest. Ozzie Newsome left the game in an ambulance because he was sweating profusely and feeling very ill. He didn't fly home with the team. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "It's common to see NFL games swing in a different direction after halftime because coaches can make adjustments during the break. But seeing things change in between quarters is pretty unusual. That's exactly what happened in this contest, however, as Cleveland's 13-0 lead following the first period quickly disappeared. Cincinnati outscored the Browns for the duration of the first half, 31-0. Joe Haden dominated this game early on. He made a stop on A.J. Green just short of the first-down marker, mirroring a tackle he made versus the stud wideout in the first meeting. Haden then snatched two interceptions, including a pick-six. Andy Dalton looked terrible, so it appeared as though the Bengals didn't have much of a chance. Dalton didn't improve, but Cincinnati caught a ton of breaks during their 31-0 second-quarter romp. It started when Jason Campbell heaved a weird-looking interception to James Harrison, who took the ball back for six before the officials ruled that there was an illegal block on the return. The Bengals then scored twice on special teams and defense; a blocked punt was brought back for six, while Chris Ogbonnaya was guilty of a fumble that was returned for a touchdown. The Bengals were up 31-13 by halftime, yet Dalton had thrown for just 63 yards on 8-of-18 passing. That's the type of weird game this was. The Browns managed just one touchdown following the break - a long bomb to Josh Gordon down the sideline. This was a rare, quality throw by Campbell, who had a disastrous afternoon after putting together a few good starts. Campbell's numbers don't look completely terrible - he was 27-of-56 for 248 yards and a touchdown - but he also threw three interceptions. His yardage was inflated - he had just 65 yards by halftime, so most of his stats came in garbage time - and he spent the entire afternoon throwing either behind or over his receivers. It's remarkable how inaccurate he was after several strong outings. ",
            "2": "Dalton, meanwhile, wasn't any better. He threw three touchdowns, but that's a misleading stat, as he went 13-of-27 for 93 yards and the two aforementioned interceptions otherwise. He simply couldn't get anything going with Haden smothering his favorite receiver. Green finished with just two catches for seven yards. With Green doing nothing, the Bengals' leading receiver, excluding Giovani Bernard, was Jermaine Gresham (2-27, TD), who had a bad drop. Mohamed Sanu and Alex Smith (the tight end) also scored. ",
            "3": "The one thing Cincinnati was able to do offensively - remember, most of its scores came via the defense and special teams - was run the ball with both BenJarvus Green-Ellis and Bernard. The two backs had 16-62 and 10-45 lines, respectively. Bernard, who also had four catches for 41 receiving yards, aggravated his rib injury in the second quarter, but was able to gut it out. ",
            "4": "The Browns, meanwhile, couldn't run very well, which really hurt them in the second-half monsoon conditions. Ogbonnaya broke a 43-yard run in the first quarter, but he finished with just 26 yards on his other seven carries. Willis McGahee (6-13) also sucked. ",
            "5": "Campbell's lone touchdown went to Josh Gordon (5-125), who caught a long bomb down the sideline. Gordon quit on a route during the prior series, so he's fortunate that Campbell decided to go back to him. Gordon later disappointed yet again, dropping a pass. As for Jordan Cameron, the talented tight end had six grabs, but was limited to just 29 yards. He was open in the end zone on one occasion, but Campbell overthrew him. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "So much for the Case Keenum era. Facing an Oakland defense that surrendered seven passing touchdowns two weeks ago, Keenum opened with an interception on the second drive. It wasn't all on him though, as he was hit as he threw the ball. This was Houston's second give-away in as many possessions, as Garrett Graham lost a fumble on the opening drive that was recovered by Charles Woodson (his first of two fumble recoveries). The Raiders converted both turnovers into touchdowns, giving them a 14-0 lead. Keenum was eventually benched in the third quarter in favor of Matt Schaub, which was strange because the undrafted rookie wasn't terrible. As mentioned, the early pick wasn't his fault. He went 13-of-24 for 170 yards and a touchdown otherwise, so the decision was a confusing one. Keenum did continue his habit of taking egregious sacks - he ran backward and was tackled 15 yards behind the line of scrimmage on one occasion - but he managed to turn one of these sorts of plays into a 42-yard touchdown to Graham in the second quarter. Schaub stepped in for Keenum, and while he did a good job of leading the Texans down field, he ultimately came up short. He couldn't find Andre Johnson in the end zone to win the game at the very end, which angered Houston's great receiver. The two yelled at each other afterward on the sideline, though the fans didn't really seem to care because Reliant Stadium was pretty empty. Johnson, who walked off the field when there was still time on the clock, sounded frustrated when told the media that he would play out his contract. ",
            "2": "While the Texans are going back and forth with their signal-callers, the Raiders are hoping that they may have found a solution at the quarterback position. Hobbled by a knee injury, Terrelle Pryor has struggled in recent weeks. He was ruled out for this game, allowing undrafted rookie Matt McGloin to start. McGloin was given a couple of gift touchdowns early because of the aforementioned Houston give-aways, but he still played pretty well overall. He finished 18-of-32 for 197 yards and three scores, as he showed pretty decent arm strength, which was not expected at all, given that he went undrafted because of a lacking arm. McGloin's three touchdowns all went to different players: Denarius Moore (2-11), Mychael Rivera (5-54) and Rod Streater (6-84). ",
            "3": "While McGloin played well, it was Rashad Jennings who was the key piece on Oakland's offense. Starting once again for the always-injured Darren McFadden, Jennings gained 150 yards and a touchdown on 22 carries. The score, an 80-yarder, came out of the Wildcat. ",
            "4": "As for the Texans, the one aerial touchdown, as mentioned, went to Graham. He led the team with 136 receiving yards on his seven catches. Johnson paced Houston with 10 receptions for 116 yards. ",
            "5": "Ben Tate rushed for 88 yards on 19 carries. He also had four catches for 29 receiving yards. He was nearly the goat because he fumbled inside the Oakland 5-yard line at the end of the game, but he was lucky to have the ball bounce right back into his chest. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "This looked like it would be one of those trap games early on. The Jaguars led by a touchdown on two occasions in the first quarter because of Arizona stupidity. The first score, a 62-yard Danny Noble reception, came on a fourth-and-1 that the Cardinals didn't see coming. On the following Jacksonville drive, Arizona had a nice goal-line stand to force a field goal, but a Yeremiah Bell taunting penalty gave his opponent a fresh set of downs, allowing Maurice Jones-Drew to score a 1-yard touchdown. The Cardinals, however, played smarter football after that, and eventually established a lead in the third quarter. The Jaguars didn't even score a single point after the Jones-Drew touchdown, allowing Arizona to win by double digits and cover the spread. ",
            "2": "Carson Palmer entered this contest with two or more turnovers in seven of his nine games this year. He actually didn't commit a single give-away versus the Jaguars - officially, that is. Palmer tossed an ugly interception, but had it overturned because of a timeout ruling. He was also whistled for a terrible intentional grounding. However, he still managed to go 30-of-42 for 419 yards and two touchdowns, thanks to very little pressure by a terrible Jacksonville pass rush. ",
            "3": "The bulk of Palmer's yardage came via Michael Floyd receptions. Floyd caught six passes for 193 yards and a touchdown - a 91-yarder that he caught on an intermediate pass and then took the distance, breaking four Jacksonville tackles in the process. Two other Arizona players tied Floyd with the reception lead: Rob Housler (6-70) and Larry Fitzgerald (6-61), who caught Palmer's other touchdown. ",
            "4": "The Cardinals won this game, so they won't be criticized too much for their recurring mistake, but I still can't understand why Rashard Mendenhall continues to get way more touches than Andre Ellington. Mendenhall had 16 touches compared to Ellington's 10. The former turned his 13 carries into just 14 yards and a touchdown. Ellington didn't fare much better (8-3), but he's capable of going the distance on any play, so he needs to have the ball in his hands as much as possible. ",
            "5": "Some quick Jacksonville stats: - Chad Henne went 27-of-42 for 255 yards, the touchdown to Noble and two very ugly interceptions. - Maurice Jones-Drew (14-23) scored, as mentioned, but couldn't find any running room otherwise. - Ace Sanders led the Jaguars with eight receptions for 61 yards. Cecil Shorts (2-22) simply couldn't get open with Patrick Peterson blanketing him. Shorts complained to the media about his usage after the game. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "This was projected to be a shootout because both of these teams had some of the worst statistical defenses coming into this game. Washington's was as bad as advetised; Philadelphia was able to get some good matchups, as there was one play in which Ryan Kerrigan was covering LeSean McCoy downfield for some strange reason. The Redskin defenders couldn't tackle or cover at all, as DeSean Jackson and Riley Cooper were able to gain separation with ease, while Brent Celek had a long reception because Washington couldn't bring him down. Much of the same was expected from Philadelphia's stop unit, but the Eagles were inexplicably dominant on the defensive side of the ball. They put a massive amount of pressure on Robert Griffin, who often didn't have any time to throw whatsoever. This was particularly prevalent on a trip to the red zone when Griffin was hit as he was about to release the ball. He lost a fumble as a result, negating Washington's best scoring chance of the day until a late touchdown in the fourth quarter. Griffin struggled to get anything going for most of the afternoon. He took four sacks - a high number considering that he scrambled out of some tackles - and as a result, he was just 7-of-15 for 57 yards and an interception on a tipped screen that was overturned before Philadelphia's defense eased up a bit. Griffin finished 17-of-35 for 264 yards, two touchdowns and a pick along with 44 rushing yards on 10 scampers, but don't be fooled; the Eagles smothered him, prompting many poor throws, including one where he missed an open Logan Paulsen to set up the offense in the red zone. This was all thanks to outstanding performances by Fletcher Cox, Connor Barwin, DeMeco Ryans and others. ",
            "2": "The Eagles were guilty of some pretty poor prevent defense in the fourth quarter, allowing Griffin to make this result a lot closer than it really was. Griffin actually had a chance to tie the game, as he reached the end zone with less than a minute remaining in regulation, but he was once again under pressure, forcing an incredibly dumb throw in which he heaved the ball off his back foot. The pass was easily intercepted, ending the game. ",
            "3": "Nick Foles, chosen way after Griffin in the 2012 NFL Draft, was the better quarterback on the field. He continuously torched Washington's helpless stop unit, going 17-of-26 for 298 yards along with 47 rushing yards and a touchdown on nine scrambles. Foles would've had an even greater statistical day had the Redskins been able to keep up; he had 217 yards on 9-of-15 passing at intermission. Foles had been targeting Riley Cooper frequently over the past few weeks, but he spread the ball around evenly in this contest. No Eagle had more than four catches, as DeSean Jackson led the team in receiving with four grabs for 82 yards. Cooper managed only three catches for 37 yards. ",
            "4": "LeSean McCoy also had four receptions (73 receiving yards) to go along with 77 rushing yards and two touchdowns on 20 carries. McCoy went down and grabbed his hamstring in the second quarter. It appeared to be serious, but he was able to take the field after intermission. ",
            "5": "Some Washington numbers: - Alfred Morris rushed for 93 yards on 22 carries. There were no touchdowns to vulture on the ground, but Darrel Young caught a long score. Aldrick Robinson (2-60) had Griffin's other garbage-time touchdown. - Pierre Garcon was the only Redskin receiver or tight end with more than two catches. His six receptions went for 68 yards, though he was whistled for a crucial face mask penalty on the final drive. - Santana Moss needs to be phased out of the offense. He had two grabs for 41 yards, but had a big drop on third down that could've moved the chains in the first quarter. Moss has had major issues with drops this season. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "27"
        },
        "comments": {
            "amount": "4",
            "1": "This was a game of three momentum swings: - The Lions made some early mistakes - Matthew Stafford missed an open Reggie Bush on the opening drive and then Reggie Bush lost a fumble - and struggled to tackle Pittsburgh on several long plays. The Steelers were also guilty of some errors early on as well; they had a whopping three drops in the red zone, which included Heath Miller not converting a touchdown because he let the ball hit the ground at the last second. But Pittsburgh was blowing out Detroit, up 17-3, so it didn't seem to matter at the time. - The Steelers apparently could have used those points, as the Lions came roaring back, ultimately establishing a seven-point lead at the break, thanks to Calvin Johnson, who had mind-boggling numbers in the first half (6 catches, 179 yards, two touchdowns). Matthew Stafford was also on pace for a record-setting day, as he was 16-30 for 327 yards and two touchdowns at intermission. - I was excited to think about what sort of numbers Stafford and Megatron could compile. After all, Ike Taylor looked completely helpless trying to cover Megatron - not included in the stats were consecutive penalties on Taylor - but Johnson was remarkably held to no catches in the second half. He was targeted just three times, with one of the passes resulting in an interception on what was a desperation into double coverage. The Steelers made the proper adjustments to take Megatron out of the game, prompting Stafford to force poor throws elsewhere. Stafford was dreadful as a result, going just 3-of-16 for 35 yards and the pick after the break, though he was hurt by some drops. His final numbers (19-of-46, 362 yards, two touchdowns, one interception) were disappointing considering what he had going on at halftime. The Steelers, meanwhile, couldn't be stopped. Ben Roethlisberger, who was sharp in the first half, was even better after the break. He finished 29-of-45 for 367 yards and four touchdowns. He made several great throws, including a third-and-9 conversion on his own 4-yard line that eventually led to the decisive score. Roethlisberger's numbers could've been even better had his teammates not dropped a couple of touchdowns. I mentioned Miller's miscue; Antonio Brown also let a potential score slip out of his hands. This was the only blemish on Brown's afternoon, however, as the budding possession receiver hauled in seven grabs for 147 yards and two touchdowns. Miller, meanwhile, had eight catches for 67 yards. Jerricho Cotchery (3-48) caught the other touchdown. ",
            "2": "The Steelers struggled to run the ball. Le'Veon Bell mustered only 36 yards on 18 carries and even lost a goal-line try to Jonathan Dwyer, who was unsuccessful. However, he was a greater factor in the aerial attack, catching four passes for 52 receiving yards, though he had one of those aforementioned red-zone drops early in the game. ",
            "3": "Bush also struggled to get anything on the ground. He managed only 31 yards on 12 carries to go along with two catches for 23 receiving yards and the aforementioned fumble. He nearly had a second lost fumble, but the officials made a bad call. He nearly lost a second fumble, and as a consequence, was benched in favor of Joique Bell (9-49), who outgained him and also scored. In fact, the only reason Bush saw action in the second half was because Bell suffered an injury. ",
            "4": "This is obviously a disappointing result for the Lions. Good teams are supposed to beat lesser opponents on the road, but Detroit came up short. The players disappointed, as did Jim Schwartz, who made a stupid decision to fake a field goal deep in Pittsburgh territory. The Steelers snuffed out the play, giving them momentum when they were down in the second half. Schwartz then spent some time lashing out at the media afterward, as he was rightfully criticized for not opting to go up a touchdown when he had a four-point lead. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: Congratulations to the Falcons, who will be No. 31 in my NFL Power Rankings come Tuesday. Pathetic. ",
            "2": "Unless you care about draft positioning, this game was irrelevant. All you need to know is the Atlanta Falcons are awful. They are completely inept in pass blocking and rushing the quarterback. Atlanta was dominated by a Tampa Bay team that started 0-8. ",
            "3": "The Bucs got on the board first with a short field goal on a drive led by runs to Bobby Rainey. On Tampa Bay's next drive, Mike Glennon hit a 47-yarder to Vincent Jackson on a great, leaping one-handed catch. That set up Rainey to run behind David Joseph and go up the middle for a 43-yard touchdown. Matt Ryan threw a terrible pass in the flat right to Mason Foster, who returned it 37 yards for a touchdown. Roddy White fumbled the ball away on the next Falcons possession. Glennon hit Tiquan Underwood to set up another Rainey score. Rainey dominated Atlanta with 163 yards on 30 carries with three touchdowns (two rushing, one receiving). Glennon hit another bomb to Jackson thanks to horrible coverage by Thomas DeCoud. That set up a short touchdown toss to Rainey. Following a Dekoda Watson blocked punt, Glennon threw for six more on a fade pass to Jackson (10-165). Glennon finished 20-of-23 for 231 yards with two scores. He played well around a great running game and had all day to throw downfield. ",
            "4": "In garbage time, Ryan hit Harry Douglas for an 80-yard touchdown after he beat Mark Barron and Johnthan Banks on a deep post. Dashon Goldson added an interception. Ryan also threw a short score to White (3-36). Ryan was 19-of-36 for 254 yards with two touchdowns and two interceptions. Steven Jackson had 41 yards rushing and 24 yards receiving. ",
            "5": "Defensively, Tampa Bay got a great game from Gerald McCoy. He had three sacks in the first half to help the Bucs build a lead. Osi Umenyiora had two insignificant coverage sacks, but Atlanta's defense was dreadful. ",
            "6": "After the game, WalterFootball.com joined a media huddle with Falcons owner Arthur Blank. He voiced his support for their regime. We love our head coach and we love our general manager. It is up to them to candidly look at everybody candidly, honestly and critically. That is their job I'm confident they are doing it and will do it. We've had five great years with the second most wins in the league. Second to only the Patriots, and the most in the NFC. It is disheartening at 2-8 with expectations that were reasonable coming into this year.  Blank said he absolutely has confidence in head coach Mike Smith and general manager Thomas Dimitroff. They've earned it over the last five years. They're proven leaders, proven by success and their records. They'll do the work that has to be done with my full support. ",
            "7": "Future Hall of Famer Tony Gonzalez summed up the Atlanta's season nicely, It's embarrassing, honestly. To tell you the truth. The way we came out and performed as a team. It's all of us. We've all got to play better. We're dropping balls. Not executing. It's all of us and will take all of us to get out of this. One thing I know for sure is I'm not going to feel sorry for our team. We have to go out there and play. We have a quick turnaround with a good New Orleans Saints team coming in to play in our dome. We have to get our head out of our butts and play better. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "Philip Rivers has improved tremendously this year because of many reasons, one of which is upgraded pass protection. However, this game was more like 2011 and 2012 - Rivers was pressured heavily throughout the afternoon. He was sacked three times, but that number isn't indicative of the heavy pass rush he had to deal with. It's ironic though that the Chargers, who were missing left tackle King Dunlap, were the ones who had blocking issues considering what the Dolphins have been going through the past few weeks with the Richie Incognito-Jonathan Martin situation. Another reason Rivers' play has been upgraded is a bolstered arsenal, namely rookie wideout Keenan Allen and scat back Danny Woodhead. Neither made much of an impact in this contest. Allen (3-45) didn't log a reception until the third quarter - in fact, no Charger wideout had a catch in the first half - and he wasn't available on the final drive because he injured his knee. Woodhead, meanwhile, inexplicably had just seven touches. Why the Chargers neglected to use Woodhead more frequently is beyond me. ",
            "2": "The San Diego defense was dreadful as well. The unit had immense issues tackling. The Dolphins had more yardage after the catch than they should have, and as a result, Ryan Tannehill went 22-of-35 for 268 yards, one touchdown and an interception. Tannehill had a positive game overall, but he made some mistakes. The pick was bad, and he happened to miss an open Mike Wallace downfield. He also had a brain fart, running out of bounds just prior to the two-minute warning when his team was attempting to bleed the clock. Tannehill's score went to tight end Charles Clay, who had a monstrous statistical outing with six grabs for 90 yards. Brian Hartline (5-65) is next on the list, though he hurt his team with a drop deep in San Diego territory. Hartline also lost a fumble at the 1-yard line in the first half, but the turnover was negated by a roughing-the-passer penalty on Corey Liuget. ",
            "3": "Mike Wallace, meanwhile, had another dud outing. He caught just four passes for 39 yards. Wallace had an opportunity for a big play when he torched a defensive back downfield, but Tannehill underthrew him. Wallace is getting what he deserves after taking the money and running to a team with an inferior quarterbacking situation. ",
            "4": "I'm not quite sure why the Dolphins gave Daniel Thomas way more touches than Lamar Miller (11-6). Thomas did play well for a change, gaining 57 yards and a touchdown on 10 carries, but Miller (4-17) has more game-breaking ability and probably could have done more than Thomas if he received a greater workload. ",
            "5": "Ryan Mathews was the best running back on the field. He gained 127 yards on 19 carries, which included a 51-yard burst. He also had two catches for 16 receiving yards. ",
            "6": "I discussed Rivers' issues with pass protection earlier. Despite that problem, he was still able to go 22-of-34 for 298 yards, one touchdown and an interception. Miami struggled to stop him despite the heavy pass rush, partly because starting cornerback Dimitri Patterson aggravated his troublesome groin injury in the first half. Rivers' sole score went to Antonio Gates (4-52). The other tight end, Ladarius Green, tied Gates for the team lead in receptions, logging 81 yards in the process. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Saints",
            "Points": "23"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: What the hell was that Drew Brees roughing-the-passer penalty? He wasn't hit in the head or neck area; it was at the top of his chest. That cost the 49ers a victory. Then again, the officials tried to screw the Saints as well at other moments. I guess it's fitting that this game concluded with a push. ",
            "2": "With Carolina on the rise, the Saints needed a win to remain in control of the NFC South, and they got it thanks to a collective team effort of big plays on offense, defense and special teams. In back-to-back weeks, the 49ers have lost close games to the top two teams in the NFC South. While San Francisco still controls its playoff destiny, these losses have the potential to bite the franchise when it comes to tie-breakers. ",
            "3": "After starting at New Orleans' three-yard line early in the game, the Saints' Mark Ingram (6-25) had a good run, and Drew Brees got the ball into the 49ers' territory with a deep cross to Robert Meachem that the wideout turned down the field for a 44-yard gain. The drive ended with a short touchdown pass to tight end Josh Hill. New Orleans' defense was doing a superb job of getting off the field in the first quarter. The Saints breathed some life into the 49ers when they muffed a punt at their own 11-yard line and San Francisco recovered the ball. A couple plays later, Colin Kaepernick threw a perfect pass on a back-shoulder fade to Anquan Boldin (6-56) to tie the game at seven. Kaepernick got extremely lucky in the second quarter after Saints cornerback Corey White picked off him and raced down the sideline. As White tried to extend the ball over the goal line, he lost control and fumbled the ball out of the end zone for a touchback. Frank Gore (13-48) then ripped off a 24-yard run to help set up a 55-yard field goal for Phil Dawson. New Orleans responded with Travaris Cadet taking the kickoff back 82 yards. Fullback Jed Collins powered into the end zone from a yard out and the Saints were up 14-10 at the half. In the third quarter, 49ers' linebacker Ahmad Brooks made a great play to record a leaping interception when Brees tried to float a ball over the linebacker to Jimmy Graham (6-41). Brooks' pick set up San Francisco's offense just outside the 20. The 49ers took the lead with Kaepernick rolling to his right to hit Vernon Davis (4-33) in the middle of the end zone. San Francisco had a drive go inside the Saints 20 with a critical 14-yard reception by Boldin on a third down, but the Saints' defense stepped up to force another 49er field goal. Brees answered with a 34-yard pass to Meachem (2-78) and dropped in a beautiful 26-yard touch pass to Marques Colston (5-80). Garrett Hartley finished the drive by hitting a chip shot. The Saints got the ball back and moved to tie the game. The play of the game happened when Brooks had a sack-fumble on Brees that was recovered by the 49ers, but a roughing-the-passer was called on Brooks to take the turnover away. It was a questionable call, but that is the 2013 NFL. Brees connected with Colston to set up a game-tying 42-yard field goal for Hartley. Junior Galette sacked Kaepernick to help force a punt. Darren Sproles fair caught the punt at the 25-yard line, but was tackled by Kassim Osgood. That penalty put the Saints at the 40. A pass to Colston and two passes to Graham moved the ball in position for a 31-yard field goal by Hartley as time expired. ",
            "4": "New Orleans' defense stepped up with a big game. Once again, Rob Ryan did a great job of coaching and scheming. Cam Jordan was excellent as he batted pass on a third-down throw, beat Anthony Davis to sack Kaepernick in the second quarter and almost had a safety in the fourth. Akiem Hicks (7 tackles, 1 sack), Galette (1 sack) and David Hawthorne (8 tackles) all played really well. ",
            "5": "Brees finished 30-of-43 for 305 yards with a touchdown and an interception. Kaepernick was 17-of-31 for 127 yards with two scores and an interception. The 49ers' defense was led by NaVorro Bowman (14 tackles). ",
            "6": "Both teams suffered significant injuries to important players. Saints' cornerback Jabari Greer had to be carted off the field with what looked like a serious leg injury in the first quarter. 49ers' cornerback Tarell Brown suffered the same fate just before halftime. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Giants",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "If Aaron Rodgers returns soon and leads the Packers into the playoffs, he'll lock up the MVP award quite easily. The Packers, as we've all discovered, are nothing without their All-Pro quarterback. Scott Tolzien, making his first NFL start, wasn't completely awful despite his 0:3 touchdown-to-interception ratio. He took some shots downfield instead of repeatedly checking it down, as many other backup quarterbacks would've done. Tolzien had some nice completions - he went 24-of-34 for 339 yards, after all - but he was guilty of several poor throws, hence the turnovers. One of the give-aways, a pick-six by Jason Pierre-Paul, was New York's first defensive score of the season. Meanwhile, the Giants are on a roll. They've won four in a row following their dubious 0-6 start, and they now sit 1.5 games back of the division-leading Eagles. Eli Manning, who was guilty of a high volume of turnovers earlier in the season, committed just one give-away in this contest, an interception that wasn't even his fault. Manning finished 25-of-35 for 279 yards, one touchdown and the pick. He was hurt by some drops, particularly in the red zone, that forced the Giants to settle for field goals, allowing the Packers to hang around. Ultimately, however, New York was able to overpower a Green Bay defense that was missing two prominent members of its secondary. ",
            "2": "Manning's sole score went to Rueben Randle (3-37). Victor Cruz, meanwhile, had a big game with eight catches for 110 yards. The same thing can't be said about Hakeem Nicks (4-50), who spent some time pouting on the sidelines with a towel wrapped around his head. Nicks remarkably has yet to catch a touchdown this season. ",
            "3": "The Giants ran somewhat well on the Packers. Andre Brown mustered 66 yards on 18 carries, though his fantasy owners had to be upset when Brandon Jacobs vultured a touchdown. Brown also dropped a pass. ",
            "4": "As for the Packers, Eddie Lacy couldn't find any running room, unlike last week. He managed just 27 yards on 14 carries, but salvaged the afternoon with a powerful touchdown in the second half. ",
            "5": "Jordy Nelson led all Green Bay wideouts with eight catches for 117 yards. Jarrett Boykin also had a nice outing (6-91), thanks to a 52-yard grab. James Jones didn't do much (2-55). ",
            "6": "Mike McCarthy made a couple of questionable decisions in this contest. He tried a fake punt in the third quarter just over midfield that failed by about a yard. That wasn't too terrible, but with that attempt in mind, I had to wonder why he didn't go for it on fourth-and-inches on his own 29 with 8:30 remaining, down two touchdowns. Lacy probably could've easily converted, but the Packers chose to punt instead, allowing the Giants to take a big chunk of the clock on the ensuing possession. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "This is it. The Seahawks now have everyone back on offense. Percy Harvin was the most prominent name to return, and he made his presence felt with an impressive, 17-yard, one-handed, leaping grab in the second quarter. That was his only reception of the afternoon, but he also had a great kickoff return into Minnesota territory that set up a touchdown. Meanwhile, both starting offensive tackles took the field after their extended absences. As a result, Russell Wilson was sacked only once. With this improved protection, Wilson misfired on just five attempts, going 13-of-18 for a whopping 230 yards and two touchdowns. He didn't have to scramble very much, running just twice for 14 rushing yards. However, he still was able to buy time on occasion, making a Brett Favre-esque flip to Marshawn Lynch for a short touchdown. ",
            "2": "Speaking of Lynch, he didn't have much running room against the Vikings, who are solid versus ground attacks. However, he was still able to score three short touchdowns. The first two were via runs, while the third was the aforementioned flip. ",
            "3": "Wilson's lone score went to Doug Baldwin (2-63). Zach Miller paced the team in receiving with four grabs for 69 yards. Golden Tate barely did anything, snagging just one catch for 26 yards. ",
            "4": "Meanwhile, the Vikings still don't have any answers on offense. They were so scared of letting Christian Ponder air it out that they continuously ran the ball despite being down by 11 in the third quarter. They tried to pound it with Adrian Peterson and Toby Gerhart, but to no avail; since struggling versus the rush in games against St. Louis and Tampa Bay, the Seahawks have improved tremendously against ground attacks. The limited Peterson to just 65 yards on 21 carries, while Gerhart didn't do much out of a 32-yard burst. You can't blame Minnesota for being so scared of Ponder because he proved to be inept. Aside from a 38-yard touchdown bomb in which Jarius Wright inexplicably burned Richard Sherman, Ponder did nothing; his final numbers were 13-of-22 for 129 yards, that touchdown and two interceptions. His picks were both awful; the first was nowhere near Peterson, his intended target, while the second was telegraphed and returned for six. Ponder was eventually pulled for Matt Cassel, who wasn't any better (5-of-13, 78 yards, one touchdown, one interception). It could be Josh Freeman time next week. ",
            "5": "Wright caught two touchdowns, but that was obviously a fluke. John Carlson led the team with five catches for 69 yards. ",
            "6": "Greg Jennings sat out with an Achilles and Jerome Simpson was benched for stupidity, and that allowed Cordarrelle Patterson to start. Patterson drew nine targets, but managed just three catches for 28 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "So this is what happens when Kansas City plays a starting quarterback. The Chiefs, who had not surrendered more than 17 points in any game all year, gave up 27 before Denver took the air out of the ball. Had the Broncos wanted to, they probably could have made this a 34-point result. It's impossible to win with the 2000 Ravens formula in today's NFL because of the no-contact rules, so Kansas City was bound to surrender this many points at some point. Despite the result, the Chiefs' defense played somewhat well, doing all it could versus one of the top offenses in NFL history. It was evident that the Broncos would eclipse the 17-point mark, but that meant Alex Smith would have to exceed that total as well. He could not do that, as he mustered just 10 points before posting a garbage touchdown with about five minutes remaining. Smith was mediocre. He failed to complete half of his passes, going 21-of-45 for 230 yards and two touchdowns (again, one was in junk time). Smith was betrayed by some drops, including one by Jamaal Charles inside the five and two deep downfield by Dwayne Bowe and Donnie Avery, but once he fell way behind, he just couldn't do anything because he can't get the ball downfield. Smith, who is a sub-par quarterback being coached up to playing above-average football, is the primary reason I never slotted Kansas City above No. 8 in my NFL Power Rankings. ",
            "2": "I mentioned that Bowe had a deep drop, but he played well otherwise despite his arrest during the week, as he led the team in receiving with four catches for 57 yards and a legitimate touchdown in the second quarter. Charles, however, wasn't a big factor in the passing game, hauling in just two balls for a loss of six receiving yards. He also notched 78 rushing yards on 16 carries. ",
            "3": "Two other notable Chiefs: Anthony Fasano (4-37) snagged Smith's garbage-time touchdown and also drew a pass interference earlier. Dexter McCluster, meanwhile, had five receptions for 53 yards, which included a beautiful twisting catch along the sideline. ",
            "4": "Kansas City suffered two injuries to its offensive line, with Eric Fisher and Jon Asamoah getting knocked out with a shoulder and calf maladies, respectively. ",
            "5": "As for the victor, Peyton Manning's effectiveness was questionable heading into this matchup because of an ankle injury he suffered late at San Diego. He didn't look very sharp early on, but he got into a groove and picked apart the Chiefs' man defense. Manning missed some throws he should have converted, but he ultimately finished 24-of-40 for 323 yards and a touchdown. Not included in Manning's final line are a couple of pass-interference flags that Wes Welker drew. Julius Thomas caught the only touchdown. Both players suffered injuries, however. Thomas was knocked out with a knee in the third quarter, while Welker collapsed because of a concussion in the final period. The way Welker looked, it'll be shocking if he's ready to play in his return to New England next Sunday night. ",
            "6": "Demaryius Thomas led the team in receiving with five catches for 121 yards. Eric Decker (5-71) also posted solid numbers. ",
            "7": "Knowshon Moreno handled most of the workload, generating 79 yards on 27 carries, but his fantasy owners watched in frustration as Montee Ball (8-25) vultured two touchdowns. Ball didn't deserve the scores, as he lost a fumble in the first half. Ball was bailed out, however, with an Anthony Sherman lost fumble on the ensuing possession. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "It'd be nice to glorify the Panthers for this nationally televised victory, but all discussion has to begin with the final play. Tom Brady had the ball at the 18-yard line with just three seconds remaining. He fired the ball at the end zone, and the ball was intercepted by safety Rob Lester. However, the official in the back of the end zone threw the flag because Luke Kuechly had his arms draped all over Rob Gronkowski. The call looked to be pass interference, as Gronkowski couldn't come back to the football. After a brief discussion with the officials, however, referee Clete Blakeman picked up the flag and quickly ran off the field. He didn't even give an explanation for it. A furious Brady ran after him and peppered him with some expletives, but Blakeman didn't respond. Every single NFL analyst furiously disputed the call. Only the fossilized Jerry Austin didn't agree, but he was just defending his referee friends. Austin repeated that Gronkowski couldn't get back to the ball, but Kuechly's initial contact occurred right where the ball was picked off. It's so shady that the back judge was right there when he threw the flag, yet Blakeman came out of nowhere to pick it up and just ran off the field. Given that there was so much betting action on the Patriots, one can safely assume that Blakeman was asked to make sure Carolina won by three or more points. Blakeman, if you're keeping score at home, also allowed three seconds to come off the clock following Carolina's final touchdown. If you go back and look, Ted Ginn ran into the end zone with 1:02 remaining, but the clock ticked down to 59 seconds. It's small, unnoticeable stuff like this that occurs in a fixed game, but Blakeman had to make a blatant ruling to prevent New England from finding the end zone at the very end. He simply had no choice. It's a shame that this game came down to crooked officiating because this was an even matchup. The Patriots actually outgained the Panthers by 90 yards, but outside of the shady call at the end, what killed New England was a Stevan Ridley inside the 10-yard line. Had Ridley not fumbled, New England would've been down 24-23, and could have just kicked a field goal to win the game. Of course, Blakeman probably wouldn't have allowed it to get to that point. Perhaps offensive pass interferences or holding penalties would've haulted other New England drives. ",
            "2": "The secondary story in this game was Cam Newton's coronation. I can't help but think of his first appearance on national TV when he battled the Giants last year. Newton was awful, but he has grown by leaps and bounds since then. Newton went 19-of-28 for 209 yards and three touchdowns. He got away with a couple of interceptions, but he played a great game overall. His best play was a 14-yard run on a third-and-7 in the third quarter. Eluding four Patriots, Newton ran backward about 20 yards and then sprinted forward 14 yards past the line of scrimmage to pick up the first down. Newton's touchdowns went to Brandon LaFell (7-59), Olsen (5-52) and Ted Ginn. The latter score, a 25-yarder, was Ginn's only catch of the game. He caught it short of the first-down marker on second-and-15, but juked Kyle Arrington and sprinted into the end zone. ",
            "3": "Steve Smith didn't score, but led the team in receiving. He had four catches for 62 yards, and he also drew two penalties on Aqib Talib. Butt hurt that Smith beat him on a 42-yard reception, Talib grabbed Smith's leg and wouldn't let go. This angered Smith and ignited the crowd, so it was an incredibly stupid thing to do. Smith is always at his best when playing mad, so the smartest way to approach him is to kiss up to him and even ask for his autograph. ",
            "4": "As for the team that could have easily won, Tom Brady was a near-perfect 29-of-40 for 296 yards, one touchdown and the bogus interception. He was under siege quite often when Charles Johnson was in the game. Johnson missed some time with a leg injury, but he came back on the field late in the fourth quarter. Brady threw his one score to Gronkowski (5-59). He spread the ball around to Kenbrell Thompkins (2-60), Danny Amendola (6-45), Aaron Dobson (4-38) and Julian Edelman (3-27). ",
            "5": "Seeing his first action since Week 1, Shane Vereen was a big part of the game plan. He had just one carry, but hauled in a team-high eight receptions for 65 yards. ",
            "6": "Ridley, as mentioned, was guilty of that crucial lost fumble. He was benched for a while in favor of LeGarrette Blount (10-49), but he retook the field in the second half and even scored a touchdown. He finished with 49 yards on 13 carries. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "15"
}