{
    "year": "2013",
    "week": "06",
    "Game 1": {
        "Team 1": {
            "Name": "Bears",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Giants are now 0-6. Let that sink in for a second. The Giants are 0-6. What happened to this team? They won the Super Bowl two years ago and just barely missed the playoffs last season. New York inexplicably got depleted of talent so quickly, particularly in the back seven and the offensive line. Thanks to the latter unit allowing so much pressure, Eli Manning had thrown 12 interceptions heading into this contest. Manning didn't have much of a pass rush to deal with in this game, but it almost seemed like he was expecting to get hit early on. As a result, he fired his 13th pick of the year right away, though the Bears didn't score any points despite taking over in the red zone (Marc Trestman foolishly opted to go for it on fourth-and-2, and Brandon Marshall proceeded to drop the ball). Manning's 14th interception, which was returned for six, came on the very next drive. While the first of the game was his fault, the second was the result of a miscommunication between Manning and his receiver. The 15th pick, which occurred on New York's final offensive drive of the evening, was a slight overthrow. Manning is now on pace to heave 40 interceptions this year. The single-season record is held by George Blanda, who tossed the ball to the other team 42 times for the Houston Oilers in 1962. Aside from the three give-aways, Manning looked very sharp. That sounds silly considering the amount of turnovers, but as an example, Manning went 8-of-9 for 132 yards and a touchdown for the duration of the opening half following the second pick. Manning's final numbers were 14-of-26 for 239 yards, one score and the three interceptions. ",
            "2": "The silver lining in the Giants' loss is that the team was finally able to establish a solid ground attack. Brandon Jacobs was partying like it was 2007, as the big back registered 106 yards and two touchdowns on 22 attempts. Jacobs did this against a depleted defensive line that was missing Stephen Paea in addition to Henry Melton, but the big back broke lots of tackles and carried defenders around. ",
            "3": "Hakeem Nicks (4-70) and Victor Cruz (4-68) tied for the team lead in receptions, but they both were guilty of crucial drops. Rueben Randle (3-75) had the lone aerial touchdown, but got away with what would've almost certainly been the biggest bone-headed move of the week. Randle went down untouched in the red zone. He slammed the ball down on the ground in frustration, which was really should've been ruled a fumble because Chicago alertly pounced on it. Trestman tried to challenge, but official John Parry incorrectly ruled that Randle gave himself up, which was very shady on his part. Randle absolutely did not give himself up. ",
            "4": "As for the Bears, Jay Cutler had a terrific performance. He went 24-of-36 for 262 yards and two touchdowns. His receivers were constantly open, while he didn't have to deal with any pressure. Cutler didn't take a single sack; he was able to sit back in the pocket and dissect New York's secondary with ease on most plays. Cutler also scrambled thrice for 20 more yards. This is noteworthy because Giants' safety Will Hill, who was responsible for one of Marshall's scores, was penalized for tapping Cutler's helmet as the quarterback was sliding. Hill literally tapped his helmet - Mike Mayock quipped that it would barely be a legal stop in two-hand touch - yet Parry threw a flag for a personal foul. As I wrote on the forum, Football is no longer football if that's a penalty. ",
            "5": "Both of Cutler's scores went to Brandon Marshall (9-87), who wore green shoes to promote mental-health awareness. This is against the league dress code, so Marshall will be fined for this. Marshall, in turn, said that he'll match the league fine with a donation. This is a cool move by Marshall, and it would be in Roger Goodell's best interest to eschew penalizing Marshall - especially during a month in which all players are encouraged (forced?) to wear pink. It's a bit hypocritical on Goodell's part if he allows the fine to stand. ",
            "6": "Cutler's other targets didn't post big numbers. Matt Forte was just OK from a standard fantasy perspective, accumulating 67 rushing yards on 19 carries and 44 receiving yards off six receptions. Martellus Bennett, who was a game-time decision, caught six balls for 68 yards. Alshon Jeffery - or Alshon Jefferies, as Michael Irvin likes to call him - had just one reception for 27 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Packers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "My editor messaged me on G-chat Sunday afternoon and said, This is the most crazy, injury-riddled day ever. Many players got hurt on this Sunday, but no game in the early afternoon saw more significant contributors hobble off than this one. It started when James Jones limped off the field in the first quarter. Aaron Rodgers then proceeded to struggle. He targeted Jordy Nelson and Jarrett Boykin a bunch, but those passes fell incomplete because of drops and miscommunications. Rodgers' frustrating afternoon got even worse when Randall Cobb was carted off into the locker room. Suddenly, the only wideouts Rodgers had at his disposal were Nelson and Boykin. But that wasn't it in terms of injuries. Rush linebacker Nick Perry, who had a sack-fumble of Joe Flacco at the very end of the first half to set up a Mason Crosby field goal, had to leave the game. The Packers then had to roll with players named Nate Palmer and Andy Mulumba as its outside linebackers. The defense understandably wasn't the same after that, but the offense made the appropriate adjustments. Rodgers completed fewer than half of his passes prior to intermission and had a pick dropped by Daryl Smith, but was 7-of-11 for 199 yards, one touchdown and an interception (a great play by Jimmy Smith) after the break. Rodgers ultimately finished 17-of-32 for 315 yards, one score and the pick. The stop unit, meanwhile, had some great performances from rookie Micah Hyde and A.J. Hawk (three sacks). ",
            "2": "The Packers may have lost a game like this last year, but they were able to pull out a victory, thanks to Eddie Lacy. The rookie runner was a stud, bulldozing Baltimore's strong ground defense for 120 yards on 23 carries. The Ravens had no answer for him as Green Bay was running out the clock. Lacy even converted a first down and smartly slided down inbounds, which allowed Green Bay to take a couple of knees and walk off the field with its third win of the year. ",
            "3": "Nelson, as you may guess, had a solid statistical performance; he had four catches for 113 yards and a touchdown. Jermichael Finley (3-75) wasn't much of a factor, as a 52-yard reception of his came when Green Bay was running out the clock. ",
            "4": "Despite Joe Flacco's decent line - 20-of-34, 342 yards, two touchdowns - the crowd booed the offense for most of the afternoon. The Ravens had so many plays of zero or negative yardage. This included some red-zone ineptness in the second quarter. Ray Rice was stuffed three times inside the 2-yard line. The Ravens eschewed kicking a field goal, so the three points obviously would've had a big impact in such a low-scoring affair. It wasn't until garbage time that Baltimore was able to get something going. Most of Flacco's yardage was meaningless. To give you an idea, he was 8-of-19 for 113 yards and a lost fumble by halftime. ",
            "5": "Ray Rice couldn't get anything on the ground; he mustered only 34 yards on 14 carries even though the Packers ranked 20th against the run entering this contest in terms of YPC allowed to opposing running backs. This was just a spirited performance by a Green Bay defense that seemed to want to prove that it could still shine without Clay Matthews. ",
            "6": "Flacco's touchdowns went to Dallas Clark (4-81) and Jacoby Jones (2-42). Torrey Smith surprisingly was limited to just one catch for 12 yards, thanks to Sam Shields' great coverage. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Most people expected this game to be a blowout. The Bengals were favored by six points on the road, and the majority of the public was betting on them. They drove down the field and kicked a field goal right away, so game over, right? After all, the Bills were starting some unknown quarterback named Thaddeus Lewis. How could they possibly overcome a 3-0 deficit? Well, immediately after that, Lewis completed a deep bomb downfield to T.J. Graham for 47 yards. He then had a nice scramble with yardage tacked on for unnecessary roughness. Two plays later, he ran into the end zone, which sent the message that Buffalo would indeed be competitive in this ball game. Unfortunately for Buffalo, its defense had major issues stopping the Bengals, who generated 483 net yards of offense and 26 first downs (compared to 322 and 20 for the Bills). Cincinnati even had a 98-yard touchdown drive after the Bills failed to find the end zone on four tries from the 1-yard line. That sequence was inexcusable. Buffalo was so close to the goal line, yet didn't even try a quarterback sneak a single time. The Bills were eventually down by 14 - it could've been 17, but Cincinnati missed a chip-shot field goal - but Lewis led the charge to engineer two scoring drives, tying the game up. The defense ultimately failed him in overtime, but Lewis should still be proud of his performance. He went 19-of-32 for 216 yards and two touchdowns. His only mistake was a lost fumble that ruined a promising drive in the second half. Just as he did in his first professional start, Lewis proved that he can be a solid No. 2 quarterback in this league. Unfortunately, Lewis suffered a foot injury late the game and was spotted in a walking boot afterward. X-rays were negative, but he'll have an MRI on Monday. ",
            "2": "Lewis' performance is remarkable considering his No. 1 wideout, Stevie Johnson, was out. Robert Woods didn't do much either (2-9), as Lewis concentrated on getting the ball to T.J. Graham (4-74), Marquise Goodwin (2-51, TD) and Scott Chandler (2-47). ",
            "3": "C.J. Spiller and Fred Jackson split carries evenly, with each getting 10 totes. They accumulated 55 and 35 yards, respectively. Jackson also had four catches for 13 receiving yards. ",
            "4": "As for the Bengals, Andy Dalton's numbers were awesome, as he went 26-of-40 for 337 yards and three touchdowns. His one mistake was an interception in which he didn't see Jim Leonhard, but Dalton's stats were misleading as a whole because most of his completions were of the short variety. Dalton got a ton of help from his play-makers. A.J. Green, who caught six balls for 103 yards, had a great leaping touchdown in the first quarter. Giovani Bernard later scored on a 20-yard reception in next period. He made four defenders miss on a breathtaking scamper into the end zone. Bernard didn't run well (15-28), but he did catch six balls for 72 receiving yards and that touchdown. ",
            "5": "Some other things of note: BenJarvus Green-Ellis ripped off 86 yards on 18 carries. Marvin Jones (3-71) caught the third touchdown. Dane Sanzenbacher made a great, one-handed grab for 23 yards on fourth-and-15. That was his only reception. Buffalo rookie linebacker Kiko Alonso registered a ridiculous 22 tackles. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Lions",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "It looked like it was going to be another one of those disappointing Detroit road losses. The Lions were doing dumb things in the first half, like dropping passes and committing stupid penalties (such as an Ndamukong Suh offside to give Cleveland a first-and-goal at the 2-yard line). Detroit trailed 17-7 at the break, and everything seemed to be going Cleveland's way. And then Brandon Weeden happened. The Lions seemed to get their act together offensively following the break. They led 24-17 in the fourth quarter, but the Browns had a good drive going. On a first-and-10 inside Detroit territory, Weeden felt some pressure. He moved around in the pocket and flinged a weird, backhanded throw to the sideline. I suppose he was trying to throw the ball away, but the Lions came away with an easy interception. Detroit converted the turnover into a touchdown, clinching the victory. ",
            "2": "Weeden went 26-of-43 for 292 yards, two touchdowns and a pair of interceptions. He could've passed for a third score, but he overthrew his target. Weeden's scores went to Chris Ogbonnaya (7-61) and Greg Mr. Dependable Little (2-12). ",
            "3": "Though they didn't find the end zone, Josh Gordon (7-126) and Jordan Cameron (5-64) led the team in receiving yardage. Gordon nearly made a great grab along the sideline in the fourth quarter, but senile official Walt Coleman incorrectly ruled that he was out of bounds, even after watching the replay. ",
            "4": "Speaking of Coleman, he flagged the Browns for a horrible roughing-the-passer call late, as well as a pair of bogus pass interferences in the second quarter. Joe Haden was flagged twice even though he barely touched the receiver on the first instance. The second pass was obviously uncatchable, but Coleman doesn't seem to know the rules anymore because he's stuck in a different decade. These flags helped the Lions score their only touchdown of the first half. The score carried them until they snapped out of their funk after intermission. Matthew Stafford finished 25-of-43 for 248 yards, four touchdowns and an interception, thanks to a brilliant second half (15-of-19, 165 yards, 3 TDs, INT). The pick was tipped. As mentioned, a number of Stafford's passes were dropped, so he could've had an even better afternoon. ",
            "5": "Laboring through a knee injury and enduring Haden's elite coverage, Calvin Johnson was limited to just three catches for 25 yards. He nearly hauled in a touchdown in the first half, but dropped the ball. Someone named Kris Durham led the team in receiving (8-83). ",
            "6": "Three of Stafford's scores went to undrafted rookie tight end Joseph Fauria (3-34), who had a different touchdown dance every time he found the end zone. The other was hauled in by Reggie Bush, who had a big game with 78 rushing yards on 17 carries and 57 receiving yards off five catches. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Rams",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "I've defended Matt Schaub. He's played poorly recently, but he has gone up against a barrage of stout defenses. Besides, what else could Houston possibly do? Neither T.J. Yates nor Case Keenum could give Houston a realistic shot of advancing deep into the playoffs. Schaub doesn't exactly have the greatest postseason history himself, but he's the best quarterback on the roster. Well, watching the first half, I changed my mind. Schaub didn't even play poorly or anything - he was 11-of-14 for 153 yards prior to intermission - but he had such horrible body language that it looked like he was negatively impacting his teammates. As the Texans continued to kill themselves with mistakes, all Schaub did was pull on defenders' legs (he literally did this when he was on the ground), shake his head and appear as if he wanted to cry. I was going to argue that Yates should replace Schaub - and that's exactly what happened, but not because of a coach's decision. Schaub injured his leg in the third quarter and had to leave the game. The crowd cheered while he was on the ground, which infuriated the players afterward. Yates then ran onto the field to a standing ovation - but that was very short-lived because Yates fired an interception in the red zone, which was taken back for a touchdown. It was the fifth time in as many games that Houston had been guilty of a pick-six. Yates then proceeded to heave a second interception. While Schaub went 15-of-21 for 186 yards, Yates was 12-of-17 for 91 yards and the two picks. So, umm... Case Keenum? ",
            "2": "I mentioned earlier that the Texans repeatedly shot themselves in the foot. It was terrible. Despite outgaining St. Louis by intermission, 248-115, the Texans were losing because of a lost fumble in the red zone by DeAndre Hopkins, poor red-zone execution and numerous penalties. Houston was whistled for seven infractions in the first half. One was a bogus pass interference on Kareem Jackson, but the others were the result of sloppiness (false starts and such). ",
            "3": "Despite Houston's dreadful afternoon, Arian Foster continued to play well. He rushed for 141 yards on 20 carries and also caught four balls for 57 yards. Andre Johnson, meanwhile, snagged seven catches for 88 yards. ",
            "4": "As for the Rams, only four of Sam Bradford's attempts hit the ground. With the Texans self-destructing, Bradford was able to go 12-of-16 for 117 yards and three touchdowns. He missed out on a fourth score when a deep ball bounced off Chris Givens' hands deep downfield. ",
            "5": "The Rams' offensive turn-around can be attributed to having a successful running game. Zac Stacy ran well for the second week in a row, gaining 79 yards on 18 carries. Daryl Richardson (3-5) was barely a factor. ",
            "6": "No St. Louis player had more than two catches. Jared Cook (2-45), Givens (2-20) and Stacy (2-11) led the way in that department. Speaking of Cook, his poor fantasy owners had to watch as the other Ram tight ends caught touchdowns. He has been a terrible fantasy bust, but no one should be surprised because he was so inconsistent in Tennessee. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "The theme of this game was poor pass protection. Neither the Raiders nor the Chiefs protected their quarterback well in this contest. Oakland rookie linebacker Sio Moore opened things up with a sack by beating Eric Fisher, who should not be starting because of performance issues. Alex Smith was brought down three times in the first quarter alone. However, the Chiefs cleaned things up after that. The Raiders, however, never fixed their blocking woes. Terrelle Pryor took a whopping 10 sacks (including 3.5 from Tamba Hali), which is remarkable considering how mobile he is. I can only imagine how high that number would be if Pryor couldn't move around so well. Having said that, Pryor himself was a big reason Oakland allowed so many sacks. The Raiders had a terrible habit of breaking the huddle super late. Pryor would then go under center and snap the ball right away, not even looking at the defense despite the fact that Kansas City was giving him complicated looks the entire afternoon. This is the same type of lethargic quarterbacking that Cam Newton is often guilty of. For Pryor to progress, he'll need to develop the mental aspect of his game, or dominant defenses will continue to crush him. Pryor finished 18-of-34 for 216 yards, one touchdown and three interceptions along with six scrambles for 60 rushing yards. He was absolutely atrocious after halftime. Kansas City made the appropriate adjustments and limited the first-year starter to 11-of-23 for 116 yards and three picks (with 13 rushing yards off two carries) following the break. ",
            "2": "Darren McFadden was a surprise start because he was expected to rest until after the team's bye. He did what he could versus Kansas City, mustering 52 yards on 16 carries. He also caught three balls for 31 receiving yards. ",
            "3": "Pryor's lone score was thrown to Denarius Moore (5-82). This is the silver lining in the Raiders' loss, as the connection between Pryor and Moore continues to strengthen. ",
            "4": "On the other side, Alex Smith failed to complete half of his passes, going 14-of-31 for 128 yards. Most of his incompletions came in the first half (7-of-19) and were the result of pressure. Smith then had a chance to be more comfortable, so he settled for more checkdowns, which is what he usually does anyway. As a consequence, Jamaal Charles was the only Chief with more than three receptions, as he caught five balls for 50 yards to go along with his 78 rushing yards and two touchdowns on 22 carries. Charles' big reception was a 24-yarder in the first quarter in which he converted a third-and-10. ",
            "5": "Kansas City's other receivers of note were Dwayne Bowe (3-46), who had another pedestrian outing, and Donnie Avery (2-6), who lost a fumble in the red zone during the second half. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Eleven months ago, the Panthers had to battle the Chiefs just days after linebacker Jovan Belcher committed suicide. No one knew how Kansas City would respond, but the Chiefs put forth a very spirited performance to help the team win one of its two games of the season, defeating the favored Carolina squad. The Panthers were stuck in a similar situation. Many expected the Vikings to go all out like the Chiefs did last year. In case you've been living under a rock - and avoiding the Sand in the Vag mafia on Twitter - one of Peterson's children, his 2-year-old son, died of physical abuse Friday afternoon. It was unclear if Peterson would suit up, but he told the media that he would play because football is a stress release for him. It was natural to think Peterson would have the performance of his lifetime - much like Brett Favre on that Monday night - and that his teammates would rally around him. Instead, the opposite occurred. The Vikings had a completely lifeless showing. The defense showed no interest in tackling or getting to the quarterback, while the offense didn't seem to want to block for Matt Cassel. As for Peterson, he broke off a 31-yard burst in the second half, but otherwise didn't do anything. He was limited to just 62 yards on 10 carries. He simply didn't have a chance because the Panthers were leading by double digits for most of this contest. Peterson did help his PPR owners out a bit with three catches for 21 receiving yards. ",
            "2": "Matt Cassel was awful in this contest. The completion percentage and yardage look nice (32-of-44, 241 yards, TD), but most of his completions were checkdowns, and he looked completely fazed when having to deal with pressure. He also heaved two ugly interceptions. This is the Cassel we've come to know and love; not the impostor who played well in London. On the bright side, Josh Freeman will be ready in a couple of weeks. Oh wait, Freeman sucks, I forgot. ",
            "3": "Cassel's lone score went to Kyle Rudolph, who had a monstrous outing with nine catches for 97 yards. Greg Jennings, meanwhile, disappointed once again (6-34). ",
            "4": "With the Vikings sputtering in every facet, the Panthers had a very clean game. That adjective can be used to describe Cam Newton's pocket, as Newton barely saw any pressure throughout the afternoon. The Vikings finally got to him in the second quarter, but it came with a face mask that gave Carolina a free first down. Thanks to the lack of pressure, Newton was able to convert third-and-longs with ease during the afternoon (7-of-12). He was able to finish a near-perfect 20-of-26 for 242 yards and three touchdowns. He also used his legs for a change, scrambling nine times for 30 rushing yards and a fourth score. ",
            "5": "Newton's three aerial touchdowns all went to different players: Brandon LaFell (4-107), Steve Smith (5-21) and Mike Tolbert (2-20). ",
            "6": "DeAngelo Williams had a big game. In addition to gaining 64 yards on 17 carries, he also snagged five catches for 53 receiving yards. Williams broke a bunch of tackles because, again, Minnesota showed zero interest in bringing down anyone in a black-and-blue jersey. The lack of effort was downright embarrassing. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "6"
        },
        "comments": {
            "amount": "4",
            "1": "The Steelers were focused on winning their first game of the season, but it didn't appear as though luck was on their side when new left tackle Levi Brown, acquired during the bye from Arizona, injured his triceps during warmups. The other tackle, Mike Adams, was inactive, so the Steelers were presumed to be in a world of trouble. That seemed to be the case when the Steelers had two three-and-outs and then Roethlisberger was sacked twice on the third drive. However, Big Ben caught fire after that. He completed a 31-yard pass to Heath Miller and then nearly lofted a touchdown to Antonio Brown, who dropped the ball. Roethlisberger was unfazed by this, finishing 23-of-30 for 264 yards and a score. He took just two more sacks the rest of the way. Meanwhile, Roethlisberger's counterpart came into this contest with some momentum, but there were reports Sunday morning that the Jets had some concerns that he wasn't handling the accolades very well. Sure enough, Smith struggled and New York as a whole was completely out of sorts. Smith went 19-of-34 for 201 yards and two interceptions. He wasn't bad early on, but struggled immensely following the break (11-of-22, 140 yards, 2 INTs). He completed just one pass longer than 20 yards. One of his picks was brutal, as it was heaved carelessly into triple coverage. All of this shouldn't have been a surprise, by the way, as the Jets' concerns about Smith's arrogance were highly warranted. Also, it must be noted that only two rookie quarterbacks have beaten Dick LeBeau. The legendary defensive coordinator doesn't have the same type of talent he used to, but he can still confuse the hell out of raw signal-callers. ",
            "2": "Both teams struggled to run the ball. Le'Veon Bell had the opportunities (16 carries) but simply couldn't find any holes behind a poor offensive line and against a stout Jet front, as he was able to muster only 34 yards, though he did chip in with three catches for 22 receiving yards. Bilal Powell, meanwhile, turned nine attempts into 30 yards. He also had three snags for 20 yards. New York trailed for most of the way, so the coaching staff had to ask Smith to air the ball out 34 times. ",
            "3": "The only touchdown in this contest came on a 55-yard Roethlisberger pass to Emmanuel Sanders (3-70). Meanwhile, just two Steelers had more than three receptions. Antonio Brown (9-86) had the most yardage, but as mentioned, he screwed himself out of a touchdown reception. Miller (6-84) looked good, and Big Ben has to be thrilled that his favorite security blanket is back. ",
            "4": "Jeff Cumberland led the Jets in receiving yardage with 59 off four catches. The only other notable was Stephen Hill (3-46). <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> It was weird not hating that the Eagles won a game. All of you know how much I despise QBDK, but it's more fun to hate on the team he plays for rather than not see him doing stupid stuff on the field. Philly, by the way, would be crazy not to stick with Foles as the starter. ",
            "2": "Like a MRSA infection, the Eagles offense gradually ate up the Bucs defense to lead to Philadelphia's third win of the season. Nick Foles was the star for the Eagles as he burned the Buccaneers' secondary with Riley Cooper and DeSean Jackson. The Glazers, the Bucs owners, and general manager Mark Dominik had to be thinking of what could have been with Chip Kelly. A Bucs source told me that Chip Kelly was Tampa Bay's head coach for six hours or so before changing his mind. Instead of landing Kelly, the organization hired Greg Schiano. The Bucs are now 7-14 under Schiano and 24-45 under Dominik with an 0-5 start to 2013. With the NFC East wide open, the Eagles showed they are just as dangerous, if not more so, with Nick Foles at quarterback. The first drive of the game was a clinic as Philadelphia moved the ball at will. It started with a 44-yard screen pass to LeSean McCoy. Foles hit big completions to Cooper and Jackson before keeping it himself for a 5-yard score. On the next possession, McCoy had a good run going before he fumbled the ball while in air. Darrelle Revis recovered the it. That spotted Tampa Bay a field goal. Eric Page had a 42-yard punt return and set up a 24-yard touchdown pass from Mike Glennon to Vincent Jackson. After the Bucs took a 10-7 lead, Foles threw a 12-yard strike to DeSean Jackson after he beat Revis and Mark Barron crossing the back of the end zone. Just before halftime with Tampa Bay down by four, Doug Martin (16-67 rushing, 4-24 receiving) had a big run up the middle to the 1-yard line and Glennon hit a fade to Vincent Jackson (9-114) for his second touchdown. The Bucs' opening drive of the second quarter ended when Glennon had an inaccurate pass picked off by Bradley Fletcher. A few plays later, Foles rainbowed in a bomb to the end zone for a 47-yard touchdown pass to Cooper (4-120), who beat Johnthan Banks running down the sideline. After the Tampa Bay managed a field goal, Foles hit Cooper on a quick throw. Cooper then broke a tackle from Banks to race down the field for 44 yards. The next play saw Foles loft in a 36-yard touchdown pass after DeSean Jackson (6-64) beat Dashon Goldson and Mark Barron in zone coverage. The running of McCoy (25-116 rushing, 2-55 receiving) set up a field goal to ice the win for the Eagles. ",
            "3": "Foles completed 22-of-31 passes for 296 yards with three touchdowns and a running score. He was superb, so Philadelphia has no reason to rush the other signal-caller back to the field. ",
            "4": "Glennon didn't play poorly for Tampa Bay and was improved in his second start. He completed 26-of-43 passes for 273 yards with two touchdowns and an interception. The breakout star for the Buccaneers was tight end Tim Wright, who hauled in 91 yards on seven receptions. Once again, the Bucs hurt themselves with penalties. They had four holdings and a critical offsides. ",
            "5": "Defensively, Lavonte David was awesome for Tampa Bay with nine tackles and a sack. Mason Foster and Gerald McCoy also played well for the Bucs. ",
            "6": "The Eagles' defense got a great game from DeMeco Ryans (12 tackles). Fletcher Cox was very disruptive as he drew a hold and almost caused an interception on a hit of Glennon. Bennie Logan and Connor Barwin recorded sacks in the fourth quarter. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I feel like Peyton Manning shaved points because he was the only one in his family pool to take Jacksonville +26.5. How else do you explain the Jaguars losing to the Rams and Broncos by about the same margin? ",
            "2": "The Jaguars dropped to 0-6, but at least they played the Broncos tough and didn't get embarrassed. Denver didn't have its best game; the team played like it was looking past Jacksonville to the Colts next week. Still, the talent gap between these two teams is so great that Denver (6-0) won while sleepwalking at times. Knowshon Moreno (15-42 rushing, 7-62 receiving) ran for three touchdowns to lead the Broncos' offense. The Jaguars attemped a fake punt early in the game, but it was stuffed for no gain. That gave Denver great field position, and some nice gains by Moreno set up a short touchdown pass from Peyton Manning to Julius Thomas (4-22). Jacksonville had a lot of opportunities for big plays go wasted. In the first quarter, the Jaguars dropped two potential interceptions. An incredibly dumb un-sportsmanlike conduct penalty on Andre Branch gave the Broncos a first down after they just been stopped on third down. Manning took advantage with a pass down the seam to Wes Welker (6-63) for a 20-yard touchdown. After the Jaguars got a field goal set up by Justin Blackmon, Manning fumbled a snap. Jacksonville recovered that for its second field goal. A bobbled field goal snap cost the Jaguars more points, but a few plays later Paul Posluszny made a fantastic leaping catch before racing down the field for a 59-yard pick-six. The two-point conversion try was picked off by Champ Bailey, but the Broncos had only a 14-12 halftime lead. Denver came out in the third quarter with a nice drive that almost ended in a turnover from a Ronnie Hillman fumble, but Eric Decker (5-50) recovered the ball. The Broncos finished the drive by having Moreno plunge into the end zone. The Jaguars answered with a possession led by completions to Blackmon. Maurice Jones-Drew (21-71) ripped off a 28-yard run and ended it with a short touchdown run. Manning came back to hit Demaryius Thomas (3-78) along the sideline, and he had a great run after the catch for a 42-yard gain. That set up Moreno for an eight-yard touchdown run. A 34-yard fake punt by the Broncos had them deep in Jacksonville territory, but another fumbled snap by Manning was recovered by the Jaguars. Chad Henne had his arm hit as he threw and the fluttering ball was picked off by Kayvon Webster. Moreno then scored his third touchdown to sealed the game for Denver. ",
            "3": "Manning completed 28-of-42 passes for 295 yards with two touchdowns and an interception. Jacksonville's defense did a nice job of pressuring him with a four-man rush and playing a deep zone to make Denver dink and dunk the ball down the field. ",
            "4": "Despite a dropped touchdown in the fourth quarter, Justin Blackon was awesome for the Jaguars. The Broncos had no answer for him as he caught 14 passes for 190 yards. Denver has to be worried about its ability to defend elite receivers considering what Blackmon and Dez Bryant have done to the defense. Blackmon is validating his high-pick status. He could be a star if he stays out of trouble and gets a good quarterback to work with in the years to come. ",
            "5": "Henne was 27-of-42 for 303 yards with two interceptions. ",
            "6": "Denver's defense was led by its front seven as the secondary didn't play well. In garbage time, Henne was hit by Shaun Philips as he threw and Danny Trevathan caught the ball for a pick. Malik Jackson had a great game with seven tackles and two sacks to negate a Jaguars possession. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "In a week comprised of weird games, this was the strangest of all of them. There were so many odd bounces and plays throughout the afternoon. Pete Carroll, looking perplexed in his post-game press conference, said that the ball looked greased today. Here were some of the highlights: - Ryan Fitzpatrick, who had an interception to Earl Thomas early on with an overthrow, nearly heaved a second one to Walter Thurmond. Thurmond dropped the ball, probably because he saw an open field and a potential defensive touchdown in front of him. - Tennessee punter Brett Kern bobbled a punt, allowing Seattle to take over in Titans' territory. - Seattle kicker Steven Hauschka suffered an injury, forcing the punter/holder to kick. There was a new holder as a consequence, who happened to bobble the ball on a field-goal try. The Titans picked up the ball and ran it into the end zone for their only touchdown of the afternoon. - Sidney Rice (2-35) inexplicably reached the ball out with both hands after a reception even though he was nowhere near the first-down marker. Tennessee picked up the fumble recovery. - Marshawn Lynch, who had a big game with 77 rushing yards and two touchdowns on 21 carries and four catches for a team-leading 78 receiving yards, fumbled at the goal line. Linebacker Zach Brown picked the ball up, but he fumbled it as well. Russell Wilson was able to pounce on it. ",
            "2": "Wilson had another solid outing. He let only eight balls hit the ground, as he finished 23-of-31 for 257 yards. He didn't throw a touchdown or an interception, though he did scramble 10 times for 61 rushing yards. His leading receiver, not including Lynch, was Doug Baldwin (4-48). ",
            "3": "As for Fitzpatrik, he had another underwhelming performance against a stellar defense. He went 17-of-29 for 171 yards and two interceptions - the second underthrown toward Richard Sherman. Fitzpatrick also had that aforementioned dropped pick-six and also took a horrible sack that took his team out of field-goal range in the second quarter. ",
            "4": "Fitzpatrick actually tied the team in rushing yards (6-33). Chris Johnson's 33 yards came on 12 attempts. The good news, for CJ1K owners, is that Johnson caught three balls for 21 receiving yards, as the Titans finally realized that they have to get the ball to their best player in the passing game. ",
            "5": "Kendall Wright led the Tennessee wideouts with five catches for 69 yards. No one else had more than 30 yards, including Nate Washington (1-15). "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "27"
        },
        "comments": {
            "amount": "5",
            "1": "If Tom Brady leads an amazing comeback and no one sees it, did the Patriots really win? When Brady recklessly heaved an interception downfield, trailing by four with about two minutes remaining, the fans filed out of the stadium. The Saints took over on their own 30, but weren't able to generate a first down. The Patriots, who used all of their timeouts, were then able to take over on their own 30. I didn't give them a chance; Danny Amendola was out, and Brady seemed cooked. But Brady proved everyone wrong in vintage fashion, hitting his receivers with strikes of 23, 15, 6, 9 and 17 yards, with the latter being a touchdown to Kenbrell Thompkins. Brady had his ups and downs in this performance. In terms of positives, Brady led that game-winning drive and also engineered many other scoring possessions. He was mostly responsible for picking up 26 first downs. Despite suffering through several drops, many of which were from Aaron Dobson (6-63), Brady went 25-of-43 for 269 yards, one touchdown and an interception. The negatives include that pick, which was an extremely careless throw into double coverage, as well as a poor overthrow of Danny Amendola for what should've been an 83-yard touchdown. Amendola beat safety Kenny Vaccaro, but Brady didn't put enough air under the ball. It is worth noting that Brady probable could've enjoyed a much better day if two things had happened: First, if Stevan Ridley (20-96) hadn't run into the end zone twice, and second, if the offensive line held up better. Brady was sacked five times, thanks in part to guard Dan Connolly going down with an injury. Something else that needs to be noted was some questionable play-calling on the Patriots' part. New England had the ball at the New Orleans 9-yard line in the fourth quarter, but ran it three straight times and had to settle for a field goal as a consequence. ",
            "2": "Meanwhile, the New England defense did a hell of a job on the Saints' scoring attack. I didn't think anything could be done to stop Jimmy Graham, but Bill Belichick, who specializes in shutting down one aspect of the opposing offense, has Aqib Talib blanket the All-Pro tight end. Graham, who was limited to no catches - he had one drop, which was really a great play by Kyle Arrington - was helped into the locker room with a leg injury in the second half. Drew Brees looked a bit flustered without being able to go to Graham very much. After all, when do you see his team have three three-and-outs in a single half? When does Griffin miss a wide-open receiver (Nick Toon) for a touchdown? Would anyone have ever imagined Brees completing fewer than half of his passes? All of that happened, as Brees went 17-of-36 for 236 yards, two scores and an interception that was a weird lob after he tried calling timeout but was not granted the stoppage. Brees had some great throws - including a 34-yard touchdown strike to Kenny Stills (3-64) on a third-and-20. ",
            "3": "Brees' other aerial score was vultured by Travaris Cadet. Marques Colston surprisingly was limited to just one reception for 11 yards. ",
            "4": "The Saints ran the ball well, which wasn't a surprise because Vince Wilfork's absence continues to be huge. Pierre Thomas gained 51 yards on 11 carries, but the big star was Khiry Robinson, who tallied 53 yards and a touchdown on seven tries. ",
            "5": "Moving back to New England, the team suffered a quartet of injuries. In addition to Connolly, Aqib Talib, Jerod Mayo and Danny Amendola all had to leave the game. Amendola's malady was a concussion, as safety Rafael Bush hit him fiercely, prompting his helmet to hit the turf. Amendola actually didn't do anything anyway; he caught two passes, but didn't gain a single yard. Julian Edelman (5-57) was much better, as was Thompkins (3-45), who caught the game-winning score. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "49ers",
            "Points": "32"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Cardinals can't blame anyone but themselves for this loss. They were very competitive with the 49ers - despite losing by 12, they legitimately outgained San Francisco, 403-387 - but ruined their chances of winning (and more importantly, covering), thanks to numerous turnovers. Five give-aways crushed the Cardinals. Carson Palmer sailed an interception to Eric Reid because he didn't see him. The 49ers took over inside Arizona's 10-yard line, but a defensive stand limited them to a field goal. Palmer then heaved another pick out of the back of his own end zone. Palmer, who took a safety later, looked like he simply quit at that point and didn't want any part of the San Francisco defense behind his patchwork offensive line. Two fumbles followed after that. The first came inside the red zone by Larry Fitzgerald. The second, by Alfonso Smith, set up the 49ers with another field goal. Of all of those turnovers, it's hard to blame Fitzgerald for his even though it did take away at least three points. Fitzgerald, who wasn't even projected to play, led the team with six receptions for 117 yards and a touchdown that went for 75 yards, thanks to a missed tackle by Donte Whitner. Michael Floyd (5-44) also scored. ",
            "2": "Palmer, by the way, went 25-of-51 for 298 yards, two scores and the two interceptions. The numbers are a bit misleading because Fitzgerald's 75-yard score was all about the All-Pro wideout. Palmer was sacked just once, but that was also not indicative of what happened. ",
            "3": "Excluding Fitzgerald, the bright star for the Cardinals was sixth-round rookie running back Andre Ellington, who continues to be a greater part of the offense. Ellington ripped off 56 rushing yards and a touchdown on just seven carries and also caught five balls for 36 receiving yards. Ellington needs more touches, but Bruce Arians has said he's concerned about Ellington's size in terms of giving him a greater workload. Rashard Mendenhall, meanwhile, gained 40 yards on 10 attempts. ",
            "4": "Some of the Cardinals played well, but no one had a bigger game than Vernon Davis, who caught eight balls for 180 yards and two touchdowns. He had an eye-popping line of 7-171-2 in the first half, but Arizona made the proper adjustments at the break. ",
            "5": "Davis had more than half of Colin Kaepernick's yardage, as the third-year quarterback went 16-of-29 for 252 yards, two touchdowns and an awful red-zone interception. Kaepernick also scrambled four times for 18 rushing yards. ",
            "6": "Outside of Davis, no one had more than 28 receiving yards for the 49ers. Anquan Boldin (3-28) couldn't get away from Patrick Peterson. ",
            "7": "Frank Gore rushed for 101 yards on 25 carries, but his fantasy owners cringed as Kendall Hunter (3-11) vultured a touchdown away. ",
            "8": "Two Arizona defenders of note: Tyrann Mathieu made an impressive play to chase down Kaepernick on a third-down scramble to keep him from advancing the chains. That was a great stop, but Mathieu was later whistled for an unsportsmanlike penalty for hitting a 49er after Hunter scored a touchdown. Meanwhile, stud defensive lineman Calais Campbell was carted off with a neck injury. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "The Cowboys are a team full of stars, but it was the unknown players who stepped up in this victory. The player who provided the greatest spark was Dwayne Harris, who took a punt in for a touchdown and later had a kickoff return to set up Dallas with a short field and a subsequent end-zone trip. This was absolutely crucial, as Dallas' offense was reeling in the wake of DeMarco Murray's injury. Murray left early with a knee sprain, and the Cowboys struggled to move the chains for a while. Murray wasn't the only Cowboy who went down. Both DeMarcus Ware and Jason Hatcher suffered injuries. Losing Hatcher appeared to be huge because he was so dominant up front with two sacks, but the other defensive linemen stepped up and put tons of pressure on Robert Griffin. This allowed Sean Lee and Brandon Carr to have huge outings in the back seven. Lee had 10 tackles, wile Carr did a terrific job of covering Pierre Garcon (6-69). ",
            "2": "As mentioned, the Dallas offense struggled at times, but did enough to clinch this important victory. Tony Romo went 18-of-30 for 170 yards, one touchdown and an interception that was tipped into the air. Romo's lone score, which went to Terrance Williams (2-27) was odd in that Romo looked like he was throwing the ball away under pressure. He heaved the ball toward the back of the end zone, but Williams somehow came up with the grab. Romo appeared to have a second touchdown, but DeAngelo Hall batted the ball away from Miles Austin-Jones, who had a step on him. Austin-Jones didn't log a single reception. ",
            "3": "Dez Bryant led the Cowboys in receptions with five for just 36 yards. Jason Witten (3-27) was an even greater disappointment for his fantasy owners. ",
            "4": "As mentioned, Murray suffered a knee sprain, which is a shame for him because he looked like he had something going on the ground. Murray gained 29 yards and a touchdown on just seven carries. Joseph Randle stepped in and also scored, but mustered only 17 yards on 11 attempts. ",
            "5": "The Redskins couldn't run the ball effectively either. Alfred Morris had a line of 16-81-1, but that's misleading because his 45-yard score came on a free play in which the Cowboys were offside and looked like they stopped for a second. Robert Griffin had to do the most damage on the ground. He opened things up with a sprint of 15 yards. He had no limp, which got Cris Collinsworth very excited. Griffin ended up scrambling nine times for 77 rushing yards with help of the read option. The Redskins are now 1-4, but the silver lining is that Griffin moved around very well. As for the passing aspect of his performance, Griffin went 19-of-39 for 246 yards and an interception. He also had a second pick that was dropped, but Griffin wasn't as bad as the numbers indicate. His receivers didn't offer him any help by dropping numerous passes. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "9"
        },
        "comments": {
            "amount": "9",
            "1": "Was this <i>Freaky Friday</i> or Monday Night Football? The Colts possess a grind-it-out offense that can run the ball and hit some big plays downfield. The Chargers, meanwhile, are often guilty of making dumb mistakes that cost them victories late in games. However, these teams swapped identities in a double-digit victory for San Diego, who have improved to 3-3. The Chargers put together eternal drives in this contest and dominated the time-of-possession battle. They had scoring drives of 12, 17, 11 and 15 plays that lasted 6:14, 7:58, 5:55 and 9:13, respectively. As a result, they controlled the clock for 17 more minutes than Indianapolis. The only reason the Colts were even in the game was because San Diego didn't convert any of its three red-zone trips into touchdowns. Indianapolis had its shot, but drops haunted the team. Darrius Heyward-Bey kicked things off by failing to reel in what would've been a touchdown of 60 yards. T.Y. Hilton and Reggie Wayne then let the ball slip through their hands on third down. Coby Fleener also had a drop on what would've been a big gain at the very end of the first half. Throw in another Fleener drop and a Trent Richardson bobble, and five of Andrew Luck's incompletions can be attributed to his targets. ",
            "2": "Luck went 18-of-30 for 202 yards and an interception that came on a tip in desperation time. He didn't play poorly at all; had he gotten help from his teammates, he would've posted some stellar numbers. ",
            "3": "Wayne had the one error, but he bailed out Luck by hauling in an errant pass. On his way to catching five balls for 88 yards - leading the team in both categories - he managed to snag his 1,000th-career reception, becoming the ninth player in NFL history to do so. ",
            "4": "Luck's other targets disappointed their fantasy owners: Hilton (5-43) got banged up in the second quarter, but remained in the game. Fleener (3-16) and Heyward-Bey (1-11) both sucked. ",
            "5": "Speaking of struggling, Trent Richardson managed just 40 yards on 10 carries. He did come alive after halftime with some tough runs, generating 29 yards on six attempts, but was guilty of that aforementioned drop. ",
            "6": "As for Philip Rivers, he went 22-of-33 for 237 yards and a touchdown. He has been rejuvenated this year for a number of reasons, one of which is improved pass protection. Rivers wasn't even sacked until the 10:23 mark of the fourth quarter. Rivers' main target was third-round rookie Keenan Allen, who had a monstrous performance with nine catches for 107 yards and a touchdown. Allen is a stud and will only continue to improve going forward. Meanwhile, Antonio Gates (4-28) hurt his team with two drops. He also failed to run past the marker on a crucial third down as time was running out. This forced San Diego into a long field goal, which Nick Novak drilled to seal the victory. ",
            "7": "Ryan Mathews posted solid numbers thanks to some big holes that his offensive line created. He gained 102 yards on 22 carries, but made a mistake late when he ran out of bounds. Rookie Eddie Lacy knew not to do this the day before, so I have to wonder why Mathews doesn't have this sort of awareness as a veteran. ",
            "8": "Danny Woodhead once again functioned as Darren Sproles Lite, rushing for 36 yards on nine carries as well as catching five passes for 47 receiving yards. ",
            "9": "One injury of note: Indianapolis inside linebacker Jerrell Freeman suffered a concussion. He was missed, as the Colts' defense succumbed to Circadian rhythms and was fatigued for most of the night. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}