{
    "year": "2013",
    "week": "13",
    "Game 1": {
        "Team 1": {
            "Name": "Lions",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Lions have a knack for shooting themselves in the foot and ruining potential victories. They blew two games versus Pittsburgh and Tampa Bay heading into this important matchup. They figured to be more focused against a divisional opponent, but the same blunders persisted. Consider all of these early mistakes that made it seem like they would lose their 10th-consecutive Thanksgiving game: - Detroit's first red-zone trip came at the end of a great opening drive. However, Reggie Bush fumbled there, thanks to a Clay Matthews strip. Bush vowed not to fumble again after coughing up the ball at Pittsburgh. So much for that. - The second try in the red zone also failed, though the Lions at least got a field goal out of it. Brandon Pettigrew committed a false start on second down and then proceeded to drop a touchdown. Pettigrew, who shouldn't have been playing in the first place, finished with one catch for six yards. - Sam Martin booted the ball out of bounds on a kickoff, setting up a Mason Crosby 54-yard field goal after James Jones made a brilliant 16-yard reception. - Matthew Stafford was strip-sixed when Nick Perry beat Riley Reiff. - Stafford was picked off by Tramon Williams in Green Bay territory. As Stafford and company walked off the field, the crowd booed furiously. At that point in the game, the Packers were up 10-3 despite not doing anything on offense. Had they maintained any sort of competent scoring attack, they probably would've beaten the mistake-prone Lions. But Matt Flynn was the quarterback, so Green Bay ultimately had no chance. This game was so lopsided that by the time Detroit made this a 40-10 affair, it had outgained the Packers, 563-56. That's just mind-boggling. As a reference, no team since 1989 (as far back as my data goes) has outgained its opponent by 507 yards or more. Green Bay secured some garbage yardage to keep itself from setting a dubious historical mark. ",
            "2": "After some early mistakes, Stafford was pretty sharp. He went 22-of-35 for 330 yards, three touchdowns, two picks and the lost fumble. His completion percentage should have been even better; he endured a handful of drops from his receivers, two of which were Calvin Johnson's fault. ",
            "3": "Speaking of Megatron, he caught six balls for 101 yards and one of Stafford's three scores. The others were secured by Kevin Ogletree and Jeremy Ross. ",
            "4": "Both Detroit running backs found the end zone as well. Bush atoned for the lost fumble, compiling 117 rushing yards and a touchdown on 20 carries to go along with five catches for 65 receiving yards. Joique Bell, meanwhile, gained 94 yards and a score on the ground on 19 attempts. ",
            "5": "The Lions made some mistakes after their initial blunders. Stafford tossed that second pick - an end-zone shot in which Sam Shields covered Megatron extremely well - while Martin placed a second kickoff out of bounds. David Akers also inexplicably whiffed on a 31-yard field goal at the end of the first half. Again, these errors didn't matter because Green Bay's offense couldn't do anything. Flynn was awful. He went 10-of-20 for 139 yards and an interception, but that doesn't tell the whole story. He had another pick dropped and lost two fumbles. He also took a safety in the third quarter. I must note that Flynn had no chance. Detroit's monstrous defensive front dominated Green Bay's offensive line. Flynn was sacked seven times through three quarters, including the safety by Ndamukong Suh, who had a very strong outing. Ezekiel Ansah was also great, mustering two sacks in the first half. It didn't help that center Evan Dietrich-Smith left the game in the second quarter, but Green Bay couldn't block the Lions even when he was in the lineup. The Packers couldn't get anything going on the ground either. Eddie Lacy had zero running lanes, as he was able to generate just 16 yards on 10 carries. He also had just two catches for 23 receiving yards. He dropped a screen pass, though the game was out of hand at that point. ",
            "6": "James Jones led the Packers in receiving with three catches for 79 yards, though his long gain (56 yards) came at the very end in garbage time. Jordy Nelson (2-14) disappointed his fantasy owners. He had a long gain that was nullified by offsetting penalties. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Tony Romo led a last-second, game-winning drive against the Giants this past Sunday. This week, he had to engineer a double-digit comeback to help his team achieve another victory. The Cowboys are now 7-5 and have temporarily established sole possession of first place in the NFC East. Things did not look promising for the Cowboys in the early stages of this game. Terrance Williams fumbled a kickoff that was returned for a touchdown. The defense then couldn't stop a Matt McGloin-to-Andre Holmes connection, while their only points came off a botched snap by the Raiders inside their own 10, which prompted Phil Simms to remark, Matt McGloin pulled out a little quick. Somewhere, Matt Millen was watching the game and smiling. Romo had just 69 passing yards entering the final drive of the first half, trailing 21-7. He couldn't get anything going with Dez Bryant, who dropped a pass and was guilty of a fumble that Dallas recovered. Thanks in part to multiple injuries in Oakland's secondary, things seemed to click for Romo from that point on. Though he started with those 69 yards, he finished 23-of-32 for 225 yards and a touchdown. Romo was so efficient offensively that he helped his team score four times in the final five drives of the game. ",
            "2": "Bryant, meanwhile, would go on to redeem himself. He led the team in receiving with seven catches for 61 yards and a touchdown. Perhaps his best play occurred late when he caught a short pass and fought off three Raider tacklers to fight for a first down. He didn't completely get there, but it set up a third-and-short for his team that was easily converted to help Dallas bleed the clock. ",
            "3": "DeMarco Murray is another Cowboy who began slowly, only to have a strong finish. Murray mustered just 12 rushing yards on seven carries in the first half, but he finished with a 17-63 line to go along with five catches for 39 receiving yards. Murray also scored a whopping three touchdowns. He actually ran into the end zone on four occasions, but one of the touchdowns was negated by a holding penalty. Lance Dunbar, meanwhile, spelled Murray and had even more success in terms of yardage. He tallied 82 yards on just 12 carries. ",
            "4": "As for the Raiders, they showed so much promise on offense in the early stages of this contest, but they fizzled out in the second half. McGloin, who was 11-of-15 for 146 yards in the opening two quarters, was just 7-of-15 for 109 yards and an interception following intermission. The pick was a back-breaker, as it occurred in the red zone when McGloin underthrew his intended receiver. Had Oakland just converted a field goal there, it could have concentrated on a touchdown on its final offensive drive where the team wisely settled for a field goal once it got into Sebastian Janikowski's range. McGloin, who ultimately finished 18-of-30 for 255 yards and the pick, targeted Andre Holmes frequently. Holmes, starting in favor of the injured Denarius Moore, made several incredible, acrobatic catches in this contest. He caught seven balls for 136 yards and was inches short of a touchdown in the second quarter. Rod Streater (3-57) also had an impressive reception that he caught over Orlando Scandrick for a gain of 27 yards. ",
            "5": "Darren McFadden made his return in this contest, but barely played; he had just 13 yards on five carries. Rashad Jennings handled the majority of the workload and surprisingly couldn't generate much in terms of yardage. However, he scored twice, though one touchdown was a gift because Holmes, as mentioned, fell down inches short of the goal line. Unfortunately, Jennings suffered a concussion in the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Baltimore-Pittsburgh matchups often feature multiple scrums and hard hits, and they ultimately go down to the wire and are decided by three points or fewer. This one was no different. These teams pushed each other around early and then battled to the very end, as the Steelers came within one play of tying the game. However, the Ravens prevailed and earned an extremely important victory to improve to 6-6, securing sole possession of the sixth seed in the AFC. The Ravens established a 19-7 lead, so this one shouldn't have gotten close. Baltimore squandered lots of opportunities; the team drove down the field deep into Pittsburgh territory, but drops and penalties - including five false starts - forced them into too many field goals. There was also one instance in which a yellow flag should've been thrown on the Steelers; Mike Tomlin slyly stepped onto the field on a Jacoby Jones kickoff return and helped slow the speedy Raven down enough to allow Cortez Allen to catch him. Cris Collinsworth indicated that the officials could've ruled a touchdown if they had decided that Jones would have scored if Tomlin hadn't interfered. The refs completely missed it, however. Jones noted afterward that he saw Tomlin, who hurt his chances of scoring. However, he wasn't bitter about it. I probably would've done the same thing if I knew I was back there, Smith said. Down 12 and eight on two separate fourth-quarter drives, Ben Roethlisberger led his team down the field twice into the end zone. The second score proved to be costly, as Le'Veon Bell collided with Baltimore cornerback Jimmy Smith and suffered what looked like an ugly concussion. The Steelers also lost center Fernando Velasco in addition to their top two offense tackles, so it's quite remarkable that they found the end zone. They missed on the two-point conversion, however, as Emmanuel Sanders couldn't hold on to the ball on what would've been a tough reception. ",
            "2": "Roethlisberger had a solid game, going 28-of-44 for 257 yards and two touchdowns. Despite all of the injuries to the offensive line, he wasn't sacked on a single occasion. He had some vintage Big Ben plays where he navigated the pocket amid pressure and still managed to connect with one of his targets downfield. However, he was ultimately betrayed by Sanders (6-43, TD), who had three drops, including two in the end zone. ",
            "3": "Bell also scored once and nearly had a second touchdown on the play in which he suffered a concussion. He actually crossed the goal line, but replay ruled that he was short because his helmet popped off beforehand. Bell finished with 73 yards on 16 carries to go along with seven catches for 63 receiving yards. Again, the concussion looked pretty bad, but he'll have 10 days to get cleared for Week 14. ",
            "4": "Heath Miller led the Steelers in receptions (8) for 86 yards. Antonio Brown (5-59) didn't have a huge game. ",
            "5": "As for the winners, Joe Flacco went 24-of-35 for 251 yards and a touchdown. Not included in these stats are a couple of long pass interferences that his receivers drew. Flacco had a great deep ball going, particularly with Torrey Smith (6-93, TD) and Jacoby Jones (4-53). Smith, however, had two drops, including one inside the 5-yard line in the fourth quarter. That one looked to be huge because a touchdown instead of a fifth field goal would've iced this game. ",
            "6": "Ray Rice didn't get much on the ground - 12 carries, 32 rushing yards - but he was a big factor in the passing attack, logging six catches for 38 receiving yards. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "The Colts vowed not to get off to a slow start again before this game. Whether they kept their word is arguable. They didn't fall into a big hole again, but they struggled to separate from Tennessee. This was just a 9-7 affair until the end of the first half when a mysterious Tennessee personal foul gave Indianapolis a gift field goal. This was actually still a close contest until the Colts engineered a game-sealing drive that went 92 yards and lasted a bit more than six minutes. However, that almost never happened because George Wilson dropped an interception thrown right to him. The CBS announcers correctly remarked that no NFL defensive back would ever see an easier pick. The miscue was huge because it allowed the Colts to eventually score a touchdown while bleeding time off the clock. Tennessee did eventually reach the red zone, but Ryan Fitzpatrick tossed his third interception of the afternoon, giving Indianapolis a victory. ",
            "2": "Luck had trouble sustaining drives throughout this game, as he was just 3-of-14 on third-down tries. Luck, who went 17-of-32 for 200 yards and an interception (as well as a potential second one), dealt with an insane amount of pressure from Tennessee's strong front. The Titans sacked Luck five times - a number that would've been greater had Luck not scrambled out of trouble on so many occasions (five rushes, 42 yards). Jurrell Casey, who had one of the sacks, had a monstrous afternoon. He had a huge tackle for loss on one play that won't be found on the box score. It didn't help Luck that his receivers struggled to get open. No Colt had more than 50 receiving yards, with Coby Fleener leading the way (3-50). T.Y. Hilton had five grabs for 46 yards, but was responsible for Luck's sole interception, as the ball tipped off his hands. Darrius Heyward-Bey, meanwhile, took an 11-yard loss and also dropped a pass. ",
            "3": "The Colts finally benched Trent Richardson in favor of Donald Brown. This is about two months too late, but better late than never. Brown was OK, gaining 54 yards and a touchdown on 14 carries, while Richardson wasted five attempts for 19 yards. Eleven of those 19 yards came on a third-and-20, so they were meaningless. ",
            "4": "Luck didn't play well, but Ryan Fitzpatrick was worse. Fitzpatrick, who performed well against the Colts two weeks ago, struggled with turnovers. He was guilty of three interceptions and a lost fumble in field-goal range, negating his decent stats: 21-of-37, 201 passing yards, 54 rushing yards, two touchdowns (one passing, one rushing). Fitzpatrick's picks were careless. Whenever he sensed any sort of pressure, it looked like he thought, Ah f*** it, I'm just going to bomb it downfield. For a smart, Harvard man, Fitzpatrick can play very stupidly sometimes. Fitzpatrick's lone aerial score was a flip to Chris Johnson on a fourth-down try at the goal line. The Titans had been stuffed twice near the end zone because they were foolishly using Shonn Greene, but they were wise to put Johnson on the field for that crucial play. Johnson had 69 rushing yards on 18 carries. He nearly had a rushing touchdown, but was tackled at the one-inch line, only to see Fitzpatrick vulture a score on a sneak. ",
            "5": "Fitzpatrick went to Kendall Wright and Delanie Walker often in the first matchup between these teams, but Walker wasn't available because of an early concussion. Wright still made an impact (6-77), as did Nate Washington (5-81). "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> I may have to consider re-slotting a quarterback to the Buccaneers in my <b> </b> after this performance by Mike Glennon. ",
            "2": "The Panthers won their eighth-straight game and their defense made another statement as they dominated Tampa Bay without the services of defensive end Charles Johnson. Cam Newton was too much for the Bucs' defense, and the talk of Mike Glennon being the long-term answer for Tampa Bay proved to be too hasty. After a Bucs' field goal drive, Newton broke off a 56-yard run into Tampa Bay territory. He hit a wide open Brandon LaFell two plays later for a 16-yard touchdown after Dashon Goldson blew the coverage. The next possession saw Newton throw late and high for LaFell. The ball was tipped in the air and intercepted by Keith Tandy. The Buccaneers added a long field goal before Glennon hit a bomb to Vincent Jackson (3-75) for a 60-yard gain after he beat Drayton Florence. On third-and-goal, Glennon dropped the ball and it was recovered by Carolina. Newton and Mike Tolbert moved the ball for a field goal. Just before halftime, LaFell (3-36) had Revis beat for a 50-yard touchdown, but Newton overthrew his receiver. A screen to Greg Olsen went for 30 yards inside the 10, and Newton dived over the top on fourth-and-goal. To start the third quarter, Glennon threw a deep ball up for grabs and it was picked off my Mike Mitchell. Newton hit Olsen (5-85) on the run for 28 yards and dropped in a beautiful 36-yard touchdown to Ted Ginn (2-47), who burned Revis for the score. After Tampa Bay missed a field goal, Revis dropped an interception and injured his chest/shoulder on the play. He left the game and went into the locker room. The Panthers moved the ball into Bucs territory before Newton made a terrible throw off his back foot for an interception to Lavonte David. ",
            "3": "Newton finished 18-of-29 for 263 yards with two touchdowns and two interceptions. He rushed for 68 yards and a score. Jonathan Stewart ran for 39 yards on 14 carries. Mike Tolbert was Carolina's leading back as he gained 48 yards on nine carries with three receptions for 41 yards. ",
            "4": "Glennon was 14-of-21 for 180 yards with a fumble and an interception. Bobby Rainey had 63 yards on 17 carries. Tiquan Underwood logged three receptions for 51 yards. ",
            "5": "The Panthers' defense was suffocating. Luke Kuechly, Thomas Davis and Star Lotulelei shut down Tampa Bay's running game. Rookie linebacker A.J. Klein flashed with a tackle for a loss and a sack. Drayton Florence had a deep pass breakup and a good day in coverage. Greg Hardy burned Donald Penn for a sack, and Wes Horton notched two sacks in the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "32"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "28"
        },
        "comments": {
            "amount": "2",
            "1": "I'm not going to delve too deeply into this game because it doesn't matter. There were two take-aways from this contest: First, what an awful, Pyrrhic win for the Jaguars. Seriously, this victory will set their franchise back a few years. They'll miss out on Teddy Bridgewater and Marcus Mariota for sure, so they'll now how to settle for a lesser quarterback prospect. Without a quality signal-caller, the Jaguars will continue to struggle, and the front office and coaching staff will ultimately be fired. I hope Gus Bradley enjoyed this win because it'll ultimately cost him his job. Second, Josh Gordon made history when he became the first receiver in NFL history to record back-to-back 200-yard receiving games. Gordon caught 10 balls for 261 yards and two touchdowns. While the numbers he posted last week were a product of garbage time, everything he did in this contest was legitimate. Gordon actually appeared to suffer a concussion in the third quarter, but he was cleared to return to the field. ",
            "2": "Some quick stats: - Maurice Jones-Drew (23-77) actually threw a touchdown pass in the second quarter - an 8-yarder to Marcedes Lewis. - Chad Henne went 22-of-40 for 195 yards, two touchdowns and an interception that was underthrown toward Joe Haden. His scores went to Cecil Shorts (6-64) and Clay Harbor. Shorts had a bad drop that would've moved the chains on a third-and-long. - Brandon Weeden went 24-of-40 for 370 yards, three scores and two picks. He was diagnosed with a concussion after the game. It's unclear if he's had this concussion since entering the NFL last year. - Gordon had two of Weeden's touchdowns, of course. The other went to Greg Little, who was guilty of his trademark drop. Jordan Cameron (4-43) also saw a ball slip through his hands. - Willis McGahee gained 57 yards and a touchdown on 14 carries. He outgained Chris Ogbonnaya (7-20) and Fozzy Whittaker (7-15) by a wide margin. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "Minnesota nearly erected a statue of Rhett Ellison. The backup tight end nearly cost the Vikings their third victory of the season, which would have been great news for the future of the franchise. They would've maintained better draft position with a loss, and Ellison would have been responsible for it. Ellison was the reason why Matt Cassel tossed a fourth-quarter interception in the red zone, as the ball popped out of his hands and into Khaseem Greene's. Ellison then committed a face mask on Blair Walsh's successful field goal in overtime, though this was a dubious call. Walsh was pushed back 15 yards and consequently missed a long field goal. Unfortunately for the Vikings, they ultimately secured a meaningless, Pyrrhic victory. Robbie Gould, called the greatest kicker in NFL history by the FOX play-by-play announcer, whiffed on a 47-yard field goal. The Vikings took over and drove down the field, thanks to numerous Adrian Peterson tough runs. Walsh converted on his next attempt, clinching a win for his team. ",
            "2": "Peterson was a beast. He exposed Chicago's horrid rush defense, gaining 211 yards on 35 carries. He also drew a crucial horse-collar tackle on a big gain in overtime. Peterson became the 28th running back in NFL history to eclipse 10,000 career rushing yards. ",
            "3": "The Vikings might be starting another quarterback next week. Christian Ponder was a shaky 3-of-8 for 40 yards before leaving the game in the second quarter with a concussion. Matt Cassel stepped in and played pretty well, albeit against one of the worst stop units in the NFL. He went 20-of-33 for 243 yards, one touchdown and the aforementioned interception that was Ellison's fault. Cassel's pocket presence was so much better than Ponder's; the latter took three sacks on his first three drives. Cassel, on the other hand, went down just twice through nearly four quarters of action. ",
            "4": "You can bet that Greg Jennings wants Cassel to start in Week 14. Jennings had his best performance of the season since the London game (also with Cassel), recording seven receptions for 78 yards and a touchdown. Here's the thing - all of his catches came after Cassel replaced Ponder. ",
            "5": "Some good, some bad with Cordarrelle Patterson. The good was a 33-yard rushing touchdown. The bad was a big drop in overtime. He had just one catch for four yards. ",
            "6": "As for the Bears, Josh McCown was a solid 23-of-36 for 355 yards and two touchdowns, though he was nearly picked on the opening drive. Both scores went to Alshon Jeffery, who had 12 catches for a whopping 249 yards. Jeffery broke Chicago's single-game record for receiving yardage, previously owned by himself. ",
            "7": "With Jeffery hogging all of the receiving yards, Brandon Marshall managed just four catches for 45 yards, thanks in part to rookie Xavier Rhodes' excellent coverage. Matt Forte did have a big game, however, gaining 120 yards on 23 carries to go along with two catches for 31 receiving yards. ",
            "8": "Notes on two defensive backs, one who was briefly on the field and one who wasn't at all. In terms of the latter, Brian Billick said, The Bears really miss Chris Tillman. I had no idea Charles Tillman changed his name. Meanwhile, Minnesota's Chris Cook was ejected for touching an official after one of Jeffery's touchdowns. There wasn't much contact, so I'm not so sure an ejection was necessary. A penalty would've been enough. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "It's only been 12 games, but the Geno Smith era could be over in New York. Smith, who has always been able to say that he has played relatively well at home, was a complete disgrace in this contest. He was 4-of-9 for 29 yards just prior to halftime, as many of his attempts were nowhere near his intended targets. He also took four sacks. Matters got only worse after that, as he carelessly heaved an interception downfield with less than half a minute remaining on the clock, giving the Dolphins a free field goal. Rex Ryan had seen enough at that point. He benched Smith in favor of Matt Simms, who wasn't any better. Simms was 2-of-7 for 27 yards before compiling some garbage yardage late in the fourth quarter. It was all for naught, however, as he eventually threw an interception. He was also credited with a lost fumble on a botched hand-off with Bilal Powell (7-34). ",
            "2": "The Jets couldn't really do anything on offense; the team was outgained 265-39 in the opening half. Chris Ivory rushed for 61 yards on 12 carries, but like last week, his numbers were inflated by a long gain in junk time. Ivory's 32-yarder was insignificant in the grand scheme of things, and his stat line was obviously 11-29 otherwise. ",
            "3": "No Jet had more than three receptions. No one is worth noting, save for Santonio Holmes, who didn't log a single reception because he pulled his hamstring in the first quarter. ",
            "4": "Though the Dolphins won this game, Ryan Tannehill did not have a good performance. Sure, he went 28-of-43 for 331 yards, two touchdowns and an interception, but he made a number of mistakes, particularly in the first half. Tannehill was nearly intercepted twice by Dee Milliner. He missed an open Marlon Moore on a deep shot, heaving the pass out of bounds. He underthrew Brian Hartline on a fourth-and-1 try. The pick, however, was actually not really his fault, as it happened because Mohammed Wilkerson hit him as he released the ball. Speaking of Wilkerson, the Jets managed to sack Tannehill just once (by Quinton Coples, who also had a great run stuff on third-and-1). It's embarrassing that they could barely put any pressure on Tannehill behind his anemic offensive line. In fact, the only thing New York did well in this contest was keep Miami from scoring, thanks to some impressive goal-line stands. Otherwise, this would've been a much greater blowout. ",
            "5": "Tannehill's touchdowns went to Hartliine (9-127) and Mike Wallace (7-82). Charles Clay also had a big game, catching seven passes for 80 yards. ",
            "6": "The Dolphins struggled to run on the Jets, as expected. Lamar Miller managed just 72 yards on 22 carries. Meanwhile, rookie Mike Gillislee saw NFL action for the first time as a pro, rushing for 21 yards on six attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "comments": {
            "amount": "5",
            "1": "Nick Foles engineered a three-game winning streak for the Eagles, but there was some uncertainty about the legitimacy of those victories because he battled three teams with horrific pass defenses. Arizona entered this weekend ranked fifth in terms of YPA, so this was Foles' first real test of the season. And he passed with flying colors. Foles went 21-of-34 for 237 yards and three touchdowns. He once again threw no picks, though he tossed one and saw it negated by a defensive hold. He also had an interception dropped in the end zone by Patrick Peterson. Still though, Foles was extremely accurate and read the blitz well. It must also be noted that he did all of this without DeSean Jackson, who was limited to just three catches for 36 yards by Peterson's awesome coverage. Foles now has 19 touchdowns and zero interceptions on the season, which is just insane. ",
            "2": "With Jackson blanketed, you might expect Riley Cooper to have a big outing, but that was not the case; he was limited to just three receptions for 48 yards, though one of his catches was an awesome one-handed grab for 24 yards. Instead, Foles spent the entire afternoon targeting his tight ends, as Arizona has been completely inept at trying to defend the position all season. Zach Ertz led Philadelphia in receiving with five catches for 68 yards and two touchdowns. Brent Celek chipped in with four grabs for 29 yards and a score. ",
            "3": "LeSean McCoy didn't have a huge performance, but he was pretty economical, tallying more than 100 total yards of offense. He rushed for 79 yards on 19 carries to go along with five catches for 36 receiving yards. ",
            "4": "While Foles and the Eagles put together a great game, the Cardinals regressed to early-season form. Carson Palmer opened the year with multiple turnovers in seven of his first nine games. He was clean in his previous two contests, but he self-destructed early on. He opened things up with a lost fumble on a Trent Cole strip-sack, which led to a Philadelphia touchdown. Palmer then heaved an interception into double coverage. He later had a second pick that was an underthrow. Palmer finished 24-of-41 for 302 yards, three touchdowns, two picks and the lost fumble. As you can tell by the numbers, Palmer had some positive moments in this contest as well. He converted a third-and-20 to Larry Fitzgerald (5-72, TD), who eluded two colliding Philadelphia defenders to find the end zone. He also had some long connections; Michael Floyd (5-99, TD) hauled in a 34-yarder. Meanwhile, Rob Housler (3-21) disappointed when he dropped a pass on third-and-4 in Philadelphia territory. ",
            "5": "Something that hurt Arizona's offense was the absence of explosive running back Andre Ellington. Rashard Mendenhall received most of the carries, gaining 76 yards on 18 carries. He wasn't terrible though, as he didn't lose a fumble for a change. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "31"
        },
        "comments": {
            "amount": "5",
            "1": "The Texans lost to the Raiders and Jaguars in consecutive home games, so this naturally was going to be an even worse defeat, right? Well, that was the conventional wisdom, as public bettors pounded New England as if there was no tomorrow. Those who expected a blowout were greatly disappointed, as Houston established a 17-7 lead by halftime. Showing effort for the first time in close to a month, the Texans seemed determined to avenge last year's playoff loss. New England, meanwhile, looked completely lethargic in the first half. Tom Brady wasn't sharp at all. He completely missed an open Kenbrell Thompkins along the sideline and then went on to toss an interception on an underthrow to Rob Gronkowski. He later missed an open Julian Edelman for a big gain downfield. However, Brady played like a new man after intermission. He let the ball hit the ground just five times in the second half, going 18-of-23 for 263 yards and a touchdown following the break. The Patriots' offense, transforming into a deadly machine, scored on all but one possession in the final two quarters. Brady's final numbers looked like this: 29-of-41, 371 yards, two touchdowns and the aforementioned pick. Brady, who had a potential third score dropped by Brandon Bolden, had a strong connection going with Gronkowski and Edelman after the early mistakes. Gronkowski had six grabs for 127 yards and a score, while Edelman led the team with nine receptions for 101 yards. Gronkowski hurt his ankle during the game, but remained on the field. It's reportedly not serious at all. ",
            "2": "Stevan Ridley didn't see any action because of his chronic fumbling problems. Shane Vereen and LeGarrette Blount split carries pretty evenly, posting lines of 10-38 and 12-44-1, respectively. Vereen also logged five catches for 37 yards and a receiving touchdown. ",
            "3": "The Texans did a good job of keeping pace with New England, even when the Patriots caught fire in the second half. Case Keenum didn't look too bad, going 15-of-30 for 272 yards, one rushing touchdown and an interception. However, he made some blunders. He was nearly picked a second time, and he was guilty of holding on to the ball way too long. Keenum's pick came as a result of this, as did the sack that ended the game. ",
            "4": "Andre Johnson didn't score, but he still had a big game, tallying eight catches for 121 yards. He was the only Texan with more than three receptions, though DeAndre Hopkins logged a decent amount of yardage (77) because of a 66-yard grab in the fourth quarter, beating Kyle Arrington who inexplicably quit on the play. ",
            "5": "Ben Tate hogged all but one of the touchdowns for the Texans. He found the end zone on three occasions, collecting 102 yards on 22 carries in the process. This was one week after he was benched in favor of Dennis Johnson (3-13). Tate actually limped off the field in the second quarter, but remained in the game. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "I'm still trying to figure out how the Bills lost this game. They were up 14-0 in the first quarter, and despite a late Atlanta charge, they still led by a touchdown at the end of regulation. They had the Falcons seemingly stopped on multiple occasions, but three penalties gave the Falcons new life. One wasn't too bad - Jerry Hughes was offside - but an illegal contact (where there was no contact) gave Atlanta first down instead of a third-down situation. The worst infraction, however, occurred on a third-and-16. Rookie Nickell Robey was flagged for a very questionable pass interference, setting up the Falcons with a short touchdown. The Bills still had a chance to win at the end of regulation, but Stevie Johnson fumbled at the Atlanta 30-yard line. Scott Chandler then coughed the ball up near midfield on the first drive in overtime. The Falcons, starting at the Buffalo 47-yard line, went 30 yards to set up Matt Bryant with a short, game-winning field goal. ",
            "2": "Buffalo's penalties and turnovers ruined what was a great afternoon by the two running backs. C.J. Spiller kicked things off with a 77-yard touchdown run in the first quarter and ultimately finished with 149 yards and the score on just 15 carries. Fred Jackson, meanwhile, found the end zone twice with his 42 rushing yards (11 carries) and 36 receiving yards (four catches). ",
            "3": "E.J. Manuel had a decent performance, though it probably should have been better considering his opponent. He went 18-of-32 for 210 yards and two touchdowns (one passing, one rushing). Manuel appeared to suffer an injury in the first half on a play that saw Atlanta commit a roughing-the-passer penalty, but he obviously remained in the game. ",
            "4": "I mentioned Johnson and Chandler as the two players who helped ruin a potential victory. They happened to lead the team in receiving; Johnson had five catches for 55 yards, while Chandler's four receptions went for 63 yards. ",
            "5": "The Falcons struggled to move the chains early, mustering just 189 net yards of offense in the first half compared to 234 afterward. Matt Ryan went 28-of-47 for 311 yards, a touchdown and a lost fumble despite a slow start. Ryan also had to deal with a ridiculous amount of pressure, as his offensive line struggled to protect against the Bills, who notched six sacks. Hughes was responsible for a pair. Ryan's score went to Tony Gonzalez (4-42), who logged three of his four receptions following intermission. Roddy White, meanwhile, led the Falcons with 10 catches for 143 yards. ",
            "6": "Harry Douglas collected six receptions for 73 yards. Douglas drew that pass interference on Roby to set up Atlanta's tying touchdown, though again, there shouldn't have been a call. ",
            "7": "Steven Jackson showed some rare life against the Bills. He still looked a bit slow, but he pummeled his way for 84 yards and two touchdown on 23 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Ah, so this is what Colin Kaepernick looks like with all of his weapons back on the field. Kaepernick has taken a ton of flak this season for not performing up to standards, but he's been without Michael Crabtree for the entire season and also didn't have Vernon Davis for a handful of contests. Davis, Crabtree and Anquan Boldin all took the field with Kaepernick, and the results were very positive. Kaepernick went 19-of-28 for 275 yards and a touchdown. He also rushed for 21 yards on four scrambles. He had some issues with pass protection, taking four sacks, including two from Michael Brockers. The issue was that Joe Staley left the game with a knee injury. Staley joined starting guard Mike Iupati on the sidelines. Kaepernick's sole aerial score went to Vernon Davis (4-82). Davis had to briefly leave the game for a play because safety T.J. McDonald grabbed him by the wang and wouldn't let go (seriously). Anquan Boldin, meanwhile, led the team with nine grabs for 98 yards. ",
            "2": "As for Michael Crabtree, it didn't start off very promising for him. He had an illegal block that negated a 13-yard Frank Gore run on the first drive. He then was whistled for offensive pass interference in St. Louis territory. However, Crabtree later redeemed himself with a 60-yard reception on a double move. He finished with two grabs for 68 yards. He played about half of the snaps, so he'll continue to be more effective going forward. Crabtree wasn't the only 49er who hurt his team with mistakes. Guard Joe Looney nullified a 15-yard gain because of a hold. A personal foul on special teams set up a chip-shot field goal for the Rams. They had a false start in the red zone. Gore (15-42) lost a fumble in the same area. Safety Eric Reid, meanwhile, dropped an interception that floated right to him. He appeared to lose the ball in the sun. ",
            "3": "Save for the field goal, the Rams couldn't capitalize on these San Francisco blunders because they had trouble moving the chains. They mustered just 73 net yards in the first half, failing to establish Zac Stacy on the ground very well. Stacy totaled 72 yards on 19 carries, but he had a 10-25 line at halftime. ",
            "4": "Kellen Clemens couldn't get anything going either. He was 3-of-9 for 37 yards in the first half, but compiled some yardage in garbage time to post a respectable stat line (19-of-37, 218 yards, TD, INT). Clemens was pretty inept, and Jeff Fisher must have been so frustrated watching this that he lost his mind and decided to try a fake punt on fourth-and-8 from his own 22, down 16-6 at the beginning of the fourth quarter. The try was an epic failure and wasn't even close to being successful. ",
            "5": "Save for Tavon Austin (4-25), who was responsible for Clemens' pick, no Ram had more than three catches. Jared Cook led the team in receiving with three grabs for 49 yards, but dropped two passes. Chris Givens (2-30) had a big drop on a third-and-1. ",
            "6": "Staley wasn't the only tackle who suffered an injury. Jake Long left the game as well when he got banged up in the second half. He collided with Stacy and seemed to suffer a concussion. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I'm too frustrated to type anything witty, or semi-witty or not witty here because the Chiefs blew a 21-7 lead as a six-point underdog. Blegh. ",
            "2": "With a sweep over the Chiefs, Denver is in the driver's seat in the AFC. The Broncos remain atop the AFC West, are closing in on a first-round bye and are in the lead to get home-field advantage throughout the playoffs. Kansas City got a good game out of Alex Smith, but the once-mighty Chiefs' defense continued its recent slump. Eric Decker was awesome as he dominated Kansas City's secondary. The Chiefs got the ball moving on their opening drive with a 24-yard completion to Dwayne Bowe to move the ball inside the 15. After a completion to Anthony Fasano (3-28) moved the ball to the two, Smith rolled out and threw the ball right to Wesley Woodyard for an interception in the end zone. Peyton Manning gave it right back when he threw a floater downfield that was batted around before Quentin Demps controlled the ball for a pick. Smith came back to hit Junior Hemingway (3-42) for a 17-yard score. The Broncos answered with a 34-yard screen pass to Knowshon Moreno. Manning then threw a perfect strike on a deep post to Decker for a 41-yard touchdown. Decker beat Brandon Flowers on the play. The Chiefs took that seven right back as Knile Davis returned the kickoff 108-yards to put Kansas City back in front. Manning tried to go back to Decker, but the veteran signal-caller had the underthrown ball fall short to Marcus Cooper for an interception that set up the Chiefs inside Broncos' territory. Smith took advantage with a touchdown pass to Fasano. Manning answered by hitting Decker for a gain of 42 yards to the three-yard line. That led to a short touchdown toss to Moreno and a 21-14 Kansas City lead at halftime. To open the third quarter, Decker burned the Chiefs' secondary again. Manning had a beautiful throw as Decker burned Flowers and Demps for a 37-yard touchdown. Manning kept pushing the ball down the field as Demaryius Thomas (3-106), who beat Cooper on his release to get open for a long catch and run of 77 yards inside Kansas City's 20-yard line. Denver took the lead with Decker's third touchdown catch of the game. He also beat Cooper on that play. Smith tossed a perfectly thrown deep ball that was dropped by A.J. Jenkins, so the Chiefs had to punt. Montee Ball (13-117) had a 45-yard run to midfield on a drive that also ended with a touchdown toss to Decker against Cooper. Despite Donnie Avery having two bad drops on passes downfield, Smith methodically moved the ball. At the goal line, Jamaal Charles (19-93) dove over the top to cut the Broncos lead to seven. Moreno converted a second-and-20 with a 31-yard completion, but eventually the Chiefs defense got off the field. The Chiefs took over inside their 10 with three and a half minutes remaining. Smith completed a 26-yarder on a third down to Jenkins (3-35), Dexter McCluster (5-43) made a diving catch for 28 yards and Smith got 25 more on a back shoulder to Bowe (3-56). On fourth down from the 12-yard line, Smith threw incomplete for Bowe in the end zone. ",
            "3": "Smith finished 26-of-42 for 293 yards with two touchdowns and an interception. He also ran for 46 yards on four caries. ",
            "4": "Manning was 22-of-35 for 403 yards with five touchdowns and two interceptions. Moreno was held to 18 yards on 15 carries, but had four receptions for 72 yards. Decker destroyed the Chiefs for 174 yards on eight receptions with four touchdowns. ",
            "5": "The Broncos really missed Derek Wolfe at the point of attack. Tight end Julius Thomas was missed as well. Wes Welker logged 38 yards on three catches. ",
            "6": "The Chiefs had a couple of significant injuries; left tackle Brandon Albert was carted off the field early in the fourth quarter with a serious knee malady and Fasano left the game early with a head injury. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "10"
        },
        "comments": {
            "amount": "4",
            "1": "My Las Vegas Hilton Supercontest partner Matvei quipped that the NFL gave us a sequel of Jets-Dolphins instead of a Bengals-Chargers battle. Both offenses were expected to post big numbers, but this was a strange defensive struggle. Andy Dalton has been woeful lately following a fast start, but he was going up against the worst defense in the NFL. He didn't improve, however, going 14-of-23 for 190 yards, one touchdown and an interception. Those numbers don't tell the whole story, as Dalton was wildly inaccurate all afternoon. His pick was lobbed up for grabs, he missed a wide-open Jermaine Gresham for a big gain, and he was whistled for a terrible intentional-grounding penalty. Dalton, however, was able to lead his team to victory, as San Diego inexplicably let A.J. Green run uncovered into the end zone for what turned out to be a 21-yard score. Green, who finished with five catches for 83 yards and the touchdown, suffered an injury in the first quarter when leaping for a catch. He didn't miss much action, however; 58 of his yards came after halftime. ",
            "2": "The Bengals were able to beat the Chargers with their ground attack, as they ran all over San Diego. BenJarvus Green-Ellis gained 92 yards and a touchdown on 20 carries, though he hurt his team with a lost fumble in the red zone. Giovani Bernard (14-57) wasn't as big of a factor as he should have been. ",
            "3": "As for the Chargers, they disappointed on offense as well. They were battling the better of the two defenses (by a wide margin), but they have the talent to overcome that. However, they made one too many dumb mistakes to ruin a game in which they otherwise played evenly with Cincinnati. It started when Antonio Gates lost a fumble in the red zone on the opening drive. Danny Woodhead then had a drop. Philip Rivers tossed an interception, though it was really Gates' fault because cornerback Dre Kirkpatrick ripped the ball out of his hands. Keenan Allen followed all of this up with a lost fumble of his own deep in his own territory. Gates, who had five catches for 41 yards, was outclassed by the other tight end, Ladarius Green, who had two grabs for 45 yards and a touchdown. Allen, meanwhile, logged eight receptions for 106 yards. ",
            "4": "Rivers finished 23-of-37 for 252 yards, one touchdown and the Gates-related interception. It was odd to see Rivers not target Danny Woodhead very much; the scat back had just two catches for 13 yards to go along with his mediocre rushing numbers (7-22). Ryan Mathews outgained him in both facets with his 61 yards on 14 carries and five receptions for 31 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Giants",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Giants were sleepwalking in the first quarter, while the Redskins came out on fire. They quickly established a 14-0 lead, as Robert Griffin opened 12-of-12 for 111 yards and a touchdown. They achieved a whopping 10 first downs before New York moved the chains on a single occasion. It seemed like Washington would run away with an easy, blowout victory. But then, reality set in. The Redskins screwed up so many times that they didn't give themselves much of a chance. Though Griffin let the ball hit the ground just eight times - he was 24-of-32 for 207 yards and a touchdown - his receivers were guilty of four drops. Pierre Garcon, who was flagged for a delay of game for randomly kicking the ball into the stands, lost a fumble on the team's final drive where safety Will Hill actually took the ball away from him. Garcon's lack of effort in this contest was alarming. The most egregious error of the night, however, came via the officials. On Washington's final possession, Garcon was tackled near the first-down marker. It should have brought up a third down, but one of the officials signaled a first down. Following an incompletion, referee Jeff Triplette told everyone that it was indeed fourth down. It ultimately didn't matter because the Redskins completed a pass that Garcon fumbled, but it was still a terrible blunder by the officiating crew. Triplette should have stopped the play and measured for a first down. ",
            "2": "Washington's defense, meanwhile, couldn't do anything to stop Eli Manning, save for intercepting him once on an overthrow. He went 22-of-28 for 235 yards, one touchdown and the pick. His score went to Brandon Myers (5-61). ",
            "3": "Victor Cruz, featured on Cris Carter's <i>Where <strike>Are</strike> You At (sic)</i> segment, led the team with six catches for 80 yards. He nearly scored a touchdown, but he was tackled inches short of the goal line. Hakeem Nicks (2-34) posted ugly numbers again, but had an impressive reception in which he wrestled the ball away from a defender. ",
            "4": "Both of the Giants' running backs, Peyton Hillis (6-45) and Andre Brown (14-35) both had long gains of 20-plus. Brown found the end zone twice. ",
            "5": "Going back to the Redskins, I already posted most of Griffin's numbers (24-of-32, 207 yards, TD; 12 carries, 88 rushing yards), but even though his supporting cast was guilty of four drops, he didn't play as well as those stats indicate. He took five sacks, four of which came from Justin Tuck, who had accomplished nothing this season heading into this contest. Also, Cris Collinsworth pointed out that Griffin was so willing to run without looking downfield at all. On one instance, he had an open Roy Helu down the sideline, but he took off instead. Griffin did scramble well, but he's at risk for injury by doing this. There was one scary moment in which he slipped on the track after he ran out of bounds. ",
            "6": "Griffin's one aerial score was to Logan Paulsen (3-41), who had one of the drops. Garcon, who also had a drop in addition to the fumble, led the team with nine receptions for 61 yards. ",
            "7": "Alfred Morris couldn't find any running room. He managed just 26 yards on 11 carries. Mike Shanahan, renowned fantasy football douche, gave Evan Royster a goal-line carry, but Royster was stuffed. Morris eventually scored the touchdown. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "All roads now go through Seattle in the NFC. The Saints and Seahawks battled each other in a game that essentially decided the No. 1 seed in the conference, but this wasn't even close. Seattle was dominant at home yet again, so New Orleans will have to win in the cold, rainy conditions in front of the loudest outdoor fans in all of sports if they want to advance to the Super Bowl. The Saints came into this game with a top-10 defense, but they looked completely helpless trying to stop Russell Wilson, who was phenomenal. Wilson had a couple of mistakes early - he missed an open receiver for a touchdown and then had an interception dropped - but he made so many great plays after that. He connected on tons of clutch throws and picked up rushing yardage when he needed to. The fans chanted M-V-P after the game, and Wilson certainly deserves consideration. Wilson let the ball hit the ground on just eight occasions, going 22-of-30 for 310 yards and three touchdowns to go along with his team-leading 47 rushing yards on eight scrambles. Wilson attempted just 11 passes after intermission because of the massive lead, so his numbers could've been even better. The Saints sacked him only once, which wasn't just a product of Wilson's mobility. His offensive line played better than it has in weeks. ",
            "2": "Seattle's defense, meanwhile, played just as well as the offense. ESPN analyst Trent Dilfer questioned the Seahawks' stop unit prior to the game because it hadn't battled a Drew Brees yet. Well, Seattle proved its former quarterback completely wrong, limiting Drew Brees to just 147 yards on 23-of-28 passing (with one touchdown). This was the first time in 43 games that Brees failed to pass for at least 200 yards. He nearly broke Dan Fouts' consecutive streak of 45. Brees simply had no chance. He was constantly under pressure. Cliff Avril sacked him in the first quarter and forced a fumble, allowing Michael Bennett to return the ball into the end zone. That was the only time Brees was officially sacked, but he was harassed throughout the entire evening. He had to hurry so many throws, and he released the ball while getting hit on numerous occasions. ",
            "3": "The one surprise in this game is that the Seahawks couldn't run the ball against one of the worst ground defenses in the NFL. Marshawn Lynch managed just 45 yards on 16 carries. He had some chances at the goal line, but was stuffed. Linebacker Curtis Lofton had a great performance in run support. ",
            "4": "Wilson's touchdowns went to Zach Miller (5-86), Doug Baldwin (4-77) and Derrick Coleman. The former and latter scores are worth noting. Miller caught a 60-yard reception earlier on the drive, but was eventually chased down in the red zone. Wilson rightfully went back to him for the touchdown. As for Coleman's score, Wilson fired a pass that doinked off tight end Kellen Davis' helmet. It ricocheted into Coleman's arms. Coleman then dived into the end zone for the bizarre touchdown. ",
            "5": "Brees, meanwhile, had his sole touchdown go to Jimmy Graham, who was limited to three catches for 42 yards. Darren Sproles led the team in receptions with seven for just 32 yards, while Marques Colston was limited to a 4-27 line. ",
            "6": "The Saints couldn't run the ball either. Mark Ingram paced New Orleans with just 22 yards on eight carries. ",
            "7": "Ed Hochuli entertained us all with a hilarious announcement in the second half. Following an official-related stoppage, he announced the following to the crowd: There was no delay of game because we were stretching our balls. Ah, so that's how Hochuli was able to develop his massive muscles. I think I may just stretch my balls tonight. "
        }
    },
    "numberOfGames": "16"
}