{
    "year": "2013",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "Think these two teams are moving in different directions? The Panthers, now 4-3, have climbed over the .500 mark for the first time in five years. As for the Buccaneers, Warren Sapp said it best when he stated, This was embarrassing to watch as the fans chanted We need Sapp! following this blowout. This was an incredibly easy win for Carolina. The team marched down the field on its first two possessions for 70- and 80-yard touchdown drives. Up 14-3, Cam Newton was 9-of-10 for 98 yards and a touchdown with four carries for 24 rushing yards. The Panthers did not look back, ultimately leading 31-6 even before Tampa reached the red zone for the first time. A garbage-time score made the result a bit closer, but Carolina dominated this contest throughout. ",
            "2": "Newton finished 23-of-32 for 221 yards and two passing touchdowns along with 11 scrambles for a team-leading 50 rushing yards and a third score on the ground. It could've even been a bigger night for him, as Ted Ginn dropped a deep pass. Tampa safety Mark Barron did let an interception fall through his hands, to be fair. Newton's scores went to Mike Tolbert and Greg Olsen (3-21). Tolbert was pretty tough, mustering 35 rushing yards on seven carries and also chipping in with four catches for 29 receiving yards. DeAngelo Williams (8-43) also found the end zone. ",
            "3": "Steve Smith didn't have a very good statistical performance, catching four balls for 42 yards. He did see Darrelle Revis occasionally, but Revis mostly played zone. Revis was a mess in the first half. He broke up a completion on third down directed toward Smith, but he committed pass interference, fell down on a Newton scramble and also whiffed on a tackle when Williams scored his touchdown. Not to beat a dead horse, but the Buccaneers are so insanely stupid for using Revis in a zone. Why would they deal a first-round pick and pay him $16 million if they aren't going to use his strength? It makes zero sense. ",
            "4": "A player Tampa did select in the 2013 NFL Draft, Mike Glennon had a pretty mediocre performance. He finished 30-of-51 for 275 yards and a touchdown. He made some nice passes, but was guilty of one too many overthrows (can we call those Josh Freemans?) He was also very fortunate that Carolina dropped three potential interceptions, though all of those instances came in the second half when Glennon was trying to mount a comeback. All in all, Glennon played OK, but I'm still not convinced that he can be a solid NFL starter. Perhaps I'll change my mind as the season progresses. Glennon's late touchdown went to rookie tight end Tim Wright (5-48). Wright tied Vincent Jackson for the team lead in receptions. Jackson's five catches went for 79 yards, but it should be noted that he dropped a first-down conversion on third down of the opening drive. ",
            "5": "Mike James, replacing the injured Doug Martin, gained 39 yards on 10 carries. He broke free for a 15-yard burst, but didn't do much else on the ground. He contributed in the passing game with four catches for 25 receiving yards. ",
            "6": "The one dark cloud surrounding Carolina's victory was a very late injury to Charles Johnson. There's a concern. We'll see, said head coach Commander Adama regarding Johnson's groin. ",
            "7": "As for the Buccaneers, Greg Schiano could be fired this week, given that they're on a pseudo bye. I'm not a fan of Michael Silver, but he wrote an article about how Schiano has lost the locker room and that his players are tuning him out. Also, consider what Charlie Campbell tweeted (@DraftCampbell): The Bucs are 24-47 under GM Mark Dominik. Greg Schiano is 1-12 in his last 13 games, is 7-16 overall. Time for the Bucs to clean house. ",
            "8": "It wouldn't be Thursday Night Football without a gaffe from Brad Nessler. Greg Little was Mr. Dependable recently, while Jay Feely became Jim Feely last week. This Thursday, Nessler joked about the Buccaneers firing their trademark cannon too early prior to their touchdown. If Nessler weren't mailing in these games, he would've known that Tampa fires the cannon once each time it reaches the red zone. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "Wow, what a game. I had a whole write-up prepared about how the Lions once again shot themselves in the foot to cost themselves a victory. After all, Matthew Stafford was responsible for two interceptions, both collected by Sean Lee. One was tipped, while the other just saw Lee step in front of the intended target. In the second half, Reggie Bush and Calvin Johnson both lost fumbles in Dallas territory. The Lions were whistled for unnecessary roughness on top of the Megatron cough-up, which gave the Cowboys three free points because they couldn't move the chains, but were set up in field-goal range. The Cowboys kicked a field goal to go up 30-24 with a minute remaining, but there would've been 20 seconds or so on the clock had they not committed a holding penalty. Jim Schwartz smartly declined the infraction, saving 40 seconds. This gave Matthew Stafford enough time to hit Kris Durham for a 40-yard bomb, ultimately setting up a 1-yard sneak for the go-ahead sneak score in which he fooled everyone - including his own linemen - by faking to spike the ball. This is a great win for the Lions, who needed to prevail like this. They need to avoid mistakes - four turnovers against quality opponents usually won't cut it - but perhaps this victory can be used as momentum to fix things going forward. On the flip side, there's no telling what a defeat like this will do for the Cowboys. Sure, it's just a non-divisional loss, and Dallas still has control of the NFC East, but Dez Bryant's sideline tirade could really hurt the team. Bryant spent so much of the second half incoherently yelling at coaches and players. It all started when Bryant shouted get me the ball to Tony Romo repeatedly. He then barked at some coaches and Romo some more. Following Detroit's touchdown, Bryant was seen screaming at Jason Witten, with DeMarcus Ware trying to break the two up. Ware then grabbed Bryant and yelled at him. It was an ugly scene, reminiscent of Terrell Owens' antics. Bryant has been a good soldier this season, but this could be a very dark cloud hovering over the team in the second half of the year, despite what the Cowboy players may have told the media. ",
            "2": "The most prominent number in this contest was 329. That's the amount of receiving yards Calvin Johnson accumulated, highlighted by an 87-yard gain in which Brandon Carr missed a tackle and Barry Church took a horrible angle. Megatron caught 14 balls to reach that total, which included a touchdown. He fell just seven yards short of Flipper Anderson's all-time record of 336 yards in a single contest. ",
            "3": "Johnson had about two-thirds of Stafford's yards. Stafford was brilliant if you exclude the two picks, as he went 33-of-48 for 488 yards and two touchdowns (one passing, one rushing) otherwise. He was especially brilliant after halftime. He let the ball hit the ground just five times, going 20-of-25 for 296 yards and the rushing score following the break. ",
            "4": "Only four Lions caught more than one pass: Johnson, Durham (4-54), Brandon Pettigrew (3-31) and Bush, whose eight catches for 30 receiving yards complemented his 92 rushing yards and touchdown on 21 carries. Bush wasn't perfect though; in addition to losing that aforementioned fumble, he also dropped a pass, which has been a problem for him this year. ",
            "5": "As for the Cowboys' offense, they had to rely on big plays to score in this contest. They had trouble sustaining drives - 3-of-13 on third downs - because Detroit put immense pressure on Romo. It seemed like he was being blasted on almost every single attempt, which would explain why he was only able to complete half of his passes. He went 14-of-30 for 206 yards and three touchdowns. Two of Romo's scores went to Bryant (3-72), who broke free with a 50-yard scamper along the sidelines and also had a David Tyree-esque catch in which he pinned the ball to the side of his helmet. Terrance Williams (2-64) caught the other, a 60-yarder that also was mostly about his yards-after-catch ability. ",
            "6": "Dallas couldn't run the ball because Detroit's ferocious defensive front didn't allow anything. Joseph Randle, starting in place of DeMarco Murray, managed only 26 yards on 14 carries. He also tied for the team lead with three grabs for 18 receiving yards. ",
            "7": "This game was a shootout, but it was also a hard-hitting blood bath, with numerous players leaving with injuries. Ezekiel Ansah, Morris Claiborne, Ryan Broyles, Bullet Bill Bentley and Brian Waters all left the contest with various maladies. Broyles' was the worst, as he ruptured his Achilles' tendon. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "49ers",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "1",
            "1": "I'm not going to spend much time on this game because... why? The biggest take-away was that Wembley Stadium was once again packed. The Brits spent the afternoon cheering for the 49ers and doing the wave. In fact, this was such a pro-San Francisco crowd that the people on the field didn't even bother to spell Jaguars correctly: "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "I've received my fair share of hate mail for slotting the Chiefs way too low in my NFL Power Rankings. I had them No. 8 this week, and it appears as though I had them too high. They nearly lost to the Browns. At home. With Jason Campbell as the starting quarterback. My main issue with Kansas City has been Alex Smith. With many clueless former NFL players foolishly lauding him as this great game-winner, anyone who has really watched these games knows that he's just not very good. His numbers looked pretty decent - 24-of-36 for 225 yards, two touchdowns - but most of his yardage once again came on short throws that his weapons turned into big gains. He didn't threaten the Browns downfield at all and was nearly intercepted on a couple of occasions. He missed some open receivers, including one in the end zone for a potential touchdown because he floated the ball out of bounds. He also took a whopping six sacks. Amazingly, Jason Campbell outplayed Smith. Campbell went 22-of-36 for 293 yards and two touchdowns, which is crazy considering that he was battling the NFL's top defense without any sort of running game. He also endured lots of drops from his receivers, mostly Greg Little and Davone Bess, who had an especially dreadful performance. Bess had his usual couple of drops - the game was actually bookended by his failed receptions - and also coughed up a punt return. ",
            "2": "It took a while for Campbell to get going - Cleveland's first down came with about four minutes remaining in the second quarter - but he caught fire after that. His scores went to Josh Gordon (5-132) and Fozzy Whittaker, while Jordan Cameron had another solid outing with four grabs for 81 yards. A major reason Campbell was able to play well was pass protection. He was sacked only once, which was very surprising considering that Kansas City's pass rush led the NFL in sacks entering the weekend. ",
            "3": "As mentioned, the Browns couldn't move the ball on the ground. Willis McGahee finished with 28 yards on nine carries, all of which came after the break; he had minus-2 yards at intermission. ",
            "4": "The Chiefs, meanwhile, had much more success moving the chains on the ground. That was to be expected because of Jamaal Charles, who tallied 74 yards on 18 carries and also caught five balls for 46 receiving yards. ",
            "5": "Charles finished second in receiving yardage to Dexter McCluster (7-67, TD). As for Dwayne Bowe, he was limited to one catch for seven yards by Joe Haden, but didn't look anywhere near 100 percent. It's not like Bowe would've done much anyway, however, because Smith simply is incapable of getting him the ball downfield. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: I'm so frustrated with Tom Brady ruining my fantasy teams and yet covering this spread in bulls*** fashion, so I'll just post a link to the Adventures of Tom Brady's Haircuts. ",
            "2": "This was a game of two halves as the young Dolphins owned the first two quarters. The Patriots adjusted at halftime and came out like gang-busters in the second half. New England needed a bounce-back win after its loss to the New York Jets and got it thanks to dominating the final two quarters. On his first possession, Tom Brady had the uncharacteristic mistake of staring down Rob Gronkowski (2-27) and the route was jumped by Dimitri Patterson for an interception. Brady came close to another pick, but a bogus 21-yard pass interference was called on Miami. That set up a field goal for New England. After the Brady interception, Ryan Tannehill moved the chains with some big completions to Charles Clay (5-37). Tannehill finished the drive with a clutch third-and-goal toss to Brandon Gibson. The second-year signal-caller followed it up with another nice drive featuring some good runs from Daniel Thomas (9-47). On third-and-3 at the five-yard line, Tannehill threw a bullet to Thomas for a touchdown and a 17-3 halftime lead. The Dolphins were moving well in the third quarter before Rob Ninkovich came with a pressure that set up a sack for Dont'a Hightower. That pushed Miami back and led to a 46-yard missed field goal by Caleb Sturgis. After that miss, it was all Patriots the rest of the way. New England moved the ball down the field with Brady hitting Aaron Dobson (4-60) for a 14-yard touchdown. The ensuing possession saw Logan Ryan (2 sacks) come unblocked on a blind-side blitz and hit Tannehill for a forced fumble. The ball was recovered by Ninkovich. A pass to Danny Amendola (3-15) set up a 1-yard touchdown run by Brandon Bolden (8-22). A holding penalty on Nate Solder canceled out a 30-yard touchdown catch by Gronkowski, so the Patriots settled for a 48-yard field goal and a 20-17 lead. Early in the fourth quarter, Tannehill laid out a deep ball for Mike Wallace, but he was well covered. Devin McCourty skied high and tipped the ball back in bounds as he was falling over the sideline. Marquice Cole was Johnny-on-the-spot to catch the ball and get his feet in bounds for the interception. A huge blown call by the officials really hurt the Dolphins. Jimmy Wilson had a strip-sack on Brady, but the officials ruled that Olivier Vernon slapped the ball forward. It was a terrible call as Vernon was trying to gain control of the ball. That took a big play away from Miami and gave New England 10 yards and a first down. Steven Ridley (14-79) ran the ball into the end zone a few plays later. The Dolphins converted a third-and-23 via a screen to Wallace (3-41) to keep their comeback hopes alive, but a field goal attempt was blocked by Chandler Jones. In garbage time, Miami's offensive line broke down. Dane Fletcher had a sack and Chris Jones beat Richie Incognito with a spin move for a sack. Tannehill threw a bomb up for grabs and it floated down to Duron Harmon for an interception. Tannehill finished completing 22-of-42 for 192 yards with two touchdowns and two interceptions. The Dolphins ran the ball better with Lamar Miller (18-89). ",
            "3": "Brady completed 13-of-22 for 116 yards with a touchdown and interception. New England ran the ball well. LeGarrette Blount had 49 yards on 11 carries. ",
            "4": "New Dolphins left tackle Bryant McKinnie played well for Miami, but the other guards and right tackle were weak enough to let the Patriots rack up six sacks. Rookie Chris Jones played well for New England with six tackles and a sack. ",
            "5": "Patriots right tackle Sebastian Vollmer was seriously injured in the second quarter. His loud screams where picked up by the field mics, and he was carted off with a leg injury. Vollmer's loss could be extremely painful for Brady and the Patriots. ",
            "6": "Jared Odrick had two sacks for Miami. His second was very impressive as he blew by Logan Mankins. Vernon also recorded a sack for Miami. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Saints",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "Quarterbacks playing in the Superdome for the first time - or even the second, third, etc. occasions - are often shell shocked by all of the noise. That appeared to be the case with Thaddeus Lewis, who looked like a deer in the headlights early on. Lewis lost a fumble on the first drive, injuring his ribs in the process. Lewis then hurried a pass and missed a wide-open Robert Woods downfield. After that, Lewis coughed up yet another ball on a play that would've been reversed last year via the Tuck Rule. Lewis fumbled a third time, but he was fortunate enough to see his team recover. Despite all of this, the Saints had issues pulling away. In fact, they were down 10-6 in the second quarter. Give Buffalo's defense credit, but New Orleans' scoring struggles happened mostly because they screwed up early. Garrett Hartley whiffed on two field goals, while Drew Brees was whistled for a pair of false starts in the red zone. Those penalties were so bizarre; all Brees was trying to do was audible, yet the officials flagged him on consecutive plays. It was so suspicious that I assumed the game was fixed (Hartley's two misses factored into my conspiracy theory), but the Saints ultimately got their act together, establishing a double-digit lead and never looking back. ",
            "2": "Drew Brees was amazing in this victory. He let the ball hit the ground on just eight occasions, going 26-of-34 for 332 yards and a whopping five touchdowns. This type of outing was remarkable, considering he was under heavy pressure throughout the afternoon. He took four sacks - 1.5 from Kyle Williams - which has to be a concern for New Orleans. ",
            "3": "Two of Brees' scores went to Jimmy Graham, who wasn't even expected to play in this contest until Sunday morning. Graham proved to be more than a decoy, snagging three balls for 37 yards and the pair of touchdowns. He was limited, however, playing about 20 snaps. ",
            "4": "Rookie receiver Kenny Stills also found the end zone twice, finishing with three grabs for 129 yards. Stills, however, was targeted only four times, as Brees did a remarkable job of spreading the ball around. Aside from Darren Sproles' four receptions, no Saint had more than three catches, which is astonishing considering that Brees fired 26 completions. Stills, Benjamin Watson (3-45), Graham, Lance Moore (3-34, TD), Pierre Thomas (3-29) and Marques Colston (3-18) all had three receptions. ",
            "5": "The Saints struggled to run the ball early, but eventually got something going with Thomas, who gained 65 yards on 14 attempts. Meanwhile, the Bills didn't rush as well as they would've liked against New Orleans' woeful ground defense. Fred Jackson tallied only 45 yards and a touchdown on 15 carries. ",
            "6": "Lewis, as mentioned earlier, struggled early on. He had some quality attempts though and wasn't completely inept, finishing 22-of-39 for 234 yards, one touchdown and an interception. Lewis' sole score went to Stevie Johnson (7-72). Scott Chandler had the exact same stats as Johnson, minus the touchdown. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Giants",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "I never thought Chip Kelly had much of a chance at this level because he's never had any sort of NFL experience. He has made some poor decisions as the head coach of the Eagles in terms of game and clock management, but this week, his big error was starting a key player who was nowhere close to being ready to suit up. Something like this may work in college when elite schools like Oregon take on teams with far less talent, but something like this just doesn't fly in the pros. The key player I'm referring to is Philadelphia's mobile quarterback, who couldn't move around at all because of a balky hamstring. QBDK proclaimed himself to be 80-percent healthy, but he looked like he was 80-percent injured instead; he struggled immensely, limiting the Eagles to 19 yards on the 17 plays he was on the field for. There's no doubt Matt Barkley should've started. Barkley didn't put any points on the board, but he at least didn't give the Giants any points. QBDK was initially intercepted on a throw behind Brent Celek. He then fumbled the ball, but was lucky to get it back because Antrel Rolle was on top of it. QBDK was then whistled for a horrible intentional-grounding penalty, which drew heavy boos from the crowd. QBDK was pulled after that, as he finished 6-of-9 for only 31 yards and the pick. He scrambled only once, thus negating his best asset. Barkley replaced him, going 17-of-26 for 158 yards and an interception that was a desperation heave as time ran out (it should be noted that DeSean Jackson put no effort into breaking it up). Barkley struggled to get the ball downfield and was guilty of floating passes, but his biggest issue was ball security. He fumbled three times, losing one of them deep in New York territory at the end of the first half because he held on to the ball too long. ",
            "2": "Some Philadelphia stats before moving on to the victors: Jackson led the team with eight catches for 63 yards. LeSean McCoy killed his fantasy owners with only 48 yards on 15 carries along with four catches for 18 receiving yards. The Eagles' only touchdown came very late on a horrible Giants' snap on a punt. ",
            "3": "This was a nice win for the Giants, but it appeared as though it would come with a price. Victor Cruz (7 catches, 86 yards), exited the game and had to take X-rays on his neck after being bodyslammed to the ground. However, he was able to re-take the field, as he missed only a few snaps. It turned out that he only suffered a stinger. ",
            "4": "The Giants didn't score any touchdowns, but moved the chains the entire afternoon. They mustered 325 net yards of offense, compared to only 201 for Philadelphia, but they just couldn't convert in the red zone, failing on both tries. The issue with that was New York's inability to establish the run. Peyton Hillis gained 70 yards on 20 carries, but he's not much of a threat. Michael Cox (9-19) wasn't either. ",
            "5": "Eli Manning went 25-of-39 for 246 yards. His top targets were Cruz and Hakeem Nicks (7-51), though Brandon Myers (3-42) had the longest completion of the game for either side, a gain of 27 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "The Jets have toggled wins and losses each week this year, so given that they were coming off a victory, a defeat was expected. Geno Smith has been awful each time New York has gone down prior to this contest, but it was the defense that let the team down in this contest. New York simply had no answer for Andy Dalton, which sounds very odd. It started off a bit shaky for him, as Mohamed Sanu dropped a deep pass, but Dalton finished 19-of-30 for 325 yards, five touchdowns and an interception that was an odd pass that he tried to fit in between two defenders. This was highlighted by a perfect 53-yard bomb to A.J. Green, but the former first-round pick wasn't the most productive Cincinnati receiver in this contest. Marvin Jones caught four touchdowns against the Jets, and that was no fluke. A 2012 fifth-round pick out of California, Jones' quartet of scores were accompanied with eight catches for 122 yards. His previous two contests saw him achieve decent stat lines of 3-71-1 and 4-57-1. He's a talented wideout and needs to be picked up in all fantasy formats, as he has grown into Dalton's second-favorite target. ",
            "2": "Dalton's fifth score went to Jermaine Gresham (2-14). The other Bengal tight end, Tyler Eifert, also caught a pair of passes (2-23). ",
            "3": "Giovani Bernard disappointed from a fantasy perspective. He carried the ball only five times for 18 yards. He appeared to fumble the ball just prior to crossing the goal line, which was initially called a touchback, but the officials ruled that he was down by contact after checking the replay. The Bengals didn't score, however, as BenJarvus Green-Ellis (11-33) was stuffed at the goal line. I thought going for it was a mistake because at 14-0, a field goal would've made it a three-possession affair regardless, but it ultimately didn't matter. It's crazy to think Cincinnati could've posted even more points. ",
            "4": "Of course, it helped the Bengals' point total that Geno Smith gave them 14 in the second half with a pair of pick-sixes. However, the Jets were down big at that point and Smith was just truing to make something happen. I'm not trying to imply that he played well, but he wasn't awful either. Smith finished 20-of-30 for 159 yards and the two interceptions. Oddly enough, Smith had fewer rushing yards (eight yards on two scrambles) than backup Matt Simms, who entered the contest in the fourth quarter. ",
            "5": "Part of the problem for Smith was that he had no semblance of a running game to help take pressure off of him from a ferocious Cincinnati front. Chris Ivory's performance last week proved to be a predictable red herring, as the overrated back gained 11 yards on six carries. Bilal Powell didn't do anything either (10-19). I have the Jets selecting a running back in the second round of my 2014 NFL Mock Draft. ",
            "6": "David Nelson caught eight balls for 80 yards to lead the Jets in both categories, but he's not worth considering in fantasy. Stephen Hill disappointed again with four grabs for 23 yards. ",
            "7": "The Bengals lost linebacker Rey Maualuga to a knee injury when he crashed into Ivory at the line of scrimmage. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "18"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers have only won once on the West Coast in the past dozen years. They did so in 2005, which was one of their Super Bowl campaigns. I think we can determine that this squad won't be competing for a Lombardi Trophy. Pittsburgh had a very good chance to come away with its third-consecutive victory, but killed itself with stupid stuff. This includes: - Allowing a 93-yard touchdown run to Terrelle Pryor to kick off the game. This was Oakland's longest run in franchise history, barely eclipsing a 92-yard scamper by Bo Jackson. - The Steelers had a blocked punt, setting up an Oakland touchdown. - Shaun Suisham whiffed on field-goal tries from 34 and 32 yards. - Ben Roethlisberger (29-of-45, 275 yards) tossed two interceptions (he could've easily thrown a couple more), including an errant deep shot downfield and a tipped pass. He did make up for it with a touchdown, however, thanks to a holding penalty on the Raiders that negated a third pick that Roethlisberger carelessly tossed into the end zone. - Antonio Brown (9-82) dropped a deep pass on a third-and-15 in the fourth quarter that would've moved the chains. This forced Pittsburgh to punt, allowing the Raiders to bleed more time off the clock. ",
            "2": "The Steelers also struggled to run the ball. This isn't totally surprising because the Raiders have a surprisingly good run defense, but I thought Bell would have more success than gaining just 24 yards on 13 carries. Luckily for his fantasy owners, he was able to find the end zone. ",
            "3": "The Raiders, meanwhile, ran all over Pittsburgh until late in the game when Dick LeBeau's defense stacked the box. Darren McFadden gained 73 yards and two touchdowns on 24 attempts. Pryor, meanwhile, scrambled nine times for 106 yards and a score, most of which came on that 93-yard scamper. Pryor actually didn't have a very good performance if that long run is excluded. He went 10-of-19 for only 88 yards and two interceptions. He did endure a drop and did a good job of avoiding some sacks, but one of his picks was awful. He showed terrible mechanics, failing to set his feet as he threw across his body. The result was an overthrow that sailed right to Troy Polamalu. Pryor completed just three passes after halftime, as the Raiders were stuck on 21 points in the final two quarters. ",
            "4": "Only one Raider had more than two receptions. That would be Rod Streater (4-45). Denarius Moore had just two catches for 32 yards. ",
            "5": "As for the Steeler wideouts, Emmanuel Sanders actually outgained Brown, catching seven balls for 88 yards and Roethlisberger's only touchdown. Heath Miller didn't do much (3-19), and his only highlight was a near-fumble in which he took a fierce hit to his knees. ",
            "6": "A big fight broke out in the second quarter. Several players on both sides got into a scrum, but amazingly, no one was flagged. However, this allowed the old CBS announcers to reminisce about the good old days when the Steelers and Raiders were bitter rivals. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "No one could've imagined the Falcons struggling like this, but at 2-5, their season is pretty much over. Of course, their 2013 campaign went up in flames when many of their key players went down with injuries. Beginning with the offense, Matt Ryan simply doesn't have much to work with. Julio Jones and Roddy White were out, so outside of Tony Gonzalez, whom Arizona took away (Patrick Peterson even covered him on some occasions), Ryan didn't have any potent targets to throw to. Harry Douglas (12-121) and Drew Davis (5-77, TD) both posted solid stats, but a majority of their numbers came in garbage time, and they just couldn't consistently separate from coverage. The Falcons' biggest concern was pass protection. The Cardinals brought Ryan down on four occasions, but that doesn't tell the whole story. Ryan was constantly under pressure, and he actually looked very skittish in the pocket. As a result, he went 34-of-61 for 301 yards, one late touchdown and four interceptions. Three of the picks were ugly. Ryan didn't see stud inside linebacker Daryl Washington on one of the give-aways. Another was a careless heave downfield. A third was underthrown. The fourth came with three minutes remaining as a desperation heave. ",
            "2": "Ryan didn't get any help from his running game for two reasons. First, Steven Jackson (11 carries, six yards) was definitely not 100 percent. He shouldn't have played. Second, the Cardinals sold out against the rush until they established a big lead. They simply didn't respect Atlanta's aerial attack because of the Falcons' shoddy offensive line and shaky downfield targets. ",
            "3": "On defense, the Falcons simply didn't have the personnel to contain Arizona's offense. Rookie running back Andre Elliington went nuts, gaining 154 yards and a touchdown on 15 carries, highlighted with an 80-yard burst in the second quarter. He didn't handle all of the work - fellow rookie Stepfan Taylor gained 38 yards on 14 tries - but the fact remains that Arizona did not miss Rashard Mendenhall whatsoever. Mendenhall is (was?) the worst starting running back in the NFL, save for Willis McGahee. The Cardinals would be wise to ditch Mendenhall completely and roll with the Ellington-Taylor tandem. ",
            "4": "Carson Palmer got off to a shaky start, overthrowing a wide-open Larry Fitzgerald. However, he snapped out of it and went on to misfire on only five attempts, going 13-of-18 for 172 yards, two touchdowns and an interception. Fitzgerald, meanwhile, didn't have a great statistical performance - he caught four balls for 48 yards and a score - but the key note is that he hauled in his 800th career reception, becoming the youngest player to do so in league history. ",
            "5": "Palmer's other touchdown went to Michael Floyd (3-30). His longest completion went to newly acquired Teddy Williams, who hauled in a 51-yarder. Williams, a converted corner, has amazing speed, but happens to be a project. It'll be interesting to see if Arizona can develop him into being a deep threat for the big-armed Palmer. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: My condolences to anyone who took the Redskins +11. As someone who had two units on Denver, I'll admit the Broncos were lucky to cover after being down 21-7. When they made their comeback charge, I was convinced they'd win by seven or 10. I never imagined they'd cover convincingly. ",
            "2": "Washington was up 21-7 after a DeAngelo Hall pick-six of Peyton Manning in the third quarter. It looked like it could pull off a big road win, but its offense and defense went limp as Denver rattled a string of touchdowns and takeaways. The Broncos went into beast mode and dominated the Redskins with 38 unanswered points. The first half was mostly a defensive strugle. The Broncos' first drive carved up the Redskins to move the ball down the field and Manning threw a short touchdown pass to Wes Welker (6-81). For most of the first half, the teams were trading punts. Alfred Morris (17-93) was running well in the first half including a run of 27 yards to get Washington out of being backed up. Griffin had a big third-down conversion on a pass to Roy Helu (5-11 rushing, 1-14 receiving). Santana Moss dropped a touchdown on a third down, but on the field goal set-up, Denver had 12 men on the field. That gave the Redskins a first down at the 7-yard line. The next play Griffin threw a bullet to Leonard Hankerson (1-7) for six. Early in the third quarter, Ryan Kerrigan came around the edge to hit Manning's arm and force a fumble. Brian Orakpo recovered the fumble at the Denver 19-yard line. Morris ran the ball in on a few plays to give Washington a touchdown lead. The next play from scrimmage saw Manning get pick-sixed by Hall. Demaryius Thomas (7-75) fell down and the ball floated right to Hall. He coasted into the end zone from 25 yards out. Manning answered with a drive down the field that was capped off with a short touchdown run from Montee Ball (11-37). The Broncos' next drive went down to the 1-yard line. On fourth-and-goal, Manning hit Joel Dreessen (2-9) for a touchdown to tie the game. Sav Rocca soon shanked a punt, which set up Denver at Washington's 35-yard line. The next play was a perfectly called and executed screen pass to Knowshon Moreno. He bolted down the field and weaved his way into the end zone for a go-ahead touchdown. Moreno had a big game with 14 carries for 44 yards, six receptions for 89 yards and that score. Von Miller then made his presence felt with a strip-sack that was recovered by Derek Wolfe at the Redskins' 24-yard line. That led to a field goal. The Broncos got the ball back and were driving for more points when E.J. Biggers dropped an interception, but Jordan Pugh caught the deflection. Griffin gave it right back two plays later as Pierre Garcon fell down and the pass was caught by Chris Harris. Denver put the game on ice with a Demaryius Thomas 35-yard touchdown on short pass. Griffin was hammered and had a pass flutter to Rahim Moore for his second interception. Manning gave it right back when DeAngelo Hall ripped the ball out of the hands of Thomas for an interception. Kirk Cousins came in to finish out the game and threw a pick-six to Dominique Rodgers-Cromartie. Shaun Philips added an interception in garbage time. ",
            "3": "Manning finished completing 30-of-44 for 354 yards with four touchdowns and three interceptions. ",
            "4": "Griffin was 15-of-30 for 132 yards with a touchdown and two interceptions. Jordan Reed (8-90) led the Washington receivers. Pierre Garcon (7-46) and Griffin came close to some long completions, but their timing was off - in part because of the Denver pass rush. ",
            "5": "Terrence Knighton had a sack and a lot of pressures for the Broncos. Danny Trevathan picked up 10 tackles and a forced fumble. Von Miller also played well. Wolfe had a huge sack coming up the middle. ",
            "6": "For the first three quarters, the Redskins' defense played pretty well. The defenders didn't get help from their offense when they needed it, and the game spiraled out of control. Rob Jackson picked up a sack. Perry Riley (10 tackles), Ryan Kerrigan and Bacarri Rambo (9 tackles) all played well. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "31"
        },
        "comments": {
            "amount": "4",
            "1": "I hate to lead off with something Al Michaels and Cris Collinsworth harped on, but what the Packers did on third (and fourth) down in this contest was amazing. They converted 13-of-18 third downs and 2-of-2 fourth downs. That means Minnesota's beleaguered defense stopped Green Bay on just three occasions. The Packers' offense is just too dangerous right now despite the absence of James Jones, Randall Cobb and Jermichael Finley. That's because both their ground and aerial attacks are so lethal. Eddie Lacy is such a tough runner, and the opposition can't concentrate on him with Aaron Rodgers being a great threat, even without three of his top four targets. Rodgers kicked things off by leading his team down the field after a Cordarrelle Patterson 109-yard kickoff return touchdown. The Packers converted four third downs, ultimately capping off their opening possession with a Rodgers touchdown to Jordy Nelson. Green Bay would end up scoring on its next eight possessions, including a Micah Hyde punt return. Rodgers misfired on just five passes, finishing 24-of-29 for 285 yards and two touchdowns, both of which went to Nelson (7-123). He also had six scrambles for 31 rushing yards. It's amazing that he's so productive while throwing to guys named Jarret Boykin, Myles White and Andrew Quarless. Three other Packers had more than two receptions: Boykin (5-89), White (5-35) and Lacy (4-18). Speaking of Lacy, the powerful runner gained 94 yards on 29 carries. He's such a tough runner, as he broke numerous tackles and carried Minnesota defenders around. James Starks chipped in with 57 yards on seven attempts, including a score of his own. ",
            "2": "As for the Vikings, there will be more speculation that the concussed Josh Freeman will have to take over for Christian Ponder next week. Ponder wasn't terrible, but he's just not very good. His numbers - 14-of-21, 145 yards with five scrambles for 38 rushing yards and a score - aren't indicative of how he played. His rushing touchdown came in garbage time, and he missed several receivers, including an open Greg Jennings downfield. Ponder also had a potential pick-six that was dropped. Jennings, meanwhile, had a dreadful outing, catching only one ball for nine yards. Ponder misfired to him on one instance because of a miscommunication. Jennings drew a bogus pass interference in the second quarter, but drew boos from the crowd following another incompletion. The only question: Who was jeering him? Was it the Minnesota fans who have been disappointed with him, or was it the Green Bay backers (there were many of them in the Metrodome), who were heckling their former receiver for foolishly choosing a bit more money over his career? Jennings whispered something into Rodgers' ear for about two minutes after the game concluded. Rodgers didn't reveal what he said, but I'll have all the answers in my NFL Power Rankings page Tuesday morning, thanks to my super-awesome spy skills. ",
            "3": "Adrian Peterson managed only 60 yards and a touchdown, but ran violently. He simply didn't get many opportunities (13 carries) because the Packers controlled the clock and didn't give the Vikings a chance to possess the ball. Peterson also had three catches for 23 receiving yards. ",
            "4": "Kyle Rudolph caught four passes for 51 yards, including a great leaping grab. Patterson, who had the aforementioned kickoff return for a touchdown, caught two balls for 26 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "9"
        },
        "comments": {
            "amount": "4",
            "1": "It was astonishing to me that the Seahawks put forth zero effort in this game. Sure, they were favored by nearly two touchdowns, but this was a divisional matchup. They showed up to play Arizona last week, so why were they so lethargic in this contest? It was extremely disappointing to see this piss-poor effort from the supposed top team in the NFL. The Seahawks showed no interest in doing many things. This includes... - Blocking. The Rams sacked Russell Wilson seven times. It's not like the offensive line was extremely overwhelmed or anything; the players just didn't even bother to block sometimes. St. Louis had free rushers heading right for Wilson on way too many occasions. As a result, both Robert Quinn and Chris Long collected three sacks. I have no idea why the Seahawks barely designed any runs for Russell Wilson. He scrambled just three times; two runs were at the goal line, so it was pretty much nothing in between the 20s. The poor blocking extended to the ground game. Marshawn Lynch had absolutely no running lanes to burst through even though St. Louis was ranked 28th against the run in terms of YPC heading into the weekend. Lynch was limited to 23 yards on eight carries. - Catching. Russell Wilson went 10-of-18 for 139 yards and two touchdowns, but was victimized by some drops. Wilson was also hurt by Sidney Rice's absence. The soon-to-be former No. 1 wideout injured his knee in the first half. - Tackling. Zac Stacy rushed for 134 yards on 26 carries. The Seahawks allowed 151 rushing yards to their previous three opponents - COMBINED. Yet, Stacy was somehow able to nearly match that himself. Daryl Richardson chipped in with an 8-39 line, looking competent for the first time all year. Seattle just showed no interest in bringing down either back. - Covering. The Seahawks came away with two interceptions and nearly had a couple more, but there were some instances in which the Seattle defenders simply fell down. The whole thing was inexplicable, and it would make any conspiracy theorist believe that Seattle shaved points to make sure St. Louis stayed within two touchdowns. - Playing clean. Seattle had a ridiculous amount of penalties in this contest. Some were bogus - a shady defensive hold on a third-and-16 set up a St. Louis field goal - while some were absolutely dumb. The Seahawks were repeatedly whistled for helmet-to-helmet hits on defenseless receivers. They had 10 infractions in total. Despite all of this, the Seahawks held on for a victory, as St. Louis offensive coordinator Brian Schottenheimer asked Kellen Clemens to pass on fourth down when his offense had been running the ball effectively on Seattle's lethargic stop unit all evening. ",
            "2": "Clemens wasn't very good. He went 15-of-31 for 158 yards and the aforementioned two picks, both of which were ugly. He was fortunate that Seattle dropped a couple more interceptions. He also lost a fumble that dribbled out of bounds. ",
            "3": "Chris Givens led St. Louis with four catches for 59 yards. Tavon Austin (2-9) and Jared Cook (3-31) disappointed yet again. Cook sucks, as he has been a predictable disappointment. ",
            "4": "Some Seattle numbers: Most of Wilson's yardage came on a 80-yard score to Golden Tate, who stupidly taunted the Rams by waving his hand while running into the end zone. The penalty didn't cost the Seahawks, however. He finished with five grabs for 93 yards. Tate was the only other Seahawk besides Zach Miller (2-14) to record more than one reception. Second-year Bruce Irvin recorded nine tackles, a sack, an interception and a forced fumble. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "13"
}