{
    "year": "2013",
    "week": "12",
    "Game 1": {
        "Team 1": {
            "Name": "Saints",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "The Saints had the Seahawks and Panthers coming up after this contest, so they weren't exactly completely focused for this matchup. The Falcons, meanwhile, called this game Super Bowl Thursday and gave out flags with Rise Up written on them to all of the fans. With their season in the toilet, all Atlanta could hope for was to derail a potential New Orleans Super Bowl run. Giving the Saints their third loss would take them out of the running for homefield advantage, after all. Even though New Orleans was sleepwalking and Atlanta was trying extremely hard, the former still prevailed, albeit in ugly fashion. ",
            "2": "The Saints had major issues stopping Atlanta's offense. The Falcons generated 355 net yards and 22 first downs (compared to 19 by New Orleans), and were successful on 6-of-12 third-down conversions. Matt Ryan, who has been extremely turnover-prone of late, was razor-sharp, letting the ball hit the ground just nine times as he completed 30-of-39 passes for 292 yards. He nearly had a touchdown, but one of his receivers was tackled inches short of the end zone on the opening drive. Ryan spent most of the night targeting beleaguered cornerback Corey White, who was starting in place of the injured Jabari Greer. Though he had a great game, he had two interceptions dropped and took some heat for sliding down four yards short of the end zone on third-and-goal. The crowd booed him, as it thought he had a chance to score. Ryan probably wouldn't have found the end zone, but a greater effort could've set up a fourth-and-goal situation inside the 2-yard line, so that negated a possible touchdown. Ryan was also betrayed by his offensive line (five sacks allowed) as well as one of his young receivers. He constantly threw to SMU rookie Darius Johnson, who caught six balls for 67 yards. Johnson had a brilliant first half, but dropped a big third-down pass in the third quarter that would've moved the chains and then lost a fumble inside the red zone during the early stages of the final period. ",
            "3": "Ryan's usual suspects didn't do much. In fact, Tony Gonzalez didn't catch his first pass until around the 2-minute warning at the end of the opening half. Gonzalez finished with four grabs for 43 yards, while Roddy White was an even greater disappointment (2-24). Harry Douglas paced the team with nine catches for 79 yards. ",
            "4": "The Falcons had a ton of success running the ball early in the game. Steven Jackson rushed for 37 yards and a touchdown on just nine carries in the opening half, but had a meager 7-26 line following intermission. ",
            "5": "As for Drew Brees, he had one more misfire than Ryan, going 23-of-33 for 278 yards and a pair of touchdowns. Despite the completion percentage, Brees was unusually inaccurate, missing some throws he would usually hit. He also had a dropped interception in the end zone. Brees was hurt a bit by injuries, as Darren Sproles and Pro Bowl guard Jahri Evans were both of the lineup. Brees' scores went to Ben Watson and Jimmy Graham (5-100), who beat a safety on a double move. Upon reaching the end zone, Graham dunked the ball so hard that he made the uprights crooked in the process. There was 3-minute delay because someone had to straighten it out with a huge level. It was funny, but the officials probably should've flagged Graham with a delay-of-game penalty. ",
            "6": "Pierre Thomas had a huge outing in the wake of Sproles' absence. He rushed for 73 yards on just 10 carries to go along with five catches for 57 receiving yards. His best play was an 18-yard burst on a second-and-17 in which he held off a defender with an extremely impressive stiff-arm. ",
            "7": "On the flip side, Marques Colston struggled again. He had an underwhelming stat line - four catches, 40 yards - and he also disappointed his team with a drop deep in Atlanta territory. ",
            "8": "I picked Saints' defensive end Cameron Jordan to reach the Pro Bowl - click here for my - and he definitely did not disappoint, recording 2.5 sacks. Akiem Hicks chipped in with 1.5 sacks. Speaking of the Saints' defensive line, there was a hit on Matt Ryan in the second quarter that resembled the controversial penalty that Brees took last week against the 49ers. This one was worse and it actually deserved a flag, as Ryan was hit in the helmet. Interestingly enough, no flag was thrown. What is it with the Saints and always benefiting from these sorts of hits? "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "3"
        },
        "comments": {
            "amount": "5",
            "1": "So much for that win-loss-win-loss dynamic. The Jets, losing after a defeat for the first time all year, put together one of the most pathetic offensive performances we've seen all year. Here are some of the lowlights: - At the 11:13 mark of the fourth quarter, Geno Smith was 4-of-15 for 42 yards and an interception. It seems like he hits a new low each week. - The Jets, at that point in the game, were just 1-of-12 on third downs. They achieved three first downs in the opening half. - New York was outgained, 212-73, in the first half. The team mustered only 137 net yards at that aforementioned point in the final period. - Greg Salas was the only Jet receiver to finish with more than one catch. He logged two receptions for 48 yards. I listed Smith's numbers at that particular stage because he compiled some junk yardage in the final few minutes when the Ravens stopped caring. He ultimately finished 9-of-22 for 127 yards and two picks. He also caught a 13-yard pass on the second drive, as New York showed tons of Wildcat formations early on, with Joshua Cribbs taking plenty of snaps. Cribbs went 1-of-2 for 13 yards and also had 20 rushing yards on five scrambles. Smith could be benched next week, by the way. Rex Ryan was non-committal on whether Smith would get the nod versus the Dolphins. ",
            "2": "The Jets didn't run the ball well. Both Bilal Powell and Chris Ivory had 17-yard scampers, but they mustered 11-41 and 9-35 lines, respectively. This wasn't a surprise, as the Ravens, who own one of the NFL's top ground defenses, welcomed back Haloti Ngata, who missed last week's contest. ",
            "3": "The Ravens struggled offensively as well, but they were obviously better than New York. The stats will show that Joe Flacco was solid - he went 17-of-26 for 273 yards, one touchdown and an interception - but he had an up-and-down afternoon. His pick came in the red zone, and he nearly had a second one deep in New York territory. On the flip side, he heaved a beautiful 60-yard bomb to Torrey Smith (2-74; one drop) to torch the struggling Antonio Cromartie. He also had a very impressive 12-yard completion on third-and-10 in the red zone to Dallas Clark as he was getting hit. Flacco's 60-yarder to Smith wasn't his longest completion. He heaved a 66-yarder to Jacoby Jones, who finished with four grabs for 103 yards and a score. New York hasn't been able to cover receivers all year. The secondary only had a few good plays, namely the aforementioned pick and a nice touchdown break-up by Ed Reed in the first half. ",
            "4": "On the other hand, the Jets have been excellent versus the rush this season. That would explain why Ray Rice regressed after trampling the Bears last week, gaining 30 yards on 16 carries. Bernard Pierce (11-30) wasn't any better. ",
            "5": "The Ravens matched the Jets with some of their Wildcat looks. Tyrod Taylor rushed for seven yards on four attempts. He misfired on one pass. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "11"
        },
        "comments": {
            "amount": "5",
            "1": "The Browns entering this game as a favorite at 4-6. They had a chance to end up with a tie with the Dolphins and Jets (and other 4-6 victors) for the final wild-card spot by the end of the day. Considering that Cleveland fans had some reason for optimism, it was only natural that not only would the team lose; it would see its quarterback leave the game with an injury. Jason Campbell was actually injured twice in this contest. He left the game briefly in the first half, but was ultimately knocked out on a fierce hit in the third quarter. The Browns were driving near midfield, but Campbell was strip-sacked by Troy Polamalu, and Pittsburgh returned it to the 4-yard line and ultimately scored a touchdown. Adding injury to insult, Campbell was carted off into the locker room, forcing Brandon Weeden to come into the game. And just like that, Cleveland lost what little hope it had. One of the announcers, not realizing that Cleveland was screwed, made this strange statement: The Browns need someone to make a play. Maybe Brandon Weeden can provide that spark. Yeah, OK. Weeden sparked the Steelers instead. He lost a fumble because he held the ball carelessly, and then he came back with a pick-six on an especially dumb throw. He would eventually get a garbage-time touchdown. He finished 13-of-30 for 209 yards, one score and the two turnovers. Campbell, meanwhile, wasn't terrible, but was an unspectacular 14-of-22 for 124 yards. He also had that aforementioned lost fumble. ",
            "2": "As for the team with actual playoff aspirations, Ben Roethlisberger was once again very sharp. He went 22-of-34 for 217 yards and two touchdowns, and he was even hurt by a Le'Veon Bell drop in the red zone. Roethlisberger's scores went to Antonio Brown and Emmanuel Sanders, both of whom logged six receptions. They had 92 and 52 receiving yards, respectively. Brown beat Joe Haden on his touchdown, and he had his way with him the entire afternoon. ",
            "3": "The only other Steelers with multiple catches were Heath Miller (5-41) and Bell (2-18). Speaking of Bell, he did a solid job running the ball (23-80), though he lost a short-yardage try near midfield to Jonathan Dwyer, who failed to convert. Mike Tomlin even challenged the spot, but the call wasn't overturned. ",
            "4": "This victory came at a price for Pittsburgh. Nose tackle Steve McClendon was knocked out of the game with an ankle injury. He left in the first quarter and didn't return. He's expected to be out for a few weeks. ",
            "5": "Some numbers for Cleveland: - Josh Gordon had a monstrous outing, catching 14 balls for a whopping 237 yards and a touchdown. However, much of this came in garbage time. All but 62 of Gordon's yardage came in the second half. - Another clunker for Jordan Cameron. The athletic tight end hauled in three catches for 32 yards. He had three drops, including one in the end zone. - Chris Ogbonnaya led the awful Cleveland running backs in rushing yardage, mustering 26 yards on four carries. However, he really cost his team with a lost fumble at midfield. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> I've been slotting a quarterback to the Buccaneers in my <b> </b> all season, but Mike Glennon's playing well enough to make me change my mind. Stay tuned for the next update on Tuesday. ",
            "2": "Once again, Detroit choked a game away. The Lions had a trap contest playing the Buccaneers four days before Detroit's battle against Green Bay on Thanksgiving. The Lions gave this one away because of a plethora of mistakes. They allowed five turnovers and a blocked punt to lose a game they should have won. Detroit started well when Jeremy Ross had a 44-yard punt return, but the drive ended when a deflected ball was intercepted by Lavonte David. Tampa Bay's drive was aided by a bogus hitting the quarterback low on Nick Fairley that gave the Bucs a first down after a third-down stop. Mike Glennon hit Tim Wright (8-75) for some chunk plays to move the ball into a short field goal. The Lions answered by moving into Tampa Bay territory thanks to a 28-yard screen pass to Nate Burleson (7-77). The drive ended with a bullet to Burleson for a short touchdown. Glennon later hit a 47-yard bomb to Vincent Jackson (2-61), and the Bucs took the lead with a short touchdown pass to Underwood. Detroit came right back with passes to Calvin Johnson to set up a short touchdown pass to Joseph Fauria. Just before halftime, Stafford threw a pick-six to Leonard Johnson, and Tampa Bay took a 17-14 lead into the half. Brandon Pettigrew made a terrible effort to catch the pass. In the third quarter, Stafford ripped the ball down the field to the take lead with a 23-yard touchdown pass to Pettigrew (3-32). Detroit's next possession started with a 41-yard run by Reggie Bush (15-83), but Stafford had an ugly overthrow in the middle of the field that was picked off by Keith Tandy. The Bucs took the lead when Glennon hit Underwood for an 85-yard touchdown as Chris Houston was burned on the play. It was a great throw by Glennon to hit Underwood on the run. The Bucs then blocked a Lions punt to take over at Detroit's 10-yard line, but Tampa Bay lost yards and missed a 24-yard field goal. The Lions started moving the ball, but Kris Durham (3-46) fumbled the ball away to the Bucs. Detroit's defense came up clutch as Glennon took a sack from Willie Young and Ryan Lindell missed another field goal. On the final drive, Stafford moved into field goal range. He lofted a ball into Johnson (7-115) on a third-and-long. Megatron then had a catch inside the 5-yard line, but Tandy jarred it loose and Johnthan Banks was able to catch the deflection for an interception. ",
            "3": "Stafford was 26-of-46 passes for 297 yards with three touchdowns and four interceptions. The defense played well for Detroit, while the Lions' offense completely blew the game. Ezekiel Ansah beat Donald Penn for two sacks and Detroit's front seven played really well - the secondary let them down. ",
            "4": "Glennon was 14-of-21 for 247 yards with two touchdowns. Bobby Rainey was held to 35 yards on 18 carries. Lavonte David was phenomenal with 11 tackles, an interception and a forced fumble. ",
            "5": "Darrelle Revis left the game at halftime due to a groin injury. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Packers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "26"
        },
        "comments": {
            "amount": "7",
            "1": "The Vikings might just be the dumbest team in the NFL. They played extremely well for most of this game, but allowed Matt Flynn to come back and send it into overtime. They gave the Packers a field goal - which didn't clinch a victory per the new rules - because of some defensive penalties. The Vikings were given one possession to tie or take the lead. They drove down the field, but stalled in the red zone, thanks to a Cordarrelle Patterson dropped touchdown. Faced with a fourth-and-14 on the Green Bay 17-yard line, Minnesota kicked the tying field goal. I don't get it. There were four minutes remaining in overtime, so the likelihood of the Vikings generating another long drive were slim. Thus, they were essentially pretty much guaranteeing that there would be a tie. What's the point of a tie for Minnesota? Green Bay doesn't exactly mind it because the team is now just half a game behind Chicago and Detroit instead of being one back with a loss. But what does a tie do for the Vikings? They should have just gone for the touchdown. It would've been a win-win situation. Had they converted, it would've energized the team to perhaps spark a late run that could carry over into 2014. A loss would improve draft positioning. A tie does neither. ",
            "2": "The Packers were able to come back with Matt Flynn. I don't understand how Flynn can play so terribly elsewhere, yet thrive in Green Bay. Flynn wasn't great or anything - he went 21-of-36 for 218 yards and a touchdown to go along with four scrambles and 24 rushing yards - but he was much more effective than Scott Tolzien, who was 7-of-17 for 98 yards and a rushing touchdown (that featured a crazy spin move) before getting benched in the second half. Tolzien was victimized by a James Jones dropped touchdown in the first quarter - though it should be noted that Xavier Rhodes made a good break-up - but that was the only thing Tolzien could possibly point to if he wants to blame something else for his struggles. He was very ineffective in this contest against an awful Minnesota defense. ",
            "3": "Flynn may have been on the field, but Eddie Lacy was the one who sparked Green Bay's offense in the fourth quarter. The noodle-armed Flynn opted to check the ball down to Lacy much more frequently than Tolzien, and the results were tremendous. Lacy caught six balls for 48 receiving yards to go along with his 110 rushing yards and touchdown. Those numbers don't tell the whole story though, as Lacy ran extremely violently. In fact, one of the FOX announcers exclaimed, He's throwing Vikings defenders all over the place! ",
            "4": "Four Packers had more than three catches. I already mentioned Lacy. The others were James Jones (7-80), Jarrett Boykin (5-60, TD) and Jordy Nelson (4-58). ",
            "5": "Lacy wasn't the only back who had some fierce runs. Adrian Peterson powered his way for 146 yards and a touchdown on 32 carries, though he lost a fumble at midfield in the first half. Toby Gerhart also looked great, tallying 91 yards on just eight attempts. He was instrumental in Minnesota's game-tying drive in overtime. ",
            "6": "Christian Ponder had an average outing. He let the ball hit the ground just nine times, going 21-of-30 for 233 yards and a touchdown. He was lucky to get away with an interception, as Davon House dropped a pass thrown right to him. On the flip side, Ponder should've had a second score (the aforementioned Patterson drop) and he also saw another receiver (Jarius Wright) let the ball fall through his hands. ",
            "7": "Though Patterson cost Minnesota a victory, he also was the only Viking with more than three catches. He actually snatched eight balls for 54 yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "6"
        },
        "comments": {
            "amount": "3",
            "1": "The Jaguars are so inept that they can't even get losing right. They were in the driver's seat in the Teddy Bridgewater sweepstakes, yet they put the top pick in the 2014 NFL Draft in jeopardy with this senseless victory. The Texans, meanwhile, can now lose out and land the Louisville quarterback. They can even hire Cardinals' head coach Charlie Strong to help the franchise begin anew and move in a promising direction. Having said that, the Texans embarrassed themselves. They were outgained in the first half, 209-60, and they mustered only four first downs in the opening two quarters. ",
            "2": "I won't spend too much time on this game, because, who cares? There were three take-aways, as far as I'm concerned: - Maurice Jones-Drew still has some burst left. Jones-Drew has struggled for most of the year, and many called him done. However, what people have forgotten is that the former Pro Bowler is coming off a serious leg injury. He's still relatively young (28), so he could be even better in 2014 because he'll be two years removed from his malady. Jones-Drew gained 84 yards and a touchdown on 14 carries to go along with six catches for 60 receiving yards. - Speaking of injured running backs, Ben Tate mustered just one yard on seven carries. He was benched at halftime. Dennis Johnson took over and gained 74 yards on 13 carries. - Case Keenum is not a legitimate starter. Going up against a dreadful secondary, Keenum went 18-of-34 for 169 yards and an interception that was really Keshawn Martin's fault. However, Keenum took another one of his trademark horrible sacks, losing a ridiculous 19 yards on one take-down. He was also extremely inaccurate throughout the entire afternoon. ",
            "3": "Some noteworthy stats: - Chad Henne went 23-of-32 for 239 yards. A big chunk of his yardage came early on when he hit Ace Sanders (4-61) for a gain of 51. - Cecil Shorts logged eight catches for 71 yards. He nearly scored a touchdown in the opening quarter, but was brought down inches short of the goal line as he was falling out of bounds. The CBS announcers actually thought Shorts scored and urged Gus Bradley to challenge the call, but they were wrong. - Andre Johnson was a disappointment, catching just two passes for 36 yards. DeAndre Hopkins (1-8) struggled as well. He was guilty of a drop on the team's final drive. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "38"
        },
        "comments": {
            "amount": "6",
            "1": "This was an extremely weird result based on how these teams have played all year. The Chargers typically find creative ways to lose close contests, while the Chiefs hadn't allowed more than 17 points in any game prior to last Sunday's tilt against the Broncos. So, how did San Diego muster 41 points, thanks to Philip Rivers' 78-yard, game-winning touchdown drive? Well, as I always say, the hardest thing for coaches to do is to make in-game adjustments for key injuries. Kansas City suffered two big losses in this contest, both in the second quarter, and both at the same position. Stud pass-rushers Tamba Hali and Justin Houston exited with ankle and elbow maladies, respectively. Rivers didn't have much time in the pocket beforehand, but he suddenly had so much room to breathe. In fact, Rivers wasn't even sacked until there were 31 seconds remaining in regulation. Rivers was awesome, going 27-of-39 for 392 yards and three touchdowns. His only real blunder was a near-interception in the fourth quarter that was thrown into the end zone. He also made a minor mistake when he missed Keenan Allen in the end zone for a potential touchdown in the first half. ",
            "2": "Speaking of Allen, the rookie wideout was dominant. He caught a whopping nine balls for 124 yards. He made an error in the opening quarter when he caught a pass that would've moved the chains, but went backward and danced around for a bit. He was down short of the first-down market, yet head coach Mike McCoy made a dumb decision to challenge the spot. ",
            "3": "Allen didn't catch a touchdown. The Chargers who did were Ladarius Green (3-80), Danny Woodhead (4-45)and Seyi Ajirotutu, who hauled in the game-winner. Woodhead also scored on the ground, compiling 25 rushing yards on six carries. ",
            "4": "Ryan Mathews found the end zone as well, gaining 55 yards on 14 carries. However, he was knocked out of the game in the third quarter with a hamstring. ",
            "5": "As for the Chiefs, they moved the chains extremely well all afternoon. They compiled 26 first downs and 395 net yards. The Chargers simply had no answer for Jamaal Charles, who ripped off 115 yards and two touchdowns on just 14 carries. He also caught four balls for 42 receiving yards. His one mistake was a drop in the end zone, but he came back to score on the same possession. ",
            "6": "Alex Smith had a very solid outing, going 26-of-38 for 294 yards, three touchdowns and an interception on an overthrow. Smith took more shots downfield than usual and even had a terrific back-shoulder scoring pass. Before anyone gets excited, they must remember that Smith battled the worst defense in the NFL, but this was a strong performance nonetheless. Smith's touchdowns went to Donnie Avery (4-91), Dwayne Bowe (5-51) and Anthony Fasano (4-21). "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "comments": {
            "amount": "3",
            "1": "I'm still not sure how the Dolphins blew this game. Everything was going their way. They were up 16-3 near the end of the first half. They blocked a field goal in the first quarter. They were getting tons of pressure on Cam Newton, who was so rattled that he forced an interception. Newton eventually had an injured finger that was looked at by the training staff. The Dolphins, meanwhile, had Mike Wallace torching Captain Munnerlyn. The only break they didn't catch in the first 30 minutes was a flag that was picked up on a helmet-to-helmet hit on Rishard Matthews. As was the case Monday night, the officials picked up the flag even though there was a blatant penalty on Luke Kuechly. Scott Green was the referee who screwed up this time. It's really amazing how things changed in the second half. Newton put together a brilliant final drive, going 5-of-7 for 34 yards and a touchdown along with an 8-yard scramble, highlighted by a Newton-to-Steve Smith conversion on fourth-and-10. Newton finished 19-of-38 for 174 yards, two scores (one passing, one rushing) and 51 yards on the ground on eight carries. Meanwhile, Ryan Tannehill started to struggle following the break. He completed 16-of-23 attempts in the second half, but mustered only 107 yards in the process. He missed Wallace on two deep shots, but he can't get all of the blame; he heaved what should've been a long touchdown right into Wallace's hands, but the speedy receiver flat-out dropped the pass. Wallace finished with five grabs for 127 yards and a score, but that final drop cost his team a victory. The problem for the Dolphins is that they couldn't run the ball, so they weren't able to bleed the clock. Tannehill actually led the team in rushing yardage by a wide margin; he had 36 yards on four scrambles, while Lamar Miller (10-8) and Daniel Thomas (3-8) combined for half of that total. Miller did at least catch four passes for 39 receiving yards. Thomas, meanwhile, was knocked out of the game with an ankle. ",
            "2": "The Panthers also struggled to move the chains on the ground. DeAngelo Williams and Jonathan Stewart each had 31 rushing yards on 10 and seven carries, respectively. ",
            "3": "Smith, who had the aforementioned big fourth-down conversion, led his team with 69 receiving yards on five catches. Curiously, shutdown cornerback Brent Grimes was covering Ted Ginn (3-11), who dropped a deep pass. Greg Olsen (5-34) caught Newton's sole aerial touchdown at the very end of the game. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Rams",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "Chicago fans have to feel depressed that their stop unit is so inept. This franchise has always been built on defense, but to allow a 42-point outing to Kellen Clemens is almost unforgivable. OK, so the Bears' defense didn't exactly surrender 42 points. One early touchdown happened because Matt Forte lost a fumble inside his own 10-yard line. Another occurred on a Josh McCown strip-six in desperation time. Still, Chicago surrendered 406 net yards of offense to the Rams. Even with all of the injuries, this should not happen. The Bears fell behind early, thanks to a Tavon Austin 65-yard fake reverse and the aforementioned Forte turnover. This allowed the Rams to lean heavily on the run, which is one area Chicago's defense fails miserably. Zac Stacy rumbled for 87 yards and a touchdown on just 12 carries, but left early because of a concussion. Benny Cunningham stepped in and was able to pick up where Stacy left off; Cunningham gained 109 yards and a score on 13 attempts. ",
            "2": "St. Louis didn't have to ask Clemens to do much. This was a good thing, as Clemens couldn't even complete half of his passes. He went 10-of-22 for 167 yards and a touchdown to Jared Cook. Cook happened to lead the Rams in receiving by a wide margin. In fact, he was the only St. Louis player with more than two catches. He logged four receptions for 80 yards and Clemens' sole aerial score. Cook also drew a pass-interference lag in the end zone, though the throw should've been deemed uncatchable. Jerome Boger was just simply too inept to realize that. ",
            "3": "As for the Bears, they moved the chains well - they actually outgained St Louis by 18 net yards - but they kept making dumb mistakes. I mentioned the Forte and McCown fumbles earlier. Also included were: - An impressive Forte touchdown run featuring multiple cuts and a spin move nullified by penalty. - McCown's errant throw toward an open Michael Bush for a touchdown. - Four(!) Bush stuffs at the goal line. - A key Brandon Marshall drop. - A holding penalty that nullified a kickoff return for a touchdown that had the Chicago fans in the stands chanting bulls***. - A Martellus Bennett touchdown, also brought back by a penalty. - A McCown interception (he went 36-of-47, 352 yards, two touchdowns, two turnovers). - Wasted timeouts and delay-of-game penalties. As you can tell, Chicago wasn't particularly prepared to play this game. ",
            "4": "Bennett (4-62) eventually found the end zone, as did Marshall (10-117). Alshon Jeffery had a disappointing outing with just four grabs for 42 yards, though he had a 27-yard run wiped out by a questionable hold. ",
            "5": "I've mentioned Forte a lot already. He managed 77 yards on 16 carries to go along with seven catches for 40 receiving yards. He seemed to suffer an injury in the second half when he was tackled awkwardly, but he returned to the field shortly afterward. ",
            "6": "There was a humorous event in this game. There was a scrum in the first half. Chris Long, who was standing on the sideline, randomly ran onto the field and attacked his brother, Kyle. Chris probably was dying to do something like this all week. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "11"
        },
        "comments": {
            "amount": "4",
            "1": "Much is going to be made of this Indianapolis loss, but one of the reasons I had the Cardinals as my NFL Pick of the Month on my page was because this game meant absolutely nothing to the Colts. They wrapped up their division with a victory over the Titans two Thursday nights ago. They were also going up against their former interim head coach, who knew how to game plan against them better than anyone. Thus, we can conclude that Arizona is definitely not 29 points better than Indianapolis. Having said that, the Colts have big problems on both sides of the ball. Offensively, Andrew Luck has just one reliable receiver and zero pass protection. The Cardinals swarmed his backfield, and he simply couldn't do anything as a consequence. Luck was sacked only once, but that doesn't nearly tell the whole story. Luck had to force bad throws and escape pressure because of Arizona's strong pass rush. Making matters worse, Luck just couldn't get the ball to T.Y. Hilton because of Patrick Peterson's coverage. Hilton made five catches for only 38 yards. In fact, the only Colt with more receiving yardage than that was Coby Fleener, who logged four receptions for 55 yards and a garbage-time touchdown. Luck finished 20-of-39 for 163 yards, the score to Fleener and a pick-six that occurred because he was hit as he threw. Much of Luck's stats came in junk time; he was 6-of-15 for 42 yards and that interception in the first half. Facing the combination of Bruce Arians and one of the top defenses in the NFL, Luck simply had no chance. ",
            "2": "Defensively, the Colts can't stop the run or the pass. Carson Palmer was nearly flawless, going 26-of-37 for 314 yards and two touchdowns. His only mistake was a near-interception at the end of the first half, but he was prolific otherwise. He helped the team tally 27 first downs and convert 7-of-14 tries on third down. Both of Palmer's touchdowns went to Larry Fitzgerald (5-52) who nearly had a third score that was ruined by an uncalled pass interference penalty. Fitzgerald eclipsed 11,000 career receiving yards in the process, becoming the youngest player ever to do so. Randy Moss previously held the distinction. ",
            "3": "Rashard Mendenhall and Andre Ellington split carries almost evenly. Mendenhall had a good game for a change (13-54, TD), while Ellington once again was the better back, gaining 50 yards on just 10 tries. ",
            "4": "Some other stats: - Trent Richardson sucked again, mustering just 15 yards on seven carries. He tried a short-yardage attempt in the second half, but failed. I'm pretty confused as to why Donald Brown was given just three touches. - While Fitzgerald had the touchdowns, Michael Floyd led his team in both catches (7) and receiving yards (104). "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Titans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "16"
        },
        "comments": {
            "amount": "5",
            "1": "With the Dolphins and Jets both losing in the 1 p.m. frame, the winner of this contest was going to have control of the sixth seed in the AFC. How bad is this conference that something like that would be determined between a matchup between Ryan Fitzpatrick and Matt McGloin? But as odd as it sounds, the quarterback position was the least of either team's issues in this contest. The main reason Oakland lost this game was because Sebastian Janikowski whiffed on two field goals from 32 and 48 yards. Janikowski is highly paid and should be able to convert these sorts of kicks, but he cost his team a victory with these misses. The Titans, meanwhile, had issues with drops in the early going. They were guilty of three in the first half. Delanie Walker (5-46) had one, while Kenny Britt let two balls fall through his hands. I have no idea why Britt's still even on the field. Even one of the CBS announcers called Britt a waste of talent. Despite Tennessee's drops, Fitzpatrick let the ball hit the ground only 12 times, finishing 30-of-42 for 320 yards and a pair of touchdowns. He also rushed for 26 yards on five scrambles. Fitzpatrick was especially effective in the second half, going 16-of-21 for 185 yards and his two scores after intermission. ",
            "2": "Fitzpatrick's touchdowns were thrown to Justin Hunter (6-109) and Kendall Wright (6-103). It was nice to see Hunter break out, as the second-round rookie hadn't logged more than two receptions in any game before this one. Wright's afternoon as highlighted by a great catch on a pass thrown way behind him in the red zone. ",
            "3": "Chris Johnson couldn't find much running room, gaining just 3.7 yards per carry. He had 73 yards on 20 attempts. He also caught three passes, but couldn't get anything out of those, mustering just eight receiving yards. ",
            "4": "As for McGloin, the undrafted Penn State rookie went 19-of-32 for 260 yards, one touchdown and an interception. He had an issue with his throws being batted down at the line of scrimmage - this happened four times in the first half - but he made some very impressive passes. One that stood out was a throw that he gunned toward Rod Streater at the end of the first half for a 23-yard gain. McGloin has inexplicably shown more arm strength than he did at Happy Valley. McGloin's sole touchdown was thrown to Marcel Reece (5-14; 4-44), who was finally a big part of the offense. Streater led the team in catches (5) and receiving yardage (93). Mychal Rivera had just one catch for 10 yards. I'm noting him because he was the recipient of a very nasty Michael Griffin hit. Griffin would've been ejected if this were a college game. ",
            "5": "Rashad Jennings had another big outing, rushing for 73 yards on 16 carries to go along with four catches for 49 receiving yards. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> It's no surprise Tony Romo came through in the clutch. No, really. He's done that before. His issues, over the years, have been in Week 17 and beyond. It's not Week 17 yet. ",
            "2": "The Cowboys needed a win to keep pace in the NFC East, and Tony Romo came through with a clutch drive to get Dallas out of New Jersey with a win. In the weak NFC East, the Giants could start to entertain getting back into the playoff race, but this was a crushing loss to those hopes. In full disclosure, the first quarter wasn't seen as FOX showed the end of the Packers and Vikings games. During that time, Dallas got on the board with a fumble return for a touchdown by Jeff Heath. Orlando Scandrick stripped the ball out from Victor Cruz and Heath returned the ball for a touchdown. Eli Manning got the Giants on the board with a clutch conversion to Rueben Randle (3-64) and another gain via a penalty on Morris Claiborne. That set up a short field goal. Dallas answered with DeMarco Murray (14-86 rushing, 3-40 receiving) as he ripped off a few chunk runs including a 30-yarder. A screen to Lance Dunbar set up Romo to throw a rope to Jason Witten (4-37) for a 20-yard touchdown. A ridiculous penalty on Brandon Carr took away a fumble that Dallas recovered, and the Giants took advantage of the break. Brandon Jacobs (9-75) took the ball to the 5-yard line on a 36-yard run, but the Giants had to settle for a field goal. The Cowboys fumbled the ball away during the third quarter, but a questionable roughing-the-passer penalty on Mathias Kiwanuka negated the fumble. A few plays later, Romo threw a short touchdown pass to Witten. The Giants quickly answered with a 27-yard touchdown to Brandon Myers (3-39). He made a leaping catch along the sideline and was on the ground. but neither Bruce Carter or Heath tagged him down. Myers got up and ran 10 yards into the end zone. Manning moved the ball down the field as the fourth quarter wound down. A 22-yard pass to Cruz (2-27) set up the Giants inside the 10. Manning hit Louis Murphy (1-4) in the back corner of the end zone, and Andre Brown ran in the two-point conversion to tie the game at 21. In crunch time, Romo came through for Dallas. The Cowboys were in a third-and-long situation, but Romo hit Dez Bryant for 18 yards to move the chains. Another completion to Bryant (9-102) moved the ball into Giants territory. Passes to Miles Austin (1-17) and Cole Beasley (2-13) got Dallas in field goal range. One more completion set up a 35-yard field goal for Dan Bailey to knock home the game winner. ",
            "3": "Romo finished completing 23-of-38 passes for 250 yards with two touchdowns and an interception. ",
            "4": "Manning was 16-of-30 for 174 yards and two scores. Andre Brown was very impressive with 127 yards on 21 carries. The Cowboys' defense came up with timely stops. Jason Hatcher had two sacks and Barry Church contributed a good game. ",
            "5": "Cullen Jenkins led the Giants with two sacks. The interior of the Dallas' offensive line had some issues, but that unit did well overall on the edges. Jason Pierre-Paul was held to one tackle. ",
            "6": "An injury of note is Cowboys cornerback Morris Claiborne hurt his hamstring and missed the second half. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "31"
        },
        "comments": {
            "amount": "3",
            "1": "Tom Brady versus Peyton Manning XIV had so many crazy twists and turns, I don't even know where to begin. I don't think anyone even expected for this to have such a thrilling finish considering how terrible New England looked in the first half. The team trailed 24-0 at intermission, and it appeared as though Denver would easily run away with a victory. The Patriots didn't look like themselves in the first half. They killed themselves with so many mistakes. Here's the rundown: - Stevan Ridley lost a fumble in the first quarter that was returned for a touchdown. Ridley (4-14), who has chronic fumbling woes, wasn't seen or heard from ever again. - Tom Brady lost a fumble when Von Miller beat Nate Solder and forced a strip-sack. Miller had two sacks and that forced fumble. Brady bobbled the ball a bit again later, but was lucky enough to have it bounce right back into his hands. - LeGarrette Blount, getting first crack at the running back duties after Ridley was benched, also lost a fumble. He gained 13 yards on his two carries. Brandon Bolden (13-58, TD) took over permanently after that. - Danny Amendola (3-17) fell down on a third-and-5 to ruin a potential first-down conversion at the end of the first quarter. - Shane Vereen (eight catches, 60 yards) dropped a catch on what would've been a 25-yard gain. - Neither the play clock nor the game clock were working at one point in the opening half. This didn't have anything to do with the Patriots, obviously, but that's what sort of contest this was. Nothing was going right, and the Broncos were doing a great job of capitalizing. They were running the ball so well with Knowshon Moreno (37 carries, 224 yards, touchdown) that it seemed like the Broncos would win this matchup in a blowout. However, the game completely flipped after the break, and Denver began making all of the mistakes. This includes... - A number of injuries. The Broncos lost Dominique Rodgers-Cromartie and some other defenders. Rodgers-Cromartie, who got hurt on a Hail Mary attempt at the end of the first half, was really missed on the field. Consider Brady's numbers prior to DRC's injury (10-of-17, 81 yards) to what he posted afterward (24-of-33, 263 yards, 3 TDs). - Montee Ball (7-40) lost a fumble. As with Ridley, he disappeared. The Broncos used undrafted rookie C.J. Anderson instead. Anderson (3-16) looked good until bobbling a handoff in overtime. - Like Brady, Peyton Manning lost the ball but had it ricochet off the ground and back into his hands. However, Manning was also intercepted. Both quarterbacks actually got away with picks. Manning's potential second interception was wiped out because of a defensive hold, while Brady's was dropped by Wesley Woodyard. - Wes Welker (4-31), making his return to Foxboro, dropped several passes. He also was partly responsible for a muffed punt in overtime that sealed the victory for the Patriots because he signaled everyone to get away too late. Tony Carter didn't hear him right away, and the ball hit him. The Patriots recovered and drilled the decisive field goal. ",
            "2": "Brady finished 34-of-50 for 344 yards, three touchdowns and the aforementioned fumble. As mentioned, he was very sharp in the second half, but he missed Edelman for a score in the fourth quarter. Brady also repeated what he did last week when he charged off the field and yelled at an official. The refs missed a blatant pass interference in overtime, and Brady went berserk. In fact, he wasted so much time yelling at the zebras that he had to use a timeout. The drive concluded with a punt, but it ultimately didn't matter. Two of Brady's touchdowns went to Edelman, who had a monstrous outing with nine catches for 110 yards. Rob Gronkowski was also huge (7-90). ",
            "3": "Manning, meanwhile, finished 19-of-36 for 150 yards, two touchdowns and an interception. He didn't fare as well as Brady in the freezing, windy conditions, as many of his passes fluttered around. He had a great drive to tie the game, but struggled outside of that. Manning's scores went to Jacob Tamme (5-47) and Demaryius Thomas (4-41). Thomas, who dropped a pass in the first half, couldn't do much because Aqib Talib did a great job smothering him. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "49ers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "6"
        },
        "comments": {
            "amount": "5",
            "1": "Both teams were coming off multi-game losing streaks entering this contest. The 49ers rebounded strongly and have seemingly brushed off some of their issues. The Redskins, meanwhile, continue to look completely lost. Washington achieved just 10 first downs and converted 4-of-15 third downs, ultimately generating 190 net yards of offense. They had only a couple quality drives, but sputtered in the red zone. Robert Griffin, who blamed his receivers and coaching staff after last week's defeat at Philadelphia, once again did not play a good football game. He went 17-of-27 for 127 yards and a horrible interception that was forced downfield. Griffin was victimized by two bad drops from Pierre Garcon and Aldrick Robinson (the latter was a deep ball that should've been caught), but he struggled to move around - he scrambled six times for 22 rushing yards - and consequently took four sacks, which isn't close to indicative of the amount of pressure he faced throughout the evening. Aldon Smith, who had two sacks, looked great for the first time since his return. Ahmad Brooks also had a pair of sacks and numerous other tackles for loss. Brooks dominated the line of scrimmage. ",
            "2": "As for Colin Kaepernick, the second-year starter took a ton of flak from the ESPN analysts heading into this contest, but posted outstanding numbers. He went 15-of-24 for 235 yards and three touchdowns. He got away with what would've been a horrible interception in the second quarter when Perry Riley dropped a pass thrown right to him. Kaepernick had some overthrows as well, but played well overall. Then again, he was battling one of the worst defenses in the NFL, so he still has a lot to prove. Two of Kaepernick's scores went to Anquan Boldin, who caught five balls for 94 yards. Vernon Davis, who hauled in the third touchdown, had four grabs for 70 yards. Davis lost a fumble near midfield in the third quarter, but the Redskins got away with a face mask on Davis, which should have negated the turnover. ",
            "3": "The Redskins struggled to stop the run entering this contest, so it was a bit surprising to see them limit Frank Gore to 31 yards on 13 carries. What happened was that Washington placed eight men inside the box on nearly every play, daring Kaepernick to beat them downfield. Kaepernick made Washington's sorry secondary pay. ",
            "4": "Alfred Morris had more success finding running lanes, though he couldn't carry the ball very much because San Francisco had the lead throughout. Morris compiled 52 yards on 14 carries, while Roy Helu chipped in with 26 yards on seven tries. Morris lost a short-yardage try to Helu in the first half that was not converted. ",
            "5": "Excluding Helu's one catch for seven yards, only three Redskins logged receptions: Pierre Garcon (8-48), Josh Morgan (5-45) and Santana Moss (3-27). "
        }
    },
    "numberOfGames": "14"
}