{
    "year": "2013",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "Did the Dolphins know that there was a game going on this week? After all, they had just won their Super Bowl by knocking off the Patriots last Sunday, so perhaps they believed the season was over because they triumphed in the Big Game. It certainly looked that way, as Miami put forth very little effort in this AFC East battle. The Dolphins, as they have all season, played down to their competition, allowing Buffalo to come away with a shutout victory. Miami's offense mustered just 103 net yards of offense and a laughable six first downs. The issue was that the offensive line was completely overwhelmed by Buffalo's stout front (minus Marcell Dareus) in terms of both run blocking and pass protection. Ryan Tannehill never had a chance. He was sacked on third down on the team's two opening drives. He then was sacked on multiple third downs in most of the ensuing possessions, and he was ultimately brought down behind the line of scrimmage a whopping seven times. When Tannehill wasn't being pinned down, he had to throw the ball away under pressure. He took seven sacks, but it felt like 700 sacks, as Miami's offensive line completely embarrassed itself. Tannehill deserves some of the blame, however, as he was inaccurate all afternoon. He was eventually benched in favor of Matt Moore, who threw an interception right away. Tannehill came back in and then was yanked again, and Moore went on to toss another pick at the very end. Tannehill went 10-of-27 for 82 yards, while Moore finished 2-of-6 for 53 yards and two interceptions. ",
            "2": "With Tannehill being held to fewer than 100 passing yards, it's actually surprising that a Dolphin receiver managed to eclipse the 50-yard barrier. That was Brian Hartline (2-53), but only because of a garbage-time catch. Mike Wallace (4-38) was next on the box score. ",
            "3": "I mentioned that the Dolphins also had problems running the ball. Daniel Thomas received most of the workload, but mustered just six yards on nine carries. He repeatedly screwed up in pass protection, so I have no idea what Miami was thinking by sticking with him. Lamar Miller was more successful on his touches, but inexplicably received only three totes for eight yards. ",
            "4": "As for Buffalo, Thad Lewis completed his sweep of the Dolphins. He got the job done, but left some points off the board with a few mistakes. For example, he threw an interception because he threw off his back foot while under pressure. He also missed receiver Chris Hogan, who was wide open for a touchdown in the first half. Still though, Lewis was solid otherwise. He went 15-of-25 for 193 yards and the pick. He also showed some mobility, picking up 13 rushing yards. Lewis did all of this without three of his receivers. Stevie Johnson was out because of a death in the family. Robert Woods, who caught three balls for 70 yards, was ejected for throwing a punch. Marquise Goodwin, meanwhile, was knocked out with a knee injury. ",
            "5": "Buffalo had much more success running the ball. Fred Jackson had his first huge performance in quite a while, generating 111 yards and a touchdown on 19 carries. C.J. Spiller (20-77) didn't have as much luck, and he even was guilty of a bone-headed play at the end of the first half when he ran out of bounds as the Bills were trying to run out the clock. It appeared as though he gave a gift three points to the opposition, but the Dolphins were just too inept offensively to take advantage of that blunder. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Most assumed the Saints wouldn't be able to win this battle for first place in the NFC South because of their futility in road games, particularly those that are outdoors. Even though there was a torrential downpour in the second half, the elements didn't really play a factor in this outcome. After all, New Orleans held a three-point lead with about half a minute remaining in regulation, so it easily could have won this contest. The main reason Carolina was able to achieve a victory was the unbelievable amount of pressure it placed on Drew Brees. Brees was sacked six times in this game, which is a very high number considering how quickly he tends to release the ball. There were two major problems. First, new left tackle Terron Armstead couldn't handle Greg Hardy at all, allowing three sacks. And second, Brees held the ball too long on occasion because he couldn't find open targets. Jimmy Graham, who is usually dominant, struggled to break free of Luke Kuechly's coverage. Both Kuechly and Thomas Davis played out of their minds in this matchup. They each intercepted Brees once, with Kuechly's pick being the result of the quarterback not being able to step up in the pocket because of pressure. Kuechly did get away with pass interference on Graham in the red zone at one point during the first half, but something like this is a weekly occurrence for the stud linebacker. New Orleans still led despite all of this when the Panthers took over at their own 36 with 55 seconds remaining. The Saints strangely called three runs on the previous drive, barely mustering anything on the ground. It was a strange decision by the usually aggressive Sean Payton, who called for a failed fake punt and a successful onside kick earlier in the afternoon. Why run it three times when you have one of the top quarterbacks in the NFL at your disposal? It really makes no sense. At any rate, Cam Newton struggled throughout most of this game without Steve Smith, who injured his knee in the first quarter. Newton, however, made several clutch throws, ultimately culminating with a touchdown strike to Domenik Hixon for the decisive score. Like Brees, Newton took several hits in this contest - he was sacked four times - and was constantly limping off the field. But he got job done at the very end to clinch a first-round bye for his team. ",
            "2": "Newton finished 13-of-22 for 181 yards, one touchdown and an interception that was tipped in the red zone. He didn't do much on the ground, scrambling four times for only six yards. Without Smith at his disposal, Newton targeted Greg Olsen more than anyone else, but all the tight end could do was catch four passes for 35 yards. Ted Ginn (2-66) led the team in receiving, thanks to his 37-yard reception on the team's final drive. ",
            "3": "DeAngelo Williams scored Carolina's other touchdown. He was bottled up for most of the contest, but burst for a 43-yard touchdown after Davis picked off Brees. The Saints had been great defensively all afternoon, but the stop unit simply wasn't ready after the sudden change. ",
            "4": "The Saints, meanwhile, actually ran the ball well with Mark Ingram, who gained 83 yards on 13 carries. However, as mentioned, Ingram couldn't get anything on the ground on the crucial penultimate drive that didn't go anywhere. ",
            "5": "Despite all of the pressure, Brees went 30-of-44 for 281 yards, one touchdown and the two aforementioned interceptions. He had a solid outing considering the opposing defense and the elements, but his team simply left too many points off the board. Brees took a terrible sack in the red zone at one point. Right tackle Zach Strief was whistled for a horrible personal-foul penalty in which Quintin Mikell flopped. This disrupted a promising drive. ",
            "6": "Carolina losing Smith wasn't the only injury to occur in this contest. The Saints also saw star rookie safety Kenny Vaccaro leave the game with a left leg injury. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "It's amazing how much better Cincinnati is at home. Following a blowout loss at Pittsburgh, the Bengals almost had to win this game, or they would've been in danger of completely missing the playoffs with a loss to the Ravens in Week 17. They got the job done, completely demolishing a Minnesota squad that had been playing extremely well despite its 4-9-1 record. Of course, the Vikings made things extremely easy for the Bengals. Despite receiving great field position throughout the first half, they couldn't generate any sort of offense. Making matters worse, they gave free possessions to Cincinnati. Matt Cassel was strip-sacked on the first drive at midfield, which led to a BenJarvus Green-Ellis touchdown. Cassel then hurled a pick-six right to emerging linebacker Vincent Rey. He followed that up with an attempted deep shot that just died in the air and was consequently picked off. While the Vikings were screwing up offensively, the Bengals were doing whatever they wanted to whenever they had the ball. Minnesota's awful secondary offered no resistance, allowing Andy Dalton to complete 27-of-38 attempts for 366 yards and four touchdowns. The Vikings looked completely helpless trying to cover A.J. Green, who scored twice while snatching seven balls for 97 yards. Dalton's other scores went to Mohamed Sanu (4-35) and Jermaine Gresham (3-49), who lost a fumble at midfield in the opening quarter. Marvin Jones also had a big game with six catches for 85 yards. ",
            "2": "As mentioned, Green-Ellis scored, but he didn't have a successful outing otherwise, mustering only 24 yards on 12 carries. Giovani Bernard also struggled to get anything on the ground (13-20), but he chipped in with 47 receiving yards. ",
            "3": "The Vikings were absolutely demolished, but this might be the best thing that could've happened to them. Not only did their draft positioning improve; they also could be forced into selecting a quarterback in the first round. Cassel had played well entering this contest, so there was some speculation that they could draft a signal-caller on Day 2 while Cassel held down the fort until the rookie was ready. However, Cassel was finally exposed by a great defense. His final numbers (13-of-27, 114 yards, one touchdown, three interceptions and a lost fumble) don't describe how poorly he played in this contest. ",
            "4": "Adrian Peterson couldn't get anything going on the ground. He rushed for 45 yards on 11 carries. Minnesota did have a rushing touchdown, but that came via Cordarrelle Patterson. ",
            "5": "Cassel's lone aerial score went to Jarius Wright, who found the end zone because a Cincinnati defensive back fell down. Greg Jennings, who had been playing well with Cassel, caught four balls for only 27 yards. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "All of the talk about this game will center on Peyton Manning's record-breaking stats. Manning managed to break Tom Brady's single-season mark for touchdowns when he threw his 51st to Julius Thomas in the fourth quarter. Manning entered this contest with 47 touchdowns, and while his tying 50th was controversial - Eric Decker was clearly bobbling the ball as he went out of bounds, but the officials didn't want to ruin history - he still managed to come back and throw a final score to Thomas to officially pass his arch rival on the all-time list. Thanks to his final stat line - 32-of-51, 400 yards and four touchdowns - Manning is now 265 yards shy of Drew Brees' single-season record for passing yardage. He should be able to eclipse that mark as well; the Raiders will offer very little resistance next week, and Manning will have to play because the Patriots beat the Ravens, meaning Denver will have to triumph in Week 17 to secure homefield advantage, barring a New England loss to Buffalo. ",
            "2": "However, all of this should be irrelevant. Manning has posted records and earned regular-season MVPs before, yet he's often come up short in the playoffs. His 2013 campaign will ultimately be measured by how successful he is beyond Week 17, meaning what happened in the first quarter of this contest is far more significant than Manning's flurry of touchdowns late in the game. On Houston's second possession, Von Miller went down with a knee injury. He would eventually walk off on his own power, but the Denver Post reported that the Broncos fear that the star linebacker tore his ACL. Miller will undergo tests on Monday. If he's out for the playoffs, it's highly unlikely that Manning will earn his second Super Bowl ring. As great as Manning has been this season, he probably won't be able to win if one of the league's best defensive players is sidelined. ",
            "3": "Miller's absence didn't have much of an impact on this contest because Matt Schaub was just so completely inept. Schaub failed to complete half of his passes, going 18-of-37 for 176 yards, one touchdown and two interceptions. Schaub was a mess. He missed an open Andre Johnson (4-63) for a touchdown in the first half. One of his picks was completely lazy, as he tried to force something that just wasn't there while rolling out of the pocket. He also fumbled following intermission, but his tight end, Ryan Griffin (5-66), pounced on the ball. ",
            "4": "Manning wasn't the only player to make history in this game. Andre Johnson became just the second player in NFL history to log 100-plus receptions in five or more seasons. Wes Welker was the first. ",
            "5": "The Texans couldn't run the ball at all without Ben Tate. Dennis Johnson started, but did nothing, mustering just 29 yards on 12 carries. ",
            "6": "Some stats/facts for the Broncos: - Manning wasn't picked, but Houston safety Shiloh Keo nearly had two interceptions. One was thrown right to his hands in the end zone, but he just dropped it. - Manning's aforementioned four touchdowns went to Decker (10-131), Demaryius Thomas (8-123) and Julius Thomas (6-78). Decker found the end zone on two occasions. - Knowshon Moreno didn't carry the ball all that much. He received just 11 totes, but did as much as possible with them, gaining 76 yards. He also caught two balls for 26 receiving yards. - Montee Ball had been a larger part of the offense recently, but he was limited to just 32 yards on four tries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Titans",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "comments": {
            "amount": "1",
            "1": "This was a game between a team ready to begin anew next year and another that is trying to build some momentum for 2014. Unfortunately, both of these squads are complete garbage, so I won't delve much into this game. Here are some key stats: <br. <br=> - Chris Johnson, who will probably be cut this offseason - I'll have my free agency rankings up earlier than usual this year - gained 90 yards on 22 carries on what appears to be the penultimate game of his Tennessee career. Shonn Greene outgained him by one yard on three fewer carries. He also scored. - Ryan Fitzpatrick went 17-of-26 for 181 yards, one touchdown and an interception. He wasn't very good early on, as he sailed a pass on fourth-and-goal at the 2-yard line. He also took some sacks, but eventually got his act together and led his team to victory. - Fitzpatrick's lone score went to Nate Washington (6-117). Only two other Titans caught more than one pass: Delanie Walker (4-35) and Kendall Wright (4-22). - Maurice Jones-Drew wasn't expected to play during the week, but he suited up. He handled most of the carries, but managed just 45 yards on 13 carries, though he did catches for 24 receiving yards. - Chad Henne surprisingly did well without Cecil Shorts, going 24-of-34 for 237 yards, two touchdowns and an interception. The scores went to Mike Brown (5-61) and Marcedes Lewis (4-50). - One of Henne's completions was fired to center Brad Meester. Playing for 14 years with the Jaguars, Meester announced that he would be retiring after this season, so this was his final home game. He received a standing ovation after his catch, which went for nine yards. It's a shame he couldn't get one more yard for that person who started him on their fantasy team! <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Colts",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "This was a sign of things to come for the Chiefs. They've accumulated lots of points recently against poor defenses, prompting ESPN people to cite ridiculous stats like Kansas City being ranked third in offense. The Chiefs still have a pedestrian Alex Smith paired with receivers who can't catch the ball and an offensive line that has trouble blocking at times, so it wouldn't have been a surprise if they had posted minimal production in a playoff lose in January. But a seven-point output against the Colts? That's pretty eye-opening. Smith was terrible against a defense that hasn't been able to stop anyone recently. His final numbers don't look too bad (16-of-29, 153 yards, two interceptions), but by the time the Colts made this a 23-7 score with 2:47 remaining in the third quarter, he was 10-of-18 for 79 yards and a pick. He generated some garbage yardage in the final frame, but ultimately tossed his second interception on an underthrown touch pass. Smith enjoyed so much success last week because the Raiders inexplicably had no idea that the Chiefs would be running screen plays. The Colts were more prepared for that, limiting Charles to 38 receiving yards on his five receptions. Charles did rush for 106 yards and a touchdown on 13 carries though, but he obviously couldn't do much more because his team trailed throughout. ",
            "2": "The Colts, meanwhile, played so much better offensively than they have in recent weeks. That's obvious just by looking at the result, but their offensive line performed extremely well. If Indianapolis' front can continue to play like this, the team will be a tough out in the playoffs because Andrew Luck is so good. Luck was sacked only once, while Donald Brown burst for a 51-yard gain in the first half immediately following a Knile Davis lost fumble. Having said that, Luck's supporting cast needs to improve as well. Luck nearly tossed an interception in the red zone during the opening quarter because Da'Rick Rogers (4-42) screwed up his route. LaVon Brazill then dropped a touchdown after Adam Vinatieri was uncharacteristically wide left from 34 yards, so this could've been an even greater victory for Indianapolis. ",
            "3": "Luck finished 26-of-37 for 241 yards and a touchdown. He nearly tossed a second pick that was actually his fault; Derrick Johnson has to be kicking himself because he let the ball sail right through his hands. ",
            "4": "It was no surprise that Trent Richardson was once again outproduced by his counterpart. While Brown gained 79 yards and the aforementioned score on just 10 carries to go along with two catches for 31 receiving yards. Richardson, meanwhile, plodded his way for 43 yards on 16 tries. ",
            "5": "Luck's college teammate, Griff Whalen, led the team in receiving with seven catches for 80 yards. T.Y. Hilton (5-52) was also a big factor. ",
            "6": "As for the Kansas City receivers, only three players logged more than one reception: Charles, Dwayne Bowe (5-46) and Donnie Avery (3-32). "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jets",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "Both of these teams were eliminated from playoff contention entering the afternoon, but this game did have postseason implications. A Cleveland victory would have ended Pittsburgh's season in some bizarre tie-breaking scenario. The Browns were ahead early, but thanks to numerous botched opportunities, the Jets were able to mount a comeback and keep the Steelers alive. It seemed like the Browns spent the entire first half in the red zone, yet they were able to muster just 10 points prior to intermission. They simply shot themselves in the foot with red-zone miscues, including three drops. Greg Little let the ball hit the ground despite getting a perfect pass thrown his way. Josh Gordon then dropped two touchdowns. ",
            "2": "The Jets, meanwhile, couldn't get anything going early on because they were too busy trying stupid trick plays that didn't work. They eventually got their act together, and the spark may have been something that occurred late in the second quarter. Geno Smith ran out of bounds after a scamper, and a Cleveland player shoved him when he was well out of the field of play. The official nearest to the action initially didn't throw a flag, which drew the ire of Rex Ryan. The Jets' coach looked like he was going to have a heart attack as he barked at the ref, and upon seeing a flag come in from elsewhere, he then went to the Cleveland defender and yelled at him. This seemed to energize the Jets - Smith in particular, who went 10-of-16 for 92 yards and two touchdowns following intermission. The rookie ultimately finished 20-of-36 for 214 yards and three touchdowns (two passing, one rushing) to go along with 48 rushing yards on 10 scrambles. ",
            "3": "Chris Ivory also ran well. He gained 109 yards on 20 carries. Bilal Powell chipped in with 54 yards on seven totes, most of which came on a 39-yard burst in the second half. ",
            "4": "As for the Browns, they had success early because Jason Campbell constantly targeted Gordon (6-97). I don't know what the Jets were thinking, but they elected to cover Gordon with Dee Milliner, who failed epically. However, Miller ultimately came away with an interception after he was switched to the pathetic Little (one catch, four yards). Campbell finished 18-of-39 for 178 yards and two picks. ",
            "5": "Cleveland's sole touchdown came on the ground with Edwin Baker, who gained 64 yards and a touchdown on 17 carries. Willis McGahee was actually active, but played only one snap. The Browns did the right thing to take a look at Baker, who could be a quality backup for them next year. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Rams",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> I don't have anything to say here. I'm pretty disappointed in the Buccaneers that they didn't cover the spread. I had them for two units, yet I always felt as though they were a safe bet. Their defense should be ashamed for allowing Kellen Clemens to score 23 points. ",
            "2": "The biggest takeaway from this game: the Rams are building a tough team that is headed in the right direction. St. Louis controlled the line of scrimmage on both sides of the ball, and Tampa Bay's 32nd-ranked offense was completely overmatched. Robert Quinn was in beast mode, while Donald Penn looks like he is in firm state of decline. One has to wonder if the Rams would be in the wild-card race if Sam Bradford hadn't been injured. ",
            "3": "In the first quarter, the Bucs had a nice drive as Mike Glennon moved the ball with two long passes to Vincent Jackson (5-98). Bobby Rainey (20-37) ran the ball into the end zone from a couple of yards out. St. Louis came back with a methodical drive that was aided by some Tampa Bay penalties. The Rams then tied the game at seven when Zac Stacy (33-104) dove into the end zone from a yard out. Alec Ogletree stripped the ball away from Rainey on the next drive. Following the sudden change, St. Louis dialed up an awesome double-reverse to Stedman Bailey (3-44), who bolted down the field for a 27-yard touchdown run. The Rams should have scored more often, but had ball-security issues. On a third-and-goal, Kellen Clemens fumbled the ball away on a quarterback draw. St. Louis got the ball in Tampa Bay territory again, but Stacy fumbled the ball away after a hit from Dekoda Watson. The Rams had a 14-10 lead at the half. The teams traded field goals in the third quarter. In the fourth quarter, Glennon fumbled the ball away on a sack from James Laurinaitis and Alec Ogletree. That set up another St. Louis field goal. To close out the game, Chris Long and Robert Quinn recorded sacks to finish off Tampa Bay. ",
            "4": "Both quarterbacks completed 16 passes for 158 yards with no touchdowns or interceptions. Glennon was 16-of-26, while Clemens was 16-of-20. ",
            "5": "The Rams' defense was suffocating. Qunn beat Penn for two of his three sacks. At 18 sacks this year, Quinn broke Kevin Carter's franchise record. T.J. McDonald (six tackles, one sack), Ogletree (eight tackles, .5 sacks, two forced fumbles), Laurinaitis (six tackles, 1.5 sacks) and Long all played well for St. Louis. ",
            "6": "Gerald McCoy (six tackles, one sack) and Lavonte David (11 tackles) continued their great seasons with excellent performances against the Rams. ",
            "7": "Early in the first quarter, Rams left tackle Jake Long had to be carted off the field with a right knee injury that looked like a potential serious knee tear. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "The media reaction to this will be some sarcastic/dumb responses about how Tony Romo can actually come through in the clutch. This was indeed a reversal for the Cowboys, who relinquished an unbelievable comeback to the Packers last week. However, Dallas, down 23-14 in the fourth quarter, engineered a last-minute surge of its own to keep its season alive. Save for an interception he made because of a bad decision, Romo was awesome in the second half. While he finished 17-of-27 for 226 yards, two touchdowns and the pick, he was 12-of-18 for 164 yards, one score and an interception following the break. Romo did this despite suffering some sort of leg/back injury on an attempted spin move. Romo could barely move at times, yet he still led his team from behind. However, despite this win, we've seen this from the Cowboys before. It's not like Romo hasn't orchestrated fourth-quarter comebacks before. He also played well last December. His problem has always been in Week 17 and beyond. He'll have a chance to win the division with a win over the Eagles in front of his home crowd next week. ",
            "2": "Romo's two scores went to Dez Bryant (4-73) and DeMarco Murray. Bryant seemed to sustain an injury along the sideline in the early going, but he didn't miss much action. Meanwhile, Terrance Williams led the team in receiving with four catches for 84 yards, thanks to a 51-yard catch near the end of the game when a defender fell down, but he could've had a much better afternoon had he hauled in a dropped touchdown. ",
            "3": "Washington's offense, meanwhile, had a very disappointing afternoon considering it was battling the Sean Lee-less inept Dallas defense. The Redskins put 23 points on the board, but they would've had a much greater output had it not been for so many red-zone miscues. They committed tons of penalties and wasted timeouts deep in Dallas territory. One infraction negated a touchdown, as a Pierre Garcon score was wiped out by his own illegal shift. Garcon still had a monstrous day, accounting for nearly all of Kirk Cousins' yardage. Out of 197, Garcon accumulated 144 off 11 catches. He also found the end zone on a play that actually counted. ",
            "4": "Speaking of Cousins, he took a major step backward in this contest, going 21-of-36 for 197 yards, the touchdown to Garcon and an interception that was way behind his receiver. The numbers don't look too bad, but Cousins was pretty inaccurate throughout the afternoon. He was way behind his targets on too many occasions, and he was brutal after halftime, going 8-of-16 for just 65 yards and a short score following the break. Any team looking to trade for Cousins this offseason needs to keep in mind that he was this pedestrian against one of the worst defenses in football. ",
            "5": "Alfred Morris had a solid outing, rushing for 88 yards and a touchdown on 24 carries. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Giants",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "A month and a half ago, it appeared as though the Lions had the NFC North locked up. They had the lead in the division, and they watched the Bears and Packers lose both of their quarterbacks to injury. Yet, they've suffered excruciating loss after excruciating loss, constantly killing themselves with unforced blunders. The trend continued this week, with this latest ridiculous loss officially ending their season. Jim Schwartz will almost certainly be fired. Schwartz, who has always been overmatched as a head coach, went out with a bang by cursing at the fans twice. Responding to a chorus of boos, Schwartz turned toward the crowd on two occasions and unleashed at least one F-bomb. ",
            "2": "Both Matthew Stafford and Reggie Bush were awful in this game. Stafford took a bad sack on third down of the opening drive, but his most egregious errors were a pair of interceptions. He fired a pick right to Justin Tuck at the end of the first half, prompting heavy boos from the crowd. Stafford finished 25-of-42 for 222 yards and the two interceptions, displaying awful mechanics throughout. Just as he did at Lambeau earlier in the year, Stafford struggled mightily without Calvin Johnson. Megatron did suit up despite Sunday morning reports that he would be a game-time decision, but he was highly ineffective. Constantly leaving and reentering the game, Johnson was limited to just three catches for 43 yards. Without a solid second option to throw to, Stafford couldn't sustain drives. When he wasn't firing picks and incompletions, he was checking the ball down to Joique Bell, who had 10 grabs for 63 receiving yards. Megatron was second in receiving, tying Joseph Fauria (3-43), who caught a two-point conversion. ",
            "3": "Bell was playing quite frequently because the coaching staff got fed up with Bush, who lost a fumble near midfield in the first half. Bush got another chance following intermission, but he dropped a pass on what would have resulted in a big gain. He was also ineffective when running the ball, gaining just 34 yards on 12 carries. Bell was so much more potent, tallying 91 yards and a touchdown on 20 attempts in addition to his receiving yardage. ",
            "4": "Despite all of this, the Lions still had a chance to win in overtime because of an Andre Brown lost fumble, but backup tight end Dorin Dickerson dropped a key pass that forced Detroit to relinquish possession in overtime. The Giants took over, and following two long completions, Josh Brown nailed a 45-yard field goal to clinch the upset. ",
            "5": "Eli Manning may have won this game, but he didn't play very well. He missed some big gains because of errant passes. Rueben Randle was open for a long completion early on when Manning misfired. Hakeem Nicks could've scored his first touchdown of the season, but Manning overthrew him. Manning did eventually get something going with Jerrel Jernigan (6-80, TD), who manned Victor Cruz's slot position, but that was pretty much it. Manning finished 23-of-42 for 256 yards, one touchdown and an interception in Detroit territory at the end of regulation. ",
            "6": "Four Giants caught more than two passes, including Jernigan. Nicks (4-52), Brandon Myers (4-53) and Randle (4-40) followed Jernigan on the box score. ",
            "7": "I mentioned Andre Brown earlier. He had a rough outing, gaining just 40 yards on 16 carries, culminating with the lost fumble. Adding injury to insult, Brown suffered a concussion on the play. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "I love media overreactions. Following this loss, the Seahawks suddenly don't have a very strong homefield advantage. They are also far from dominant, and they absolutely need Percy Harvin to have success in the playoffs. This must have been one hell of a loss! The fact of the matter is, this game meant very little to the Seahawks, who essentially had the No. 1 seed locked up. They didn't actually have it clinched, but with the Rams coming into town in Week 17, they would easily wrap up homefield advantage next Sunday, assuming the 49ers didn't trip up in one of their final two contests. Conversely, Arizona absolutely had to win this game to keep its playoff chances alive. It got the job done, so with a victory in Week 17, the Cardinals will earn a playoff spot with a loss by one of the 49ers or Saints. ",
            "2": "It's quite amazing that the Cardinals won this game considering that Carson Palmer tossed four interceptions. Two weren't his fault because of what happened behind or at the line of scrimmage, but the others most certainly were. He made the mistake of forcing throws inside the red zone on the picks that were his responsibility. Palmer finished 13-of-25 for 178 yards, one touchdown and the four interceptions. He wasn't all bad, as his score was a great, 31-yard rainbow to Michael Floyd. He also should've tossed a second touchdown, but Rob Housler dropped the pass. ",
            "3": "Only two Cardinals registered multiple receptions and 18-plus yards: Andre Roberts (2-25) and Larry Fitzgerald (3-18), who couldn't break free from coverage. The same goes for Floyd (1-31), who saw plenty of Richard Sherman. ",
            "4": "Rashad Mendenhall nearly was responsible for Arizona's fifth turnover when he lost a fumble in the second half. However, replay somehow overturned it when it was pretty obvious that Mendenhall coughed it up. He finished with 63 yards on 21 carries. Andre Ellington, meanwhile, was so much more explosive, once again outgaining Mendenhall on fewer carries (15-64). He didn't do much as a receiver, however, catching just two passes for eight yards. ",
            "5": "The Mendenhall fumble wasn't the only play in which the officials screwed Seattle. Russell Wilson's second interception hit the ground and bounced into the arms of an Arizona defender. However, the incompetent refs ruled that the ball somehow bounced off a player's arm when something like this wasn't physically possible. The Cardinals took over, and following one first down, they took three knees to clinch the victory. Wilson had perhaps the worst performance of his young career. He went just 11-of-27 for 108 yards, one touchdown and that weird interception. He also didn't scramble very much, scampering just twice for 32 rushing yards. Wilson was under heavy pressure throughout the afternoon, but that doesn't excuse the many inaccurate passes he fired downfield. Wilson constantly overthrew his receivers. Of course, he didn't really have much to work with. Patrick Peterson erased Golden Tate (2-34), forcing Wilson to fire to the likes of Jermaine Kearse (3-38) and Zach Miller (1-11, TD). ",
            "6": "Marshawn Lynch disappointed his fantasy owners in their championship. He rushed for 71 yards on 18 carries. He just missed out on a couple of touchdowns, but was tackled just shy of the end zone. ",
            "7": "I wrote earlier that the officials screwed the Seahawks with two horrible calls, but I'd be remiss if I didn't say that the zebras tried to do the same thing to the Cardinals. Arizona blocked an extra point that would've given Seattle the lead in the fourth quarter, but it was ruled that the player who blocked the kick lined up over the center, which was the incorrect ruling. However, this ultimately had no impact on the final result. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "This would have been a crushing way for the Packers to close out the season. Matt Flynn, who once again drew the start in what Mike McCarthy repeatedly called an organizational decision, ruined a potential victory with two crucial mistakes. His first was a lost fumble as he was reaching for the first-down marker on a scramble late in the fourth quarter. The Steelers took over and scored a touchdown, but a 70-yard Micah Hyde kickoff return gave Green Bay some life. The Packers drove inside the 5-yard line, but following a false start and a consequential 10-second run-off, Flynn failed to spike the ball and instead wasted time and heaved an errant ball into the end zone. He fired toward Jarrett Boykin when he had Jordy Nelson wide open. It appeared as though Green Bay's season would be over because the Bears were battling a Philadelphia team that had nothing to play for. The Bears lost, however, granting the Packers new life. They'll play in Chicago next week for the NFC North title. It'll obviously be huge for the Packers if Aaron Rodgers is cleared to play. He has a good chance, and he'll need to suit up because Flynn once again wasn't very good. In addition to the two aforementioned mistakes, he took some bad sacks and missed several receivers on overthrows. He also fired a pick-six on one of the most awkward passes I've ever seen. It was so odd that I jotted down pick-six WTF? in my notes. Flynn finished 21-of-39 for 232 yards, one touchdown and the interception. His offense's struggles to move the ball through the air wasn't all his fault; the Packers had three drops in the opening half. Also, Eddie Lacy, who gained 84 yards and two touchdowns on 15 carries, suffered an ankle injury in the third quarter and never returned, and the offense sputtered afterward as a consequence. This is why it's absolutely crucial for Rodgers to return. If the Packers don't have him or Lacy, they'll have major problems moving the chains next week despite how awful Chicago's defense looked Sunday night. ",
            "2": "Lacy wasn't the only major Packer to suffer an injury. Clay Matthews aggravated his thumb injury in the first half and never reentered the game. There's a chance he broke it again, which would be disastrous. ",
            "3": "A trio of Packers caught three or more passes: Boykin (5-54, TD), Nelson (3-46) and James Jones (9-84). Jones dropped a pass, but he made up for a great catch that prevented what looked to be a Flynn interception in the first quarter. ",
            "4": "As for the Steelers, they're also still alive. If they win, they'll take the sixth seed as long as the Ravens, Dolphins and Chargers all lose. Considering Kansas City will likely be resting its starters against San Diego, their chances are bleak, but they still have an opportunity because of this victory. ",
            "5": "Le'Veon Bell was a beast for the Steelers. He shook off an early drop and his first career fumble inside his own 5-yard line to rumble for 124 yards and a touchdown on 26 carries. Bell tried his hardest to prove that he's the best rookie running back, running hard and even hurdling defenders, but it's not like Lacy had a chance to respond after leaving the game early. ",
            "6": "Ben Roethlisberger went 16-of-28 for 167 yards, three touchdowns (two passing, one rushing) and an interception, which was a great, one-handed grab by A.J. Hawk. Roethlisberger played well overall, though he did miss Antonio Brown for a third aerial score late in the game, though Pittsburgh eventually found the end zone on that particular drive. Brown still had a big game though, catchiing six balls for 105 yards. Big Ben's touchdowns went to Matt Spaeth and Emmanuel Sanders, who also left early with a knee injury. ",
            "7": "There were two terrible calls in this game, one by the officials, and the other by Mike Tomlin. The Steelers blocked a Green Bay field goal, but the Packers were able to maintain possession with a free first down because of a batted ball. However, the Steelers should have been down by contact before then, so Tomlin looked like he was losing his mind while yelling at the refs. Tomlin later had Bell score a touchdown when he should have taken a few knees and kicked a chip-shot field goal. The Packers let Bell score so they could have one final possession, so Tomlin essentially did what Green Bay was planning all along. It ultimately didn't matter, but the Steelers were so close to seeing their season come to an end. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "It wasn't pretty, but the Chargers took care of business against the Raiders to keep their playoff hopes alive. With a win and losses by the Dolphins and Ravens, they'll earn the No. 6 seed in the AFC. Philip Rivers didn't play his best game. He lost a fumble on a botched snap near midfield and then went on to heave an interception on an underthrow. Rivers also threw behind Keenan Allen on a few occasions, including once in the red zone. He did enough positive things, however, as he fiished 19-of-29 for 201 yards, one touchdown and the pick. ",
            "2": "Like Rivers, Allen struggled at times but made up for it with some strong plays. He dropped a pass in the first half and then muffed a punt that led to a Raiders' field goal. However, he later came back and scored a touchdown. He finished with three grabs for 26 yards. ",
            "3": "Ryan Mathews set a new career high in rushing yards for a single season, crossing 1,100 yards, thanks to his 99 yards on 25 carries. He also scored a touchdown. ",
            "4": "A few notes on the Raiders: Matt McGloin looked antsy in the pocket throughout the afternoon. He went 20-of-36 for 206 yards and a tipped interception that was hauled in by Eric Weddle with a great, diving catch. He was also stirp-sacked, but he's fortunate that one of his linemen recovered the loose football. McGloin nearly had a touchdown on a pass in which he heaved up for grabs while under pressure at the very end of the game. The ball floated toward Marcel Reece, who let it fall through his hands. This score would've covered the spread, so anyone who bet the Raiders has to be absolutely furious at Reece. ",
            "5": "Rashad Jennings also failed to find the end zone, gaining 45 yards on just 10 carries. He was vultured by Darren McFadden (4-8, TD). ",
            "6": "McGloin continued to show good rapport with Andre Holmes, who led the team in receiving with five catches for 71 yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> Charlie covered this game, but I'll have plenty on this in my <a href=/nflpowerrankings.php>NFL Power Rankings</a> on Tuesday. You better believe that I was keeping track of my December NFL Pick of the Month. ",
            "2": "The Ravens knocked the Patriots out of the playoffs last year, so New England was amped to deal Baltimore a loss that could help cost the Ravens a playoff berth. With Miami losing, Baltimore's playoff hopes remain alive, but were dealt a blow. The Patriots also showed that their defense is ready for January. The stop unit played with discipline and excellent execution to control all four quarters against the Ravens. Early in the first quarter, Torrey Smith (3-69) was wide open by a mile for a long touchdown, but Joe Flacco threw the ball late and short to let Devin McCourty come over and break up the pass. That set the tone for the game. New England got the ball on the one-yard line after a questionable 34-yard pass interference penalty on Jimmy Smith. LeGarrette Blount (16-76) then scored from a yard out. Flacco went on to have a pass bounce off of Dont'a Hightower and be intercepted by Logan Ryan. Brady hit Danny Amendola (2-45) for a 34-yard gain to get the ball near the end zone before finishing the drive with a toss in the flat to Shane Vereen (2-6) for a score. The Patriots took a 17-0 lead into the half. The Ravens' offense was completely inept and New England was putting a lot of heat on Flacco. In the third quarter, the Patriots were set up inside the Ravens' territory after Ryan grabbed his second interception on a deflection off Dennis Pitta. That set up another field goal. Baltimore finally got going with a pass to Smith for a gain of 42, but Rob Ninkovich stuffed Ray Rice (11-40) for no gain on a fourth-and-1 inside the five-yard line. Everything was going against the Ravens as Justin Tucker missed a field goal. They got into the end zone in the fourth quarter as Flacco dove into the end zone from a yard out. The Patriots answered with a dominating drive on the ground with their stable of backs, and Blount finished off Baltimore with his second touchdown run. In the final two minutes, a bad shotgun snap rolled into the end zone and was recovered by Chandler Jones for a touchdown. Tavon Wilson also picked off Tyrod Taylor and returned the interception 74 yards for a score. ",
            "3": "Brady finished completing 14-of-26 for 172 yards with a score. Julian Edelman (7-77) led the New England receivers. ",
            "4": "Flacco went 22-of-38 for 260 yards with two picks. ",
            "5": "The Patriots' defense had a phenomenal performance led by Rob Ninkovich (six tackles, one sack). The team also got sacks out of Andre Carter, Kyle Arrington and Sealver Siliga. Brandon Spikes, Kyle Arrington, Aqib Talib and Ryan also played well for New England. ",
            "6": "Daryl Smith, Courtney Upshaw, Terrell Suggs all recorded sacks for Baltimore. Patriots veteran Logan Mankins held up pretty well at left tackle. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "54"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "11"
        },
        "comments": {
            "amount": "3",
            "1": "This game meant absolutely nothing for the Eagles, who are extremely fortunate that none of their players went down with injuries. Chip Kelly defended his decision to use all of his starters by telling the media, We're from Philadelphia and we fight. Had one of his stars suffered an injury, however, he would've been heavily criticized, so he's pretty lucky nothing bad occurred. With this game being completely irrelevant for Philadelphia, let's talk about the Bears, who put forth an absolutely disgraceful performance. Their offense didn't play well, as Jay Cutler was pretty erratic, but it doesn't matter who the quarterback is as long as the defense is this inept. Chicago was so terrible on this side of the ball in every facet. The Eagles ran all over the Bears, as LeSean McCoy gained 133 yards and two touchdowns on 18 carries. Bryce Brown chipped in with 115 yards on nine attempts, including a 65-yard score in garbage time. Chris Polk (2-12) also scored. In case you don't want to do the math, the three Philadelphia running backs averaged 8.97 yards per carry. That's nearly a first down every time they handled the ball! The Bears also showed very little resistance through the air. Nick Foles let the ball hit the ground only four times, completing 21-of-25 for 230 yards and two touchdowns. Foles, who also scrambled twice for 17 rushing yards, basically did whatever he pleased. He barely saw any pressure throughout the evening, as Chicago's defense was reeling. Foles, by the way, fired his touchdowns to Brent Celek (3-58) and Riley Cooper (3-53). DeSean Jackson disappointed his fantasy owners with four catches for 29 yards. ",
            "2": "With all of that in mind, it's not like anyone expected Chicago's stop unit to play particularly well. The offense, however, was expected to at least keep pace with the Eagles, but that wasn't happening for several reasons: - Cutler was erratic at times, going 20-of-35 for 222 yards, one late touchdown to Brandon Marshall (4-36) and a pick-six. He simply wasn't sharp, which will fuel the quarterback controversy even further. - Pass protection was a huge issue. Matt Forte struggled on blitz pick-ups, allowing two sacks in the first half alone. Cutler did a poor job of holding on to the ball too long on other occasions. - Forte, who also dropped a pass, couldn't get going on the ground because the team was down big early. He was handed just nine carries, which he turned into 29 yards. ",
            "3": "The Bears also struggled on special teams. Not only was Devin Hester bottled up on his kick returns; he also lost a fumble when the Eagles were already up 7-0. This set up a short field and a subsequent Philadelphia touchdown, and the game consequently got away from Chicago. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "49ers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "24"
        },
        "comments": {
            "amount": "4",
            "1": "If the 49ers continue to play like they did in the final game at Candlestick, they won't have a chance to advance deep into the postseason. Their offense couldn't do anything in the first half, while their defense collapsed following intermission despite having the natural aid of Circadian rhythms. Thanks to an onside kick recovery when Navorro Bowman let the ball slip by him, Atlanta was in the red zone, threatening to take the lead and put San Francisco's playoff life in jeopardy. But a Ryan pass was tipped and somehow found its way into Bowman's hands, who ran back 89 yards for the game-clinching pick-six. Kaepernick was woeful in the opening half, going just 6-of-11 for 69 yards. He was nearly picked twice, as his favorite target, Vernon Davis, missed plenty of action because he had something wrong with his eyes. Davis took the field following intermission, and Kaepernick suddenly improved. He let the ball hit the ground only three times in the second half, and two of those passes were dropped by Davis and Michael Crabtree. Kaepernick ultimately finished 13-of-21 for 197 yards and a touchdown to Anquan Boldin (6-72). While Kaepernick improved after the break, the defense suddenly couldn't stop Matt Ryan. The Falcon signal-caller dinked and dunked in the first half, but really opened things up following intermission. He took more chances on shots to Roddy White, and as mentioned, he was in position to pull a colossal upset. Ryan's numbers in the second half were quite amazing: 21-of-28 for 204 yards, two touchdowns and a pair of fluky picks (the aforementioned tip and a Hail Mary try at the very end). It's almost inexplicable how porous San Francisco's defense was against an offense that couldn't muster much against the Redskins last week. It's possible that the team was overconfident or distracted in the wake of all of the hoopla ESPN caused with the closing of Candlestick. It's still a bad omen, however. I've been a 49er supporter all year, ranking them in the top three even when they were 1-2 following the blowout loss to Indianapolis. But unlike the Colts' game, this was a crucial contest that had playoff implications. Given that the 49ers were battling an East Coast team at night, this should have been a demolition. Instead, San Francisco was one fluke pick away from losing to a dreadful four-win team. ",
            "2": "Here are some San Francisco numbers: - Only two 49ers caught more than one pass: Boldin and Crabtree (5-102). Davis didn't log a single reception. Davis dropped a pass following intermission. Kaepernick then returned the favor by missing his stud tight end for a touchdown. - Frank Gore rushed for 97 yards and a touchdown on 21 carries. - Bowman had the decisive pick-six, but Patrick Willis was the better player, logging a whopping 18 tackles. ",
            "3": "And now, some Atlanta stats and notes: - Ryan finished 37-of-48 for 348 yards, two touchdowns and the two picks. He wasn't legitimately intercepted, but that nearly happened in the first half when a 49er dropped what looked to b e a possible pick-six. - White was a monster, catching 12 balls for 141 yards and a touchdown. Ryan's other score went to Tony Gonzalez (8-63), who caught the pass right where Dwight Clark hauled in the touchdown in the NFC Championship more than three decades ago. - Steven Jackson also found the end zone. He looked good, gaining 53 yards on 16 carries. - Defensive tackle Corey Peters suffered an Achilles injury in the first half. He was helped off the field and was later seen crying on the bench. ",
            "4": "Walt Coleman was the official in this contest, so there were bound to be terrible calls. That definitely was the case, as the senile Coleman looked like he was trying to screw both teams. It started when he flagged Donte Whitner for a hit on a defenseless receiver, when Whitner only rammed the Falcon player with his shoulder. Coleman then helped the 49ers score with a terrible third-and-long pass interference on linebacker Paul Worrilow. And just when we all thought Coleman was done, he gave the Falcons great field position on their onside kick attempt because of an apparent roughing-the-passer penalty in which Ryan was barely touched. But a picture's worth a thousand words, so here's something to show you how frustrated Jim Harbaugh was with Coleman throughout the evening: "
        }
    },
    "numberOfGames": "16"
}