{
    "year": "2013",
    "week": "08",
    "Game 1": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "13"
        },
        "comments": {
            "amount": "8",
            "1": "Think these two teams are moving in different directions? The Panthers, now 4-3, have climbed over the .500 mark for the first time in five years. As for the Buccaneers, Warren Sapp said it best when he stated, This was embarrassing to watch as the fans chanted We need Sapp! following this blowout. This was an incredibly easy win for Carolina. The team marched down the field on its first two possessions for 70- and 80-yard touchdown drives. Up 14-3, Cam Newton was 9-of-10 for 98 yards and a touchdown with four carries for 24 rushing yards. The Panthers did not look back, ultimately leading 31-6 even before Tampa reached the red zone for the first time. A garbage-time score made the result a bit closer, but Carolina dominated this contest throughout. ",
            "2": "Newton finished 23-of-32 for 221 yards and two passing touchdowns along with 11 scrambles for a team-leading 50 rushing yards and a third score on the ground. It could've even been a bigger night for him, as Ted Ginn dropped a deep pass. Tampa safety Mark Barron did let an interception fall through his hands, to be fair. Newton's scores went to Mike Tolbert and Greg Olsen (3-21). Tolbert was pretty tough, mustering 35 rushing yards on seven carries and also chipping in with four catches for 29 receiving yards. DeAngelo Williams (8-43) also found the end zone. ",
            "3": "Steve Smith didn't have a very good statistical performance, catching four balls for 42 yards. He did see Darrelle Revis occasionally, but Revis mostly played zone. Revis was a mess in the first half. He broke up a completion on third down directed toward Smith, but he committed pass interference, fell down on a Newton scramble and also whiffed on a tackle when Williams scored his touchdown. Not to beat a dead horse, but the Buccaneers are so insanely stupid for using Revis in a zone. Why would they deal a first-round pick and pay him $16 million if they aren't going to use his strength? It makes zero sense. ",
            "4": "A player Tampa did select in the 2013 NFL Draft, Mike Glennon had a pretty mediocre performance. He finished 30-of-51 for 275 yards and a touchdown. He made some nice passes, but was guilty of one too many overthrows (can we call those Josh Freemans?) He was also very fortunate that Carolina dropped three potential interceptions, though all of those instances came in the second half when Glennon was trying to mount a comeback. All in all, Glennon played OK, but I'm still not convinced that he can be a solid NFL starter. Perhaps I'll change my mind as the season progresses. Glennon's late touchdown went to rookie tight end Tim Wright (5-48). Wright tied Vincent Jackson for the team lead in receptions. Jackson's five catches went for 79 yards, but it should be noted that he dropped a first-down conversion on third down of the opening drive. ",
            "5": "Mike James, replacing the injured Doug Martin, gained 39 yards on 10 carries. He broke free for a 15-yard burst, but didn't do much else on the ground. He contributed in the passing game with four catches for 25 receiving yards. ",
            "6": "The one dark cloud surrounding Carolina's victory was a very late injury to Charles Johnson. There's a concern. We'll see, said head coach Commander Adama regarding Johnson's groin. ",
            "7": "As for the Buccaneers, Greg Schiano could be fired this week, given that they're on a pseudo bye. I'm not a fan of Michael Silver, but he wrote an article about how Schiano has lost the locker room and that his players are tuning him out. Also, consider what Charlie Campbell tweeted (<a href=https://twitter.com/DraftCampbell target=blank>@DraftCampbell</a>): The Bucs are 24-47 under GM Mark Dominik. Greg Schiano is 1-12 in his last 13 games, is 7-16 overall. Time for the Bucs to clean house. ",
            "8": "It wouldn't be Thursday Night Football without a gaffe from Brad Nessler. Greg Little was Mr. Dependable recently, while Jay Feely became Jim Feely last week. This Thursday, Nessler joked about the Buccaneers firing their trademark cannon too early prior to their touchdown. If Nessler weren't mailing in these games, he would've known that Tampa fires the cannon once each time it reaches the red zone. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "Wow, what a game. I had a whole write-up prepared about how the Lions once again shot themselves in the foot to cost themselves a victory. After all, Matthew Stafford was responsible for two interceptions, both collected by Sean Lee. One was tipped, while the other just saw Lee step in front of the intended target. In the second half, Reggie Bush and Calvin Johnson both lost fumbles in Dallas territory. The Lions were whistled for unnecessary roughness on top of the Megatron cough-up, which gave the Cowboys three free points because they couldn't move the chains, but were set up in field-goal range. The Cowboys kicked a field goal to go up 30-24 with a minute remaining, but there would've been 20 seconds or so on the clock had they not committed a holding penalty. Jim Schwartz smartly declined the infraction, saving 40 seconds. This gave Matthew Stafford enough time to hit Kris Durham for a 40-yard bomb, ultimately setting up a 1-yard sneak for the go-ahead sneak score in which he fooled everyone - including his own linemen - by faking to spike the ball. This is a great win for the Lions, who needed to prevail like this. They need to avoid mistakes - four turnovers against quality opponents usually won't cut it - but perhaps this victory can be used as momentum to fix things going forward. On the flip side, there's no telling what a defeat like this will do for the Cowboys. Sure, it's just a non-divisional loss, and Dallas still has control of the NFC East, but Dez Bryant's sideline tirade could really hurt the team. Bryant spent so much of the second half incoherently yelling at coaches and players. It all started when Bryant shouted get me the ball to Tony Romo repeatedly. He then barked at some coaches and Romo some more. Following Detroit's touchdown, Bryant was seen screaming at Jason Witten, with DeMarcus Ware trying to break the two up. Ware then grabbed Bryant and yelled at him. It was an ugly scene, reminiscent of Terrell Owens' antics. Bryant has been a good soldier this season, but this could be a very dark cloud hovering over the team in the second half of the year, despite what the Cowboy players may have told the media. ",
            "2": "The most prominent number in this contest was 329. That's the amount of receiving yards Calvin Johnson accumulated, highlighted by an 87-yard gain in which Brandon Carr missed a tackle and Barry Church took a horrible angle. Megatron caught 14 balls to reach that total, which included a touchdown. He fell just seven yards short of Flipper Anderson's all-time record of 336 yards in a single contest. ",
            "3": "Johnson had about two-thirds of Stafford's yards. Stafford was brilliant if you exclude the two picks, as he went 33-of-48 for 488 yards and two touchdowns (one passing, one rushing) otherwise. He was especially brilliant after halftime. He let the ball hit the ground just five times, going 20-of-25 for 296 yards and the rushing score following the break. ",
            "4": "Only four Lions caught more than one pass: Johnson, Durham (4-54), Brandon Pettigrew (3-31) and Bush, whose eight catches for 30 receiving yards complemented his 92 rushing yards and touchdown on 21 carries. Bush wasn't perfect though; in addition to losing that aforementioned fumble, he also dropped a pass, which has been a problem for him this year. ",
            "5": "As for the Cowboys' offense, they had to rely on big plays to score in this contest. They had trouble sustaining drives - 3-of-13 on third downs - because Detroit put immense pressure on Romo. It seemed like he was being blasted on almost every single attempt, which would explain why he was only able to complete half of his passes. He went 14-of-30 for 206 yards and three touchdowns. Two of Romo's scores went to Bryant (3-72), who broke free with a 50-yard scamper along the sidelines and also had a David Tyree-esque catch in which he pinned the ball to the side of his helmet. Terrance Williams (2-64) caught the other, a 60-yarder that also was mostly about his yards-after-catch ability. ",
            "6": "Dallas couldn't run the ball because Detroit's ferocious defensive front didn't allow anything. Joseph Randle, starting in place of DeMarco Murray, managed only 26 yards on 14 carries. He also tied for the team lead with three grabs for 18 receiving yards. ",
            "7": "This game was a shootout, but it was also a hard-hitting blood bath, with numerous players leaving with injuries. Ezekiel Ansah, Morris Claiborne, Ryan Broyles, Bullet Bill Bentley and Brian Waters all left the contest with various maladies. Broyles' was the worst, as he ruptured his Achilles' tendon. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "49ers",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "1",
            "1": "I'm not going to spend much time on this game because... why? The biggest take-away was that Wembley Stadium was once again packed. The Brits spent the afternoon cheering for the 49ers and doing the wave. In fact, this was such a pro-San Francisco crowd that the people on the field didn't even bother to spell Jaguars correctly: "
        }
    }
}