{
    "year": "2013",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "49"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "The Broncos look scary good. Good as in teams have to be watching them and thinking, how the hell are we going to stop this offense? scary good. All Peyton Manning did in the season opener was throw for seven touchdowns - the first quarterback to do so since 1969. Manning was 27-of-42 for 462 yards and the seven scores. He started a bit slowly - he blamed it on the 50-minute delay in a post-game interview - but he eventually was absolutely lethal with his plethora of weapons. Manning definitely made sure to showcase his new toys. Tom Brady had to be watching with envy as Wes Welker hauled in nine grabs for 67 yards and two touchdowns. Welker dropped a pass and muffed a punt to give Baltimore an easy score, but the positives outweighed those two negatives. Meanwhile, super-athletic Julius Thomas snagged five balls for 110 yards and a pair of end-zone trips of his own. Thomas was my No. 9 , so I was definitely not surprised to see him go off like this. He has all the potential in the world, and to top it off, he blocked pretty well in this contest. Make Thomas a priority pick-up if he's available in your league. ",
            "2": "As for Manning's other targets, Demaryius Thomas had a pretty nice line (5-161-2), but most of that came late. Stud corner Lardarius Webb was on him in the first half, but the Ravens finally decided to put Webb on Welker. Eric Decker, meanwhile, had a rough outing (2-32). He had several drops, including one potential touchdown. He also was guilty of a fumble and an offensive pass interference. Fantasy owners of his should be a bit concerned, but shouldn't panic quite yet. ",
            "3": "Speaking of fantasy, Montee Ball... the guy is a Big Ten plodder who can't pass protect. He's not going to be on the field very much unless the Broncos are blowing teams out. I'm not sure if he's worth a roster spot unless you're in a deep league. I'd still keep him around, but it seems as though Knowshon Moreno (9-28; 3-37) will get the majority of the touches. ",
            "4": "As for the Ravens, they really had a shot to win this game. That may sound silly if you're just looking at the box score, but they were up 17-14 (would've been 21-14 had Dallas Clark not dropped a touchdown) and could have challenged an obvious incompletion to retain possession in the middle of the third quarter. John Harbaugh opted not to throw the red flag, to the chagrin of both announcers, which led to a Denver touchdown on the same drive. Following a blocked punt, the Broncos suddenly were up 35-17 and never looked back. One other thing that hurt Baltimore was the loss of right tackle Michael Oher. The Ravens had to replace Mr. Blind Side with a fifth-round rookie named Ricky Wagner, who predictably struggled. The edge Baltimore had in pass protection with Von Miller out was suddenly lost. Oher's absence played a huge role in Denver's victory. Shaun Phillips (2.5 sacks, forced fumble) went nuts. ",
            "5": "The Ravens also killed themselves with drops. The Broncos had their fair share, as mentioned, but it seemed like every drive of Baltimore's featured a drop by one of the two tight ends. Dallas Clark and Ed Dickson were just awful. Clark caught seven balls for 87 yards, but he looked super slow and inept. His aforementioned dropped touchdown was huge. Dickson (1-13) was just as bad. Joe Flacco still managed to go 34-of-62 for 362 yards, two touchdowns and a pair of interceptions, including one that should've been a pick-six. However, the defender, Danny Trevathan, pulled a DeSean Jackson and dropped the ball before he crossed the goal line. Adding injury to insult, stud linebacker Wesley Woodyard was injured on the play, but he would be fine. Flacco's initial pick helped set up Manning's first touchdown of the night. ",
            "6": "Torrey Smith didn't have the huge outing he enjoyed during the playoff victory, but he did catch four balls for 92 yards, including an impressive one-handed grab where the defender grabbed hold of his arm. Marlon Brown, an undrafted rookie out of Georga, caught four passes for 65 yards and a score. He was on the field because Jacoby Jones was injured during a special-teams incident in the first half. Jones' absence was also big because Flacco had to rely more on Clark, Dickson and Brandon Stokley. ",
            "7": "Ray Rice and Bernard Pierce split carries almost evenly (12-36, TD; 9-22), but Rice acted like the PPR stud that he is, catching eight balls for 35 yards. ",
            "8": "One last thing I'd like to emphaize - and I said this in my - is that the Broncos are not 22 points better than Baltimore. If the two teams played this game 100 times, most of the results wouldn't be double-digit blowouts. A series of unfortunate events did the Ravens in, so they looked much worse than they really are. As a consequence, they could be a good bet on team going forward. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Patriots pulled a victory out of their a** in this game, but they have to feel extremely discouraged. They were favored by 9.5 points on the road against a team with a rookie quarterback making his first start and two stud defensive backs out of the lineup. They should have blown out Buffalo. Instead, they had to scratch and claw their way to a victory, thanks to an impressive final drive. Tom Brady (29-of-52, 288 yards, 2 TDs, INT) had a great decisive possession in which he completed all six attempts for 34 yards. However, he struggled for most of the afternoon. He just didn't look sharp. Some of his throws were off - he tossed an ugly interception that put the Bills in scoring position - and he bobbled a snap on fourth-and-goal on the 1-yard line. His decision-making also seemed off; early in the fourth quarter, it looked like Brady could run in for a possible touchdown, but he instead made a poor throw to Kenbrell Thompkins in the end zone that fell incomplete. Of course, this is to be expected, given that Brady lost Rob Gronkowski, Aaron Hernandez and Wes Welker because of various reasons. But Buffalo not having Stephon Gilmore and Jairus Byrd should have offset that. That's exactly why Patriot fans should be incredibly concerned. Gronkowski may return in Week 3 or 4, but he may not be 100 percent. He's also at risk for further injury because he's not in playing shape. ",
            "2": "Speaking of Patriots who are sure to get injured, Danny Amendola battled a groin injury the entire afternoon. He was wincing in pain throughout the entire contest. He still managed to haul in 10 grabs for 104 yards, but his durability is a major concern. ",
            "3": "As for Brady's other weapons, Julian Edelman caught both touchdowns. His line of seven catches for 79 yards will almost definitely be his best of the season, but he's worth picking up in fantasy leagues because it's not like Brady has many other options. Kenbrell Thompkins (4-42) struggled, as he screwed up one play in the red zone in which he ran into Edelman. ",
            "4": "Stevan Ridley was the starting running back, as expected, but he was benched after losing a fumble that resulted in a Buffalo touchdown. Ridley gained 46 yards on just nine attempts, so it's a shame because he looked like he was on his way to a big afternoon. Shane Vereen took over and compiled 159 total yards on 21 touches. LeGarrette Blount was mixed in (7-15), but I wanted to mention him because he returned kickoffs for some strange reason. Don't the Patriots have Leon Washington? Why aren't they using him? ",
            "5": "Buffalo had turnover issues of its own. Both C.J. Spiller and Marquise Goodwin lost fumbles. Spiller was a huge disappointment; he mustered just 41 yards on 17 carries and was actually outgained by Fred Jackson. The veteran back rushed for 67 yards on 13 carries and also hauled in four catches for 41 yards. ",
            "6": "E.J. Manuel went 18-of-27 for 150 yards and two touchdowns in his debut. He made safe throws early on, but took more chances as the game progressed. It was disappointing to see him scramble just three times for 23 rushing yards. Running is his best trait, so he needs to do that much more. ",
            "7": "Manuel's two scores went to Stevie Johnson (3-39) and Robert Woods (1-18). <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "The consensus opinion was that the Seahawks were going to blow the Panthers out of the water. Seattle won the offseason, after all, so the team was a 3.5-point favorite in Carolina despite making a dreaded 10 a.m. local start. I got a kick out of the top comment on the NFL.com GameCenter page: Seahawks 134, Panthers -12. If that were a realistic score, most people would have predicted it. Well, the Seahawks didn't have the blowout everyone was expecting. This was a fierce defensive battle, as the Panthers did a great job of pressuring Russell Wilson all afternoon. Carolina registered just two sacks, but only because of Wilson's elite pocket maneuverability. Wilson barely had time to breathe, which makes his performance that much more impressive. Wilson went 25-of-33 for 320 yards and a touchdown. The key play of this contest was a 43-yard touchdown bomb to Jermaine Kearse (2-49) in the fourth quarter. This came exactly one snap after a Wilson-to-Stephen Williams bomb was dropped. Wilson also scrambled five times, but for only seven yards. ",
            "2": "Wilson's favorite target was Doug Baldwin, who caught seven balls for 91 yards. That's a nice stat line, but Baldwin isn't talented enough to maintain this type of production. Golden Tate (4-51) and Sidney Rice (2-31) will lead their team in receiving yards on a week-to-week basis. ",
            "3": "Carolina's vaunted front seven will stymie effective ground attacks all season. That's what the team did to Marshawn Lynch, who managed just 43 yards on 17 carries. ",
            "4": "It's rare that DeAngelo Williams has a more productive afternoon than his counterpart, but that was the case in this contest. Williams mustered 76 yards on 16 carries. Unfortunately, Williams was the Panther most responsible for this loss. He fumbled the ball on the Seattle 8-yard line with about five minutes remaining in the fourth quarter. It's obviously unclear if the Panthers would've found the end zone, but they would have had a great chance with a first-and-goal inside the 10-yard line. Instead, Seattle took over and never relinquished possession. ",
            "5": "Cam Newton struggled last preseason and got off to a slow start in 2012. History is apparently repeating itself, as Newton went 16-of-23, but for only 125 yards and a touchdown. Newton needs to do more scrambling; he ran just five times for 38 yards. Defenses fear Newton when he takes off, so his hesitancy to run is music to opposing defensive coordinators' ears. Newton can't receive too much blame for this loss, however, as the coaching staff screwed up by punting it away on too many fourth-and-short situations. Newton can pretty much pick up any short-yardage situation by moving the pile, so I have no idea what Ron Rivera was thinking - especially after losing in similar fashion at Atlanta last season. ",
            "6": "Only three Panthers had more than one reception: Greg Olsen (5-56), Steven Smith (6-51, TD) and Williams (3-14). "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bears",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "This was an evenly matched game that would probably be decided by seven points 90 out of 100 times. The Bears won by a field goal, while the Bengals eclipsed them in total net yards by just 17 (340-323). The first-down count was also close, with Cincinnati also having the edge there, 18-17. The Bengals did lead in this contest though, but the Bears rallied and scored the final two touchdowns. Cutler was unbelievably sharp in the second half, going 11-of-14 for 142 yards, one touchdown and an interception after intermission. His overall numbers (21-of-33, 242 yards, 2 TDs, INT) were also solid. ",
            "2": "Matt Forte struggled to find running room (19-50), but still tallied 91 total yards of offense, thanks to four catches. He also scored, which is important because Michael Bush didn't vulture a touchdown away. Forte's one major blemish was a dropped pass that took the Bears out of field goal range in the first half. ",
            "3": "It was no surprise that Brandon Marshall led the team in receiving. He caught eight balls for 104 yards and a touchdown. Martellus Bennett (3-49) also scored. Alshon Jeffery chipped in with five catches for 42 yards. ",
            "4": "Marshall was impressive, but A.J. Green was a freaking monster. He snagged nine receptions for 162 yards and a pair of touchdowns. This included an awesome, diving catch in the third quarter and a drawn pass interference on Charles Tillman in the end zone. Tillman had an eventful afternoon, by the way. He intercepted Andy Dalton twice, including one instance in which he ran into the end zone for an apparent pick-six. However, replay eventually ruled that he was down by contact. ",
            "5": "Dalton was very sharp if the two interceptions are excluded. He completed a high number of passes (26-of-33) for 282 yards and the two aforementioned touchdowns that Green caught. ",
            "6": "Dalton and Green had a great connection, but the third-year quarterback also focused on getting the ball to his tight ends. Tyler Eifert and Jermaine Gresham each caught five passes for 47 and 35 yards, respectively. Mohamed Sanu (4-19), meanwhile, made a costly error by fumbling the ball deep in Chicago territory in the second half. ",
            "7": "The Bengals need to feature Giovani Bernard more prominently. Bernard ran for 22 yards on four carries to go along with an eight-yard reception. BenJarvus Green-Ellis, meanwhile, mustered just 25 yards and a touchdown on 14 attempts. The score was just a typical goal-line plunge, which wasn't anything impressive. The Law Firm looked as slow as ever, which makes me wonder why Bernard didn't get more touches. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: Boy, am I stupid. I thought the Browns would have a chance at the playoffs because of a strong offseason and improved coaching, but no... the Browns are the Browns, and they'll always be the Browns. I should've known better. I'm sorry. </i> ",
            "2": "There was optimism for both teams to make a big jump in 2013, but the Browns continued their typical play and lost their ninth-straight opening game. Miami controlled the matchup with a tough defense and efficient play out of Ryan Tannehill. The real star of the game was the Dolphins' front seven. The unit dominated the line of scrimmage. Cameron Wake destroyed right tackle Mitchell Schwartz as he notched 2.5 sacks and had a ton of pressure. The defensive tackles Randy Starks (1.5 sacks), Paul Soliai (two batted passes) and Jared Odrick all played well. Dion Jordan had a sack and Derrick Shelby had a strip-sack going against Schwartz. The front seven did a great job defending the run as well. Browns' guard Oniel Cousins was horrible for Cleveland as he was beaten for sacks and called for a holding that took away a Browns touchdown. Trent Richardson had about 25 yards on the first drive and after that was shut down by Miami. Richardson (13-47, two catches for 30 yards) actually ran better than the numbers indicate considering his lack of holes. The Dolphins were crowding the tackle box, daring Brandon Weeden and the receiving corps to beat them. Cleveland had a nice first drive when Weeden threw a ball up for grabs, but it was off the mark and Nolan Carroll came down with an interception at the one-yard line. Wide receiver Travis Benjamin (2-30) didn't do a great job of fighting for the ball either. ",
            "3": "Playing his former team, Dimitri Patterson had probably the best game of his career against Cleveland. His first interception came when Greg Little (4-26) dropped another pass. Patterson made a fabulous catch off the deflection as he fell to the ground. That set up a Caleb Sturgis field goal. Weeden's third interception was a pass high and behind Jordan Cameron for a deflection. Patterson snatched the fluttering ball for the third pick of the half for Weeden. ",
            "4": "Weeden had some nice chemistry with Cameron (9-108), but the second-year signal-caller otherwise struggled to move the ball with his receivers. In the second quarter, Cameron made a highlight-reel 22-yard reception. He set up a score with a big catch inside the 10 and finished the drive with a leaping touchdown reception in the corner of the end zone. That gave the Browns a 7-6 halftime lead. However, Cleveland couldn't move the ball in the final two quarters. Weeden finished 26-of-53 for 289 yards with a touchdown and three interceptions. Davone Bess (5-47) and the other wideouts couldn't make up for Josh Gordon being suspended. ",
            "5": "Tannehill carried Miami's offense. The running game was pathetic as the offensive line had a weak performance. Lamar Miller recorded just three yards on 10 carries. After two field goal drives in the first half, Tannehill threw a rocket to hit Brian Hartline for a 34-yard touchdown along the sideline after beating Buster Skrine. Miami was up 13-10 midway through the fourth before Tannehill led a drive that ended with a one-yard touchdown plunge by Daniel Thomas (8-14). The Dolphins tacked on another field goal with four minutes remaining. Tannehill's only miscue was a pass deflected by D'Qwell Jackson to set up an interception for Tashon Gipson, but that was a great play by Jackson. Tannehill completed 24-of-38 attempts for 272 yards with a touchdown and an interception. Hartline (9-114) was the Dolphins best receiver; he saw 16 targets fly his way. Brandon Gibson (7-77) dropped a few and Charles Clay (5-54) chipped in. ",
            "6": "The Miami offensive line was a weakness. Lamar Miller (10-3) had a miserable game. Paul Kruger had a sack against Tyson Clabo, while Jonathan Martin gave up a sack to Quinton Groves. Desmond Bryant had two sacks for the Browns beating both guards (John Jerry and Richie Incognito). Bryant was very impressive. Mike Wallace (1-14) was a disappointment in his debut for Miami. Although Wallace was wide open in the end zone for an easy touchdown throw, Tannehill didn't see him. There was another bomb that Wallace had a step on Joe Haden, but Tannehill overthrew him. Haden had perfect coverage on a deep ball and dropped an interception on a pass intended for Wallace. Haden definitely got the better of the matchup. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Lions",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "The Lions are often guilty of doing dumb things like committing untimely penalties, taking unnecessary sacks and fumbling the ball away. However, the Vikings apparently have spent too much time watching tape of Detroit this offseason because they were the team that constantly screwed up in this contest. The obvious blunders are Christian Ponder's three interceptions and one lost fumble. However, there was one Detroit fourth-quarter drive in which defensive tackle Letroy Guion hit Matthew Stafford late on third-and-long. The Lions would have punted the ball away, but they were awarded a free first down. Later on the possession, Xavier Rhodes was whistled for pass interference downfield. This eventually led to a Detroit touchdown. The game was a 27-24 affair at that point, so the two penalties helped the Lions pull away. ",
            "2": "Detroit, of course, made some mistakes itself. Reggie Bush dropped a pass in the red zone on the opening drive. A field goal attempt was aborted because of a bobbled hold. Calvin Johnson let the ball hit the ground on a potential touchdown. A chop block nullified a pick-six. Brandon Pettigrew lost a fumble. The team burned a timeout in the beginning of the third quarter. Basically another day at the office for this team. The Lions look great at times, but these errors will cost them games down the road. They're just fortunate that the Vikings made similar mental mistakes. ",
            "3": "It really helped the Lions that Ponder was so inept. He went 18-of-28 for 236 yards, one touchdown, three picks and a fumble. He didn't even attempt a pass in the first quarter, as the coaching staff clearly doesn't trust him. Plus, there's always Adrian Peterson, who opened the contest with a 78-yard score. Peterson did nothing after that, however, mustering just 15 yards the rest of the way. His final numbers were 93 yards and three total touchdowns on 18 attempts. ",
            "4": "The only Viking receiver with more than 35 yards was Jerome Simpson (7-140), who should be ignored in all fantasy leagues. Greg Jennings predictably did nothing, mustering just three receptions for 33 yards. It sucks that Jennings threw away his NFL career for slightly more money. ",
            "5": "Speaking of disappointing fantasy players, Megatron snagged just four balls for 37 yards. It's a shame because he just missed out on a huge day. He couldn't hold on to the ball in the first quarter - it was one of those process of the catch things that screwed him in Week 1 a few seasons ago - and he later couldn't get a second foot inbounds when hauling in a potential touchdown. ",
            "6": "Bush also lost two touchdowns. Both missed opportunities came on reviews. He was otherwise brilliant, collecting 90 rushing yards (21 carries) and 101 receiving yards (four catches). He did manage to score once. Bush dislocated his thumb in this game, but said that he's fine. ",
            "7": "Save for an interception on a tipped pass, Stafford was outstanding. He went 28-of-43 for 357 yards, two touchdowns and the pick. He distributed the ball evenly, with six Lions catching at least three balls. Stafford's scores went to Bush and undrafted rookie tight end Joseph Fauria (3-27). "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "So much for the Raiders being the worst team of all time. They were very competitive in this contest and had a great chance to win at the very end. The main reason for this was that Terrelle Pryor was absolutely brilliant. Pryor went 19-of-29 for 217 yards, one touchdown and two interceptions (one pick was legitimate; the other came on a desperation attempt at the end of the contest). Pryor was most lethal on the ground though, compiling 112 yards on 13 carries. He actually had more rushing yards than any other NFL player following the 1 p.m. games. Now, before anyone gets too excited, remember that Indianapolis' defense is probably the worst stop unit in the NFL. The lack of one talent is one thing, but they were just so poorly coached. Matvei, whom I enter the Las Vegas Hilton Supercontest with, texted me and said that Chuck Pagano studied film of last year's 49ers-Packers tilt. That's exactly what it looked like. It seemed as though the Colts had no idea that Pryor could run the football. They didn't set the edge at all and looked completely unprepared. Fortunately for the Colts, this all didn't matter because Andrew Luck was sharp in the clutch. Once again leading his team on a game-winning drive, Luck had just five incompletions (18-of-23), compiling 178 yards and three touchdowns (two passing, one rushing). It was very discouraging that Luck was constantly under pressure - the Raiders have no legitimate pass-rushers outside of Lamarr Houston, so I'm still not quite sure how this happened - but he's one of the top, young quarterbacks in the NFL and just has a knack of eking out victories. He also rushed for 38 yards, which includes one scamper where eluded two potential sacks. Linebacker Kevin Burnett had him wrapped up, but Luck somehow eluded him. ",
            "2": "Luck's aerial scores went to Reggie Wayne (8-96) and Dwayne Allen (1-20). Allen injured his hip in the second half. His absence hurt Indianapolis' blocking. Meanwhile, both Darrius Heyward-Bey and T.Y. Hilton snagged three receptions for 33 and 20 yards, respectively. ",
            "3": "Vick Ballard started this contest and outrushed Ahmad Bradshaw, 63-26. However, it seemed like Pagano was simply rewarding Ballard for playing in the preseason. Ballard had just five carries after halftime (eight prior). ",
            "4": "Ballard and Bradshaw's counterpart scored a touchdown. Darren McFadden nearly got into the end zone on a second occasion, but his second foot was out of bounds on a potential long reception. McFadden gained 48 yards on 17 carries. ",
            "5": "Pryor hit Rod Streater and Denarius Moore five times each. Streater outgained Moore, 70-43, but Moore caught Pryor's lone aerial score. ",
            "6": "A bit more on Pryor: He has unbelievable athleticism and will eat up inept defenses that aren't prepared for him. He made some clutch plays in this contest, including one 4th-and-9 conversion in the final quarter. However, there were some mental mistakes. He had to waste a timeout and later was whistled for delay of game inside the Indianapolis 5-yard line. He also can't read defenses, so coordinators who have talent to work with will befuddle him. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "2"
        },
        "comments": {
            "amount": "6",
            "1": "The score may not show it, but the Jaguars opened the game with some awesome momentum. They blocked a Kansas City punt to score a safety. The crowd was going nuts, probably because they were thrilled to have the Red Zone channel on the Jumbotron. Things looked bright in Jacksonville for the first time in years... And then reality set in. The offense had its blunders - among other things, Blaine Gabbert tossed an early interception because of a miscommunication with Cecil Shorts - but the defense was very anemic. Kansas City outgained the Jaguars, 170-56 by halftime, as Alex Smith and Jamaal Charles did whatever they pleased. ",
            "2": "Charles rushed for 77 yards and a touchdown on 16 carries. He also caught three balls for 23 yards. He could've enjoyed a much brighter afternoon, but he left the game in the third quarter with a quad injury. Charles did return to rush the ball once in the fourth quarter, but Kansas City didn't need him on the field because this game was such a blowout. Still, it's highly encouraging that Charles was able to take the field after getting dinged. ",
            "3": "Smith, meanwhile, went 21-of-34 for 173 yards and a pair of scores. Smith obviously didn't trail by more than two throughout the afternoon, so he was able to do what he does best - check the ball down to his targets. Smith will have much greater issues when facing large deficits and tougher defenses, but he lives for games like this. ",
            "4": "The one player hurt by Smith's constant checkdowns is Dwayne Bowe, who caught just four balls for 30 yards. If you're a Bowe fantasy owner, get used to performances like this. Bowe will have the occasional big game, but he'll have pedestrian numbers for a No. 1 wideout by the end of the season. ",
            "5": "Let's get through the Jaguars quickly. Gabbert is terrible. He went 16-of-35 for 121 yards and two picks. The first interception, the aforementioned miscommunication, was not really his fault. The second one was, as he tossed the ball right to Tamba Hali, who took the pick back for six. Gabbert managed to injure his thumb in this contest, but it's not like it matters. It's clear that he's the worst starting quarterback in the NFL. Jacksonville will have to take Teddy Bridgewater or Tajh Boyd next April (click here for my ). It should be noted that Gabbert wasn't completely at fault. The offensive line was terrible, which is puzzling, given that Jacksonville used its first-round pick on right tackle Luke Joeckel. Gabbert took six sacks. Justin Houston had three of them. ",
            "6": "Maurice Jones-Drew (15-45) and Cecil Shorts (3-40) had poor fantasy outings because of Gabbert's ineptitude. There will be better days against softer defenses, so don't panic if you own one of them. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Saints",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "I expected the Saints to come out on fire in this game. With Sean Payton back after a yearlong absence, the team was excited to just play football with some normalcy. The ALS-stricken Steve Gleason led the Who Dat chant with Payton's aid, and the normally crazy crowd was fired up more than usual. The strong start didn't happen though. In fact, it looked like the Falcons would run away with a victory after taking a 10-0 lead at the end of the first quarter. The Saints, however, were able to rally, thanks to a strong defensive effort. Rob Ryan's new unit surrendered just seven points in the final three frames and had an awesome goal-line stand to secure a victory. This was especially impressive because the Saints lost several defenders in this contest, including nose tackle Brodrick Bunkley and starting cornerback Keenan Lewis. Of course, Drew Brees had a big say in this victory. He went 26-of-35 for 357 yards, two touchdowns and an interception, absolutely torching a secondary featuring two rookie cornerbacks. Asante Samuel was out, so Desmond Trufant and Robert Alford were tasked with stopping New Orleans' aerial attack. Yeah, that wasn't happening. ",
            "2": "Brees' scores went to the usual suspects: Marques Colston (5-68) and Jimmy Graham (4-45). Rookie wideout Kenny Stills caught a 67-yard bomb, but he had just two receptions on the afternoon. Darren Sproles (6-88) led the team in receiving yardage. ",
            "3": "Sean Payton told the media that he wants to run the ball more often this season. He kept his word, as Pierre Thomas (9-43), Sproles (8-22) and Mark Ingram (9-11) combined for 26 carries. It's always good to be balanced, but Payton may have run the ball a little too much early on. The Saints failed on a fourth-and-inches try in the first half because Ingram was stuffed in the backfield. With Brees matched up versus two rookie corners, the Saints should have exploited that advantage. ",
            "4": "The Falcons, meanwhile, didn't run the ball enough. Steven Jackson had just 11 carries for 77 yards, including a 50-yard scamper. Atlanta never trailed by more than six points, so I'm not sure why the team abandoned its rushing attack, especially since Jackson was such a prized offseason acquisition. It's worth noting though that Jackson dropped two passes, including a key one on the team's final drive. ",
            "5": "Matt Ryan threw the ball 38 times. He completed 25 passes for 304 yards, two touchdowns and an interception. Ryan's an excellent quarterback, but the constant passing was a bad idea because the Saints did a great job of applying pressure on him. New Orleans recorded three sacks, but the number could've been much higher if Ryan wasn't capable of releasing the ball so quickly. Ryan took a shot to the ribs early on and appeared to be hurt. ",
            "6": "Ryan's scores went to Julio Jones (7-76) and Tony Gonzalez (3-36). Harry Douglas led the Falcons in receiving with four grabs for 93 yards, but he was such a big factor in the aerial attack because Roddy White was so limited. White, who was declared out by ProFootballTalk.com prior to kickoff, managed just two receptions for 19 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Jets",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: I picked the Jets to win. I watched the Jets win. But I'm still not sure how they won. What the hell was Lavonte David thinking? Why not just roll out the red carpet and walk New York down into field goal range? </i> ",
            "2": "It was the epitome of an ugly win, but a victory nevertheless for the Jets. A coach from a rival team texted me and thought the Bucs would win in an ugly game; he was correct about the description, but wrong about the outcome. Tampa Bay made a ton of undisciplined mistakes which eventually came back to cost them the game. Here are Tampa Bay's greatest hits of sloppy mistakes from Sunday: two delay of games, multiple false starts, holding on Davin Joseph, Mark Barron dropping a pick, two helmet-to-helmet penalties on the safeties, Josh Freeman throwing an interception to Dawan Landry, and Leonard Johnson blowing a third-down stop that gave New York a critical first down on a fourth-quarter field goal drive instead of just a punt. That allowed Geno Smith the opportunity to move the ball into Tampa Bay territory for a go-ahead field goal with five minutes remaining. Freeman came back to answer and get the Bucs a 17-15 lead with a field goal. But the backbreaking mistake was a 15-yard penalty on Lavonte David to give the Jets 15 critical yards so Nick Folk could hit a 48-yard field goal with seven seconds remaining. Smith scrambled for about eight yards and had stepped out of bounds when David gave Smith an extra shove to the ground. The penalty was reminiscent of Dwayne Rudd's helmet toss from 11 years ago. In total, Tampa Bay was penalized 13 times for 102 yards versus six infractions for 45 yards on New York. ",
            "3": "The mistakes wiped out a great performance by Vincent Jackson. Jackson set up a Mike Williams (4-52) touchdown with a 39-yard reception. Jackson had his way with rookie Dee Milliner throughout the afternoon. After catching a 10-yard pass, Jackson spun away to run 27 more yards and set up Tampa Bay to take the lead with less than a minute remaining. Jackson (7-154) was a stud and the Jets had no answer for him with Milliner or Antonio Cromartie. ",
            "4": "The Bucs' offensive line was absolutely brutal, but you have to credit New York's defensive front for playing a great game. Doug Martin (24-65) never got going because Tampa Bay couldn't open holes, and the Jets were superb in their gap integrity. Freeman had some accuracy issues, but I don't think it is fair to pin the loss on him considering his offensive line was God awful at opening running lanes and giving him time to throw. His line allowed three sacks and a ton of pressure. Donald Penn was beaten for sacks by Muhammed Wilkerson and Antwaun Barnes. Freeman was 15-of-31 for 210 yards with a touchdown and an interception. ",
            "5": "Geno Smith's first pass was a 26-yard gain to Jeremy Kerley (3-45), and the rookie improved as the game progressed. Smith definitely had moments where he looked like a rookie. Smith panicked under heavy blitzes. On one, he held onto the ball too long and Mason Foster (2 sacks) managed a strip-sack inside the Jets' five-yard line that was recovered by Tampa Bay. That set up a five-yard touchdown run from Martin. Smith later gave it back to the Bucs with a terribly inaccurate pass intercepted by Lavonte David. Smith had a nice drive just before halfime, making two good throws to Kellen Winslow including an eight-yard touchdown toss. For his first game, Smith made some nice plays on third down and came up with some clutch completions and runs in the fourth quarter. He finished 24-of-38 for 256 yards with a score and a pick, plus ran for 47 yards on six carries. Smith didn't get much help from the ground game as Bilal Powell (12-29) and Chris Ivory (10-15) were contained. Winslow sat out last season, but had an impressive comeback game against his former team. He led the Jets with 79 yards on seven receptions. If your fantasy team is weak at tight end, you should consider picking up Winslow. New Tampa Bay cornerback Darrelle Revis had a strong debut. He had two passes broken up on slants and only allowed one catch - a slant to Santonio Holmes (1-13). Revis and safety Dashon Goldson already look like big upgrades from the Buccaneers' terrible 2012 secondary. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Titans",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "I didn't like the Titans' chances in this matchup because Jake Locker was playing on the road against Dick LeBeau's defense. Well, Locker didn't really have to do much because Pittsburgh did a great job of self-destructing. The Steelers were stuck at two points for most of the afternoon - a byproduct of a Darius Reynaud blunder on the opening kickoff - as they couldn't maintain drives, converting just 4-of-13 tries on third down. The issue with the Steelers is pass protection. Their offensive line was absolutely anemic, and it's no surprise that they couldn't hold up for Ben Roethlisberger in this contest - especially when center Maurkice Pouncey was carted off the field with a knee injury. It was extremely unfortunate, as Pouncey's own teammate inadvertently rolled into his knee. Pouncey, who tore his ACL and MCL, is the most talented player on the front, so his absence will make it extremely difficult for Pittsburgh to move the chains this entire season. Roethlisberger went 21-of-33 for 191 yards, one touchdown and an interception. He was sacked five times, including twice by Jurrell Casey, who had an amazing preseason. As I wrote in the preseason recaps, Casey is poised for a huge year. ",
            "2": "Only three non-running back Steelers caught more than one pass: Antonio Brown (5-71), Emmanuel Sanders (7-57) and Jerricho Cotchery (4-34, TD). ",
            "3": "The Steelers, as you can imagine, had issues running the ball. Isaac Redman, who started, gained just nine yards on eight carries. He also lost a fumble in the red zone. Felix Jones, meanwhile, didn't get a single touch because he blew a blitz pick-up. It makes you wonder why the Steelers cut Jonathan Dwyer, who was their most talented running back. ",
            "4": "As mentioned, Jake Locker didn't have to do anything. He completed just 11-of-20 attempts for 125 yards. I wanted to see if he could put together a strong performance in hostile conditions, but we'll have to wait for that. ",
            "5": "Only three Titans caught passes, with Nate Washington predictably leading the way with four grabs for 46 yards. Delanie Walker (3-40) and Kendall Wright (2-11) also had multiple catches, while Kenny Britt (1-15) barely did anything. ",
            "6": "Chris Johnson had a tough matchup, which would explain his low YPC. He gained just 70 yards on 25 carries. Rookie rush linebacker Jarvis Jones blew him up on one play. ",
            "7": "Speaking of Tennessee running backs, goal-line specialist Shonn Greene left the game early on with a knee injury. Jackie Battle replaced him as the goal-line hammer, which had to be disappointing for CJ2K owners. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "28"
        },
        "comments": {
            "amount": "6",
            "1": "The Packers spent the entire offseason trying to figure out the read-option. Colin Kaepernick destroyed them on the ground in the playoffs, so the entire staff went down to College Station and reviewed tape with the Texas A&amp;M coaching staff. Unfortunately for Green Bay, this was all for naught. Jim Harbaugh, who always seems to be one step ahead of Mike McCarthy, barely called any read-option plays for his quarterback. Kaepernick, instead, torched the Green Bay secondary. Kaepernick went 27-of-39 for 412 yards and three touchdowns to go along with 22 rushing yards on seven scrambles. Kaepernick's 400-yard performance was the first by a 49er since Tim Rattay nearly a decade ago. What the Packers mainly weren't prepared for was Anquan Boldin. Proving that last year's exceptional playoff run was no fluke, the former Raven hauled in a ridiculous 13 receptions for 208 yards and a touchdown. Boldin, 33 in October, looked like a spry 25-year-old again. It's unbelievable how dominant he was. ",
            "2": "Kaepernick's other two scores went to Vernon Davis (6-98). Davis said he was thrilled to play with a quarterback like Kaepernick after the game, which was amusing considering that he said that Alex Smith should be the quarterback at the end of last season. Kaepernick and Davis simply didn't click in 2012, but that appears to have changed. ",
            "3": "One thing the Packers did well was contain the run. Frank Gore mustered just 44 yards and a touchdown on 21 carries. ",
            "4": "The Packers also struggled to rush the football, which has to be discouraging considering that they spent two draft picks on running backs. Eddie Lacy, the second-rounder, totaled just 41 yards and a touchdown on 14 carries. His best run was an 11-yarder in the second quarter that was wiped out because of a Josh Sitton hold. Lacy then lost a fumble on the next play. On the bright side, Lacy made some very shifty moves on a 31-yard screen pass in the first quarter. ",
            "5": "Aaron Rodgers had a nice performance considering the defense he was battling. He went 21-of-37 for 333 yards, three touchdowns and an interception that wasn't his fault; Jermichael Finley bobbled the ball and allowed rookie safety Eric Reid to pick it off. Reid had a second interception, but an offside penalty nullified that. Rodgers' scores went to Jordy Nelson (7-130), Randall Reggie Cobb (7-106) and Finley (5-56). James Jones did not make a single reception. ",
            "6": "I'd be remiss if I didn't mention an egregious blunder by the officials in the second quarter. Clay Matthews, who had a sack, ran down Kaepernick and hit him late out of bounds. A scrum ensued and left tackle Joe Staley punched Matthews in the helmet. The official ruled that there were offsetting penalties, but he incorrectly stated that the down should be replayed. It should've been fourth down because the penalties took place after the play, but the 49ers got a second chance, which they turned into a touchdown. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Rams",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "This was a battle of two defensive teams that could make the playoffs if they get solid play from their quarterbacks. If this opening-day matchup is any indication, both the Cardinals and Rams could be vying for a postseason spot. The winning signal-caller, Sam Bradford, was outstanding. He went 27-of-38 for 299 yards, two touchdowns and an interception that was tipped in the air and returned for a touchdown by nose tackle Dan Williams. Bradford could have notched a third score, but Jared Cook lost a fumble on what should've been an easy trip to the end zone. Tyrann Mathieu made a great play to chase Cook down. Also not included in Bradford's stat line is a long pass interference that Tavon Austin drew on Mathieu. I want to make a note here that Mathieu had an outstanding performance, save for that penalty. ",
            "2": "Both of Bradford's scores went to Cook, who had a monstrous outing. He caught seven balls for 141 yards. As mentioned, he was so close to a third score. Austin also had a solid debut for the Rams. He snagged six receptions for 41 yards and also had that pass interference that he drew 38 yards downfield on Mathieu. Chris Givens didn't do much (2-27). ",
            "3": "This was St. Louis' first game in the post-Steven Jackson era. Daryl Richardson looked solid, gaining 63 rushing yards on 20 carries. He also made five catches for 33 receiving yards. ",
            "4": "Carson Palmer, meanwhile, went 26-of-40 for 327 yards, two touchdowns and an interception. He took four sacks, which isn't too bad considering his lack of mobility and the state of the Arizona offensive line. Robert Quinn had three of those sacks, easily beating inept left tackle Levi Brown. Quinn also forced Palmer into two fumbles. ",
            "5": "Palmer and Larry Fitzgerald looked as if they had been playing for years; not months. Fitzgerald snagged eight catches for 80 yards and two touchdowns. Andre Roberts (8-97) and Michael Floyd (4-82) also showed well. Floyd made an awesome one-handed reception in the first half. ",
            "6": "Rashard Mendenhall didn't do anything spectacular, save for an 11-yard scamper. He tallied 60 yards on 16 carries. ",
            "7": "One thing that helped the Cardinals' offense was the play of Cortland Finnegan. The St. Louis defensive back stupidly committed two personal fouls. He was also called for illegal contact and was beaten for a score on one of Fitzgerald's touchdowns. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "31"
        },
        "comments": {
            "amount": "5",
            "1": "Turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers, turnovers and turnovers. Oh, did I mention turnovers? That's the key word for this contest, as the Giants assumed Dallas' role and constantly shot themselves in the foot. They committed a ridiculous six give-aways, yet still only lost by five. Tom Coughlin said after the game that he was embarrassed. Here's the rundown of the turnovers: 1. Eli Manning was picked on the first play of the game. DeMarcus Ware made a great play to disrupt a screen. Dallas was able to come away with a field goal. 2. David Wilson fumbled the ball in the red zone later in the first quarter. It's worth noting that Wilson later was stuffed on the goal line and then blew a blitz pick-up, leading to a Manning sack. 3. Manning overthrew his target near the end of the first quarter for a second pick. 4. Wilson was stripped for a fumble returned for a touchdown. He wasn't on the field after that. He finished with 19 yards on seven carries, absolutely killing his fantasy owners. 5. A weird bounce on a punt bounced off an unaware Giant. 6.Da'Rel Scott, replacing Wilson, had an interception tip off his hands. Scott wasn't turned out because he didn't recognize the read. All Manning could do was raise his arms in frustration while the Cowboys ran back the pick for a touchdown. Scott took five carries for 23 yards. More significantly, he caught five balls for 51 receiving yards. ",
            "2": "Manning's first two picks were bad, but he was otherwise exceptional. He actually had the same 27-of-42 line as big brother Peyton. He threw for 450 yards, four touchdowns and the three interceptions. Three of Manning's scores went to Victor Cruz (5-118). Hakeem Nicks (5-114), Rueben Randle (5-101) and Brandon Myers (7-66, TD) also had big games as a result of the Giants always being in catch-up mode. ",
            "3": "One thing to note about the Giants' offense is that Manning took three sacks. First-round rookie Justin Pugh did a great job though, getting beaten only once on a play in which the Cowboy defender looked like he was offside. ",
            "4": "As for the winning team, Tony Romo went 36-of-49 for 263 yards, two touchdowns and an interception. There was a scary moment in which Romo was blasted in the ribs at the end of the first half. He was down for a couple of minutes, and it was unclear if he'd play after intermission. Things did not look promising when he threw an ugly duck to Dez Bryant to open up the third quarter, but he continued to get more and more comfortable, and it eventually didn't seem like the injury was a factor at all. He went 11-of-16 for 75 yards after intermission. Both of Romo's scores went to Jason Witten (8-70) which was weird to see because the All-Pro tight end isn't usually a red-zone target. Miles Austin-Jones (10-72) had a big day, while Dez Bryant barely did anything (4-22) because the Giants game planned to eliminate him. Bryant had his ankle rolled up in the second half. ",
            "5": "DeMarco Murray had a pretty mediocre outing, gaining 86 yards on 20 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "What would Chip Kelly's NFL offense look like? That was the big question entering this contest. We found out right away, as the Eagles zoomed down the field. Their first drive ended in a fumble returned for a touchdown by DeAngelo Hall on a weird, seemingly backward pass by the quarterback that had to be reviewed. However, Philadelphia, completely undaunted, scored 10 points on the next two drives that only spanned a combined two minutes and 42 seconds. The Eagles showed the Redskins tons of complicated looks, and the defenders were completely confused. Washington finally had some success stopping Philadelphia, but the damage had already been done; the Eagles went up 33-7 in the middle of the third quarter. ",
            "2": "Philadelphia did a great job of running the ball, which is something Eagle fans were not accustom to in the Andy Reid era. LeSean McCoy and Bryce Brown had a combined 40 carries. McCoy was especially awesome. He had so many breath-taking jukes and shifty moves to elude Washington defenders. He gained 184 yards and a touchdown on his 31 attempts, giving him the league lead in rushing. ",
            "3": "QB Dog Killer also scored on the ground. He scrambled nine times for 54 yards to go along with his 15-of-25 passing for 203 yards and two aerial touchdowns. QBDK operated the offense well, but had some issues with accuracy, missing open receivers at times. Of course, the huge concern is his durability, and he seemed to be limping around near the end of the game. The primary reason why the Eagles ultimately won't achieve much success this season is because QBDK will get hurt at some point. If he's still in the lineup by Halloween, it'll be completely shocking. ",
            "4": "QBDK's two passing scores went to DeSean Jackson (7-104) and Brent Celek (2-56). Jackson was great, as he seems to be a natural fit in this offense. No other Eagle had more than two receptions. ",
            "5": "The nation wanted to see Kelly's offense, but Washington anticipated Robert Griffin's return from major knee surgery. The crowd was ready to cheer him on, but they were highly disappointed for most of the contest, as Griffin and his supporting cast were extremely flat and made numerous, unforced blunders as a consequence. This includes: First drive: Alfred Morris (12-45, TD) lost a fumble, leading to a Philadelphia touchdown because Washington's defense was exhausted. Second drive: An illegal shift negated Griffin's first completion. Griffin then tossed an interception late down the middle of the field. Third drive: Morris couldn't catch a pitch in his own end zone, though it was a bit wide of his body. He had to fall on the ball and take a safety. Fourth drive: A Logan Paulsen hold disrupted a drive. The penalty led to a punt. You get the idea. The Redskins played terrible football. They resembled the Giants on Sunday night, but were much worse because Griffin wasn't nearly as sharp as Eli Manning. He wasn't stepping into his throws (often behind his receivers) and looked hesitant to run. Things were at an all-time low when he lobbed a weak-armed interception in the third quarter... And then everything changed. Griffin got into a groove in the final frame. He nearly led an amazing comeback. Had the Redskins recovered an onside kick with a minute remaining, they probably would have pulled off the victory. The Eagles' defense, which had been playing so well in this contest - especially the linebackers, Fletcher Cox and newcomer Cary Williams - was reeling, and all of the players seemed to ran out of gas. Griffin finished 30-of-49 for 329 yards, a pair of touchdowns and the two interceptions. He also scrambled five times for 24 rushing yards. The majority of his debut was disappointing, but the way he finished this contest has to be encouraging. ",
            "6": "Both of Griffin's scores went to Leonard Hankerson (5-80). Pierre Garcon had a big game as well (7-64), but couldn't find the end zone. ",
            "7": "Stud rush linebacker Ryan Kerrigan left the contest in the fourth quarter to get tested for concussions. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "New season, new coaching staff, same old Chargers. CKane said it best: You can take the Chargers away from Norv but you can't take Norv away from the Chargers. San Diego was responsible for multiple collapses last season, most notably Peyton Manning's epic comeback and the Ravens' victory in which Ray Rice allegedly converted a 4th-and-29. The team went up 28-3 in the third quarter Monday night and was absolutely dominating this contest. But that's when the Chargers reverted to their old habits. They did dumb things to relinquish the lead, as the Texans ultimately hit a last-second field goal to triumph by three points. It all started in the third quarter when San Diego surrendered multiple third-and-long situations. Matt Schaub converted a 3rd-and-18 as well as a 3rd-and-13. The Chargers then hit the center on a Houston field goal attempt early in the final period. The kick would've made it 28-17. Instead, the Texans were awarded a free first down and found the end zone on the very next play. The score was once 28-7, but Houston drew within seven. The Chargers proceeded to allow a converted fake punt, followed by a Philip Rivers tying pick-six to Brian Cushing. Eddie Royal killed a potential first-down conversion on the next drive by dropping the ball, and Houston took over and eventually moved into field-goal range to secure the victory. ",
            "2": "San Diego's defense deserves a ton of blame for this loss, but Rivers was awful in the second half. He was just 6-of-15 for 83 yards, one touchdown and the aforementioned pick-six after intermission. His team didn't help him with poor blocking and dropped passes, but it was disappointing to see Rivers melt down after a hot start. His final numbers were 14-of-29 for 195 yards, four touchdowns and the interception. ",
            "3": "Rivers' scores went to Ryan Mathews, Vincent Brown (2-13) and Royal twice (3-24). The Texans did a great job of scheming Antonio Gates (2-49) out of the game. ",
            "4": "Mathews, who opened with the first touchdown, looked pretty quick at first. However, the Texans ultimately bottled him up, holding him to 33 yards on 13 carries. Danny Woodhead, meanwhile, caught just two passes. I'm not sure why he wasn't utilized more. ",
            "5": "Everyone will laugh at the Chargers for the loss, but Houston's ability to rally can't be ignored. Matt Schaub was unstoppable in the second half, finishing 34-of-45 for 346 yards, three touchdowns and a fluke interception at the beginning of the game that was tipped into the air and picked by nose tackle Cam Thomas. ",
            "6": "Schaub found only his tight ends in the end zone; Owen Daniels, who had two touchdowns, made five receptions for 67 yards. Garrett Graham (4-27) caught the other score. However, Andre Johnson was Schaub's preferred target. Johnson hauled in 12 receptions for 146 yards, making it the 19th time he has snagged at least 10 catches in a game throughout his career. That's an NFL record, believe it or not. ",
            "7": "Gary Kubiak said that Arian Foster and Ben Tate were going to split touches. Well, it wasn't very even; Foster had twice as many carries as Tate (18-9). Despite this though, Foster outgained Tate by just two rushing yards (57-55) though he did catch six balls for 33 receiving yards. There's no doubt Tate is the better runner, but there's Foster is better at blocking and receiving. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    },
    "numberOfGames": "16"
}