{
    "year": "2013",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Bengals had the AFC North already clinched. The only thing they were playing for was a possible shot at the No. 2 seed, though that would've involved the Bills upsetting the Patriots. Cincinnati won by what looks like a convincing margin to at least give itself a chance at a bye, but its fans have to be very concerned about the play of Andy Dalton. Dalton was pretty pedestrian in this matchup. He threw four interceptions, three of which were ugly. The first wasn't too bad, as cornerback Corey Graham had great coverage on Marvin Jones. The second was an ugly overthrow that generated some boos from the crowd. Dalton's third pick was forced into double coverage, while the fourth was a poor misfire on a shot to A.J. Green in the end zone. Dalton, who also had some issues with the play clock in the first half, went 21-of-36 for 281 yards, three touchdowns (two passing, one rushing) and the four picks. He made some nice throws and connected with A.J. Green for a 53-yard scoring bomb, though that pass was underthrown. Dalton did manage to set the franchise single-season record for passing yardage and touchdowns with his numbers, but his struggles shouldn't be lost because they're a huge concern going forward. ",
            "2": "Injuries are an issue for Cincinnati as well. Dalton didn't have either of his two tight ends in this matchup. He also missed left tackle Anthony Collins in the second half, as Collins left the game with an ankle. The Bengals already had tons of injuries, so they can't afford to see any more players get hurt. ",
            "3": "Cincinnati was able to win this game because Joe Flacco had yet another poor outing. Flacco, who already had knee issues, looked like he hurt his shoulder on a first-quarter hit. He was then banged again soon after, and Tyrod Taylor started warming up. Flacco remained under center, but was largely ineffective, going 30-of-50 for only 192 yards, one touchdown and three interceptions. One pick was tipped at the line of scrimmage, but the interception that sealed the game was thrown behind his intended target and returned for six. Flacco also missed an open Jacoby Jones for a touchdown. ",
            "4": "Flacco's sole score went to Marlon Brown (5-30), though his top target was Dennis Pitta, who hauled in eight grabs for 63 yards. Torrey Smith didn't do much (3-27), as Flacco was very limited. ",
            "5": "The Ravens once again struggled to run the ball. Bernard Pierce had a nice gain of 14 early on, but neither he nor Ray Rice were able to do much on the ground much after that. Pierce tallied 28 yards on five carries, while Rice mustered only 15 yards on six tries, though he did catch seven balls for 35 receiving yards. Rice was sidelined for much of the first half with an injury. ",
            "6": "The Bengals had slightly more success on the ground. BenJarvus Green-Ellis looked good as he gained 66 yards on 11 carries, though Giovani Bernard (13-22) couldn't even average two yards per attempt. Bernard did mirror Rice in being a big factor in the passing game; he had five catches for 51 receiving yards. ",
            "7": "Dalton's aerial touchdowns went to Green (4-61) and Marvin Jones (5-61). Green dropped a touchdown, so he could've had an even bigger day. Jones, meanwhile, made a great, acrobatic catch with one hand while falling down. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Colts",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "2",
            "1": "This wasn't a very important game for the Colts. Because they had clinched their division, they were inevitably headed for a third or fourth seed, though there was a very unlikely scenario in which they could obtain a first-round bye. This would involve the Bills winning at Gillette Stadium for the first time in franchise history, so that wasn't happening. Still, Indianapolis got up for this effectively meaningless contest and quite easily dispatched the pathetic Jaguars. Jacksonville made things very easy for the Colts. Maurice Jones-Drew lost a fumble on the opening drive, which helped set up a Donald Brown touchdown. The Jaguars then allowed Trent Richardson to score on a fourth-and-2 near the goal line. Making matters worse, Chad Henne was picked off because of a miscommunication deep in Indianapolis territory. Antoine Beatha had a big return to set up a field goal, making this a three-score affair at halftime. Indianapolis never looked back. This was a nice win, but the Colts sustained a number of injuries: Vontae Davis (groin), Aubrayo Franklin (knee) and Bjoern Werner (ankle) were all knocked out. ",
            "2": "Here are some key stats/notes: - Andrew Luck went 26-of-37 (including a perfect 6-of-6 in the second half) for 282 yards and a touchdown. He should've had a second score, but Griff Whalen dropped the ball in the end zone. On the flip side, Luck was fortunate to get away with an interception in the red zone. - Whalen ultimately found the end zone, as he was one of two Colts who logged more than a couple of receptions (4-32). The other was T.Y. Hilton, who had a huge game with 11 catches for 155 yards. - Both Indianapolis backs scored, as mentioned, though Brown (12-31) and Richardson (8-25) were both limited in terms of yardage. - Henne racked up garbage yardage, finishing 30-of-51 for 331 yards, one touchdown and the aforementioned pick. It must be noted that Henne had just 107 yards by halftime. - Jones-Drew, who fumbled, had just 39 rushing yards on 13 carries, but did catch five balls for 51 receiving yards. This may have been his final game in a Jaguars' jersey. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Jets",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "7"
        },
        "comments": {
            "amount": "4",
            "1": "The Dolphins had the easiest scenario of all the teams vying for the No. 6 seed in the AFC, so it figures that they had the ugliest result. Outside of a victory over Geno Smith at home, they just needed either a Baltimore loss at Cincinnati or a San Diego victory over the Kansas City backups. Miami got what it needed otherwise, but failed to take care of business on its end. There's blame to go all around for this loss. Beginning with Ryan Tannehill, the second-year quarterback completed just half of his passes, going 20-of-40 for 204 yards, one touchdown and three interceptions. The picks obviously weren't good, but Tannehill hurt his team most with regular misfires. He had Mike Wallace wide open for an 80-yard touchdown, but completely missed him. Wallace torched Dee Milliner, but Tannehill couldn't hit him with a pass any quality quarterback should convert. Tannehill also made a mistake when he slid feet first just shy of the first-down marker. Instead of moving the chains, Tannehill's action forced a fourth-and-inches situation. The Dolphins called for a Charles Clay run, which was predictably stuffed by David Harris. The Jets consequently took over on a very short field. A number of drops hurt Miami as well. Clay had a huge third-down drop on the opening drive. Rishard Matthews then let the ball fall through his hands in the second quarter. These are just some examples, and it didn't help Tannehill at all that he lost Brian Hartline to a knee injury after a 25-yard reception in the opening half. Two areas that hurt the Dolphins last week that weren't prevalent in this matchup were pass protection and the running game. Tannehill wasn't sacked a single time, and that isn't a fluke stat - Miami's beleaguered offensive line held up pretty well for the most part. It allowed some pressures, but Tannehill had enough time to operate in the pocket. Meanwhile, Lamar Miller ran well, gaining 73 yards on 17 carries. ",
            "2": "As for the Jets, things looked bleak early on for Geno Smith when he threw late or behind some receivers. However, he got his act together and finished the game with three strong quarters. It started when he hit David Nelson for a 24-yarder on a third-and-10. He went on to misfire on just four of his 12 passes following intermission. He was especially lethal out of the pocket, scrambling for 44 yards and a touchdown on the ground. Smith finished 17-of-27 for 190 yards. He had the early aforementioned misfires and later overthrew Nelson for a touchdown. He was also lucky to get away with an interception thrown late across his body. However, Smith had a solid performance overall, and it's definitely something to build on heading into the 2014 campaign. ",
            "3": "Both of New York's scores came on the ground. I already mentioned Smith's touchdown. Rookie defensive tackle Sheldon Richardson also found the end zone, running out of the fullback position. This is the second time Richardson has scored this year, which ties the Fridge for most rushing touchdowns by defensive linemen in a single season. ",
            "4": "Chris Ivory (5-19) missed the entire second half with rib and hip injuries, so Bilal Powell handled most of the workload. He gained 76 yards on 21 carries and also completed a 30-yard pass on yet another trick play. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "13"
        },
        "comments": {
            "amount": "2",
            "1": "The Vikings won this meaningless game by the slimmest of margins, though they dominated this matchup. They outgained Detroit by 100 yards, as the Lions mustered just three first downs in the opening half. Many Detroit players, particularly those on defense, didn't seem to put much effort into this game. There were so many missed tackles, as the team pretty much quit on Jim Schwartz, who figures to be fired Monday. Minnesota had trouble putting Detroit away because of two key turnovers. Matt Cassel forced an interception in the end zone in the first half, and then Matt Asiata, starting in place of Adrian Peterson and Toby Gerhart, lost a fumble that set up a quick Detroit score much later in the game. ",
            "2": "I'm not going to spend much time on this contest. Here were some key stats/notes: - Matthew Stafford struggled once again without Calvin Johnson. He went 22-of-33 for 217 yards and a touchdown, but much of that came after intermission; he was just 8-of-12 for 43 yards after one half of action. - With Johnson out, Detroit's leaders in receptions were Kevin Ogletree (5-75), Nate Burleson (5-64) and Reggie Bush (5-33). Bush, who scored on a reception, couldn't get much on the ground, gaining just 32 yards on 14 carries. - Cassel finished 20-of-33 for 189 yards, one touchdown and the aforementioned pick. He could've had a second touchdown, but actually missed Jared Allen in the end zone. - Cordarrelle Patterson scored twice, once on a 50-yard fake sweep and a second time for an 8-yard score that ended up being the game-winning touchdown. Greg Jennings, meanwhile, led the team in receiving with five catches for 44 yards. - The Vikings still had a solid ground attack despite Peterson's absence. Asiata tallied 115 yards on just 14 carries. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> I didn't know if the Falcons would be able to get up for this game after their emotional loss Monday night. It turns out they did, with Tony Gonzalez's impending retirement being the primary source of their energy. I'm not sure Gonzalez will retire though. He says he will now, but we'll see what happens when he gets that itch come August. ",
            "2": "The Panthers needed a win over the Falcon to get a first-round bye and clinch first place in the NFC South. Thanks to the league's best defense, Carolina will be resting next weekend before hosting a game in the divisional round. The Panthers' pass rush completely dominated the Falcons as Carolina recorded nine sacks against Atlanta's inept offensive line. While the Falcons only had draft position on the line, they played motivated football to try and get a win in the final game of future Hall of Fame tight end Tony Gonzalez's career. Mike Ditka said he thinks Gonzalez is the greatest tight end in NFL history, and Matt Ryan enjoyed having Gonzalez at his disposal one last time. ",
            "3": "Atlanta came out showing a glimpse of its 2012 form as Ryan ripped the ball down the field on his team's first drive. He connected with Gonzalez for a couple completions, including one for 23 yards. Ryan finished the drive with a short touchdown pass to Jason Snelling (5-36). Cam Newton had a crazy escape from a sack and a run to convert a third-and-10, but a deflected pass resulted in a diving interception by William Moore. A screen pass to DeAngelo Williams (10-33 rushing, 2-75 receiving) went for 56 yards, but Desmond Trufant stripped him of the ball and Robert Alford recovered it for Atlanta. A few plays later, Melvin White picked off Ryan and stumbled into the end zone for a touchdown. The Panthers moved the ball inside the 10 just before halftime off a good run by Pro Bowl fullback Mike Tolbert (7-29). Newton finished the drive by hitting a wide open Ted Ginn (2-6) for a three-yard score. In the third quarter, Ryan dropped in a 39-yarder to Roddy White (8-91) for a touchdown. White had four drops in the game, but held on running a deep post against Mike Mitchell. Carolina came right back with a touchdown drive. Newton fired a bullet to Greg Olsen (6-42) for the score. Atlanta had a good drive inside Panthers territory, but it ended with Greg Hardy getting to Ryan and forcing a field goal. Carolina's defense shut down Atlanta's final drives with a relentless pass rush. ",
            "4": "Newton finished completing 15-of-27 for 149 yards with two touchdowns and one interception. He ran for 72 yards on 12 carries. ",
            "5": "Ryan was 28-of-40 for 280 yards with two touchdowns and an interception. He played well considering how pathetic his offensive line was. Steven Jackson (13-41 rushing, 5-53 receiving) and Harry Douglas (7-58) chipped in. ",
            "6": "Greg Hardy was utterly dominant. He beat Gonzalez twice, as well as right guard Peter Konz and left tackle Lamarr Holmes to total four sacks. Hardy was an animal. Carolina has to pull out all the stops to re-sign the 2010 sixth-round pick. The Panthers also got sacks from Frank Alexander, Star Lotulelei, Mike Mitchell and Charles Johnson (two sacks). ",
            "7": "Gonzalez had four receptions for 56 yards in his final NFL game. Congratulations to him on a great NFL career. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Giants",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "6"
        },
        "comments": {
            "amount": "3",
            "1": "You never want to see key players injured in these meaningless games, but New York fans had the misfortune of watching their quarterback and left tackle get knocked out. Eli Manning was taken down awkwardly at the end of the first half. He hobbled into the locker room to receive X-rays on his leg, and he was ruled out for the rest of the game. It turned out to be an ankle sprain. That didn't seem as bad as William Beatty's injury. Beatty was carted off with his right leg immobilized, and he was ultimately diagnosed with a fractured leg. Rehab will be tough for him this offseason, and this further emphasizes the need the Giants have for a tackle. I may give them one in my next <b> <a href=/draft2014.php>2014 NFL Mock Draft</a></b>. ",
            "2": "The other big storyline in this contest was Kirk Cousin's dwindling trade stock. Cousins had a great performance against the Falcons two weeks ago, but has gotten worse each week. Cousins went 19-of-49 for 169 yards, two interceptions and a lost fumble. It could've been even worse for Cousins, as the Giants dropped a couple of possible picks. His receivers hurt him with some drops, but Cousins was completely inept, and the Redskins will be lucky to get anything more than a fourth-round pick for him. ",
            "3": "Some other stats/notes: - Manning went 10-of-24 for 152 yards, one touchdown and an interception. He was nearly pick-sixed on the opening drive. He later hurt his hand and completed just three of 10 passes after that before leaving with his ankle sprain. - Andre Brown also gave the ball away on a lost fumble, all while mustering just 11 yards on 13 carries. Brown's fumble marked the 42nd turnover on the season for the Giants, meaning they've committed at least one give-away in every single game this season. - Curtis Painter replaced Manning and was predictably incompetent. He was just 2-of-8 for 11 yards and an interception thrown in the end zone. - Jerrel Jernigan had another big game. He caught six balls for 90 yards and a touchdown, and he also scored on a 49-yard rush. This wasn't a surprise, as the slot position is a big stat-producer in New York's offense. - Pierre Garcon (6-56) became the third receiver in NFL history to log five or more receptions in every single game this year. He did this on a day in which Antonio Brown accomplished the same feat, though Brown did so earlier in the afternoon. Jimmy Smith was the first. He accomplished this in 2001. - Alfred Morris didn't do much on the ground outside of a 19-yard scamper. He gained 62 yards on 16 carries. He also lost a fumble, though no damage was done because Painter tossed his pick on the ensuing Giants' possession. - This was a horrific offensive game. If the stats and score don't indicate that enough, there were a whopping eight punts in the first 20 minutes. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers were the only team in the early-afternoon slate vying for the AFC's No. 6 seed that didn't disappoint. They completely embarrassed the Browns, though perhaps both Baltimore and Miami would've pulled through had they enjoyed the luxury of battling this inept Cleveland squad. Still though, it's a shame the Chiefs couldn't be victorious against the lackluster Chargers to help Pittsburgh clinch the final spot in the conference. Despite the victory, Ben Roethlisberger did not play well. He went 19-of-31 for 179 yards, one touchdown and two interceptions. He also fumbled, but was lucky enough to recover it. The rain definitely played a factor, as he didn't seem to have complete control of the football on his first interception. He also severely underthrew Antonio Brown downfield for what would've been a long score. Roethlisberger actually should've had a second touchdown, but Jerricho Cotchery had a bad drop. Cotchery did redeem himself, however, ultimately hauling in Roethlisberger's only aerial score. However, Antonio Brown led the way with nine catches for 87 yards. As I noted in the Giants-Redskins capsule, Brown became the second player (Jimmy Smith) to record at least five receptions in every NFL game during a season. ",
            "2": "Le'Veon Bell helped carry the offense, gaining 90 yards and a touchdown on 20 attempts. ",
            "3": "Though Roethlisberger struggled in the heavy rain, it ultimately didn't matter because Jason Campbell was infinitely worse. Campbell's numbers were actually better (23-of-41, 240 yards, one touchdown, one interception), but don't let that fool you. A big chunk of Campbell's yardage came in garbage time, as he was just 8-of-13 for 53 yards in the first half. Campbell, who lost an early fumble because he held on to the ball too long, constantly threw behind his receivers. One of the more egregious passes of this nature was a misfire on a fourth-and-4 behind Josh Cooper deep in Pittsburgh territory. Campbell's pick also was heaved behind his target. It was deflected and intercepted. ",
            "4": "Many of Campbell's junk yardage went to Josh Gordon (7-82), who had just one catch in the opening half. Jordan Cameron (5-69) was solid in his return from a concussion. ",
            "5": "Running back Edwin Baker actually looked pretty decent on an early 20-yard scamper, showing some nice speed. Baker, who gained 69 yards on 18 carries, can be a capable No. 2 back next year. ",
            "6": "The big news for the Browns was the report that Rob Chudzinski would be fired. I've posted a <a href=/freeagents2013recap.php>coach firing grade</a> for Chudzinski, who had a YOLO approach to this game, constantly going for it on fourth down. I'm all for aggressiveness, but had Chudzinkski settled for some field goals, the Browns could've been in position to tie on a final drive. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Titans",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "10"
        },
        "comments": {
            "amount": "2",
            "1": "The Texans lost this game, but they were the ultimate winners because they secured the No. 1 pick in the 2014 NFL Draft. I have them picking Teddy Bridgewater in my <b> <a href=/draft2014.php>2014 NFL Mock Draft</a></b>, though Jadeveon Clowney is definitely an option. ",
            "2": "I'm not going to delve too much into this game because it was otherwise meaningless. Here are some notes: - The Titans would've won this game by a wider margin had Ryan Fitzpatrick not been so inaccurate in the first half. His interception came in Houston territory when he was hit as he threw, but he missed open receivers, especially on a drive at the end of the second quarter. He went 15-of-24 for 166 yards and the pick, though it's worth noting that he was 6-of-7 for 48 yards following the break. - Chris Johnson will likely be cut after the season is over. He gave Tennessee fans one last solid performance, rushing for 127 yards and a touchdown on 27 carries. - Matt Schaub went 22-of-34 for 229 yards and two picks, though one of the interceptions was just a desperation overthrow at the very end of the game. Schaub won't be back with his team either. - With Andre Johnson limited to six catches for 49 yards, Houston's greatest yardage producer in this contest was fourth-string running back Jonathan Grimes, who handled the workload because Arian Foster, Ben Tate and Dennis Johnson were all out. He rushed for 50 yards and a touchdown on 16 carries and also caught six balls for 76 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Packers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "28"
        },
        "comments": {
            "amount": "5",
            "1": "There's a reason the Packers went from 4.5-point underdogs to three-point favorites when it was announced that Aaron Rodgers would play. Matt Flynn has done a solid job since taking over for the inept Seneca Wallace and Scott Tolzien, but Rodgers' presence on the field gives Green Bay a chance to beat anyone because he's the best quarterback in the NFL when he's healthy. <r> Rodgers actually didn't look very healthy early on. He began 3-of-3 with some short and intermediate throws, but that streak was interrupted with a James Starks drop. It still looked promising though when Green Bay reached the red zone, but Rodgers was intercepted when rolling out of the pocket. Rodgers then threw another interception on a high pass to Jordy Nelson that was tipped and picked. Rodgers missed several throws after that. He had Nelson open for a touchdown, but misfired. He failed to connect with Nelson (10-161) on a couple of other occasions, including a crucial third-and-8 when he fired behind his favorite receiver. However, Rodgers came through in the clutch, finding Randall Cobb for a 48-yard score on the very next play. There was some good and some bad from Rodgers, who finished 25-of-39 for 318 yards, two touchdowns and the pair of interceptions. This was to be expected though, and he should only be better next week when he takes on the 49ers. ",
            "2": "There was also a major plot line regarding Chicago's quarterbacking situation. There was major debate whether Jay Cutler or Josh McCown should start. Cutler, 1-7 against the Packers heading into this contest, actually performed well despite the loss. He went 15-of-24 for 226 yards, two touchdowns and an interception that came at the very end on a Hail Mary. Cutler has choked versus Green Bay in the past, but this loss certainly wasn't his fault. His usually reliable weapons had a hand in this defeat. Alshon Jeffery (3-80) lost a fumble in the first half, while Brandon Marshall (6-74, TD) was guilty of a drop on the final drive. ",
            "3": "Chicago's defense was ultimately to blame for this loss because it blew a coverage on Cobb's decisive touchdown. It also didn't pay attention on a weird play in which Rodgers fumbled and then Jarrett Boykin ran into the end zone after picking up the football and standing around for what seemed like 10 seconds. ",
            "4": "The Bears also struggled to stop the run. Thanks to an ankle injury that continued to hamper him, Eddie Lacy was held in check with 66 yards and a touchdown on 21 carries. Starks, however, tallied 88 yards on just 11 attempts. ",
            "5": "Matt Forte had the most success of any running back. He had a huge outing after barely doing anything last week. He scored three times; twice on the ground. He accumulated 110 yards on 22 carries and also hauled in four catches for 47 receiving yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "The Patriots clinched the second seed in the AFC with this victory, but it was played sloppily in terrible conditions. There was a downpour in Foxboro, which resulted in countless fumbles and drops. New England was incredibly fortunate in this game. The team fumbled a whopping four times, but didn't lose possession on any of the cough-ups. LeGarrette Blount, Shane Vereen and Julian Edelman (muffed punt) all dropped the ball, but didn't cost their team. Stevan Ridley also appeared to lose possession, but it was ruled that he was down by contact. The fourth fumble was a botched snap, also pounced on by New England. Meanwhile, a Vereen drop bounced into the arms of a Buffalo player, which will officially go down as a Tom Brady interception. The Bills, meanwhile, didn't commit as many blunders, but they were more costly. T.J. Graham lost a fumble and also had a big drop on a fourth-and-2. This was just one of three instances in which Buffalo failed to convert on fourth down. It was a bit odd because Thad Lewis was able to complete some impressive throws on third-and-long situations. This obviously does not include a Fred Jackson drop on third down. Buffalo's mistakes included penalties. On offside on a fourth-and-1 field goal attempt allowed the Patriots to score a touchdown. On another sequence, Alan Branch was penalized for unsportsmanlike conduct for a late shove, and during the announcement, Ed Hochuli told the crowd that Jerry Hughes was flagged for a separate 15-yard infraction for shouting expletives at the officials. This didn't cost the Bills, however, because the drive ultimately culminted with a Brady punt. On third-and-32. Yes, it was that weird of a game. ",
            "2": "As for some positives, LeGarrette Blount had a career day. He rushed for 189 yards and two touchdowns on 24 carries. And if that wasn't enough, he inexplicably had kickoff returns of 83 and 62 yards in the second half. ",
            "3": "Brady didn't have as much success. He went 14-of-24 for 122 yards, one touchdown and the aforementioned interception. The score was thrown to Vereen (3-42), who was just one of two New England players to record more than one reception. The other was Edelman (9-65), who was guilty of a drop. New England's aerial attack was simply stymied by the weather, though Aaron Dobson's injury didn't help. ",
            "4": "As for the Bills, Lewis was pretty solid. Considering all of the drops and the horrible weather, his 16-of-29, 247-yard and one-touchdown line is impressive. Lewis has not been any sort of downgrade from E.J. Manuel this season. Manuel obviously has more long-term potential, but Lewis has solidified himself as a solid backup. ",
            "5": "Manuel's aerial score went to Graham (3-62). Jackson secured Buffalo's other touchdown (14-60); he was a factor in the passing game (three catches, 53 receiving yards), though he was outgained on the ground by C.J. Spiller (19-105). "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Saints",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> How could I not bet any units on the Saints at home? Pretty stupid on my part. ",
            "2": "With the Panthers winning in their early game, the Saints lost their shot at a first-round bye and the NFC South Championship, but New Orleans still needed to win in order to to lock up a wild-card spot over Arizona. The Saints' offense was a point machine that completely overwhelmed the Bucs' defense. New Orleans came out on fire as Drew Brees threw a perfect bomb down the field to hit Lance Moore (4-73) in stride for a 44-yard touchdown after he burned Leonard Johnson. Tampa Bay came right back to hit on a flea flicker as Mike Glennon threw a 48-yard touchdown to Tiquan Underwood (5-93). The Saints' offense burned the Bucs with passes to Darren Sproles and Jimmy Graham (5-71). The drive ended with Brees firing a bullet to Graham for six. On New Orleans' next possession, Brees and Robert Meachum burned Darrelle Revis for a 41-yard touchdown. Tampa Bay scored again with a short touchdown toss to Tim Wright (5-58). Brees came right back to hit Kenny Stills for a 76-yard touchdown. Revis was in coverage and seemed to think he had deep help from Dashon Goldson - but he didn't. The Bucs moved the ball to the Saints' 25-yard line, but on fourth-and-10, the Buccaneers tried a weird, obviously fake, punt pass with Michael Koenen. It was a broken play from the start and a terrible call by the Tampa Bay coaching staff. In the third quarter, Glennon led a field goal drive, but Brees continued to move the ball at ease and Pierre Thomas (7-20) ran the ball in from seven yards out. Keenan Lewis promptly intercepted Glennon to set up the Saints at the Bucs 25-yard line, and the rout was on. Brees took off on a third down run to score from nine-yards out. ",
            "3": "Brees completed 24-of-31 passes for 381 yards with four touchdowns and one score rushing. Marques Colston (6-67) and Khiry Robinson (12-50) played well for New Orleans. ",
            "4": "Glennon was 22-of-41 for 219 yards with two scores and a pick. Vincent Jackson (4-35) and Bobby Rainey (11-35) were held in check by the Saints defense. Junior Galette had two sacks with one coming against Donald Penn. ",
            "5": "For Tampa Bay, this loss could be the final push to lead to a new front office and coaching staff. The Bucs finished 4-12 when they were expected to compete for the playoffs. The organization is now 28-52 under general manager Mark Dominik. In three of his five years, Tampa Bay has had 12 or more losses and has never finished higher than third place in the NFC South. Greg Schiano is 11-21 after two years and looks like a better fit in the college game. There are better general managers and head coaches available for the Buccaneers to hire. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "I wrote last week that Colin Kaepernick would need to step up for the 49ers to make another Super Bowl push. He had a strong second half Monday night, but that was against a hapless Atlanta defense. What he did in this contest was very impressive, as he beat one of the NFL's elite stop units with a strong afternoon that culminated with two clutch drives to win this game. Kaepernick, who went 21-of-34 for 310 yards and two touchdowns, completed 4-of-6 attempts for 76 yards on the final two possessions of the afternoon. This led to a pair of Phil Dawson field goals to give San Francisco the win. Thanks to his numbers (4 carries, 24 rushing yards included), Kaepernick became just the 12th player in NFL history to throw for 3,000 yards and rush for 500 yards in the same season. Kaepernick's performance was especially impressive considering he had no running game to work with. The Cardinals, entering this weekend No. 2 against the run, limited Frank Gore to just 14 yards on 13 carries. ",
            "2": "Anquan Boldin made his first trip back to Arizona since leaving for Baltimore and then San Francisco. He put on a show in front of his former fans, hauling in a whopping nine passes for 149 yards and a score. With Patrick Peterson smothering Michael Crabtree (3-29), Kaepernick really had no choice but to turn to Boldin and Vernon Davis (3-45, TD). ",
            "3": "The Cardinals had a chance to win this game, but committed too many mistakes. Carson Palmer predictably threw an interception, which was a horrible decision because he tried to force it to Michael Floyd, who had four defenders around him. Rashard Mendehall also predictably lost a fumble. What couldn't have been projected was Jay Feely's two missed field goals, as Feely was 28-of-32 entering this contest. ",
            "4": "Palmer played pretty well aside from the pick. He went 28-of-49 for 407 yards, two touchdowns and the interception. He was especially sharp in the second half, misfiring on just one pass. He was a ridiculous 18-of-19 for 292 yards and a score following intermission. Palmer's touchdown went to Andre Roberts (3-74). His top three targets were Larry Fitzgerald (6-113), Floyd (6-91) and Rob Housler (5-78). ",
            "5": "Mendenhall, meanwhile, couldn't redeem himself after the fumble. He did nothing out of scampering for a 28-yard gain and converting a fourth down. He finished 47 yards on 10 tries. Andre Ellington (9-30) once again needed a bigger workload. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "This game was all about Peyton Manning breaking more records. He eclipsed Drew Brees for the single-season yardage record by just one yard, finishing with 5,477. He increased his all-time record for passing touchdowns in one year, as he reached 55. Denver also became the highest-scoring team in league history. Manning played just one half in this contest, going 25-of-28 for 266 yards and four touchdowns. He was pulled because the Raiders simply couldn't compete; Denver went up 31-0, and the game was over by intermission. It's a shame because Manning was on pace to throw for 532 yards and eight scores. The latter figure is another record he could have broken. ",
            "2": "Two of Manning's scores went to Demaryius Thomas (6-113), who also sat during the entire second half. The same goes for Moreno (5 catches, 41 receiving yards), who also scored. The fourth touchdown went to Eric Decker (4-27). ",
            "3": "Moreno rushed for 23 yards on just six carries to go along with his receiving touchdown. Montee Ball (10-72) and Ronnie Hillman (12-30) handled the majority of the workload after intermission. ",
            "4": "There's not much else to say about the Broncos, who had one flawless first half. The Raiders were on the other side of the spectrum, as Terrelle Pryor lost a fumble on the second drive. Pryor may have finished 21-of-38 for 207 yards and two touchdowns along with 49 rushing yards on nine scrambles, but don't be fooled by misleading numbers; most of that came in garbage time. Pryor was just 6-of-11 for 35 yards with only 12 rushing yards in the first half when this game was still in question. Pryor, who had his agent making excuses for him prior to this game, gave no indication that he deserves a chance to be the team's starting quarterback next year. ",
            "5": "Some meaningless Oakland numbers: - Pryor's two touchdowns went to Rod Streater (5-40) and Nick Kasa. - Denarius Moore led the team with 63 receiving yards (four catches). Andre Holmes, who had been coming on with Matt McGloin, was limited to just three catches for 38 yards. - Neither Rashad Jennings (4-9) nor Darren McFadden (7-6) had success running the ball. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "I have to constantly remind myself that the Chargers won this game. They trailed 24-14 entering the fourth quarter despite the Bengals, Jets and Andy Reid gift-wrapping a victory for them. With Baltimore and Miami losing, San Diego controlled its own destiny for the No. 6 seed in the AFC. Given that the Chiefs were locked in to the fifth slot, Reid opted to rest his starters. That meant that all the Chargers needed to do was defeat a backfield comprised of Chase Daniel and Knile Davis. Easier said than done, apparently. Given their lacking effort, especially on defense, it's a shame that the Chargers are rewarded with a playoff berth. They should be ashamed of how inept they were when it came to stopping Kansas City's second-string offense. It was ridiculous that Daniel was able to go 21-of-30 for 200 yards and a touchdown along with 59 rushing yards on the ground. Daniel actually looked very similar to Alex Smith, constantly throwing short passes and scampering for decent gains on the ground. Despite this style of attack, San Diego simply couldn't get off the field. Kansas City actually had the yardage lead heading into the final quarter of regulation. ",
            "2": "The Chargers' offense, meanwhile, had some poor moments. Philip Rivers forced an interception early on, as someone named Ron Parker came up with the pick. There were too many three-and-outs, and some drops didn't help. Rivers, however, got his act together in the final two frames, ultimately finishing 22-of-33 for 229 yards, three touchdowns and the aforementioned interception. Of course, the Chargers were very fortunate to score at the very end because they converted a fake punt on a sketchy spot. Not only was the play unmeasured; it also wasn't reviewed because the Chiefs appeared to recover a fumble returned for what seemed to be a game-winning score. Play just continued on, as the inept officiating crew didn't seem to realize what happened. Another poor call came on a Ryan Succop missed 41-yard field goal at the end of regulation. The Chargers were actually lined up illegally and should have been whistled for a five-yard penalty. Succop would've had a chance at a 36-yarder to win the game. Steeler fans have to be pissed, ",
            "3": "Rivers' three scores went to Antonio Gates (4-31), Ladarius Green and Eddie Royal (3-34), who had a big drop. Keenan Allen led the team in receiving with five grabs for 89 yards. ",
            "4": "The Chargers at least ran the ball well, as Ryan Mathews rushed for 144 yards on 24 carries. Danny Woodhead didn't get nearly as much work on the ground (5-18), but he chipped in with seven catches for 42 receiving yards. ",
            "5": "Some Kansas City notes/stats: - Daniel had a chance to lead the team to victory or at least tie the game in overtime, but pulled a Greg McElroy when he fired a fourth-down pass five yards beyond the line of scrimmage.  - Daniel's lone touchdown went to Dexter McCluster (6-62). - A.J. Jenkins paced the Chiefs in receiving yardage. He tallied 67 yards on three catches. - Knile Davis, who had an ugly fumble last week, redeemed himself with two touchdowns on the ground while gashing San Diego's porous defense for 81 yards on 27 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "The Rams gave the Seahawks all they could handle on a Monday night in October. This game was much different, as St. Louis was completely overwhelmed on the offensive side of the ball. Seattle's defense completely dominated, as you would expect it to at home against Kellen Clemens. The Seahawks limited St. Louis to 158 net yards of offense and restricted it to just 11 first downs. The Rams converted only 2-of-11 third-down opportunities. Kellen Clemens could barely do anything, mustering just 157 yards on 30 attempts. He threw two interceptions, a number that could've been much higher. On one near-pick, three Seahawks collided in the end zone, resulting in Richard Sherman getting banged up. One of Clemens' real interceptions was returned for a touchdown. Seattle's offense, meanwhile, sputtered early on. St. Louis' defensive front bullied around the Seahawks in the trenches, just like it did in the first matchup. Russell Wilson couldn't accomplish much in the first half - he missed some throws he should have made, including a pass to an open Doug Baldwin on third down - but eventually caught heat after intermission. He misfired only twice on nine throws in the second half, ultimately finishing 15-of-23 for 172 yards and a touchdown. ",
            "2": "Wilson's sole aerial score went to Golden Tate (8-129), who had more than six times the amount of yardage than the No. 2 target. That was Zach Miller, who logged three catches for 21 yards. They were the only two Seahawks to record more than one reception. ",
            "3": "Marshawn Lynch struggled to run in the prior meeting, but he redeemed himself. He gained 97 yards and a touchdown on 23 carries. Conversely, Zach Stacy, who trampled Seattle in the first meeting, was stuffed at the line of scrimmage, mustering just 15 yards on 15 carries. It gets worse when you factor in that Stacy ripped off a seven-yard gain; this means he managed just eight yards on his other 14 totes. ",
            "4": "Clemens finished with a nice completion percentage (21-of-30), but as mentioned, managed just 157 yards, one garbage-time touchdown and the two picks. I noted the first one already; the second one was a weak shot downfield. The score was thrown to Jared Cook (5-30). ",
            "5": "This was an extremely physical game that got a bit chippy at times. There were a couple of scrums that featured players throwing punches and hitting each other late. There were four penalties on one play. Kendall Langford was even ejected for hitting an official in the forehead, albeit accidentally. Langford swung his arm backward, and his fist collided with the ref. He probably shouldn't have been tossed, but it was largely irrelevant. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "22"
        },
        "comments": {
            "amount": "7",
            "1": "I thought the Cowboys would have a chance to win this game because the supporting cast would rally around Kyle Orton and give 110 percent. Orton actually played well for the most part, but his teammates let him down. DeMarco Murray opened things up with a lost fumble in Philadelphia territory on the initial drive. This proved to be at least a six-point swing because the Eagles scored a field goal on the ensuing possession. Later on, Jason Witten let a pass pop into the air. The ball landed into the arms of an Eagle, and Philadelphia scored a touchdown two plays later. These two careless give-aways led to 10 points, which obviously was greater than the margin of victory. Had Dallas remained clean, it may just have won this game. ",
            "2": "Having said that, the Eagles deserve credit for this victory. I don't know how Nick Foles does it, but he lobs up these passes that look like they're up for grabs, yet his teammates somehow always come up with improbable catches. Foles went 17-of-26 for 263 yards and two touchdowns, though he took a number of bad sacks. Cris Collinsworth did a great job of highlighting the issue; when faced with a tough pass rush, Foles brings his eyes down. Dallas sacked him five times (one of which resulted in a forced fumble) and also forced him into an intentional grounding. There actually should've been a second grounding call, but the officials incorrectly ruled that a Philadelphia receiver was in the area. ",
            "3": "As many expected the Eagles ran all over the Cowboys. LeSean McCoy rushed for 131 yards on 27 carries and also scored on his sole reception. McCoy, however, lost a touchdown on the ground to Bryce Brown (2-11). ",
            "4": "Foles, who nearly scored on the ground via a failed sneak at the goal line, saw his aerial touchdowns go to Brent Celek (3-71) and McCoy. No Eagle recorded more than three receptions, though five players on the team managed that distinction: Celek, Jason Avant (3-45), Zach Ertz (3-43), Riley Cooper (3-39) and DeSean Jackson (3-28). ",
            "5": "Moving on to the Cowboys, Orton actually began 7-of-7 for 58 yards before misfiring for the first time on a throw that was behind Dez Bryant. Orton finished 30-of-46 for 358 yards, two touchdowns and a pair of interceptions. Again, he played well, but the second pick was an absolute killer. On a potential game-winning drive, Orton threw behind Miles Austin-Jones. Brandon Boykin snatched the interception, which sealed the victory for Philadelphia. Orton's two touchdowns went to Dez Bryant (8-99) and Gavin Escobar. Despite the bobbled pass that turned into an interception, Jason Witten paced the team with 12 receptions for 135 yards. Witten got banged up in this game, as he had to limp to the sideline on a couple of occasions. ",
            "6": "Murray, who had the aforementioned fumble on the opening drive, was limited to just 51 yards on 17 carries. Though he dropped a pass as well, he did most of his damage as a receiver - and I mean that quite literally. On one of his five catches (39 receiving yards), he plowed right into Damion Square, which sent the Philadelphia defensive linemen flying through the air. ",
            "7": "There were some strange coaching decisions late in this game on Dallas' part. The Cowboys opted to go for a fourth-and-1 just over midfield in the fourth quarter. Instead of trying to pound it with Murray, they asked Orton to throw it. It appeared as though Orton had Murray open in the flat, but the pass was batted down. Later on, the Cowboys had to waste a crucial timeout. It also appeared as though they were guilty of a delay-of-game infraction, but the officials screwed up when they reset the play clock to 25 instead of 40 seconds. <table border=0 width=98%> <tr> <td> <iframe frameborder=0 id=pcd name=pcd src=/PostCommentDev/cmts/1118.php style=overflow-y:auto; width=100%></iframe> </td> </tr> </table> </r>"
        }
    }
}