{
    "year": "2011",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Bills",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "35"
        },
        "comments": {
            "amount": "4",
            "1": "It might be too soon for me to recap this game given the breakneck pace of the second half. Let's not jump ahead though. After a sluggish start for both offenses, I tweeted the passing numbers for the quarterbacks combined at the conclusion of the first quarter. Ryan Fitzpatrick and Jason Campbell were 6-of-13 for 32 yards, and the game was scoreless. Oakland got the running game going just enough to move the football with an occasional screen pass to Darren McFadden. It was nothing fancy, but drive after drive, they marched in for touchdowns in the second quarter. This was supposed to be a hangover game for them flying east on a short week following a late Monday Night Football appearance in Denver. Instead, they were up 21-3 at halftime aided by a missed field goal and turnover leading to a short touchdown drive. When the second half started, everything went back to analyst expectations coming in. Buffalo came out firing on offense and playing aggressive on defense. The offense scored touchdowns all five times they touched the ball after the break. The defense forced a fumble on Oakland's first possession and a quick punt on their second possession. By the fourth quarter, this was an old school AFL shootout with the teams exchanging touchdowns and the lead. Remember the passing stats from earlier? Well, in the final three quarters Fitzpatrick and Campbell combined to complete 45 out of 66 attempts for 565 yards and five touchdowns. ",
            "2": "Campbell's numbers were solid. He completed almost 70 percent of his throws for 323 yards and a couple touchdowns. The interception was on a hail mary play the end the game, so ignore that. Campbell was dealing with some different wide receivers with Darrius Heyward-Bey, Louis Murphy and Jacoby Ford out. It turned out to be a blessing. Denarius Moore, a star of the preseason, caught five balls for 146 yards including a jaw-dropping 50-yard score down the middle with Leodis McKelvin and Gibril Wilson on him like two pieces of bread. Derek Hagan was also solid, catching five passes for 61 yards. ",
            "3": "Unfortunately for the Raiders, their defense was not up to the task in the second half. When Fred Jackson and C.J. Spiller weren't breaking off big runs (19 rushes for 180 yards, 2 touchdowns) wide receivers Stevie Johnson and David Nelson were picking up first downs in the passing game (18 receptions for 179 yards, 2 touchdowns). Right now there are two people named Chris Johnson in the NFL. That might not be the case for long. ",
            "4": "Another footnote of sorts is the poor kickoff returns by Oakland's Nick Miller, who repeatedly took the ball out of the end zone and failed to reach the 20. Ford was sorely missed in that area, and when he is healthy, Miller might be looking at a pink slip. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "As odd as it may sound, this game was decided after each team's opening drive. The Lions scored a touchdown on their first possession, thanks to major help from Kansas City. The Chiefs picked off Matthew Stafford, but fumbled the ball away on the return. With new life, the Lions were able to move down the field with the help of two Kansas City personal foul penalties. When the Chiefs had the ball, Jamaal Charles suffered a nasty-looking knee injury as he fell out of bounds. Charles tripped over the Lions mascot and had to be carted into the locker room. All reports indicate that Charles will be out for the year. Kansas City is now a leading candidate in the Suck for Luck sweepstakes. ",
            "2": "With Charles done, Dexter McCluster has to be added. Thomas Jones (12-40) is the obvious guy, but Todd Haley has been using McCluster often thus far in the preseason and these two regular-season games. McCluster rushed for 51 yards on eight carries to go along with four receptions. ",
            "3": "Matt Cassel had yet another poor outing without Charlie Weis. He went 15-of-22 for 133 yards and three picks. That means he's 57-of-109, 437 yards, one touchdown and a whopping nine interceptions in his last four games. Fortunately for Dwayne Bowe owners, he was able to salvage a solid day (5-101). ",
            "4": "While the Chiefs struggled to get first downs, the Lions pretty much moved the ball at will. Matthew Stafford went 23-of-39 for 294 yards, four touchdowns and an interception. The disparity between the two quarterbacks was extremely evident, as Stafford completed a very similar pass that was a Cassel interception. The announcers ran with this, talking about windows for a good 10 minutes. I guess they can't be blamed because it was a blowout and they had nothing else to say. ",
            "5": "Two of Stafford's scores went to Calvin Johnson (3-29), but he was outgained by Nate Burleson, who hauled in seven grabs for 93 yards. Titus Young (5-89) also had a solid game, while Brandon Pettigrew (1-7) seemed hampered by a back injury he suffered in the first half. ",
            "6": "Jahvid Best uncharacteristically scored twice, but that shouldn't be a surprise given how often Detroit was in the red zone. He totaled 123 yards. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Browns",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "19"
        },
        "comments": {
            "amount": "5",
            "1": "If Peyton Manning doesn't come back this year, the Colts could easily go 0-16. That's obvious now. I thought Indianapolis would beat the Browns at home, but they're apparently too inept to do that. The problem is obviously Kerry Collins. He's terrible. Though his stats don't look too bad - 19-of-38 for 191 yards, one touchdown, one interception - some of that came in junk time late in the game when Indianapolis was down 15. Collins played as though he just came out of a Penn State frat party. He was so inaccurate that the Colts simply had no chance. In fact, it's a miracle he threw only one pick. I have to wonder why Curtis Painter isn't starting. He's at least familiar with the offense. Collins belongs in a glue factory. ",
            "2": "Reggie Wayne, Joseph Addai, Dallas Clark all caught four passes; Clark snagged a touchdown late to salvage his fantasy performance (4-32). He saw eight targets, so it's not like it was his fault; Collins simply couldn't get him the ball. In another example, Austin Collie had three receptions for 24 yards despite seeing 10 targets. ",
            "3": "The one positive takeaway for the Colts was the performance of Delone Carter, who rushed for 46 yards on 11 carries. Carter looked great and should see more touches going forward. Pick him up in your fantasy leagues, and pray Peyton Manning returns in a couple of months. ",
            "4": "Many suspected that Indianapolis wouldn't be able to stop Peyton Hillis. Well, it was Colt McCoy that they had issues with. McCoy went 22-of-32 for 211 yards and a touchdown, though it appeared as though he was over the line of scrimmage when he hit Evan Moore for a 16-yard score. McCoy did a great job moving the chains all afternoon, converting 8-of-16 third downs. As a comparison, the Colts were 4-of-14. ",
            "5": "Hillis did have a good game though, rushing for 94 yards and two touchdowns on 27 carries. He also tied for the team lead in receptions (4) for 23 receiving yards. Greg Little was the other player with four grabs (38 yards). "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Saints",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "The big storyline going into this game was the passing of Brian Urlacher's mother. The way Chicago's offensive front played, however, makes you think that each of the starting linemen lost a loved one (save for right tackle Gabe Carimi - more on that later). Facebook friend Steve T. had another theory: <i> I'm convinced: Jay Cutler owes Mike Tice a great deal of money. So rather than call a hitman to kill Cutler, Tice instructs his lineman not to block for the Bears QB </i> Either way, Cutler was sacked a whopping six times. All the pressure forced a number of errant throws; Cutler went 19-of-45 for 244 yards and a touchdown. ",
            "2": "Making matters worse for Cutler, he lost Earl Bennett to a chest injury in the first quarter and Carimi to a knee injury just right before halftime. His only offensive option was Matt Forte, who caught a whopping 10 balls for 117 receiving yards to go along with 49 rushing yards on 10 carries. ",
            "3": "On the other side of the ball, Drew Brees went 26-of-37 for 270 yards and three touchdowns, one of which was a 79-yard bomb to Devery Henderson. He was sacked just once. Brees loved checking the ball down to Darren Sproles, especially early on. Sproles finished with eight receptions for 43 yards and a score. ",
            "4": "Mark Ingram once again saw more carries (14) than Pierre Thomas (9). Ingram had 51 yards to Thomas' 41, but the YPC discrepancy is misleading because Ingram had the short-yardage work, and thus a few minimal gains. ",
            "5": "There was some terrible officiating in this game on both sides. Roman Harper was whistled for a horrible roughing-the-passer call on Chicago's second drive that set up a touchdown. Meanwhile, in the fourth quarter, Darren Sproles stepped out of bounds on his way to the end zone. This was completely obvious to Joe Buck and Troy Aikman, yet the booth refused to review it. The Bears couldn't challenge because of the NFL's stupid, new touchdown-replay rule. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Buccaneers quarterback Josh Freeman continued his spotty play early against Minnesota. On the first play of the game, Freeman held onto the ball too long on a three-step drop and was sacked by Jared Allen. Freeman took another sack later by defensive end Everson Griffen. He couldn't get into a groove as the Viking offense maintained control of the ball in the first half. The Vikings completely shut down the Bucs in the first two quarters. Tampa Bay had only 62 yards in the first half. Freeman was 4-of-7 for 35 yards prior to halftime. The Bucs had only three first downs, and running back LeGarrette Blount ran for only four yards on five carries. Tight end Kellen Winslow led the Bucs at half time with 22 yards on two receptions. In the third quarter, Blount broke out with a 27-yard touchdown run behind right tackle Jeremy Trueblood and right guard Davin Joseph. The Buccaneers executed an onside kick and started moving down the field with Blount running the ball well. Freeman connected with Kellen Winslow for some nice gains. The Bucs were at the Vikings' 12 yard-line when Freeman threw a horrible pass off his back foot. The ball was behind Winslow in the end zone and was intercepted by Husain Abdullah. On the next drive, the Bucs caught a break when a fumble by Earnest Graham that was returned inside the 10-yard line was negated by an offsides penalty on Vikings defensive end Brian Robison. Freeman tossed a short crossing route to wide receiver Preston Parker that was broken downfield for a 51-yard gain. Freeman tossed a beautiful 17-yard touchdown pass to Mike Williams, but an illegal shift penalty took the score away. That set up a field goal from Connor Barth. Freeman hooked up with wide receiver Arrelious Benn for a 25-yard touchdown part way through the fourth quarter. That fired up Freeman, and the Buc offense didn't look back. On the Bucs' final possession, Freeman made a few good throws to move the ball downfield. Blount finished the drive with a touchdown run from four yards out. Freeman finished the game 22-of-31 for 243 yards with one touchdown and one interception. ",
            "2": "Blount's big second half was the key to the Buccaneers comeback win. Hw finished the game with 71 yards on 13 carries and two touchdowns. ",
            "3": "Backup wide receiver Parker led Tampa Bay in receiving with 98 yards on six receptions. Winslow totaled 44 yards on four receptions. Williams finished the game with only one catch for minus-4 yards. ",
            "4": "The Vikings started the game by running the ball down the throat of the Buccaneers. Minnesota controlled the ball on the ground and were led by running back Adrian Peterson. Backup running back Toby Gerhart also had some success on the ground and through the air. Donovan McNabb was able to execute some play-action passing because of the strong running game that overwhelmed the Bucs defense. In the first half Peterson ran for 83 yards on 15 carries with two short touchdown runs. Peterson also had a fumble, but it was recovered by Minnesota. Gerhart had 36 yards on two carries with one reception for 42 yards. At halftime, McNabb completed 11-of-17 passes for 153 yards with no interceptions or touchdowns. McNabb had a good run for a first down to extend the Vikings' second touchdown drive. He did a good job as a game manager early, but couldn't come up with needed plays in clutch time in the second half. At halftime, Minnesota had a 17-0 lead. Peterson, McNabb and Vikings were slow to move the ball in the second half. Peterson had only nine yards rushing on four carries in the third quarter. In the fourth quarter, Minnesota had a field goal drive, but the offense didn't do enough to seal the win for the Vikings and that let the Bucs offense pull out a comeback. ",
            "5": "Peterson ran for 120 yards on 25 carries with two touchdowns. McNabb completed 16-of-27 passes for 193 yards with zero touchdowns and zero interceptions. Wide receiver Percy Harvin led Minnesota in receiving with 76 yards on seven receptions. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Jets",
            "Points": "32"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "So much for the Jets being overhyped. Despite the fact that New York lost center Nick Mangold very early game and couldn't get things going offensively until the second half, the Jets completely dominated this game with an unbelievable defensive effort. As the score indicates, it wasn't even close. Luke McCown was dreadful, going 6-of-19 for 59 yards and four ugly interceptions (twice by Antonio Cromartie). It's hard to completely blame McCown because he was missing Marcedes Lewis, but McCown looked like he was playing blindfolded at times. Oh, and I'd be remiss if I forgot that McCown was also missing the great Jason Hill, who talked trash about the Jets and Darrelle Revis despite the fact that he didn't even play. ",
            "2": "McCown was pulled in the fourth quarter. Blaine Gabbert went 5-of-6 for 52 yards, albeit against a New York prevent defense. He should start next week because McCown is inept. ",
            "3": "Maurice Jones-Drew was really outstanding, rushing for 88 yards on 18 carries. The Jets were stacking the line of scrimmage the entire afternoon, so the fact that Jones Drew gained nearly five yards per carry was very impressive. ",
            "4": "But enough with the losers. As mentioned, the Jets struggled offensively until halftime. They had to settle for field goals early on, but Mark Sanchez (17-of-24, 182 yards, 2 TDs, 2 INTs) eventually developed a rhythm with Dustin Keller, who grabbed six balls for 101 yards and a score. ",
            "5": "Plaxico Burress didn't catch a single pass and was targeted only twice (zero times in the first three quarters). His production against Dallas was seemingly the result of the Cowboys having so many injuries in their secondary. Expect more of this from Burress, who can be dropped in fantasy leagues if you need the roster space. ",
            "6": "It wasn't exactly the bounce-back performance his fantasy owners were looking for, but Shonn Greene scored a touchdown to go along with his 49 yards on 16 carries. I wouldn't be discouraged by this; Jacksonville did a number on Chris Johnson last week, though Mike Munchak and the Tennessee coaching staff contributed to that effort. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "0"
        },
        "comments": {
            "amount": "4",
            "1": "This game wasn't remotely close - Seattle mustered just eight first downs - so let's focus on the important stuff - mainly, Ben Roethlisberger's injury. Big Ben went down in the second quarter on a low hit to the knee. It really resembled what happened to Tom Brady in the 2007 season opener when Bernard Pollard destroyed Brady's season. I thought he was done when he limped off the field and was replaced by Charlie Batch, who entered the game to a chorus of Charlie! Charlie! Charlie! chants. However, in typical Roethlisberger fashion, he re-entered the game just two plays later. While the Steelers stalled in the red zone, the important thing is that Big Ben is fine - even if he did take a nasty hit in the second half as well. Roethlisberger finished 22-of-30 for 298 yards and a touchdown. He looked great after halftime, hooking up with Mike Wallace for a 53-yard completion. Wallace, by the way, had eight grabs for 126 yards and a score. ",
            "2": "Roethlisberger wasn't the only Steeler to get hurt. Defensive end Brett Keisel left with a knee injury. ",
            "3": "Rashard Mendenhall rushed for 66 yards and a touchdown on 19 carries. He had an opportunity for a second score, but was stuffed on the goal line. Isaac Redman stole another touchdown in the second quarter. ",
            "4": "Like I said, this game wasn't close whatsoever. In addition to those eight first downs, Seattle had just 31 rushing yards as a team - and Tarvaris Jackson was the leader with 12. Even worse, the Seahawks' first snap in Pittsburgh territory occurred at the 9:39 mark of the FOURTH quarter. How embarrassing. Seattle's offensive line simply couldn't block for Jackson, who took five sacks. The Seahawks were behind early, so Marshawn Lynch had only six carries for 11 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Titans",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "13"
        },
        "comments": {
            "amount": "5",
            "1": "So, the Ravens destroy the Steelers in Week 1, while the Titans lose at pathetic Jacksonville. Naturally, Tennessee goes on to blow out Baltimore, dominating the time-of-possession battle by 11 minutes. The NFL makes absolutely no sense this year. ",
            "2": "I don't know what happened to Matt Hasselbeck in the past week, but he looked like a completely different quarterback. He went 30-of-42 for 358 yards, one touchdown and an interception that wasn't really his fault (it was tipped at the line of scrimmage). With Baltimore's defense focusing on Chris Johnson, Hasselbeck took full advantage, torching the Ravens' secondary on multiple deep strikes to Kenny Britt and Nate Washington. He didn't take a single sack. Britt hauled in nine grabs for 135 yards and a touchdown. He was unstoppable. Washington pitched in with seven catches for 99 yards. ",
            "3": "What's really amazing about Tennessee's victory was that Chris Johnson barely did anything. CJ2K rushed for just 53 yards on 24 attempts. The tough pill to swallow for his fantasy owners was the fact that Javon Ringer (5-21) vultured a touchdown. ",
            "4": "Joe Flacco really struggled. He faced tons of pressure (3 sacks) and was completely out of sync with his receivers, who dropped passes (Anquan Boldin) and struggled to get open (Lee Evans). He went 15-of-32 for 197 yards, one touchdown and a pair of picks. ",
            "5": "Boldin was Baltimore's top producer at wideout, catching three balls for 46 yards. Evans (2-42) admitted afterward that his bum ankle is nowhere near 100 percent. Flacco's top target was Ray Rice, who hauled in five grabs for 53 yards and a 31-yard touchdown in the second quarter. Rice struggled to run the ball, however, managing only 43 yards on 13 attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "When everyone was belittling the Redskins this offseason for opting to roll with John Beck or Rex Grossman, it was almost unfathomable that Washington would start 2-0. Yet, here we are. Rex Grossman continues to play relatively well for Mike Shanahan, as he went 25-of-43 for 291 yards, two touchdowns and a pair of picks. One interception was tipped, but the second one was definitely a Bad Rex moment. He's had two of them in two games thus far, which is big positive because Washington can survive with only one Bad Rex instance per week. The important thing is that Grossman led the Redskins on three scoring drives in the fourth quarter of 44, 73 and 64 yards. ",
            "2": "Grossman once again looked comfortable throwing to his favorite weapons. Fred Davis (6-86, TD) and Santana Moss (5-61, TD) both abused an Arizona defense that had issues with Cam Newton last week. ",
            "3": "Tim Hightower gained 96 yards on 20 carries, most of which came in the first half. I don't know if Hightower got injured or what because he had just two carries in the fourth quarter. Roy Helu received most of the work late, and he looked fantastic, rushing for 74 yards on 10 attempts. Helu still has problems in pass protection, which makes me wonder why he was used exclusively over Hightower in the final period. ",
            "4": "Though his team lost, Larry Fitzgerald can't be too upset. Kevin Kolb found Fitzgerald deep for a 73-yard touchdown, as the All-Pro wideout compiled seven grabs for 133 yards. However, Kolb looked pretty mediocre otherwise, finishing 17-of-30 for 251 yards, two scores and a very ugly pick inside Washington territory. ",
            "5": "Of Arizona's 15 rushing attempts, 14 were by Chris Wells, who tallied 93 yards and a touchdown. Wells looked great and the Redskins had no answer for him. Now completely healthy, he needs to be utilized more often. ",
            "6": "If there's a negative to come out of this game for Washington, it's that this shouldn't have been as close as the final score indicates. The Redskins won the time of possession by 15 minutes and outgained Arizona by 130 yards. They were simply sloppy deep in Arizona territory, missing a field goal and committing two turnovers. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "27"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Just your typical Cowboys-49ers thriller, right? It was wild to look at the box score afterward and see Dallas with a massive edge in total yards at 472-206. Obviously Dallas Plaxico'ed itself quite a bit, starting with a blown field goal from 21 yards out after driving 77 yards on 14 plays to chew up exactly half of the first quarter. When an errant snap was fumbled by Alex Smith, it was no surprise to 49er fans who have seen his follies all too often. Amazingly, the ball bounced right back up to Smith, who threw deep, almost connecting for a touchdown and getting a pass interference call on the Cowboys to boot. Breaks like that helped San Francisco scrap its way to a 14-0 lead. A pass interference penalty (25 yards) set them up at the 1-yard line for a short Frank Gore touchdown run, and in the second scoring drive, a bunch of short plays did the trick after starting at the Dallas 48. Finally, Dallas caught a huge break when Ahmad Brooks lined up offsides on a failed third down as time was running out in the half. Given a second chance to convert, some guy named Tramine Brock out of Belhaven College (think the 49ers need to draft a cornerback?) fell down in coverage, and 53 yards later, Miles Austin cut the lead to 14-7 at the break. ",
            "2": "Speaking of Austin, that final drive marked his first catch of the game after the Cowboys failed to find him on five targets in the first half. Then he caught all nine passes thrown his way for 143 yards and a touchdown hat trick. Unfortunately, Austin pulled his hamstring and could be out a few weeks. The passing game took on increased importance because Felix Jones hurt his shoulder early. He had just nine carries for 25 yards, and caught a pass for five yards. DeMarco Murray (6-21) and Tashard Choice (5-5) were not effective in relief. ",
            "3": "While on the subject of injuries, Tony Romo was hit by Carlos Rogers toward the end of the second quarter and did not come out ready to play in the second half. It was Jon Kitna time and you know what that means - touchdowns, yards and interceptions. Kitna completed his first three passes before Donte Whitner intercepted him when Jason Witten did not go where he expected him to on a deep route. Witten saw a hefty 15 targets, catching seven passes for 102 yards. Both quarterbacks looked at him, so if Romo's ribs keep him out, fantasy owners should not be worried about putting the tight end in the lineup. That interception was offset by a pick from Alan Ball who was starting at cornerback as part of a makeshift Dallas secondary. Five plays later, Kitna found Austin to tie the game at 14. ",
            "4": "Where was Ted Ginn? Glad I am pretending you asked. Ginn was another heavily targeted player, leading the 49ers with seven, but he caught just four passes for 38 yards. He also was not a factor in the return game after housing a punt and kickoff to ice last week's win over Seattle. However, rookie Kendall Hunter did have a big kickoff return for 43 yards following the tying score. Unfortunately it was wasted when DeMarcus Ware started that drive with one of his two sacks. Kitna's next interception was a pass thrown behind Kevin Ogletree. Alex Smith immediately hit Delanie Walker who was matched up with Anthony Spencer and predictably ran right past him for a 29-yard score to make it 21-14. After the two interceptions apparently Romo's painkillers kicked in. He was hit a ton in this game even though he was sacked just once. One of the legal hits was from rookie Aldon Smith. Romo looked battered. San Francisco head coach Jim Harbaugh made a gutsy call going to the field goal from 55 yards out leading by seven early in the fourth quarter, and veteran kicker David Akers came through for him. After that, in the fourth quarter the more talented Cowboys were done making mistakes and drove the ball on three straight scoring drives while the defense did not allow another first down. Dallas drove 80 yards for a touchdown to cut the lead to 24-21, then probably got too conservative with time running out by marching 44 yards to tie it with a field goal. I guess I can't really call the third one a drive since Romo hit reality TV show winner (seriously) Jesse Holley for a 77-yard pass on the first play of overtime. A quick field goal ended the game. ",
            "5": "The takeaway is the injury status of Austin, Jones and Romo. We pretty much found out the Cowboys can't run much without Jones and will turn it over more without Romo. The 49ers played about as well as they could in this one, but should have lost by double digits at least. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "22"
        },
        "comments": {
            "amount": "5",
            "1": "Denver fans finally got their wish. Tim Tebow played. Rejoice, Broncos faithful! OK, maybe not so much. The Broncos had only three healthy receivers entering this game, and when they lost Eddie Royal to a groin injury, Tebow had to play wideout. He was used in the slot, but didn't catch any passes. He blocked primarily. ",
            "2": "The Broncos held the lead throughout, so the fans didn't get a chance to chant for Tebow. Orton went 15-of-25 for 195 yards and two touchdowns, including an impressive 52-yard bomb to Eric Decker (5-113, 2 TDs). Orton was pretty mediocre otherwise, but was missing Brandon Lloyd and Royal. ",
            "3": "Knowshon Moreno was also out, allowing Willis McGahee to exploit Cincinnati's defense. He rushed for 101 yards and a touchdown on 28 attempts. ",
            "4": "Denver was also hobbled on defense, with Elvis Dumervil and Champ Bailey missing in action. This allowed Andy Dalton to piece together a great performance; the rookie signal-caller went 27-of-41 for 332 yards and two touchdowns. I don't really want to take anything away from Dalton because he nearly improved to 2-0 despite playing two games on the road, but the bums Denver utilized on defense had no hope of covering either A.J. Green (10 catches, 124 yards, TD) and Jerome Simpson (4-136). ",
            "5": "Cedric Benson rushed for 59 yards on 16 carries. He was stuffed multiple times on short-yardage situations in the first half. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Texans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "13"
        },
        "comments": {
            "amount": "12",
            "1": "The Houston Texans played some strong defense and took advantage of some special teams miscues to open up an early lead on Miami. The Dolphins had one field goal blocked and missed another kick. The Texans were able to apply some heat on quarterback Chad Henne, and as a result the Dolphin offense never got off the ground. ",
            "2": "One of the top stories of the game was Miami deciding to go to rookie running back Daniel Thomas and not feature Reggie Bush. It was surprising the Dolphins decided to bench Bush in favor of Thomas in just the second game of the season. Bush was not injured but the coaches decided to give Thomas an extended look after reportedly being down on him in the early going of 2011. Miami got some good production out of Thomas. Thomas ran for 51 yards on 10 carries in the first half. Bush had two yards on two carries in the first two quarters of the game. ",
            "3": "Henne was 6-of-15 for 94 yards with one interception. Deep in his own territory, Henne was hit as he threw the ball by Texans pass rusher Mario Williams. The pass was a wounded duck and Texans cornerback Johnathan Joseph ran under the ball for the interception. That turnover produced the only touchdown of the first half. ",
            "4": "Wide receiver Devon Bess led Miami with two catches for 42 yards. Brandon Marshall had two receptions for 39 yards. ",
            "5": "In the third quarter, the Dolphins put a good drive together. Thomas was effective with some good runs. Miami capped the possession with Henne tossing a 12-yard touchdown to Marshall. With Miami grabbing the momentum in the third quarter, Thomas gave it back to the Texans when he fumbled the ball away at midfield. Even though the Texans didn't produce points on that possession, the fumble stalled the Miami offense that had Houston on its heels. ",
            "6": "Miami was unable to produce any more points against Houston. The Texan defense finished the game well with a good pass rush and better run defense. For the game, Henne was 12-of-30 for 170 yards with one touchdown and one interception. Henne was inaccurate on his passing, and his blocking had issues keeping pressure off of him. Thomas had his first 100-yard rushing game of his career with 107 yards on 18 carries. Bush finished the game with just 18 yards on six carries. Marshall finished the game with 79 yards on six receptions and a score. ",
            "7": "Texans quarterback Matt Schaub had a strong first half. He was 16-of-22 for 170 yards with one touchdown. Arian Foster was kept in check by the Miami defense with only 33 yards on 10 carries. Foster re-injured his hamstring and the Texans kept him on the sideline in the second half. ",
            "8": "Houston moved the ball through the air with wide receiver Andre Johnson. He caught five passes for 63 yards in the first half. Owen Daniels had three receptions for 25 yards and a touchdown. Schaub connected with Daniels from four yards out for the only touchdown in the first half after Henne's interception. Schaub and the passing game helped move the ball to get three field goals in the first half. ",
            "9": "Ben Tate had four carries for 21 yards in the first half, but with Foster sidelined, Tate had a big second half. He ran downhill and did a good job of picking up yards after contact. Tate totaled 103 yards on 23 carries. It was unclear when Foster could return to the lineup. ",
            "10": "After dropping a potential touchdown pass, Johnson came back to catch a 23-yard touchdown strike from Schaub. The Texans established Tate in the second half, and Schaub's job was pretty easy. He only threw seven passes after halftime. He finished the game with 21-of-29 passes for 230 yards and two scores. ",
            "11": "Johnson paced Houston with seven receptions for 93 yards and one touchdown. Daniels did not record a reception in the second half. Jacoby Jones was second on the team with three catches for 48 yards. ",
            "12": "The Texan defense showcased some good rushes from Williams, rookie J.J. Watt, Connor Barwin, and others. It wasn't all good for Joseph; after recording his interception, the former Bengal injured his ankle and did not return. Joseph was on the sideline and it looked more like a sprain or twist than a long-term injury. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Chargers love screwing themselves. That's what they do best. Their forte is looking great, but disappointing when it counts most. San Diego had four screw-ups inside New England's 35-yard line. The first was a botched fourth-and-goal try at the 1-yard line in which Norv Turner predictably called for a Michael Tolbert run. Rivers would go on to toss two picks in Patriots territory. The worst infraction, meanwhile, was a Tolbert fumble. The big running back found no room at the line of scrimmage, so he made a foolish decision to run backward in an attempt to find a lane elsewhere. The ball was stripped and recovered by the Patriots, who put the game away with a touchdown. If that wasn't bad enough, the Patriots scored on a BenJarvus Green-Ellis as the clock was running out. This pissed me off immensely, since San Diego +7 was my biggest play of the weekend. ",
            "2": "Excluding San Diego's miscues deep in New England territory, this game was played pretty evenly, with the Patriots barely outgaining the Chargers, 504-470. Both quarterbacks were unstoppable (aside from Rivers' interceptions, of course). Brady went 31-of-40 for 423 yards and three touchdowns, while Rivers was 29-of-40 for 378 yards, two scores and the picks. ",
            "3": "Three Patriot players caught at least seven passes. Deion Branch (129 yards) paced the team with eight receptions, two of which came at the very end of the first half when Brady inexplicably led his team into scoring territory despite having less than 10 seconds to work with following one of Rivers' interceptions. The other two targets were Aaron Hernandez (7-62, TD) and Wes Welker (7-81). Hernandez was spotted limping after the game. His status is unknown. Meanwhile, Rob Gronkowski (4-86) caught two touchdowns. Chad Ochocinco (2-45) once again was silent. ",
            "4": "I was happy to see impressive rookie running back Stevan Ridley get two carries; he gained nine yards. BenJarvus Green-Ellis (17-70, TD) saw most of the workload though. ",
            "5": "Speaking of running backs, it's time for Ryan Mathews to get the bulk of the touches. Mathews looked very explosive, gaining 64 rushing yards and a touchdown on 12 attempts, as well as catching seven balls for 62 receiving yards. Tolbert (9-10) had the fumble and the unsuccessful fourth-and-goal attempt. While Tolbert did snag eight catches for 73 receiving yards, he's just not that good. ",
            "6": "Rivers couldn't hook up with Antonio Gates at all; in fact, one of Rivers' interceptions came on a Gates target. Vincent Jackson did most of the work aerially, hauling in 10 balls for 172 yards and a pair of scores. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "The story going into this game was obviously QB Dog Killer's return to Atlanta, and whether or not Matt Ryan could win a big game and take the next step as Atlanta's franchise quarterback. With all the focus on the two signal-callers, both QBDK and Ryan had took turns trying to prove who was worse for the first three quarters. For every QBDK fumble, there was a Ryan interception. However, QBDK took a hit on the head falling into right tackle Todd Herremans and was forced out of the game. Once that happened, Ryan seemed to gain confidence and shredded Philadelphia's tired defense with the no-huddle. Ryan finished 17-of-28 for 195 yards, four touchdowns and two interceptions. The Falcons need to employ the no-huddle offense much more often. It was really night and day once Atlanta switched to this attack. ",
            "2": "Two of Ryan's scores went to Tony Gonzalez (7-83), who predictably abused Philadelphia's weak linebacking corps. Roddy White (3-23, TD) and Julio Jones (2-29) struggled to get open against the Eagles' elite cornerbacks. ",
            "3": "Michael Turner rushed for 114 yards and a touchdown on 21 carries. The Eagles' run defense was trampled prominently in the first and fourth quarters, especially on a 61-yard burst to set up Atlanta's winning score. ",
            "4": "One troublesome aspect of the Falcons' offense was the play of left tackle Sam Baker, who seems to get worse with each succeeding game. Baker was completely abused by Trent Cole, who dominated this contest despite getting just six tackles and one sack. ",
            "5": "As for the Eagles, QBDK was greeted by a chorus of boos. Al Michaels suggested that there was 75-percent booing from the crowd, though some of the patrons donned QBDK jerseys. QBDK was also booed when he walked off the field following the aforementioned injury. In a very classy move, he pointed to the scoreboard. As for his actual play, QBDK once again struggled with the blitz. He was sharp early on, but made the usual mistakes. He fumbled three times and tossed a pick. He was otherwise 19-of-28 for 242 yards and a pair of scores. ",
            "6": "Vince Young was out, so QBDK's replacement was Mike Kafka, who actually looked pretty good; the second-year Northwestern product went 7-of-9 for 72 yards. He threw an accurate pass on the final real play of the game, but Jeremy Maclin dropped the pass. ",
            "7": "Speaking of Maclin, he bounced back from a lackluster performance against the Rams to snag 13 receptions for 171 yards and two touchdowns. He was a monster with DeSean Jackson (2-21) missing some time because of a forearm injury. LeSean McCoy (18-95, 2 TDs) also pleased his fantasy owners. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}