{
 "week":"18",
 "year":"2010",
 "numberOfGames":"3",
 "games":[
  {
   "Team 1":{
    "Name":"Jets",
    "Points":"17"
   },
   "Team 2":{
    "Name":"Colts",
    "Points":"16"
   },
   "comments":" The Jets did a lot of growing up Saturday night. Rex Ryan finally beat Peyton Manning, while Mark Sanchez orchestrated a brilliant game-winning drive, culminating with Nick Folk's decisive 32-yard field goal. Sanchez (18-of-31, 189 yards, INT) was brutal in the first half. He was sailing his throws, missing a wide-open receiver in the end zone for a touchdown. Later on the same possession, Sanchez tossed an interception when he overthrew his target. However, Sanchez calmed down after intermission. He was suddenly way more accurate. And on the team's final drive, he called the play himself that resulted in an 18-yard completion to Braylon Edwards, giving Folk an easy kick.    LaDainian Tomlinson looked great. He was exceptional at the beginning of the year, but appeared to wear down as the season went on. But he looked like the old LT at Indianapolis, rushing for 82 yards and two touchdowns on 16 carries. Shonn Greene (19-70) was also effective.    Ryan's defense did a great job limiting Peyton Manning and his offense to 312 total yards. The Colts had just one big play, a 56-yard bomb to Pierre Garcon (5-112, TD), who beat Antonio Cromartie. Outside of that, Indianapolis moved the chains, but couldn't get into the end zone. Manning went 18-of-26 for 225 yards and a touchdown. He remarkably attempted just one pass inside the red zone, which was an incompletion to Jacob Tamme. Manning simply didn't have many options at his disposal; Darrelle Revis completely erased Reggie Wayne, who caught one ball for one measly yard.    The Colts ran the ball efficiently out of shotgun draws on third-and-long, as Joseph Addai (13-60) and Dominic Rhodes (14-33) each achieved an unexpected first down in that situation. Unfortunately for Indianapolis, the team went to the well one too many times. They failed on their final attempt, forcing to settle for a field goal. Speaking of a poor coaching decision, what was Jim Caldwell doing when he called a timeout with 29 seconds remaining in regulation amid a running clock? Instead of being forced into an unfavorable 50-yard field goal, the Jets were able to run another play - which is when Sanchez hit Edwards for 18 yards along the sideline. <div class=dfpAdSlots>   ",
   "players":[

   ]
  },
  {
   "Team 1":{
    "Name":"Ravens",
    "Points":"30"
   },
   "Team 2":{
    "Name":"Chiefs",
    "Points":"7"
   },
   "comments":" Ah, so this is what happens when the Chiefs play a good team at home. It's really a shame that Kansas City wasted a playoff spot; the Chargers would have been much more competitive (until Nate Kaeding's perennial choke job, that is.)    If you didn't watch this game, you might find it hard to believe that this game was in doubt for Baltimore at intermission. The score was 10-7, thanks to a late score by the Ravens. In fact, it was 7-3 for most of the first half. Baltimore had complete control of the game when Joe Flacco fumbled at midfield. A couple of plays later, Jamaal Charles broke through for a 41-yard touchdown run. When this happened, I wrote, Are the Chiefs really going to get another B.S. win? Thankfully, the better team won in Arrowhead this time. I just didn't feel like watching a Round 2 blowout in Pittsburgh. The four units didn't hurt either.    Not to completely rag on the Chiefs - OK, fine, this is fun - Phil Simms said at the end of the broadcast, The Ravens exposed some of Kansas City's flaws, but they'll take care of them this offseason. I really don't think that's possible. The offensive line stinks, there's no No. 2 receiver and the defense has holes, but the Chiefs' greatest flaw is Matt Cassel. Cassel (9-of-18, 70 yards, 3 INTs) is not a legitimate starting quarterback in the NFL. He thrived this season because of all the horrific opponents he played, but as Simms said, Baltimore finally exposed Kansas City's flaw. Adding insult to injury, things won't be any better for Cassel next year with Charlie Weis headed to Florida.    You really have to wonder what happened to Charles (9-82, TD). He ran the ball just twice in the second half. One of those carries was the turning point of the game - down 10-7 early in the third quarter, Todd Haley opted to go for it on 4th-and-inches on Baltimore's 33. Charles was stuffed for a 4-yard loss, and didn't receive a single carry after that. Following that botched fourth-down attempt, the Chiefs' offense had minus-23 yards of offense with three turnovers. There was nearly a fourth, but Cassel was saved by the tuck rule.    One more thing on the Chiefs: Dwayne Bowe didn't catch a single pass. It's hard to tell whether Cassel was too inept to get him the ball, or Bowe was actually hurt despite the fact that Kansas City took him off the injury report late in the week.    As for the Ravens, they'll move on to play the Steelers next week. Flacco has never beaten Ben Roethlisberger, so this would be a good time to get over that hurdle. Flacco played great Sunday, as he improved to 4-2 in the postseason. Flacco went 25-of-34 for 265 yards and two touchdowns, breaking Baltimore single-game playoff records for yards and completions. He took some sacks early and had that aforementioned fumble - Tamba Hali was a monster - but Flacco decided to scramble often in the second half. He gained 26 yards on seven important rushes.    Flacco often targeted Todd Heap, who constantly beat rookie safety Eric Berry. Heap caught 10 balls for 108 yards, becoming the first Ravens player to ever accumulate 10 receptions in a playoff game. <div class=dfpAdSlots>   ",
   "players":[
    {
     "player information":{
      "player_id":"18977",
      "name":"Ben Roethlisberger",
      "position":"QB",
      "height":"6-5",
      "weight":"240",
      "current_team":"Pittsburgh Steelers",
      "birth_date":"1982-03-02",
      "birth_place":"Lima, OH",
      "death_date":"None",
      "college":"Miami (OH)",
      "high_school":"Findlay, OH",
      "draft_team":"Pittsburgh Steelers",
      "draft_round":"1",
      "draft_position":"11",
      "draft_year":"2004",
      "current_salary":"12,000,000",
      "hof_induction_year":"None"
     },
     "game information":{
      "player_id":      18977,
      "year":"2011",
      "date":"2012-01-08",
      "game_number":"17",
      "age":"29-312",
      "team":"PIT",
      "game_location":"A",
      "opponent":"DEN",
      "game_won":      false,
      "player_team_score":"23",
      "opponent_score":"29",
      "passing_attempts":      22,
      "passing_completions":      40,
      "passing_yards":      289,
      "passing_rating":      75.9,
      "passing_touchdowns":      1,
      "passing_interceptions":      1,
      "passing_sacks":      5,
      "passing_sacks_yards_lost":      45,
      "rushing_attempts":      3,
      "rushing_yards":      15,
      "rushing_touchdowns":      0,
      "receiving_targets":      0,
      "receiving_receptions":      0,
      "receiving_yards":      0,
      "receiving_touchdowns":      0,
      "kick_return_attempts":      0,
      "kick_return_yards":      0,
      "kick_return_touchdowns":      0,
      "punt_return_attempts":      0,
      "punt_return_yards":      0,
      "punt_return_touchdowns":      0,
      "defense_sacks":      0,
      "defense_tackles":      0,
      "defense_tackle_assists":      0,
      "defense_interceptions":      0,
      "defense_interception_yards":      0,
      "defense_interception_touchdowns":      0,
      "defense_safeties":      0,
      "point_after_attemps":      0,
      "point_after_makes":      0,
      "field_goal_attempts":      0,
      "field_goal_makes":      0,
      "punting_attempts":      0,
      "punting_yards":      0,
      "punting_blocked":      0
     }
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Packers",
    "Points":"21"
   },
   "Team 2":{
    "Name":"Eagles",
    "Points":"16"
   },
   "comments":" Dom Capers is a hell of a defensive coordinator. Coming into this game, the big question was how QB Dog Killer would deal with Capers' trademark blitzes behind a horrid offensive line. But the Packers seldom blitzed, especially in the first half; they sent extra pass-rushers only four times prior to intermission. QB Dog Killer still made some nice plays, going 20-of-36 for 292 yards, one touchdown and an interception. He was plagued by several drops (mostly by Jason Avant) and his weak front line. Right tackle Winston Justice was benched in the fourth quarter after being abused by Clay Matthews. Justice somehow had three penalties in a span of just two plays.    The Eagles just looked out of rhythm all afternoon, which can't be a surprise because aside from a fluky 8-minute rally against the capsizing Giants, they haven't played well in a month. I already mentioned the offensive line and drops. QB Dog Killer made some poor clock-management decisions down the stretch. On the Eagles' final play, QB Dog Killer lobbed up an underthrown ball for Riley Cooper instead of spiking it. Green Bay corner Tramon Williams, who somehow didn't make the Pro Bowl, came up with the game-clinching interception. And then there was David Akers... Akers, who has a long, great postseason track record, whiffed on attempts from 41 and 34 yards. The first miss was excusable; he was going against a strong wind. The second kick was an easy try that Akers can usually make in his sleep. After the game, someone vandalized Akers' Wikipedia page, writing, He looks at kid porn on his computer and donates all of his salary to Al Qaeda and the Taliban. Not that there's anything wrong with that.    Congrats to Aaron Rodgers, who won his first playoff game. Rodgers was outstanding, going 18-of-27 for 180 yards and three scores. Like QB Dog Killer, Rodgers was hurt by drops. There were three big ones, including a potential 60-yard touchdown by James Jones at the end of the first half.    I don't think anyone thought the Packers would rush for 138 yards in this game. Rookie James Starks was outstanding, generating 123 yards on 23 attempts. He's an explosive runner who could be the team's back of the future.    The Packers travel to Atlanta next week to avenge a last-second regular-season loss back in Week 12. No NFC six-seed has ever won the Super Bowl before, but the Packers have a great chance to buck that trend. They could be the second-best team in the NFL. At least I think so.   ",
   "players":[

   ]
  }
 ]
}
