{
  "week": "14",
  "year": "2016",
  "numberOfGames": "16",
  "games": [
    {
      "Team 1": {
        "Name": "Chiefs",
        "Points": "21"
      },
      "Team 2": {
        "Name": "Raiders",
        "Points": "13"
      },
      "comments": " If Derek Carr's fingers don't heal, the Raiders aren't going to win a single playoff game. Actually, with the Chargers, Colts and Broncos on the horizon, they may not win another contest this season. Carr was that bad in this game. He had major issues connecting with his targets. He constantly was way off the mark on his throws, even failing to hit players just three yards in front of him. Some might blame the weather, but Carr was seen wincing on a number of his passes, particularly on one in which he had Amari Cooper wide open downfield for a touchdown. Carr completely missed him, and the same thing happened earlier in the game when Carr whiffed on a pass to a wide-open Jalen Richard, who was standing in the end zone by himself. It was pretty clear that the Raiders didn't have a chance when their defense produced two turnovers in the third quarter, setting up the offense near the red zone on two occasions. Oakland managed just three points on the two possessions. Seth Roberts was guilty of dropping a touchdown on the first drive, and there was a holding penalty involved, but Carr was almost picked off on another throw. Marquette King fumbled a hold on one of Sebastian Janikowski's attempts, but in the end, it didn't really matter. Carr finished with absolutely dreadful numbers. He was 17-of-41 for only 117 yards. He was victimized by numerous drops, but he looked like a shell of his former self because of his injury, and once again, if things don't get better in that regard, the Raiders could lose their next four games. They're known for their dynamic offense, so it's going to be difficult for them to have any success averaging just 3.3 yards per play like they did in this divisional affair.    The Chiefs, meanwhile, have moved into first place of the AFC West in the wake of this victory, thanks to their season-sweep tie-breaker over the Raiders. However, they can't be feeling too good right now because of Derrick Johnson's injury. Johnson went down on no contact toward the end of the second quarter and had to be helped off the field. It was ruled that he he ruptured his problematic Achilles and will be out for the year and possibly a portion of 2017. It's a huge blow, as Johnson is the heart and soul of Kansas City's defense.    Alex Smith was terrific in the first half, as he looked like the quarterback in the running for the MVP. Smith was 11-of-16 for 202 yards and a touchdown in the opening half alone. He converted on an early third-and-10, as Chris Conley beat David Amerson. He then hit Travis Kelce for a gain of 28 yards from deep in his own territory, and followed that up with a nifty play in which he danced around the pocket and connected to Conley for a 31-yarder, as Conley beat Amerson again. Smith came back down to Earth after halftime, as he was just 6-of-10 for 62 yards, a telegraphed interception and a lost fumble (Khalil Mack strip-sack) following intermission. A regression to the mean was bound to happen for Smith, though in fairness, Andy Reid didn't seem interested in passing whatsoever, opting to just feed Spencer Ware instead. Overall, Smith finished 17-of-26 for 264 yards, one touchdown, the pick and the lost fumble.    The Raiders came into this game struggling against tight ends, so it's no wonder that Kelce went off. Kelce caught five passes for 101 yards, including a one-handed grab thrown behind him for a gain of 34. Meanwhile, Tyreek Hill (6-66) scored twice; once on offense when he beat Amerson (notice a theme here?), and once via a punt return. Jeremy Maclin (1-16) was barely heard from upon his return. He was targeted on Smith's interception.    Ware had a disappointing evening. He was limited to just 56 yards on 20 carries, and he was vultured in the second quarter by Charcandrick West, who found the end zone on one of his only two attempts.    Moving back to the Raiders, there might be another hand injury that they have to worry about. That's what Michael Crabtree hurt during one of his drops in the fourth quarter. Crabtree caught four passes for 21 yards, and the only positive thing he did was draw a pass-interference flag. Sadly, Crabtree trailed the Raider leader in receiving yardage by only eight yards, as Cooper snatched five of his 10 targets for just 29 yards. Cooper should've had more, but as mentioned, Carr couldn't hit an open Cooper for a long touchdown.    Seth Roberts needs to be brought up again. He dropped three passes, including one in the end zone. Though he converted a fourth-and-4, Roberts is one of the worst receivers in the NFL.    As for the running game, Cris Collinsworth kept harping about how much more effective Oakland's rushing attack would've been had Kelechi Osemele not been a late scratch. Osemele is one of the top guards in the NFL, and his unexpected absence certainly had a big impact. Even with him gone, Latavius Murray was able to pick up some substantial gains, registering 103 yards and a touchdown on 22 carries. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "18802",
          "name": "Seth Roberts ",
          "position": "WR",
          "height": "6-2",
          "weight": "196",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-02-22",
          "birth_place": "Moultrie, GA",
          "death_date": "None",
          "college": "West Alabama",
          "high_school": "McClay, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23267",
          "name": "Spencer Ware",
          "position": "RB",
          "height": "5-10",
          "weight": "229",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1991-11-23",
          "birth_place": "Eunice, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Princeton, OH",
          "draft_team": "Seattle Seahawks",
          "draft_round": "6",
          "draft_position": "194",
          "draft_year": "2013",
          "current_salary": "1,300,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4700",
          "name": "Michael Crabtree",
          "position": "WR",
          "height": "6-2",
          "weight": "215",
          "current_team": "Oakland Raiders",
          "birth_date": "1987-09-14",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Texas Tech",
          "high_school": "David W. Carter, TX",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "10",
          "draft_year": "2009",
          "current_salary": "6,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16890",
          "name": "Kelechi Osemele",
          "position": "T",
          "height": "6-5",
          "weight": "333",
          "current_team": "Oakland Raiders",
          "birth_date": "1989-06-24",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "Iowa St.",
          "high_school": "Langham Creek, TX",
          "draft_team": "Baltimore Ravens",
          "draft_round": "2",
          "draft_position": "60",
          "draft_year": "2012",
          "current_salary": "6,700,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9894",
          "name": "Tyreek Hill",
          "position": "WR",
          "height": "5-10",
          "weight": "185",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1994-03-01",
          "birth_place": "Douglas, GA",
          "death_date": "None",
          "college": "West Alabama",
          "high_school": "Coffee Co., GA",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "5",
          "draft_position": "165",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13797",
          "name": "Khalil Mack",
          "position": "OLB",
          "height": "6-3",
          "weight": "251",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-02-22",
          "birth_place": "Fort Pierce, FL",
          "death_date": "None",
          "college": "Buffalo",
          "high_school": "Westwood, FL",
          "draft_team": "Oakland Raiders",
          "draft_round": "1",
          "draft_position": "5",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12301",
          "name": "Marquette King",
          "position": "P",
          "height": "6-0",
          "weight": "192",
          "current_team": "Oakland Raiders",
          "birth_date": "1988-10-26",
          "birth_place": "Macon, GA",
          "death_date": "None",
          "college": "Fort Valley St.",
          "high_school": "Rutland, GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,400,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "383",
          "name": "David Amerson",
          "position": "CB",
          "height": "6-1",
          "weight": "205",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-12-08",
          "birth_place": "Honolulu, HI",
          "death_date": "None",
          "college": "North Carolina St.",
          "high_school": "James B. Dudley, NC",
          "draft_team": "Washington Redskins",
          "draft_round": "2",
          "draft_position": "51",
          "draft_year": "2013",
          "current_salary": "650,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20509",
          "name": "Alex Smith",
          "position": "QB",
          "height": "6-4",
          "weight": "212",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1984-05-07",
          "birth_place": "Seattle, WA",
          "death_date": "None",
          "college": "Utah",
          "high_school": "Helix, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2005",
          "current_salary": "10,800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16093",
          "name": "Latavius Murray",
          "position": "RB",
          "height": "6-3",
          "weight": "225",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-01-18",
          "birth_place": "Titusville, FL",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Onondaga Central, NY",
          "draft_team": "Oakland Raiders",
          "draft_round": "6",
          "draft_position": "181",
          "draft_year": "2013",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3487",
          "name": "Derek Carr",
          "position": "QB",
          "height": "6-2",
          "weight": "214",
          "current_team": "Oakland Raiders",
          "birth_date": "1991-03-28",
          "birth_place": "Bakersfield, CA",
          "death_date": "None",
          "college": "Fresno St.",
          "high_school": "Bakersfield Christian, CA",
          "draft_team": "Oakland Raiders",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2014",
          "current_salary": "5,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12018",
          "name": "Travis Kelce",
          "position": "TE",
          "height": "6-5",
          "weight": "255",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1989-10-05",
          "birth_place": "Westlake, OH",
          "death_date": "None",
          "college": "Cincinnati",
          "high_school": "Cleveland Heights, OH",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "3",
          "draft_position": "63",
          "draft_year": "2013",
          "current_salary": "2,700,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18575",
          "name": "Jalen Richard",
          "position": "RB",
          "height": "5-8",
          "weight": "207",
          "current_team": "Oakland Raiders",
          "birth_date": "1993-10-15",
          "birth_place": "Baton Rouge, LA",
          "death_date": "None",
          "college": "Southern Miss",
          "high_school": "Peabody Magnet, LA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4495",
          "name": "Amari Cooper",
          "position": "WR",
          "height": "6-1",
          "weight": "210",
          "current_team": "Oakland Raiders",
          "birth_date": "1994-06-18",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Northwestern, FL",
          "draft_team": "Oakland Raiders",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4400",
          "name": "Chris Conley",
          "position": "WR",
          "height": "6-2",
          "weight": "207",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1992-10-25",
          "birth_place": "Dallas, GA",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "North Paulding, GA",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "3",
          "draft_position": "76",
          "draft_year": "2015",
          "current_salary": "635,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10942",
          "name": "Sebastian Janikowski",
          "position": "K",
          "height": "6-2",
          "weight": "250",
          "current_team": "Oakland Raiders",
          "birth_date": "1978-03-02",
          "birth_place": "Walbrzych, Poland",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Seabreeze, FL",
          "draft_team": "Oakland Raiders",
          "draft_round": "1",
          "draft_position": "17",
          "draft_year": "2000",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13822",
          "name": "Jeremy Maclin",
          "position": "WR",
          "height": "6-0",
          "weight": "200",
          "current_team": "Baltimore Ravens",
          "birth_date": "1988-05-11",
          "birth_place": "St. Louis, MO",
          "death_date": "None",
          "college": "Missouri",
          "high_school": "Kirkwood, MO",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "1",
          "draft_position": "19",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Titans",
        "Points": "13"
      },
      "Team 2": {
        "Name": "Broncos",
        "Points": "10"
      },
      "comments": " The Broncos didn't seem to match up well against the Titans heading into this contest, despite the varying records between these teams. Denver has a major defensive weakness in being incapable of stopping the run, and Tennessee pounds the ball extremely well. Meanwhile, the Broncos don't exactly have the greatest aerial attack, so they wouldn't be able to expose Tennessee's ailing secondary. Sometimes, NFL games don't go according to script, but this one definitely did. The Titans managed to prevail despite Marcus Mariota completing only six passes. That's because DeMarco Murray and Derrick Henry gashed the Broncos throughout the afternoon, beating them both inside and outside. Opposing teams have trampled the Broncos on the ground all year, and that continued to be the case, as Murray gained 92 yards and a touchdown on 21 carries, while Henry accumulated 42 yards on 12 attempts.    Meanwhile, Trevor Siemian returned following last week's hiatus, but he couldn't beat the Titan defensive backfield, at least not in the early going. Siemian struggled to start the game, as he was sacked on a third down of he opening drive, and then threw a horrible pass to Jordan Taylor on another third down. The Broncos didn't even score until the fourth quarter when Siemian managed to catch fire. He converted a third-and-14 to put the team into scoring range and then looked like he was going to lead a potential tying drive at the very end, but A.J. Derby lost a fumble near midfield. Siemian finished 35-of-51 for 334 yards and a touchdown, with 221 of those yards coming in the second half. Siemian has been better in the second halves of games this year, so his late-game surge, especially versus a poor secondary, was far from a surprise. It needs to be noted that Siemian was incomplete on a fourth down on a final-quarter drive. The Broncos should've kicked a field goal, and if they did, this game might have gone to overtime because Denver lost by three. Siemian also took a sack from Aaron Wallace later, which helped force a field goal.    Neither Demaryius Thomas nor Emmanuel Sanders was doing much in the opening half, which undoubtedly had their fantasy owners worried. That changed in the second half as Siemian was able to heat up, and both receivers eclipsed the century mark. Thomas caught 10 balls for 126 yards. Sanders, meanwhile, reeled in 11 catches for 100 yards and a touchdown. He dropped a pass in the fourth quarter.    The Broncos haven't been able to run the ball since C.J. Anderson was knocked out for the year, and that continued to be the case this week. Devontae Booker was limited to just one yard on three carries. Justin Forsett handled most of the workload, gaining 17 yards on just six attempts. He lost a fumble in the first half, setting up Tennessee with a field goal. Depiste the fumble, Gary Kubiak trusts Forsett more than Booker.    Going back to the Titans, Mariota has had better games. Mariota wasn't expected to perform well because of how good the Broncos are against the pass, but it was still a disappointment because Mariota was just 6-of-20 for 88 yards. He threw an apparent touchdown pass to Rishard Matthews, but it was negated by a Delanie Walker offensive pass interference. Mariota almost threw another score, but Walker barely stepped out of bounds, and Murray would end up finding the end zone on that same drive. Mariota also took a bad sack to take his team out of field goal range.    Speaking of Walker, he actually led the team in receiving yardage with 30 on two catches. He was the only Titan with multiple receptions. Matthews, blanketed by the elite Denver corners, had just one grab for 26 yards.    There was a big fight in this game during the second quarter. Harry Douglas dived at Chris Harris' knee on what was an obvious, dirty play. The officials should've ejected Douglas, but they didn't, and that started a huge brawl.   ",
      "players": [
        {
          "player_id": "19449",
          "name": "Emmanuel Sanders ",
          "position": "WR",
          "height": "5-11",
          "weight": "186",
          "current_team": "Denver Broncos",
          "birth_date": "1987-03-16",
          "birth_place": "Bellville, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Bellville, TX",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "3",
          "draft_position": "82",
          "draft_year": "2010",
          "current_salary": "6,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1999",
          "name": "Devontae Booker",
          "position": "RB",
          "height": "5-11",
          "weight": "212",
          "current_team": "Denver Broncos",
          "birth_date": "1992-05-27",
          "birth_place": "Sacramento, CA",
          "death_date": "None",
          "college": "Utah",
          "high_school": "Grant Union, CA",
          "draft_team": "Denver Broncos",
          "draft_round": "4",
          "draft_position": "136",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16086",
          "name": "DeMarco Murray",
          "position": "RB",
          "height": "6-0",
          "weight": "214",
          "current_team": "Tennessee Titans",
          "birth_date": "1988-02-12",
          "birth_place": "Las Vegas, NV",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Bishop Gorman, NV",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "71",
          "draft_year": "2011",
          "current_salary": "6,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23085",
          "name": "Delanie Walker",
          "position": "TE",
          "height": "6-1",
          "weight": "241",
          "current_team": "Tennessee Titans",
          "birth_date": "1984-08-12",
          "birth_place": "Pomona, CA",
          "death_date": "None",
          "college": "Central Missouri St.",
          "high_school": "Pomona, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "6",
          "draft_position": "175",
          "draft_year": "2006",
          "current_salary": "4,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22029",
          "name": "Demaryius Thomas",
          "position": "WR",
          "height": "6-3",
          "weight": "229",
          "current_team": "Denver Broncos",
          "birth_date": "1987-12-25",
          "birth_place": "Montrose, GA",
          "death_date": "None",
          "college": "Georgia Tech",
          "high_school": "West Laurens, GA",
          "draft_team": "Denver Broncos",
          "draft_round": "1",
          "draft_position": "22",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5871",
          "name": "Harry Douglas",
          "position": "WR",
          "height": "5-11",
          "weight": "170",
          "current_team": "Tennessee Titans",
          "birth_date": "1984-09-16",
          "birth_place": "Tampa, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Jonesboro, GA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "3",
          "draft_position": "84",
          "draft_year": "2008",
          "current_salary": "1,200,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23144",
          "name": "Aaron Wallace",
          "position": "OLB",
          "height": "6-3",
          "weight": "240",
          "current_team": "Tennessee Titans",
          "birth_date": "1993-07-08",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "UCLA",
          "high_school": "Rancho Bernardo, CA",
          "draft_team": "Tennessee Titans",
          "draft_round": "7",
          "draft_position": "222",
          "draft_year": "2016",
          "current_salary": "383,824",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21872",
          "name": "Jordan Taylor",
          "position": "WR",
          "height": "6-5",
          "weight": "204",
          "current_team": "Denver Broncos",
          "birth_date": "1992-02-18",
          "birth_place": "Sherman, TX",
          "death_date": "None",
          "college": "Rice",
          "high_school": "Denison, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "421",
          "name": "C.J. Anderson",
          "position": "RB",
          "height": "5-8",
          "weight": "224",
          "current_team": "Denver Broncos",
          "birth_date": "1991-02-10",
          "birth_place": "Vallejo, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Bethel, CA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14056",
          "name": "Marcus Mariota",
          "position": "QB",
          "height": "6-4",
          "weight": "215",
          "current_team": "Tennessee Titans",
          "birth_date": "1993-10-30",
          "birth_place": "Honolulu, HI",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Saint Louis, HI",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9143",
          "name": "Chris Harris",
          "position": "CB",
          "height": "5-10",
          "weight": "190",
          "current_team": "Denver Broncos",
          "birth_date": "1989-06-18",
          "birth_place": "Bixby, OK",
          "death_date": "None",
          "college": "Kansas",
          "high_school": "Bixby, OK",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "7,400,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20223",
          "name": "Trevor Siemian",
          "position": "QB",
          "height": "6-3",
          "weight": "215",
          "current_team": "Denver Broncos",
          "birth_date": "1991-12-26",
          "birth_place": "Windermere, FL",
          "death_date": "None",
          "college": "Northwestern",
          "high_school": "Olympia, FL",
          "draft_team": "Denver Broncos",
          "draft_round": "7",
          "draft_position": "250",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5535",
          "name": "A.J. Derby",
          "position": "TE",
          "height": "6-4",
          "weight": "255",
          "current_team": "Miami Dolphins",
          "birth_date": "1991-09-20",
          "birth_place": "Iowa City, IA",
          "death_date": "None",
          "college": "Arkansas",
          "high_school": "City, IA",
          "draft_team": "New England Patriots",
          "draft_round": "6",
          "draft_position": "202",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9653",
          "name": "Derrick Henry ",
          "position": "RB",
          "height": "6-3",
          "weight": "247",
          "current_team": "Tennessee Titans",
          "birth_date": "1994-01-04",
          "birth_place": "Yulee, FL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Yulee, FL",
          "draft_team": "Tennessee Titans",
          "draft_round": "2",
          "draft_position": "45",
          "draft_year": "2016",
          "current_salary": "695,815",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14314",
          "name": "Rishard Matthews",
          "position": "WR",
          "height": "6-0",
          "weight": "212",
          "current_team": "Tennessee Titans",
          "birth_date": "1989-10-12",
          "birth_place": "San Diego, CA",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Saddleback, CA",
          "draft_team": "Miami Dolphins",
          "draft_round": "7",
          "draft_position": "227",
          "draft_year": "2012",
          "current_salary": "5,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7155",
          "name": "Justin Forsett",
          "position": "RB",
          "height": "5-8",
          "weight": "190",
          "current_team": "None",
          "birth_date": "1985-10-14",
          "birth_place": "Lakeland, FL",
          "death_date": "None",
          "college": "California",
          "high_school": "Polk, FL",
          "draft_team": "Seattle Seahawks",
          "draft_round": "7",
          "draft_position": "233",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Vikings",
        "Points": "25"
      },
      "Team 2": {
        "Name": "Jaguars",
        "Points": "16"
      },
      "comments": " The Vikings may have won by nine, but it feels like they could've prevailed by 29. This game was not close. Minnesota spent most of the afternoon successfully moving the chains in between the 20s, but the team constantly stalled in the red zone. The Vikings settled for tons of field goals and even failed to convert on multiple occasions from the 1-yard line. Just prior to halftime, Matt Asiata was stuffed on a fourth down, even though it appeared as though he scored on the previous play. Asiata then lost a fumble at the goal line. Overall, the Vikings outgained the Jaguars by 1.2 yards per play, but the missed opportunities allowed this game to be close.    Sam Bradford posted a terrific stat line considering whom he was battling. Bradford finished 24-of-34 for 292 yards and a touchdown versus a Jacksonville secondary that has been performing on a high level lately. One of Bradford's best plays was when he was strip-sacked. He recovered the ball and had the awareness to flip a pass to Jerick McKinnon for a 15-yard gain. The Vikings need to trust Bradford more in short yardage, as pounding the ball with Asiata has failed more often than not.    Speaking of Asiata, he did manage to score once, gaining 37 yards on 11 carries. He outgained McKinnon (14-31) despite having three fewer attempts. However, Asiata's lost fumble nearly ended up costing Minnesota the game, so he's lucky he was up against such a bad opponent.    Bradford's leading receiver was Adam Thielen, who snatched four balls for 101 yards. Kyle Rudolph (4-60) hauled in Bradford's sole touchdown, while Stefon Diggs managed to catch just three passes for 55 yards. Forty-five of Diggs' yards came on a brilliant, diving catch. He should've had a better stat line, but a T.J. Clemmings hold negated a 20-yard reception.    Speaking of disappointing receivers, Allen Robinson caught only one pass for 17 yards, thanks to Xavier Rhodes' brilliant coverage. However, Rhodes had some issues of his own. He was flagged for a couple of pass-interference penalties and was also called for an unsportsmanlike infraction for yelling at an official. The Vikings actually racked up 42 penalty yards on a single drive of Jacksonville's in the second half.    Despite the Vikings trying to give this game away in a variety of ways, they were still able to prevail because Jacksonville's offense couldn't do anything. Blake Bortles didn't have a horrendous performance for once, but couldn't keep drives going. He finished 23-of-37 for 257 yards and a touchdown. Bortles couldn't connect with his primary receiver because of Rhodes, and with Allen Hurns out, Bortles had to rely throwing to Marqise Lee (5-113) and Bryan Walters (4-31, TD).    Chris Ivory was out as well, so T.J. Yeldon handled most of the workload. Yeldon gained 59 yards on 17 carries and also caught seven passes for 31 receiving yards. Yeldon did what he could with terrible blocking, and he had a decent afternoon. He should've been starting over Ivory this entire time, especially considering Ivory's medical condition.    On Jacksonville's blocking, left tackle Kelvin Beachum left the game with a knee injury. Beachum has struggled all year because he's been hurt, as it's quite apparent that general manager David Caldwell overpaid for damaged goods. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "23200",
          "name": "Bryan Walters",
          "position": "WR",
          "height": "6-0",
          "weight": "190",
          "current_team": "None",
          "birth_date": "1987-11-04",
          "birth_place": "Bothell, WA",
          "death_date": "None",
          "college": "Cornell",
          "high_school": "Juanita, WA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1325",
          "name": "Kelvin Beachum",
          "position": "T",
          "height": "6-2",
          "weight": "303",
          "current_team": "New York Jets",
          "birth_date": "1989-06-08",
          "birth_place": "Mexia, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Mexia, TX",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "7",
          "draft_position": "248",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13113",
          "name": "Marqise Lee ",
          "position": "WR",
          "height": "6-0",
          "weight": "192",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1991-11-25",
          "birth_place": "Inglewood, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Junipera Serra, CA",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "2",
          "draft_position": "39",
          "draft_year": "2014",
          "current_salary": "1,125,549",
          "hof_induction_year": "None"
        },
        {
          "player_id": "680",
          "name": "Matt Asiata",
          "position": "FB",
          "height": "5-11",
          "weight": "229",
          "current_team": "None",
          "birth_date": "1987-07-24",
          "birth_place": "West Valley, UT",
          "death_date": "None",
          "college": "Utah",
          "high_school": "Hunter, UT",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2038",
          "name": "Blake Bortles ",
          "position": "QB",
          "height": "6-5",
          "weight": "232",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1992-04-28",
          "birth_place": "Oviedo, FL",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Oviedo, FL",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2014",
          "current_salary": "3,236,565",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14897",
          "name": "Jerick McKinnon ",
          "position": "RB",
          "height": "5-9",
          "weight": "205",
          "current_team": "Minnesota Vikings",
          "birth_date": "1992-05-03",
          "birth_place": "Atlanta, GA",
          "death_date": "None",
          "college": "Georgia Southern",
          "high_school": "Sprayberry, GA",
          "draft_team": "Minnesota Vikings",
          "draft_round": "3",
          "draft_position": "96",
          "draft_year": "2014",
          "current_salary": "700,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21992",
          "name": "Adam Thielen",
          "position": "WR",
          "height": "6-3",
          "weight": "200",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-08-22",
          "birth_place": "Detroit Lakes, MN",
          "death_date": "None",
          "college": "Minnesota St.",
          "high_school": "Detroit Lakes, MN",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19223",
          "name": "Kyle Rudolph ",
          "position": "TE",
          "height": "6-5",
          "weight": "265",
          "current_team": "Minnesota Vikings",
          "birth_date": "1989-11-09",
          "birth_place": "Cincinnati, OH",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Elder, OH",
          "draft_team": "Minnesota Vikings",
          "draft_round": "2",
          "draft_position": "43",
          "draft_year": "2011",
          "current_salary": "5,150,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2201",
          "name": "Sam Bradford ",
          "position": "QB",
          "height": "6-4",
          "weight": "236",
          "current_team": "Minnesota Vikings",
          "birth_date": "1987-11-08",
          "birth_place": "Oklahoma City, OK",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Putnam City North, OK",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2010",
          "current_salary": "14,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10549",
          "name": "Allen Hurns",
          "position": "WR",
          "height": "6-3",
          "weight": "195",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1991-11-12",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Miami Carol City, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5642",
          "name": "Stefon Diggs",
          "position": "WR",
          "height": "6-0",
          "weight": "195",
          "current_team": "Minnesota Vikings",
          "birth_date": "1993-11-29",
          "birth_place": "Gaithersburg, MD",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Our Lady of Good Counsel, MD",
          "draft_team": "Minnesota Vikings",
          "draft_round": "5",
          "draft_position": "146",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4074",
          "name": "T.J. Clemmings",
          "position": "OT",
          "height": "6-5",
          "weight": "307",
          "current_team": "Washington Redskins",
          "birth_date": "1991-11-18",
          "birth_place": "Teaneck, NJ",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Paterson Catholic, NJ",
          "draft_team": "Minnesota Vikings",
          "draft_round": "4",
          "draft_position": "110",
          "draft_year": "2015",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24845",
          "name": "T.J. Yeldon",
          "position": "RB",
          "height": "6-2",
          "weight": "221",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1993-10-02",
          "birth_place": "Daphne, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Daphne, AL",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2015",
          "current_salary": "972,617",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18545",
          "name": "Xavier Rhodes",
          "position": "CB",
          "height": "6-2",
          "weight": "210",
          "current_team": "Minnesota Vikings",
          "birth_date": "1990-06-19",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Norland, FL",
          "draft_team": "Minnesota Vikings",
          "draft_round": "1",
          "draft_position": "25",
          "draft_year": "2013",
          "current_salary": "8,026,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18833",
          "name": "Allen Robinson",
          "position": "WR",
          "height": "6-3",
          "weight": "220",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1993-08-24",
          "birth_place": "Detroit, MI",
          "death_date": "None",
          "college": "Penn St.",
          "high_school": "St. Mary's Prep, MI",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "2",
          "draft_position": "61",
          "draft_year": "2014",
          "current_salary": "898,755",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10701",
          "name": "Chris Ivory",
          "position": "RB",
          "height": "6-0",
          "weight": "222",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1988-03-22",
          "birth_place": "Longview, TX",
          "death_date": "None",
          "college": "Washington St.",
          "high_school": "Longview, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "4,500,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Dolphins",
        "Points": "26"
      },
      "Team 2": {
        "Name": "Cardinals",
        "Points": "23"
      },
      "comments": " This was a classic case of a Pyrrhic victory for the Dolphins. They managed to prevail as home underdogs against the Cardinals to improve their standing in the wild-card race, moving into a tie for the No. 6 seed. Unfortunately, Ryan Tannehill tore his ACL and will obviously be out for the remainder of the season. It's a shame for the Dolphins and Tannehill in particular, as Tannehill was enjoying a strong afternoon. Despite playing in a heavy downpour and against a strong Arizona defense, Tannehill had misfired on just five passes. He was 15-of-20 for 195 yards and three touchdowns. Sure, he had made some mistakes, like overshooting Jay Ajayi for a potential score, and throwing the ball backward for a loss of about 20 yards because the slippery ball fell out of his hands. He also heaved an interception on a late throw to Kenny Stills, but he had been terrific in the second half, completing all eight of his passes for 114 yards. The afternoon ended when Calais Campbell drilled Tannehill below the knee. Matt Moore stepped in, and the Dolphins went three-and-out and hit a poor punt to give Arizona a short field. The Cardinals were able to come back as a result to tie the game, but Moore was clutch on the final drive. Moore completed three of his five attempts for 47 yards, setting up the decisive field goal.    Tannehill and Moore's heroics were crucial, as the Dolphins couldn't run the ball against Arizona's stalwart front. Ajayi managed just 48 yards on 20 carries, and 13 of his yards came on one burst. As mentioned earlier, Ajayi should've caught a touchdown, but Tannehill overshot him. Ajayi was also robbed of another score, as a scamper of his into the end zone was nullified by a hold.    Thanks to the conditions, only two Dolphins accumulated more than 15 receiving yards. DeVante Parker (2-14) was not one of them, as he had to deal with Patrick Peterson. Thanks to Tyvon Branch's injury, Jarvis Landry led the way with four catches for 103 yards, though he lost a fumble on a punt return. Kenny Stills logged six receptions for 97 yards and scored once.    With Tannehill out of the game, the victory was there for the Cardinals, and they managed to come back from down 21-9, but Carson Palmer couldn't move the chains in a tie game. Palmer had a couple of nice drives this afternoon, but struggled for the most part. In fact, he was so bad that it makes me wonder if someone dressed up in his jersey last week because the difference was night and day, and this version of Palmer is the one we've seen most of the year. Palmer finished 18-of-33 for only 145 yards, two touchdowns, a pair of interceptions and three fumbles. The result could've been even worse for Palmer, as Miami dropped a couple of other potential picks. One of his actual interceptions wasn't his fault because the pass was tipped, but Palmer had a horrible afternoon overall.    With Palmer struggling in yet another road start, only two Cardinals accumulated more than 20 receiving yards: Jermaine Gresham (5-45) and David Johnson (5-41). Palmer couldn't connect with Larry Fitzgerald, who saw nine targets, but converted just three of them for 12 yards. Michael Floyd (2-18) didn't do much either.    Johnson as Arizona's primary source of offense. In addition to his receiving numbers, Johnson also logged 80 yards on 20 carries. However, he lost a fumble early in the game.    The Cardinals need to shore up their kicking game, as Chandler Catanzaro had yet another rough outing. He missed an extra point and a 41-yarder early on, and then had an extra try blocked and returned for two.    I need to mention the officials because they were terrible. Jerome Boger and his staff were absolutely clueless. The officials, on one occasion, didn't know whom a neutral-zone infraction penalty was on, so they huddled for what seemed like five minutes. They also took forever to review a Miami fumble. It was evident that Ajayi recovered the fumble, and the FOX announcers agreed, but Boger ruled Arizona possession. Boger's decision-making took years, and at one point, it seemed like this game was going to end at 5 p.m.   ",
      "players": [
        {
          "player_id": "17016",
          "name": "Carson Palmer",
          "position": "QB",
          "height": "6-5",
          "weight": "230",
          "current_team": "Arizona Cardinals",
          "birth_date": "1979-12-27",
          "birth_place": "Fresno, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Santa Margarita, CA",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2003",
          "current_salary": "15,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17481",
          "name": "Patrick Peterson",
          "position": "CB",
          "height": "6-0",
          "weight": "220",
          "current_team": "Arizona Cardinals",
          "birth_date": "1990-07-11",
          "birth_place": "Fort Lauderdale, FL",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Blanche Ely, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "5",
          "draft_year": "2011",
          "current_salary": "9,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21763",
          "name": "Ryan Tannehill",
          "position": "QB",
          "height": "6-4",
          "weight": "220",
          "current_team": "Miami Dolphins",
          "birth_date": "1988-07-27",
          "birth_place": "Big Spring, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Big Spring, TX",
          "draft_team": "Miami Dolphins",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2012",
          "current_salary": "17,975,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21319",
          "name": "Kenny Stills",
          "position": "WR",
          "height": "6-1",
          "weight": "194",
          "current_team": "Miami Dolphins",
          "birth_date": "1992-04-22",
          "birth_place": "Oceanside, CA",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Lo Costa Canyon, CA",
          "draft_team": "New Orleans Saints",
          "draft_round": "5",
          "draft_position": "144",
          "draft_year": "2013",
          "current_salary": "1,975,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2266",
          "name": "Tyvon Branch",
          "position": "DB",
          "height": "5-11",
          "weight": "197",
          "current_team": "Arizona Cardinals",
          "birth_date": "1986-12-11",
          "birth_place": "Cicero, NY",
          "death_date": "None",
          "college": "Connecticut",
          "high_school": "Cicero-North Syracuse, NY",
          "draft_team": "Oakland Raiders",
          "draft_round": "4",
          "draft_position": "100",
          "draft_year": "2008",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3316",
          "name": "Calais Campbell",
          "position": "DE",
          "height": "6-8",
          "weight": "282",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1986-09-01",
          "birth_place": "Denver, CO",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "South, CO",
          "draft_team": "Arizona Cardinals",
          "draft_round": "2",
          "draft_position": "50",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3677",
          "name": "Chandler Catanzaro",
          "position": "K",
          "height": "6-3",
          "weight": "200",
          "current_team": "New York Jets",
          "birth_date": "1991-02-26",
          "birth_place": "Greenville, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "Christ Church Episcopal School, SC",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11229",
          "name": "David Johnson ",
          "position": "TE",
          "height": "6-2",
          "weight": "270",
          "current_team": "None",
          "birth_date": "1987-08-26",
          "birth_place": "Pine Bluff, AR",
          "death_date": "None",
          "college": "Arkansas St.",
          "high_school": "Pine Bluff, AR",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "7",
          "draft_position": "241",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17083",
          "name": "DeVante Parker",
          "position": "WR",
          "height": "6-3",
          "weight": "209",
          "current_team": "Miami Dolphins",
          "birth_date": "1993-01-20",
          "birth_place": "Louiville, KY",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Ballard, KY",
          "draft_team": "Miami Dolphins",
          "draft_round": "1",
          "draft_position": "14",
          "draft_year": "2015",
          "current_salary": "1,423,776",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8489",
          "name": "Jermaine Gresham",
          "position": "TE",
          "height": "6-5",
          "weight": "261",
          "current_team": "Arizona Cardinals",
          "birth_date": "1988-06-16",
          "birth_place": "Ardmore, OK",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Ardmore, OK",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "21",
          "draft_year": "2010",
          "current_salary": "2,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15715",
          "name": "Matt Moore",
          "position": "QB",
          "height": "6-3",
          "weight": "192",
          "current_team": "Miami Dolphins",
          "birth_date": "1984-08-09",
          "birth_place": "Van Nuys, CA",
          "death_date": "None",
          "college": "Oregon St.",
          "high_school": "William S. Hart, CA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12827",
          "name": "Jarvis Landry",
          "position": "WR",
          "height": "6-0",
          "weight": "205",
          "current_team": "Miami Dolphins",
          "birth_date": "1992-11-28",
          "birth_place": "Metairie, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Lutcher, LA",
          "draft_team": "Miami Dolphins",
          "draft_round": "2",
          "draft_position": "63",
          "draft_year": "2014",
          "current_salary": "893,852",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11230",
          "name": "David Johnson",
          "position": "RB",
          "height": "6-1",
          "weight": "224",
          "current_team": "Arizona Cardinals",
          "birth_date": "1991-12-16",
          "birth_place": "Clinton, IA",
          "death_date": "None",
          "college": "Northern Iowa",
          "high_school": "Clinton, IA",
          "draft_team": "Arizona Cardinals",
          "draft_round": "3",
          "draft_position": "86",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "160",
          "name": "Jay Ajayi",
          "position": "RB",
          "height": "6-0",
          "weight": "216",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1993-06-15",
          "birth_place": "London, England",
          "death_date": "None",
          "college": "Boise St.",
          "high_school": "Liberty, TX",
          "draft_team": "Miami Dolphins",
          "draft_round": "5",
          "draft_position": "149",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6967",
          "name": "Larry Fitzgerald",
          "position": "WR",
          "height": "6-3",
          "weight": "225",
          "current_team": "Arizona Cardinals",
          "birth_date": "1983-08-31",
          "birth_place": "Minneapolis, MN",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Academy of the Holy Angels, MN",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2004",
          "current_salary": "11,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7063",
          "name": "Michael Floyd ",
          "position": "WR",
          "height": "6-3",
          "weight": "220",
          "current_team": "Minnesota Vikings",
          "birth_date": "1989-11-27",
          "birth_place": "St. Paul, MN",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Cretin-Derham Hall, MN",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2012",
          "current_salary": "887,058",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Panthers",
        "Points": "28"
      },
      "Team 2": {
        "Name": "Chargers",
        "Points": "16"
      },
      "comments": " The Chargers were effectively knocked out of the playoffs after losing last week to the Buccaneers. In a sense, it's a good thing that San Diego's playoff hopes were dashed because all of the injuries it sustained in this game would've been devastating for any sort of postseason aspirations. It started early in the first quarter when Melvin Gordon sustained an injury. Gordon was down on the ground for a while and then was carted into the locker room. It was ruled that he had a hip injury and was ruled out about half an hour later. The Chargers then lost Craig Mager and Joe Barksdale, which wouldn't have been the end of the world, but Joey Bosa was knocked out after that with a concussion. All of this occurred in the opening half. With the top offensive play-maker and best talent in the front seven gone, the Chargers didn't have much of a chance. The Chargers needed Gordon and their other injured players - Orlando Franklin went down in the second half as well - during an attempted comeback. They drew to within 26-16, but Philip Rivers, with no one to throw to, had to hold the ball forever in his end zone. He took the safety, and the game was over.    Rivers had a sloppy afternoon. Going up against a poor Carolina defense missing several key players, Rivers was just 21-of-39 for 236 yards, two touchdowns and three interceptions. With Gordon gone, Rivers had to do everything on his own, and it was just too much to ask. He forced the issue on too many occasions, as his first pick was basically a punt thrown up for grabs, which led to an early Carolina touchdown. His second was crushing, as it occurred when the Chargers were storming back. The third was in desperation time. Rivers was also strip-sacked in the opening quarter.    With Gordon (3 carries, 5 yards) out with a hip injury, Kenneth Farrow handled most of the workload. Farrow gained 55 yards on 16 carries and also caught six balls for 23 receiving yards. Farrow is a plodder with no play-making ability, but if Gordon is out, Farrow will be worth adding in fantasy.    Rivers' leading receiver was Dontrelle Inman, who once again put together a strong performance. He caught six of his seven targets for 71 yards and a touchdown. Tyrell Williams (2-68) and Antonio gates (5-61) were next on the receiving list, while Hunter Henry (2-13) caught Rivers' other score. Henry was also banged up because a Rivers pass had him laid out by a defender.    Cam Newton is very fortunate that the Chargers sustained so many injuries because based on how he played, the Panthers had absolutely no business winning this game. Newton was horrible, as he failed to complete half of his passes yet again. Newton went 10-of-27 for 160 yards, one touchdown and an interception, which appeared to be a pick-six, but it was ruled down by contact after replay. Newton also should've been intercepted several more times. He was nearly picked in the end zone early on by Casey Hayward, and then had another potential pick wiped out by a horrible replay review. The CBS announcers thought that Newton heaved an interception, but the officials somehow ruled that the ball hit the ground. That was just one of many dubious calls made throughout the league on this day.    The primary reason why Newton struggled, aside from his horrible offensive line, is that Kelvin Benjamin was blanketed by Hayward. Benjamin was limited to just one catch for 11 yards. Newton instead targeted Greg Olsen primarily. Olsen caught four passes for 87 yards, and he was way ahead of second place on the receiving list, which was Devin Funchess (2-33). Funchess was knocked out for a bit when he was jacked up by Jaleel Addae, but returned later to catch a touchdown.    Jonathan Stewart had the play of the game when he ran for 20 yards. The play included a somersault to elude a tackle, and Stewart somehow didn't hit the ground. It was so inexplicable that Mike McCoy challenged, but the review stood correctly for once. Stewart gained 66 yards on 24 carries, and he scored a touchdown. His only blemish was a dropped pass in the red zone.   ",
      "players": [
        {
          "player_id": "7292",
          "name": "Orlando Franklin",
          "position": "OL",
          "height": "6-6",
          "weight": "315",
          "current_team": "None",
          "birth_date": "1987-12-16",
          "birth_place": "Kingston, Jamaica",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Atlantic, FL",
          "draft_team": "Denver Broncos",
          "draft_round": "2",
          "draft_position": "46",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2043",
          "name": "Joey Bosa",
          "position": "DE",
          "height": "6-5",
          "weight": "269",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1995-07-11",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "St. Thomas Aquinas, FL",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21291",
          "name": "Jonathan Stewart",
          "position": "RB",
          "height": "5-11",
          "weight": "235",
          "current_team": "Carolina Panthers",
          "birth_date": "1987-03-21",
          "birth_place": "Fort Lewis, WA",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Timberline, WA",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "13",
          "draft_year": "2008",
          "current_salary": "1,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8145",
          "name": "Melvin Gordon",
          "position": "RB",
          "height": "6-1",
          "weight": "207",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1993-04-13",
          "birth_place": "Kenosha, WI",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Mary D. Bradford, WI",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "15",
          "draft_year": "2015",
          "current_salary": "1,404,980",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9655",
          "name": "Hunter Henry ",
          "position": "TE",
          "height": "6-5",
          "weight": "250",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1994-12-07",
          "birth_place": "Little Rock, AR",
          "death_date": "None",
          "college": "Arkansas",
          "high_school": "Pulaski Academy, AR",
          "draft_team": "San Diego Chargers",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2016",
          "current_salary": "740,014",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7461",
          "name": "Devin Funchess",
          "position": "WR",
          "height": "6-5",
          "weight": "230",
          "current_team": "Carolina Panthers",
          "birth_date": "1994-05-21",
          "birth_place": "Farmington Hill, MI",
          "death_date": "None",
          "college": "Michigan",
          "high_school": "Harrison, MI",
          "draft_team": "Carolina Panthers",
          "draft_round": "2",
          "draft_position": "41",
          "draft_year": "2015",
          "current_salary": "836,900",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9481",
          "name": "Casey Hayward",
          "position": "DB",
          "height": "5-11",
          "weight": "188",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1989-09-09",
          "birth_place": "Perry, GA",
          "death_date": "None",
          "college": "Vanderbilt",
          "high_school": "Perry, GA",
          "draft_team": "Green Bay Packers",
          "draft_round": "2",
          "draft_position": "62",
          "draft_year": "2012",
          "current_salary": "3,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24276",
          "name": "Tyrell Williams",
          "position": "WR",
          "height": "6-4",
          "weight": "205",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1992-02-12",
          "birth_place": "Salem, OR",
          "death_date": "None",
          "college": "Western Oregon",
          "high_school": "Cascade, OR",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10639",
          "name": "Dontrelle Inman",
          "position": "WR",
          "height": "6-3",
          "weight": "198",
          "current_team": "Chicago Bears",
          "birth_date": "1989-01-31",
          "birth_place": "Batesburg, SC",
          "death_date": "None",
          "college": "Virginia",
          "high_school": "Batesburg-Leesville, SC",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18745",
          "name": "Philip Rivers",
          "position": "QB",
          "height": "6-5",
          "weight": "228",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1981-12-08",
          "birth_place": "Decatur, AL",
          "death_date": "None",
          "college": "North Carolina St.",
          "high_school": "Athens, AL",
          "draft_team": "New York Giants",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2004",
          "current_salary": "11,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16815",
          "name": "Greg Olsen",
          "position": "TE",
          "height": "6-6",
          "weight": "254",
          "current_team": "Carolina Panthers",
          "birth_date": "1985-03-11",
          "birth_place": "Paterson, NJ",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Wayne Hills, NJ",
          "draft_team": "Chicago Bears",
          "draft_round": "1",
          "draft_position": "31",
          "draft_year": "2007",
          "current_salary": "6,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1069",
          "name": "Joe Barksdale",
          "position": "OL",
          "height": "6-5",
          "weight": "313",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1988-01-01",
          "birth_place": "Detroit, MI",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Cass Tech, MI",
          "draft_team": "Oakland Raiders",
          "draft_round": "3",
          "draft_position": "92",
          "draft_year": "2011",
          "current_salary": "4,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6717",
          "name": "Kenneth Farrow",
          "position": "RB",
          "height": "5-9",
          "weight": "219",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1993-03-07",
          "birth_place": "None",
          "death_date": "None",
          "college": "Houston",
          "high_school": "L.D. Bell, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "363,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13861",
          "name": "Craig Mager",
          "position": "CB",
          "height": "6-0",
          "weight": "191",
          "current_team": "None",
          "birth_date": "1992-06-11",
          "birth_place": "New Braunfels, TX",
          "death_date": "None",
          "college": "Texas St.",
          "high_school": "Luling, TX",
          "draft_team": "San Diego Chargers",
          "draft_round": "3",
          "draft_position": "83",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16363",
          "name": "Cam Newton",
          "position": "QB",
          "height": "6-6",
          "weight": "260",
          "current_team": "Carolina Panthers",
          "birth_date": "1989-05-11",
          "birth_place": "College Park, GA",
          "death_date": "None",
          "college": "Auburn",
          "high_school": "Westlake, GA",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2011",
          "current_salary": "13,166,666",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1520",
          "name": "Kelvin Benjamin",
          "position": "WR",
          "height": "6-5",
          "weight": "240",
          "current_team": "Buffalo Bills",
          "birth_date": "1991-02-05",
          "birth_place": "Belle Glade, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Glades Central, FL",
          "draft_team": "Carolina Panthers",
          "draft_round": "1",
          "draft_position": "28",
          "draft_year": "2014",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Bengals",
        "Points": "23"
      },
      "Team 2": {
        "Name": "Browns",
        "Points": "10"
      },
      "comments": " I've lost so much respect for Hue Jackson recently. I used to consider Jackson as a quality head coach as well as a terrific offensive coordinator. I thought he did a good job in Oakland, and his early game-planning for the Browns was solid; the team, despite losing, had been competitive. However, Jackson's decision-making when it's come to his starting quarterback has been extremely dubious, and it seems as though Jackson has no idea what he's doing. Starting Robert Griffin was inexcusable. Griffin is a bum who doesn't care about football enough to study film or improve the mental part of his game. Cody Kessler should've been named the starter for this game, but instead, Jackson went with the anemic Griffin, who predictably put together an abysmal afternoon. Griffin went 12-of-28 for only 104 yards and an interception heaved into triple coverage. He had a touchdown dropped by a fullback and also rushed for 31 yards and a score on the ground. He made a nice play in the early going when he scrambled around in the backfield to connect with Gary Barnidge for a 13-yarder, but Griffin, overall, was very inaccurate, and the timing with his receivers seemed incredibly off. Even his stat line is inflated with garbage-time numbers; Griffin was just 2-of-10 for 20 yards and a pick in the opening half, but was able to move the chains in the second half when the Bengals took their foot off the gas.    Given that Griffin doesn't really care about football, he probably wasn't even aware of how great of a season Terrelle Pryor had been enjoying. I say that because Griffin threw to Pryor just three times, with Pryor coming up with one catch for only three yards. Instead, Griffin spent most of the afternoon firing inaccurate passes to Corey Coleman, whom he has undoubtedly heard of, if only because they're both alumni of the same school. Coleman's 11 targets turned into three catches for 26 yards. He trailed only Barnidge (3-27) in receiving. Barnidge dropped a pass, though Griffin was to blame as well for firng a poorly thrown ball.    The Browns trailed throughout, so they couldn't run much. Isaiah Crowell actually tallied 113 yards on just 10 carries, though most of that came late when the Bengals weren't playing the run; Crowell managed just two yards on four attempts in the opening half.    As for the real team in this matchup, the Bengals were definitely focused, as they didn't want to be the only squad to lose to the Browns this year. They were playing hard, and they even went for it on an early fourth-and-1 on their own 21-yard line, up 13-0 in the first quarter! Andy Dalton finished 20-of-28 for 180 yards and two touchdowns. Though he held on to the ball too long on some occasions, he was mostly solid, especially considering that he didn't have A.J. Green at his disposal. Dalton didn't face much resistance, of course, given how bad Cleveland's secondary is. Check out my to see how the Browns can improve their defensive backfield.    With Green out, both of Dalton's touchdowns went to Tyler Eifert (5-48), who trailed only Tyler Boyd (6-49) on the receiving chart. Boyd also picked up 39 rushing yards on one play. Brandon LaFell (3-22) had a predictable dud performance following a decent, statistical showing.    Jeremy Hill hasn't run well since Giovani Bernard went down with a torn ACL, but that changed in this game. Only against the Browns. Hill generated 111 yards and a touchdown on 25 carries. Hill also caught three passes for 31 receiving yards. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "6318",
          "name": "Tyler Eifert",
          "position": "TE",
          "height": "6-6",
          "weight": "250",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1990-09-08",
          "birth_place": "Fort Wayne, IN",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Bishop Dwenger, IN",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "21",
          "draft_year": "2013",
          "current_salary": "4,782,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12762",
          "name": "Brandon LaFell",
          "position": "WR",
          "height": "6-2",
          "weight": "208",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1986-11-04",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Mirabeau B. Lamar, TX",
          "draft_team": "Carolina Panthers",
          "draft_round": "3",
          "draft_position": "78",
          "draft_year": "2010",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1142",
          "name": "Gary Barnidge",
          "position": "TE",
          "height": "6-5",
          "weight": "240",
          "current_team": "None",
          "birth_date": "1985-09-22",
          "birth_place": "Middleburg, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Middleburg, FL",
          "draft_team": "Carolina Panthers",
          "draft_round": "5",
          "draft_position": "141",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5035",
          "name": "Andy Dalton",
          "position": "QB",
          "height": "6-2",
          "weight": "215",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1987-10-29",
          "birth_place": "Katy, TX",
          "death_date": "None",
          "college": "TCU",
          "high_school": "Katy, TX",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2011",
          "current_salary": "13,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2158",
          "name": "Tyler Boyd",
          "position": "WR",
          "height": "6-1",
          "weight": "197",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1994-11-15",
          "birth_place": "Clairton, PA",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Clairton, PA",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "2",
          "draft_position": "55",
          "draft_year": "2016",
          "current_salary": "643,589",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4231",
          "name": "Corey Coleman",
          "position": "WR",
          "height": "5-11",
          "weight": "194",
          "current_team": "Cleveland Browns",
          "birth_date": "1994-07-06",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Baylor",
          "high_school": "J.J. Pearce, TX",
          "draft_team": "Cleveland Browns",
          "draft_round": "1",
          "draft_position": "15",
          "draft_year": "2016",
          "current_salary": "979,773",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12170",
          "name": "Cody Kessler",
          "position": "QB",
          "height": "6-1",
          "weight": "224",
          "current_team": "Cleveland Browns",
          "birth_date": "1993-05-11",
          "birth_place": "Bakersfield, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Centennial, CA",
          "draft_team": "Cleveland Browns",
          "draft_round": "3",
          "draft_position": "93",
          "draft_year": "2016",
          "current_salary": "604,049",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18016",
          "name": "Terrelle Pryor",
          "position": "QB",
          "height": "6-6",
          "weight": "240",
          "current_team": "Washington Redskins",
          "birth_date": "1989-06-20",
          "birth_place": "Jeanette, PA",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Jeannette, PA",
          "draft_team": "Oakland Raiders",
          "draft_round": "3",
          "draft_position": "1",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9856",
          "name": "Jeremy Hill",
          "position": "RB",
          "height": "6-1",
          "weight": "233",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1992-10-20",
          "birth_place": "Baton Rouge, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Redemptorist, LA",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "2",
          "draft_position": "55",
          "draft_year": "2014",
          "current_salary": "881,855",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8337",
          "name": "A.J. Green",
          "position": "WR",
          "height": "6-4",
          "weight": "205",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1988-07-31",
          "birth_place": "Summerville, SC",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Summerville, SC",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2011",
          "current_salary": "10,300,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1603",
          "name": "Giovani Bernard",
          "position": "RB",
          "height": "5-9",
          "weight": "202",
          "current_team": "Cincinnati Bengals",
          "birth_date": "1991-11-22",
          "birth_place": "Davie, FL",
          "death_date": "None",
          "college": "North Carolina",
          "high_school": "St. Thomas Aquinas, FL",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "2",
          "draft_position": "37",
          "draft_year": "2013",
          "current_salary": "1,600,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4860",
          "name": "Isaiah Crowell",
          "position": "RB",
          "height": "5-11",
          "weight": "190",
          "current_team": "Cleveland Browns",
          "birth_date": "1993-01-08",
          "birth_place": "Columbus, GA",
          "death_date": "None",
          "college": "Alabama St.",
          "high_school": "Carver, GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Lions",
        "Points": "20"
      },
      "Team 2": {
        "Name": "Bears",
        "Points": "17"
      },
      "comments": " Matthew Stafford has been enjoying a terrific season and has even been worthy of MVP discussion. Going into this game, he hadn't thrown an interception since Week 9. That all changed, as Stafford struggled to throw the ball versus the Bears. Stafford banged his hand on a Chicago player in the first quarter, and he had to wear a glove on his right hand the rest of the afternoon. The hand injury gave him major problems, especially in the second half. Stafford, however, came up big when it mattered most. Stafford's second half was a mess, as he went just 5-of-10 for 47 yards following intermission. His first interception was thrown into the end zone on a deflection, which wasn't really his fault, but his other pick was; he telegraphed the throw to Anquan Boldin. The pass was also behind Boldin, allowing Cre'von LeBlanc to take the interception back for six. This gave the Bears the lead, but that didn't last very long. Stafford engineered a touchdown drive on the following possession, capped off with his own rushing score. Stafford's late-game heroics were great, as they'll make everyone but his fantasy owners forget about his middling passing numbers (21-of-35, 223 yards, one touchdown, two interceptions). He also rushed for 15 yards and another touchdown. However, his hand injury, which was ruled a dislocated middle finger, has to be a concern. The Lions rely so much on him, so it'll be difficult for them to win if he's not 100 percent.    Stafford didn't have Theo Riddick available as a receiving option. He instead focused on Golden Tate, who converted six of his 11 targets for 58 yards. He trailed Marvin Jones (4-67) on the receiving chart, thanks mostly to a 48-yard bomb Jones caught in the second quarter on a third-and-17 to set up a field goal. Boldin (3-49) secured Stafford's sole aerial score.    Dwayne Washington handled the majority of the workload on the ground, as he gained 64 yards on 16 carries. Washington's numbers could've been better, but he had a 14-yard burst negated by an illegal-use-of-hands penalty.    As for Detroit's defense, the team finally welcomed back DeAndre Levy for the first time since Week 2. He was credited with a tackle on Jordan Howard's second carry, drawing heavy cheers from the ground. Despite Levy's presence, however, the Lions couldn't prevent Howard from gashing them. Howard ended up gaining 86 yards on 13 carries. He saw five targets in the passing game, but caught just two of them for 24 yards.    The big story for Chicago's offense was the continued strong play of Matt Barkley. The former Eagle thrived against the 49ers and Titans, but this was his first real test. He certainly passed, as he proved to NFL decision-makers that he's capable of being a solid No. 2 quarterback in the NFL. Barkley finished 20-of-32 for 212 yards and a touchdown. Though he got lucky to avoid some potential turnovers, he also made a number of nifty plays, including one in which he sidestepped a pass-rusher on a third-and-9 to extend the play and help the Bears convert a first down. Barkley almost led a game-tying drive at the end of regulation, but his conversions to Cameron Meredith and Daniel Braverman of 27 and 17 yards, respectively, were negated by holds.    Meredith led the Bears in receiving with six catches for 72 yards and a touchdown, followed by Joshua Bellamy (3-45). Meredith would've had a line of 7-99, but the aforementioned hold wiped that out. Had Meredith's play been allowed to stand, the Bears would've been in field-goal range to force overtime.   ",
      "players": [
        {
          "player_id": "18654",
          "name": "Theo Riddick",
          "position": "RB",
          "height": "5-10",
          "weight": "201",
          "current_team": "Detroit Lions",
          "birth_date": "1991-05-04",
          "birth_place": "Manville, NJ",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Immaculata, NJ",
          "draft_team": "Detroit Lions",
          "draft_round": "6",
          "draft_position": "199",
          "draft_year": "2013",
          "current_salary": "1,075,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1067",
          "name": "Matt Barkley",
          "position": "QB",
          "height": "6-3",
          "weight": "227",
          "current_team": "Arizona Cardinals",
          "birth_date": "1990-09-08",
          "birth_place": "Newport Beach, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Mater Dei, CA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "4",
          "draft_position": "98",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2295",
          "name": "Daniel Braverman",
          "position": "WR",
          "height": "5-10",
          "weight": "178",
          "current_team": "None",
          "birth_date": "1993-09-28",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "West. Michigan",
          "high_school": "University, FL",
          "draft_team": "Chicago Bears",
          "draft_round": "7",
          "draft_position": "230",
          "draft_year": "2016",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21069",
          "name": "Matthew Stafford",
          "position": "QB",
          "height": "6-2",
          "weight": "230",
          "current_team": "Detroit Lions",
          "birth_date": "1988-02-07",
          "birth_place": "Tampa, FL",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Highland Park, TX",
          "draft_team": "Detroit Lions",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2009",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1961",
          "name": "Anquan Boldin",
          "position": "WR",
          "height": "6-1",
          "weight": "218",
          "current_team": "None",
          "birth_date": "1980-10-03",
          "birth_place": "Pahokee, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Pahokee, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "2",
          "draft_position": "54",
          "draft_year": "2003",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21799",
          "name": "Golden Tate",
          "position": "WR",
          "height": "5-11",
          "weight": "195",
          "current_team": "Detroit Lions",
          "birth_date": "1988-08-02",
          "birth_place": "Hendersonville, TN",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Pope John Paul II, TN",
          "draft_team": "Seattle Seahawks",
          "draft_round": "2",
          "draft_position": "60",
          "draft_year": "2010",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23329",
          "name": "Dwayne Washington",
          "position": "RB",
          "height": "6-1",
          "weight": "221",
          "current_team": "Detroit Lions",
          "birth_date": "1994-04-24",
          "birth_place": "Lakewood, CA",
          "death_date": "None",
          "college": "Washington",
          "high_school": "Richard Gahr, CA",
          "draft_team": "Detroit Lions",
          "draft_round": "7",
          "draft_position": "236",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11662",
          "name": "Marvin Jones ",
          "position": "WR",
          "height": "6-2",
          "weight": "198",
          "current_team": "Detroit Lions",
          "birth_date": "1990-03-12",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Etiwanda, CA",
          "draft_team": "Cincinnati Bengals",
          "draft_round": "5",
          "draft_position": "166",
          "draft_year": "2012",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10295",
          "name": "Jordan Howard",
          "position": "RB",
          "height": "6-1",
          "weight": "225",
          "current_team": "Chicago Bears",
          "birth_date": "1994-11-02",
          "birth_place": "Gardendale, AL",
          "death_date": "None",
          "college": "Indiana",
          "high_school": "Gardendale, AL",
          "draft_team": "Chicago Bears",
          "draft_round": "5",
          "draft_position": "150",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13055",
          "name": "Cre'von LeBlanc",
          "position": "DB",
          "height": "5-11",
          "weight": "190",
          "current_team": "Chicago Bears",
          "birth_date": "1994-07-25",
          "birth_place": "West Palm Beach, FL",
          "death_date": "None",
          "college": "Florida Atlantic",
          "high_school": "Glades Central, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15125",
          "name": "Cameron Meredith",
          "position": "WR",
          "height": "6-3",
          "weight": "200",
          "current_team": "Chicago Bears",
          "birth_date": "1992-09-21",
          "birth_place": "Berwyn, IL",
          "death_date": "None",
          "college": "Illinois St.",
          "high_school": "St. Joseph's, IL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13242",
          "name": "DeAndre Levy",
          "position": "LB",
          "height": "6-2",
          "weight": "230",
          "current_team": "None",
          "birth_date": "1987-03-26",
          "birth_place": "Milwaukee, WI",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Vincent, WI",
          "draft_team": "Detroit Lions",
          "draft_round": "3",
          "draft_position": "76",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Texans",
        "Points": "22"
      },
      "Team 2": {
        "Name": "Colts",
        "Points": "17"
      },
      "comments": " <i> EDITOR'S NOTE: <\/i> I bet the Texans on the moneyline because I thought they provided good value, but I'm still kind of surprised that they won. With Andrew Luck getting hot, it almost seemed likely that Indianapolis was going to prevail.    This was essentially a playoff elimination game, and the Colts are very likely to be watching football in January because of this loss. The old adage of a good defense and a running game leading to wins was proven true; the Texans' defense forced three turnovers to keep the Colts under 20 points, while Houston's rushing offense was excellent, totaling 185 yards to move the ball enough for a field-goal offense to get the job done. By virtue of winning this game, the Texans swept the Colts to basically advance to be in a two-team race for the AFC South with the Tennessee Titans.    Luck converted a third down on his first drive with a 31-yard zone read run. He connected with T.Y. Hilton for 17 yards, and that set up a short field goal for Indianapolis. After a three-and-out, Luck had Dwayne Allen fall down, and that led to Quintin Demps picking off the pass. It set up the Texans at the Colts' 16-yard line, but the Colts held the Texans to a game-tying field goal. Osweiler was able to drive to midfield on his next possession, but threw an interception to Akeem Ayers to set up the Colts just across the 50. Fortunately for Osweiler, the Texans' defense forced a three-and-out. Houston got moving thanks to runs from Lamar Miller, a 22-yard third-down conversion to DeAndre Hopkins, and a third-and-5 was converted by Akeem Hunt with a run of 19 yards. A terrific catch by Fiedorowicz then set up the Texans at Indianapolis' 1-yard line, from where Miller charged into the end zone to finish the impressive drive and give them the 10-3 lead. Just before the half, Adam Vinatieri missed a 55-yard field goal as the ball fell short. The Texans took advantage of the short field with a couple of completions to get a 52-yard field goal from Nick Novak. They took a 13-3 lead into the locker room. Luck was only 9-of-22 for fewer than 100 yards by halftime. Early in the third quarter, Luck was clobbered by Jadeveon Clowney, which led to a floating pass that was picked off by Andre Hal. He returned the interception inside the Colts' 20-yard line. Darryl Morris dropped a potential interception in the end zone, but the Texans settled for a field goal. The Colts had a chance after they were set up in the red zone by a 41-yard penalty on Robert Nelson, and they turned that into a screen pass to Frank Gore for an 18-yard touchdown. Down 16-10, Colts moved into position to take the lead on a drive that had a completion to Chester Rogers for 21 yards, a 13-yard run by Gore, and then a 28-yard penalty on Robert Nelson, which set up the Colts at the five-yard line. On third-and-goal, however, Clowney slammed into Luck for a blind-side strip-sack. That loose ball was recovered by Houston's Whitney Mercilus. Indianapolis was running a poorly designed play at the time, as tight end Dwayne Allen was blocking Clowney one-on-one, and Clowney destroyed Allen. The Texans had a 20-yard pass to Fiedorowicz (3-32) and a 20-yard run from Miller to set up a 41-yard field goal from Novak, taking a 19-10 lead early in the fourth quarter. The Colts struck back as Luck hit T.Y. Hilton for a 35-yard touchdown, who had beatend Robert Nelson to get wide open. Miller had a run of 20 yards and a gain of 16 yards on a screen to give the Texans another field goal as they ran off more than six minutes from the clock. Those three points left Luck needing a touchdown, but having less than three minutes remaining and no timeouts. Indianapolis crossed midfield, but the Texans forced an incompletion on a fourth-and-1 on a horrible called screen pass by the Colts.    Luck completed 24-of-45 passes for 276 yards with two touchdowns and two interceptions. Hilton caught nine passes for 115 yards and a touchdown. Dwayne Allen had three touchdowns against the Jets, but was shut out by Houston.    Gore had 41 yards on only 10 carries.    Miller was the workhorse for Houston, running for 107 yards on 21 carries with a touchdown and 15 yards receiving.    Hopkins caught two passes for 33 yards, but drew some critical pass-interference penalties on point-producing drives.    Osweiler completed 14-of-24 passes for 147 yards and one interception. He had some nice passes, but Houston's red-zone offense was brutal. Fortunately for the Texans, the defense picked them up and Nick Novak was a perfect 5-for-5 on field goals.    The Texans' defense was superb despite missing two of its top-three cornerbacks from injuries. Clowney stepped up with a huge game to produce two turnovers for his team. Benardrick McKinney, Quintin Demps, Andre Hal, A.J. Bouye and Vince Wilfork all contributed big plays. Indianapolis' defense played very well in pass coverage, but the team's front seven was ineffective at stopping the Texans' rushing offense.   ",
      "players": [
        {
          "player_id": "18987",
          "name": "Chester Rogers",
          "position": "WR",
          "height": "6-1",
          "weight": "180",
          "current_team": "Indianapolis Colts",
          "birth_date": "1994-01-12",
          "birth_place": "Huntsville, AL",
          "death_date": "None",
          "college": "Grambling St.",
          "high_school": "Lee, AL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8152",
          "name": "Frank Gore",
          "position": "RB",
          "height": "5-9",
          "weight": "215",
          "current_team": "Indianapolis Colts",
          "birth_date": "1983-05-14",
          "birth_place": "Coral Gables, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Coral Gables, FL",
          "draft_team": "San Francisco 49ers",
          "draft_round": "3",
          "draft_position": "65",
          "draft_year": "2005",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10191",
          "name": "DeAndre Hopkins",
          "position": "WR",
          "height": "6-1",
          "weight": "214",
          "current_team": "Houston Texans",
          "birth_date": "1992-06-06",
          "birth_place": "Central, SC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "D.W. Daniel, SC",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "27",
          "draft_year": "2013",
          "current_salary": "8,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15824",
          "name": "Darryl Morris ",
          "position": "CB",
          "height": "5-10",
          "weight": "188",
          "current_team": "None",
          "birth_date": "1990-09-04",
          "birth_place": "San Antonio, TX",
          "death_date": "None",
          "college": "Texas St.",
          "high_school": "Warren, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9921",
          "name": "T.Y. Hilton",
          "position": "WR",
          "height": "5-10",
          "weight": "183",
          "current_team": "Indianapolis Colts",
          "birth_date": "1989-11-14",
          "birth_place": "Miami Springs, FL",
          "death_date": "None",
          "college": "Florida International",
          "high_school": "Miami Springs, FL",
          "draft_team": "Indianapolis Colts",
          "draft_round": "3",
          "draft_position": "92",
          "draft_year": "2012",
          "current_salary": "8,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22951",
          "name": "Adam Vinatieri",
          "position": "K",
          "height": "6-0",
          "weight": "202",
          "current_team": "Indianapolis Colts",
          "birth_date": "1972-12-28",
          "birth_place": "Yankton, SD",
          "death_date": "None",
          "college": "South Dakota St.",
          "high_school": "Rapid City Central, SD",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4110",
          "name": "Jadeveon Clowney",
          "position": "DE",
          "height": "6-5",
          "weight": "266",
          "current_team": "Houston Texans",
          "birth_date": "1993-02-14",
          "birth_place": "Rock Hill, SC",
          "death_date": "None",
          "college": "South Carolina",
          "high_school": "South Pointe, SC",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "289",
          "name": "Dwayne Allen",
          "position": "TE",
          "height": "6-3",
          "weight": "255",
          "current_team": "New England Patriots",
          "birth_date": "1990-02-24",
          "birth_place": "Fayetteville, NC",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "Terry Sanford, NC",
          "draft_team": "Indianapolis Colts",
          "draft_round": "3",
          "draft_position": "64",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8763",
          "name": "Andre Hal",
          "position": "CB",
          "height": "5-10",
          "weight": "188",
          "current_team": "Houston Texans",
          "birth_date": "1992-05-30",
          "birth_place": "Port Allen, LA",
          "death_date": "None",
          "college": "Vanderbilt",
          "high_school": "Port Allen, LA",
          "draft_team": "Houston Texans",
          "draft_round": "7",
          "draft_position": "216",
          "draft_year": "2014",
          "current_salary": "1,797,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10479",
          "name": "Akeem Hunt",
          "position": "RB",
          "height": "5-9",
          "weight": "184",
          "current_team": "Kansas City Chiefs",
          "birth_date": "1993-02-22",
          "birth_place": "Covington, GA",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Newton, GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14884",
          "name": "Benardrick McKinney",
          "position": "ILB",
          "height": "6-4",
          "weight": "246",
          "current_team": "Houston Texans",
          "birth_date": "1992-11-19",
          "birth_place": "Tunica, MS",
          "death_date": "None",
          "college": "Mississippi St.",
          "high_school": "Rosa Fort, MS",
          "draft_team": "Houston Texans",
          "draft_round": "2",
          "draft_position": "43",
          "draft_year": "2015",
          "current_salary": "920,921",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13674",
          "name": "Andrew Luck ",
          "position": "QB",
          "height": "6-4",
          "weight": "240",
          "current_team": "Indianapolis Colts",
          "birth_date": "1989-09-12",
          "birth_place": "Washington, DC",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Stratford, TX",
          "draft_team": "Indianapolis Colts",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2012",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5478",
          "name": "Quintin Demps",
          "position": "DB",
          "height": "6-0",
          "weight": "203",
          "current_team": "Chicago Bears",
          "birth_date": "1985-06-29",
          "birth_place": "San Antonio, TX",
          "death_date": "None",
          "college": "Texas-El Paso",
          "high_school": "Theodore Roosevelt, TX",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "4",
          "draft_position": "117",
          "draft_year": "2008",
          "current_salary": "2,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "784",
          "name": "Akeem Ayers",
          "position": "LB",
          "height": "6-3",
          "weight": "255",
          "current_team": "New York Giants",
          "birth_date": "1989-07-10",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "UCLA",
          "high_school": "Verbum Dei, CA",
          "draft_team": "Tennessee Titans",
          "draft_round": "2",
          "draft_position": "39",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16563",
          "name": "Nick Novak",
          "position": "K",
          "height": "6-0",
          "weight": "191",
          "current_team": "Los Angeles Chargers",
          "birth_date": "1981-08-21",
          "birth_place": "Charlottesville, VA",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Albermarle, VA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23934",
          "name": "Vince Wilfork",
          "position": "NT-DT",
          "height": "6-2",
          "weight": "325",
          "current_team": "None",
          "birth_date": "1981-11-04",
          "birth_place": "Boynton Beach, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Santaluces, FL",
          "draft_team": "New England Patriots",
          "draft_round": "1",
          "draft_position": "21",
          "draft_year": "2004",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2089",
          "name": "A.J. Bouye",
          "position": "CB",
          "height": "6-0",
          "weight": "186",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1991-08-16",
          "birth_place": "Tucker, GA",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Tucker, GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15124",
          "name": "Whitney Mercilus",
          "position": "DE",
          "height": "6-3",
          "weight": "261",
          "current_team": "Houston Texans",
          "birth_date": "1990-07-21",
          "birth_place": "Akron, OH",
          "death_date": "None",
          "college": "Illinois",
          "high_school": "Garfield, OH",
          "draft_team": "Houston Texans",
          "draft_round": "1",
          "draft_position": "26",
          "draft_year": "2012",
          "current_salary": "4,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16290",
          "name": "Robert Nelson",
          "position": "FS",
          "height": "5-10",
          "weight": "175",
          "current_team": "New York Jets",
          "birth_date": "1990-02-16",
          "birth_place": "Lakeland, FL",
          "death_date": "None",
          "college": "Arizona St.",
          "high_school": "North Gwinnett, GA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15340",
          "name": "Lamar Miller",
          "position": "RB",
          "height": "5-11",
          "weight": "215",
          "current_team": "Houston Texans",
          "birth_date": "1991-04-25",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Killian, FL",
          "draft_team": "Miami Dolphins",
          "draft_round": "4",
          "draft_position": "97",
          "draft_year": "2012",
          "current_salary": "5,500,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Redskins",
        "Points": "27"
      },
      "Team 2": {
        "Name": "Eagles",
        "Points": "22"
      },
      "comments": " <i> EDITOR'S NOTE: <\/i> The Eagles lost their long-snapper and backup long-snapper in this game. As a result, they were having tryouts for long-snappers on the sideline. I've never seen anything like it. The Eagles may not be going to the playoffs, but they're at least entertaining.    All of the momentum was with the Eagles during the final drive of this contest. Every time that the Redskins had a chance to put the game away, they could not do it. It seemed like Carson Wentz was destined to lead a comeback that would essentially knock the Redskins out of the playoff picture. Ryan Kerrigan had other ideas. The Redskin rush linebacker came screaming off of the edge with 20 seconds left to get a hit on Wentz, which knocked the ball loose. The Redskins recovered the fumble. That would be how the game ended. Needless to say, this was a huge win for the Redskins. They needed it to keep pace in the NFC playoff race, and they got just that. Part of the reason they were able to make it was the terrific play of their offense.    Kirk Cousins has been one of the best quarterbacks in the NFL during the 2016 season, and that continued on Sunday. He was guilty of a pretty bad mistake on a brutal pick-six though. He underthrew DeSean Jackson on the play, allowing Leodis McKelvin to catch it for a walk-in touchdown. Aside from that, Cousins played well. On the day, Cousins went 14-of-21 for 234 yards, two touchdowns and the aforementioned pick. The touchdowns were both great throws. The first came on a deep ball to Jackson. Cousins launched the ball in the air to the veteran speedster, who came down with it. The ball was slightly underthrown, but Cousins knew Jackson had McKelvin beaten on the play anyway. The second touchdown went to Pierre Garcon on a fade route. Cousins put that one right on the money, and it was probably his best throw of the day. Overall, this was another performance that will help make Cousins some money when he signs a long-term deal in the offseason.    Cousins' leading receiver was Jackson (3-102, 1 TD). Cousins only threw to Jackson on those three occasions, and the veteran was able to make some big-time plays. He still has excellent game-breaking speed. He can be trusted as a high-upside WR2 in the fantasy playoffs. There is always a chance Jackson could disappear though in a touch matchup. Elsewhere, Garcon (5-59, 1 TD) led Washington in targets with six, and once again, he was able to work well in the intermediate game. I could consider him to be Cousins' No. 1 option moving forward, as the veteran has developed a strong rapport with the franchise quarterback this season.    Jamison Crowder (2-37) and Jordan Reed (1-10) were both disappointments on Sunday. Crowder will bounce back, but Reed seemed to be in more of a decoy role. Until we know more about how healthy his shoulder is, it is hard to trust him in fantasy.    On the ground, Robert Kelley once again led the way for the team in carries and yardage. Kelley got 16 carries and turned them into 63 yards. He had a great 22-yard touchdown run on which he was able to run over three tacklers to get the team's first score. Kelley's physicality makes him an ideal fit for Jay Gruden's offense, so he will continue to get a majority of the carries. Chris Thompson also performed well. He saw just three carries, but turned them into 38 yards and a touchdown. The touchdown came on a pitch play where he got into space and ran into the end zone. The Redskins should mix him in more, as he can be a weapon in certain circumstances.    For the Eagles, this loss was actually a great performance from them. On offense, Wentz and the young unit showed a lot of promise. They will definitely be a competitive team in 2017. Wentz put together a terrific performance in his second game against the Redskins. The rookie went 32-of-46 for 314 yards, a touchdown and an interception. He was every bit as good as those numbers indicate, and he could have been even better. Right out of the gate, Wentz was showing pinpoint accuracy. On the Eagles' first drive, he was hitting all of his receivers and showed a strong connection with tight end Zach Ertz (10-112). Wentz was able to pick apart the Redskins' porous secondary. He threw a nice deep ball to Nelson Agholor, at one point, that would have gone for a touchdown if it was not for a blatant pass interference by Quinton Dunbar. The only big mistake that Wentz made was a pick in the end zone. In the first half, the Eagles were driving and had all the momentum against the Redskins. They were facing a third-and-goal when Wentz threw a ball over the middle. Safety Deshazor Everett managed to get in front of the receiver and picked it off. It was not a bad throw from Wentz, but he has to show better decision-making as he continues to develop.    Wentz was able to do a lot despite having only one proven receiver. Ertz led the way in targets (13), catches (10) and yards (112) during the game. He could end up being a big fantasy performer down the stretch, though the Redskins have been notoriously bad against tight ends this year.    Jordan Matthews (8-79) put together a strong performance, and he is the No. 1 receiver on the Eagles right now. He can be used as a WR3 unless he has a tough matchup. Nelson Agholor (2-22) looked better today as he used his speed to beat Washington's corners. He just did not see a lot of targets. Tight end Trey Burton (7-65) looked like another good intermediate weapon, while Darren Sproles caught the only touchdown for Wentz.    The Eagles were happy to welcome back Ryan Mathews to their back-by-committee system today. Mathews saw 15 carries for 60 yards, but was mostly bottled up in the second half. Mathews is only a mediocre runner, and he is not a recommended start in most fantasy formats. If you are desperate, use him as a FLEX. Normally, I would prefer Darren Sproles, who saw five carries for 27 yards and caught a touchdown, but he got knocked out in the second half by a pretty dirty Deshazor Everett hit. Sproles was getting ready to return a punt when Everett put a massive blow on him. He got there a split second before the ball and gave Sproles a knock to the head.    There was actually some long snapper drama in this game for the Eagles. Their long snapper, Jon Dorenbos, who had played in 162 consecutive contests, left with a wrist injury. This forced tight end Brent Celek to operate as the long snapper for a field goal. Celek had a poor snap on what was a missed field goal, and then was injured on a punt. After that, another tight end, Trey Burton, played the position. He executed on the one field goal he snapped for. It was a pretty interesting storyline from what was an exciting NFC East battle.    Final Note: The Redskins may have lost two of their top middle linebackers this week. Su'a Cravens left early with a biceps injury, and early indications seem that he may have torn the muscle. Will Compton also left the game with a knee injury. He is due to get an MRI. If both are out, the Redskins will be really weak in the middle of their defense and could surrender a lot of points to close out the season.   ",
      "players": [
        {
          "player_id": "14862",
          "name": "Leodis McKelvin",
          "position": "DB",
          "height": "5-11",
          "weight": "190",
          "current_team": "None",
          "birth_date": "1985-09-01",
          "birth_place": "Waycross, GA",
          "death_date": "None",
          "college": "Troy",
          "high_school": "Ware Co., GA",
          "draft_team": "Buffalo Bills",
          "draft_round": "1",
          "draft_position": "11",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18350",
          "name": "Jordan Reed",
          "position": "TE",
          "height": "6-3",
          "weight": "236",
          "current_team": "Washington Redskins",
          "birth_date": "1990-07-03",
          "birth_place": "New London, CT",
          "death_date": "None",
          "college": "Florida",
          "high_school": "New London, CT",
          "draft_team": "Washington Redskins",
          "draft_round": "3",
          "draft_position": "85",
          "draft_year": "2013",
          "current_salary": "3,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "137",
          "name": "Nelson Agholor",
          "position": "WR",
          "height": "6-1",
          "weight": "190",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1993-05-24",
          "birth_place": "Lagos, Nigeria",
          "death_date": "None",
          "college": "USC",
          "high_school": "Berkeley Prep, FL",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "1",
          "draft_position": "20",
          "draft_year": "2015",
          "current_salary": "1,287,489",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21034",
          "name": "Darren Sproles",
          "position": "RB",
          "height": "5-6",
          "weight": "181",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1983-06-20",
          "birth_place": "Waterloo, IA",
          "death_date": "None",
          "college": "Kansas St.",
          "high_school": "Olathe North, KS",
          "draft_team": "San Diego Chargers",
          "draft_round": "4",
          "draft_position": "130",
          "draft_year": "2005",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3101",
          "name": "Trey Burton",
          "position": "TE",
          "height": "6-3",
          "weight": "228",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1991-10-29",
          "birth_place": "Venice, FL",
          "death_date": "None",
          "college": "Florida",
          "high_school": "Venice, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23623",
          "name": "Carson Wentz ",
          "position": "QB",
          "height": "6-5",
          "weight": "237",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1992-12-30",
          "birth_place": "Bismarck, ND",
          "death_date": "None",
          "college": "North Dakota St.",
          "high_school": "Bismarck Century, ND",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "1",
          "draft_position": "2",
          "draft_year": "2016",
          "current_salary": "1,662,561",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6610",
          "name": "Deshazor Everett",
          "position": "CB",
          "height": "6-0",
          "weight": "193",
          "current_team": "Washington Redskins",
          "birth_date": "1992-02-22",
          "birth_place": "DeRidder, LA",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "DeRidder, LA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4727",
          "name": "Su'a Cravens",
          "position": "OLB",
          "height": "6-1",
          "weight": "226",
          "current_team": "Washington Redskins",
          "birth_date": "1995-07-07",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "USC",
          "high_school": "Vista Murrieta, CA",
          "draft_team": "Washington Redskins",
          "draft_round": "2",
          "draft_position": "53",
          "draft_year": "2016",
          "current_salary": "651,408",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14267",
          "name": "Ryan Mathews",
          "position": "RB",
          "height": "6-0",
          "weight": "220",
          "current_team": "None",
          "birth_date": "1987-10-10",
          "birth_place": "Bakersfield, CA",
          "death_date": "None",
          "college": "Fresno St.",
          "high_school": "West, CA",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "12",
          "draft_year": "2010",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22162",
          "name": "Chris Thompson",
          "position": "RB",
          "height": "5-8",
          "weight": "195",
          "current_team": "Washington Redskins",
          "birth_date": "1990-10-20",
          "birth_place": "Greenville, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Madison County, FL",
          "draft_team": "Washington Redskins",
          "draft_round": "5",
          "draft_position": "154",
          "draft_year": "2013",
          "current_salary": "382,942",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7598",
          "name": "Pierre Garcon",
          "position": "WR",
          "height": "6-0",
          "weight": "210",
          "current_team": "San Francisco 49ers",
          "birth_date": "1986-08-08",
          "birth_place": "Carmel, NY",
          "death_date": "None",
          "college": "Mount Union",
          "high_school": "John I. Leonard, FL",
          "draft_team": "Indianapolis Colts",
          "draft_round": "6",
          "draft_position": "205",
          "draft_year": "2008",
          "current_salary": "3,675,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12046",
          "name": "Robert Kelley ",
          "position": "RB",
          "height": "6-0",
          "weight": "228",
          "current_team": "Washington Redskins",
          "birth_date": "1992-10-03",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Tulane",
          "high_school": "O. Perry Walker, LA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14311",
          "name": "Jordan Matthews",
          "position": "WR",
          "height": "6-3",
          "weight": "212",
          "current_team": "Buffalo Bills",
          "birth_date": "1992-07-16",
          "birth_place": "Madison, AL",
          "death_date": "None",
          "college": "Vanderbilt",
          "high_school": "Madison Academy, AL",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "42",
          "draft_year": "2014",
          "current_salary": "1,094,900",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10756",
          "name": "DeSean Jackson",
          "position": "WR",
          "height": "5-10",
          "weight": "178",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1986-12-01",
          "birth_place": "Long Beach, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Long Beach Polytechnic, CA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "49",
          "draft_year": "2008",
          "current_salary": "6,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6520",
          "name": "Zach Ertz",
          "position": "TE",
          "height": "6-5",
          "weight": "249",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1990-11-10",
          "birth_place": "Orange, CA",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Monte Vista, CA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2013",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5816",
          "name": "Jon Dorenbos",
          "position": "C",
          "height": "6-0",
          "weight": "250",
          "current_team": "New Orleans Saints",
          "birth_date": "1980-07-21",
          "birth_place": "Humble, TX",
          "death_date": "None",
          "college": "Texas-El Paso",
          "high_school": "Pacifica, CA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12163",
          "name": "Ryan Kerrigan",
          "position": "DE",
          "height": "6-3",
          "weight": "255",
          "current_team": "Washington Redskins",
          "birth_date": "1988-08-16",
          "birth_place": "Muncie, IN",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Muncie Central, IN",
          "draft_team": "Washington Redskins",
          "draft_round": "1",
          "draft_position": "16",
          "draft_year": "2011",
          "current_salary": "8,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4644",
          "name": "Kirk Cousins",
          "position": "QB",
          "height": "6-3",
          "weight": "214",
          "current_team": "Washington Redskins",
          "birth_date": "1988-08-19",
          "birth_place": "Holland, MI",
          "death_date": "None",
          "college": "Michigan St.",
          "high_school": "Holland Christian, MI",
          "draft_team": "Washington Redskins",
          "draft_round": "4",
          "draft_position": "102",
          "draft_year": "2012",
          "current_salary": "23,943,600",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3705",
          "name": "Brent Celek",
          "position": "TE",
          "height": "6-4",
          "weight": "261",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1985-01-25",
          "birth_place": "Cincinnati, OH",
          "death_date": "None",
          "college": "Cincinnati",
          "high_school": "La Salle, OH",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "5",
          "draft_position": "162",
          "draft_year": "2007",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4853",
          "name": "Jamison Crowder",
          "position": "WR",
          "height": "5-8",
          "weight": "174",
          "current_team": "Washington Redskins",
          "birth_date": "1993-06-17",
          "birth_place": "Monroe, NC",
          "death_date": "None",
          "college": "Duke",
          "high_school": "Monroe, NC",
          "draft_team": "Washington Redskins",
          "draft_round": "4",
          "draft_position": "105",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6064",
          "name": "Quinton Dunbar",
          "position": "WR",
          "height": "6-2",
          "weight": "201",
          "current_team": "Washington Redskins",
          "birth_date": "1992-07-22",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Florida",
          "high_school": "Booker T. Washington, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Steelers",
        "Points": "27"
      },
      "Team 2": {
        "Name": "Bills",
        "Points": "20"
      },
      "comments": " <i> EDITOR'S NOTE: <\/i> It'd be great if teams could warn me that their stud players might be out prior to me locking in my picks. That would be awesome, you know? Kyle Williams' absence completely ruined any chance the Bills had of stopping the run in conditions where throwing the ball would be very difficult.    On a snowy Sunday in Buffalo, Le'Veon Bell tore up New Era Field, both literally and figuratively, as the Pittsburgh Steelers cruised to a 27-20 victory over the Bills. Bell outgained the whole home team, 298 to 275 yards. Ben Roethlisberger was not his best on the road and in the snow, giving the Bills the ball on three interceptions, but the Steelers' defense and, of course, Bell were able to take care of the win despite Roethlisberger's miscues. It's tough to discuss this game in terms other than Le'Veon Bell's dominance, so let's just take a quick look at the stats. First off, the Bills came into this game allowing just 3.8 yards per carry and 115.5 total yards per game to opposing running backs, ranking them sixth and eighth in those categories - well, until today. Bell rushed a whopping 38 times for a Steelers record 236 yards, for a healthy 6.21 yards per carry and three rushing touchdowns. Besides being a Steelers record, the rushing yards were a record for the Bills as well, who had never allowed such a number. Bell also tacked 62 more yards through the air as he caught 4-of-5 targets. And besides the astronomical numbers, Bell put on a show with his legs. As always, he showed the patience of a Zen master before exploding like a jackrabbit out of a paper bag. Many times you knew he would be devoured inside a mass of defenders before escaping.    The Bills managed to make the score look presentable with garbage-time points, but this game appeared to be a mismatch most of the way. After two drives, Tyrod Taylor had been sacked three times and gained no yardage. By the time the first quarter was up, the Steelers had outgained Buffalo by 150 total yards. The Bills' receiving leader was LeSean McCoy, who caught 6-of-7 targets for 81 yards, mostly in garbage time, whereas he couldn't get the ball moving on the ground, rushing 12 times for just 27 yards, but did add a late touchdown run.    Sammy Watkins caught 4-of-6 targets for 54 yards, including a second-quarter touchdown. He isn't blowing up after returning from his foot injury, but he is playing solid enough to be useful in fantasy football, which is all the Bills' fans can really hope for now that the team has all but been mathematically eliminated from the playoffs.    The Steelers kept pace with the Ravens, who will face a tough Patriots team in Foxborough Monday night. If the Ravens win, they'll stay a step ahead of the Steelers as they beat them head-to-head this season, but if they lose, the Steelers will regain first place in the AFC North.    This game was delayed for 10 minutes after halftime due to an excess of rubber pellets that had been moved toward the sidelines as the grounds crew removed snow. It was kinda gross.   ",
      "players": [
        {
          "player_id": "24155",
          "name": "Kyle Williams",
          "position": "DT",
          "height": "6-1",
          "weight": "300",
          "current_team": "Buffalo Bills",
          "birth_date": "1983-06-10",
          "birth_place": "Ruston, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Ruston, LA",
          "draft_team": "Buffalo Bills",
          "draft_round": "5",
          "draft_position": "134",
          "draft_year": "2006",
          "current_salary": "6,300,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18977",
          "name": "Ben Roethlisberger",
          "position": "QB",
          "height": "6-5",
          "weight": "240",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1982-03-02",
          "birth_place": "Lima, OH",
          "death_date": "None",
          "college": "Miami (OH)",
          "high_school": "Findlay, OH",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "1",
          "draft_position": "11",
          "draft_year": "2004",
          "current_salary": "12,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23393",
          "name": "Sammy Watkins",
          "position": "WR",
          "height": "6-1",
          "weight": "211",
          "current_team": "Los Angeles Rams",
          "birth_date": "1993-06-14",
          "birth_place": "Fort Myers, FL",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "South Fort Myers, FL",
          "draft_team": "Buffalo Bills",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21908",
          "name": "Tyrod Taylor",
          "position": "QB",
          "height": "6-0",
          "weight": "221",
          "current_team": "Buffalo Bills",
          "birth_date": "1989-08-03",
          "birth_place": "Hampton, VA",
          "death_date": "None",
          "college": "Virginia Tech",
          "high_school": "Hampton, VA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "6",
          "draft_position": "180",
          "draft_year": "2011",
          "current_salary": "7,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14591",
          "name": "LeSean McCoy",
          "position": "RB",
          "height": "5-10",
          "weight": "215",
          "current_team": "Buffalo Bills",
          "birth_date": "1988-07-12",
          "birth_place": "Harrisburg, PA",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Bishop McDevitt, PA",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "2",
          "draft_position": "53",
          "draft_year": "2009",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1465",
          "name": "Le'Veon Bell",
          "position": "RB",
          "height": "6-2",
          "weight": "230",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1992-02-18",
          "birth_place": "Reynoldsburg, OH",
          "death_date": "None",
          "college": "Michigan St.",
          "high_school": "Groveport Madison, OH",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "2",
          "draft_position": "48",
          "draft_year": "2013",
          "current_salary": "12,120,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Falcons",
        "Points": "42"
      },
      "Team 2": {
        "Name": "Rams",
        "Points": "14"
      },
      "comments": " <i> EDITOR'S NOTE: <\/i> I don't do my re-mock drafts until five years after the draft in question takes place, but if I were to do a re-mock of the 2016 NFL Draft, Jared Goff would not be in the first round. Goff is that horrible. It's crazy that prominent members of the Rams' organization wanted to take Carson Wentz, and yet they selected Goff instead. Goff doesn't look like he belongs in the NFL.    The Falcons were without Julio Jones, but it didn't matter as they dominated Los Angeles. Through three quarters, Atlanta was up 42-0, as the Rams' offense was horrible at not turning the ball over and the defense was incapable of stopping Matt Ryan. Atlanta maintained its positioning with Tampa Bay for the NFC South, while Los Angeles will have to win its final three in order to maintain Jeff Fisher's 7-9 standard. After losing their ninth game of the season, this marks the 10th straight year that the Rams will be under .500.    The blowout started on the opening kickoff, as the Rams muffed the catch and the ball rolled around before Paul Worrilow recovered it for the Falcons at the Rams' 3-yard line. The next play saw Ryan hit a back-shoulder throw to Justin Hardy for a touchdown. Atlanta then put another touchdown on the board as Ryan used five different weapons with completions to Aldrick Robinson (3-42), Levine Toiliolo (1-19) and a six-yard touchdown pass to Tevin Coleman. The Falcons added to their lead when Los Angeles quarterback Jared Goff demonstrated poor field vision, throwing a pass right to Deion Jones for an interception. Goff stared down his primary read on the play, and Jones undercut the route to return the pick 33 yards for a touchdown. It was Goff's second interception of the half, but the first one was not his fault as it came on a deflected pass that Kenny Britt (7-82) dropped. Atlanta was up 21-0 by halftime, while Goff was only 8-for-18 for 75 yards and two interceptions. Early in the third quarter, Ryan found Taylor Gabriel wide open downfield in busted coverage for a 64-yard touchdown. The Falcons' Courtney Upshaw soon stripped Malcolm Brown (4-14) of the football and recovered the loose ball. Coleman had a 6-yard touchdown run a few plays later. On the Rams' next possession, Goff held onto the ball too long before getting strip-sacked by Vic Beasley after he burned Rob Havenstein. Beasley scooped up the ball and ran it 21 yards for a touchdown. That put the Falcons up 42-0 late in the third quarter. In garbage time, the Rams moved the ball versus Atlanta's backups, and on the first play of the fourth quarter, Todd Gurley plunged into the end zone. Matt Schaub took over at quarterback for Ryan in the fourth quarter. Goff laid out a 50-yard touchdown pass to Brian Quick, but that was called back by a very questionable pass interference. Still, it was a nice throw from the rookie signal-caller. Goff ended up having a short touchdown run with under three minutes remaining.    Ryan finished the game having completed 18-of-28 for 237 yards with three touchdowns with just three quarters of action. Gabriel led the Falcons in receiving with three receptions for 82 yards and a touchdown.    Coleman ran for 36 yards on eight carries for a touchdown on the ground with two receptions for 19 yards and a score through the air. Devonta Freeman (6-6 rushing, 2-12 receiving) was held in check.    Goff ended up 24-of-41 for 235 yards, two interceptions and a rushing touchdown. He made some nice passes, but had a lot of problems with holding onto the ball too long as he took some terrible sacks. His offensive line struggled as well, especially Havenstein. Goff needs to make the process much faster and work off his primary read. The rest of the 2016 season will be all about Goff learning, but he been very unimpressive thus far.    Gurley compiled 61 yards on 16 carries and a touchdown. Tavon Austin had some nice plays with seven receptions for 62 yards and two carries for 27 yards.    Vic Beasley absolutely dominated Los Angeles' offensive line with three sacks. Keanu Neal had an impressive game as well. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "2425",
          "name": "Kenny Britt",
          "position": "WR",
          "height": "6-3",
          "weight": "215",
          "current_team": "Cleveland Browns",
          "birth_date": "1988-09-19",
          "birth_place": "Bayonne, NJ",
          "death_date": "None",
          "college": "Rutgers",
          "high_school": "Bayonne, NJ",
          "draft_team": "Tennessee Titans",
          "draft_round": "1",
          "draft_position": "30",
          "draft_year": "2009",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19618",
          "name": "Matt Schaub",
          "position": "QB",
          "height": "6-5",
          "weight": "235",
          "current_team": "Atlanta Falcons",
          "birth_date": "1981-06-25",
          "birth_place": "West Chester, PA",
          "death_date": "None",
          "college": "Virginia",
          "high_school": "East, PA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "3",
          "draft_position": "90",
          "draft_year": "2004",
          "current_salary": "2,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "19319",
          "name": "Matt Ryan",
          "position": "QB",
          "height": "6-4",
          "weight": "217",
          "current_team": "Atlanta Falcons",
          "birth_date": "1985-05-17",
          "birth_place": "Exton, PA",
          "death_date": "None",
          "college": "Boston Col.",
          "high_school": "William Penn Charter School, PA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "3",
          "draft_year": "2008",
          "current_salary": "15,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1348",
          "name": "Vic Beasley",
          "position": "OLB",
          "height": "6-2",
          "weight": "235",
          "current_team": "Atlanta Falcons",
          "birth_date": "1992-07-08",
          "birth_place": "Adairsville, GA",
          "death_date": "None",
          "college": "Clemson",
          "high_school": "Adairsville, GA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2677",
          "name": "Malcolm Brown ",
          "position": "RB",
          "height": "5-11",
          "weight": "224",
          "current_team": "Los Angeles Rams",
          "birth_date": "1993-05-15",
          "birth_place": "Biloxi, MS",
          "death_date": "None",
          "college": "Texas",
          "high_school": "Steele, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18080",
          "name": "Brian Quick",
          "position": "WR",
          "height": "6-4",
          "weight": "209",
          "current_team": "Washington Redskins",
          "birth_date": "1989-06-05",
          "birth_place": "Columbia, SC",
          "death_date": "None",
          "college": "Appalachian St.",
          "high_school": "Ridge View, SC",
          "draft_team": "St. Louis Rams",
          "draft_round": "2",
          "draft_position": "33",
          "draft_year": "2012",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11556",
          "name": "Deion Jones",
          "position": "OLB",
          "height": "6-1",
          "weight": "222",
          "current_team": "Atlanta Falcons",
          "birth_date": "1994-11-04",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Jesuit, LA",
          "draft_team": "Atlanta Falcons",
          "draft_round": "2",
          "draft_position": "52",
          "draft_year": "2016",
          "current_salary": "656,620",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11634",
          "name": "Julio Jones",
          "position": "WR",
          "height": "6-4",
          "weight": "220",
          "current_team": "Atlanta Falcons",
          "birth_date": "1989-02-03",
          "birth_place": "Foley, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Foley, AL",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "6",
          "draft_year": "2011",
          "current_salary": "11,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9041",
          "name": "Justin Hardy ",
          "position": "WR",
          "height": "5-11",
          "weight": "190",
          "current_team": "Atlanta Falcons",
          "birth_date": "1991-12-18",
          "birth_place": "Washington, DC",
          "death_date": "None",
          "college": "East Carolina",
          "high_school": "West Craven, NC",
          "draft_team": "Atlanta Falcons",
          "draft_round": "4",
          "draft_position": "107",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7342",
          "name": "Devonta Freeman ",
          "position": "RB",
          "height": "5-8",
          "weight": "206",
          "current_team": "Atlanta Falcons",
          "birth_date": "1992-03-15",
          "birth_place": "Miami, FL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Miami Central, FL",
          "draft_team": "Atlanta Falcons",
          "draft_round": "4",
          "draft_position": "103",
          "draft_year": "2014",
          "current_salary": "1,297,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8657",
          "name": "Todd Gurley",
          "position": "RB",
          "height": "6-1",
          "weight": "226",
          "current_team": "Los Angeles Rams",
          "birth_date": "1994-08-03",
          "birth_place": "Baltimore, MD",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Tarboro, NC",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "10",
          "draft_year": "2015",
          "current_salary": "1,691,653",
          "hof_induction_year": "None"
        },
        {
          "player_id": "756",
          "name": "Tavon Austin",
          "position": "WR",
          "height": "5-9",
          "weight": "174",
          "current_team": "Los Angeles Rams",
          "birth_date": "1991-03-15",
          "birth_place": "Baltimore, MD",
          "death_date": "None",
          "college": "West Virginia",
          "high_school": "Paul Laurence Dunbar, MD",
          "draft_team": "St. Louis Rams",
          "draft_round": "1",
          "draft_position": "8",
          "draft_year": "2013",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7480",
          "name": "Taylor Gabriel",
          "position": "WR",
          "height": "5-8",
          "weight": "167",
          "current_team": "Atlanta Falcons",
          "birth_date": "1991-02-17",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Abilene Christian",
          "high_school": "John Horn, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,746,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16215",
          "name": "Keanu Neal",
          "position": "FS",
          "height": "6-0",
          "weight": "211",
          "current_team": "Atlanta Falcons",
          "birth_date": "1995-07-26",
          "birth_place": "Webster, FL",
          "death_date": "None",
          "college": "Florida",
          "high_school": "South Sumter, FL",
          "draft_team": "Atlanta Falcons",
          "draft_round": "1",
          "draft_position": "17",
          "draft_year": "2016",
          "current_salary": "938,075",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9378",
          "name": "Rob Havenstein",
          "position": "OT",
          "height": "6-7",
          "weight": "321",
          "current_team": "Los Angeles Rams",
          "birth_date": "1992-05-12",
          "birth_place": "Mount Airy, MD",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Linganore, MD",
          "draft_team": "St. Louis Rams",
          "draft_round": "2",
          "draft_position": "57",
          "draft_year": "2015",
          "current_salary": "795,911",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22757",
          "name": "Courtney Upshaw",
          "position": "OLB",
          "height": "6-2",
          "weight": "273",
          "current_team": "Atlanta Falcons",
          "birth_date": "1989-12-13",
          "birth_place": "Eufala, AL",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Eufaula, AL",
          "draft_team": "Baltimore Ravens",
          "draft_round": "2",
          "draft_position": "35",
          "draft_year": "2012",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4263",
          "name": "Tevin Coleman",
          "position": "RB",
          "height": "6-0",
          "weight": "210",
          "current_team": "Atlanta Falcons",
          "birth_date": "1993-04-16",
          "birth_place": "Triley Park, IL",
          "death_date": "None",
          "college": "Indiana",
          "high_school": "Oak Forest, IL",
          "draft_team": "Atlanta Falcons",
          "draft_round": "3",
          "draft_position": "73",
          "draft_year": "2015",
          "current_salary": "680,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24691",
          "name": "Paul Worrilow ",
          "position": "LB",
          "height": "6-1",
          "weight": "232",
          "current_team": "Detroit Lions",
          "birth_date": "1990-05-01",
          "birth_place": "Wilmington, DE",
          "death_date": "None",
          "college": "Delaware",
          "high_school": "Concord, DE",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8015",
          "name": "Jared Goff",
          "position": "QB",
          "height": "6-4",
          "weight": "210",
          "current_team": "Los Angeles Rams",
          "birth_date": "1994-10-14",
          "birth_place": "Novato, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Marin Catholic, CA",
          "draft_team": "Los Angeles Rams",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2016",
          "current_salary": "1,719,894",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18832",
          "name": "Aldrick Robinson",
          "position": "WR",
          "height": "5-10",
          "weight": "184",
          "current_team": "San Francisco 49ers",
          "birth_date": "1988-09-24",
          "birth_place": "Waxahachie, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Waxahachie, TX",
          "draft_team": "Washington Redskins",
          "draft_round": "6",
          "draft_position": "178",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Buccaneers",
        "Points": "16"
      },
      "Team 2": {
        "Name": "Saints",
        "Points": "11"
      },
      "comments": " <i> EDITOR'S NOTE: <\/i> It was a rough day for the officials all around. I mentioned earlier instances. In this game, the official announced, false start, on the defense. Yeah. And speaking of rough afternoons, Brandin Cooks dropped a touchdown and then had alligator arms during a long pass in the fourth quarter. He whined earlier that he wasn't getting enough touches, and it's easy to see why that was he case. Cooks completely dogged it in this game.    Many expected this game to be an offensive shootout. Instead, it turned into a defensive battle with some mediocre quarterback play. Both defenses were better than expected, and the teams have to be happy with how each stop unit played. However, there is some serious cause for concern for both teams, and especially for the future of the New Orleans offense. From watching this game, you would think that Drew Brees was the second-year quarterback and Jameis Winston was the long-term pro. Brees had a pretty rough outing, going 25-for-41 with 257 yards and a whopping three interceptions. He struggled with accuracy throughout the whole day. He missed numerous big plays, but none were more important than a couple of deep passes for Brandin Cooks. In the second quarter, Cooks had his man beaten for what would have been a touchdown. Brees saw Cooks streaking over the middle of the field and lofted a pass toward the end zone. Brees put it a step in front of Cooks, however, and the speedy receiver could not get to it in time. It was a throw that Brees definitely should have made, and it was indicative of the larger problems he had during the day. Moving forward, Brees has to improve his accuracy. He simply has not looked good this season, and maybe he is just on the decline. The turnovers and missed opportunities really played a major part in the loss.    Despite Brees' accuracy issues, New Orleans' receiving corps was able to have some success. Three receivers saw eight or more targets. They were Cooks (5-61), Willie Snead (6-85) and Brandon Coleman (5-47). Cooks saw the most targets with 10, but as mentioned earlier, Brees had some issues connecting with him. Cooks was overthrown on one potential touchdown throw and then dropped another one later in the contest. Cooks is still a low-end WR1 in fantasy, but if Brees cannot get better, Cooks' upside will be limited. Snead was probably the most impressive Saints receiver on the day. He worked over the middle of the field and had a lot of success doing so. He is becoming one of the better slot men in the league, and is a worthy WR3/FLEX in most matchups. Meanwhile, Coleman only saw significant action because rookie Michael Thomas missed the game with a foot injury. Most weeks, Coleman is just a red-zone threat, at the best.    On the ground, the Saints were a major disappointment. Mark Ingram suited up despite concerns over a toe injury, but he was not productive at all. He got seven carries, yet only managed 14 yards. Backup Tim Hightower was much better than Ingram. Hightower saw six carries and turned them into 31 yards. He looked strong bursting through the line, and he definitely outplayed Ingram. Hightower should have a chance to be the starter moving forward.    Defensively, the Saints actually put together a strong performance. Rookie safety Vonn Bell looked good and so did Cameron Jordan. The team needs to add more talent at the corner position, but the Saints have some young talent they can build around.    For the Buccaneers, this win was huge. The Redskins had won earlier in the day, so the Buccaneers had to win to keep control of their own destiny. They were able to do just that, and Jameis Winston really helped his team to do so. Winston did not put together a great stat line, as he went 16-of-26 for 184 yards, but he really did a lot more for his team than the stats suggest. Winston put all of his throws right on the money for his receivers. He threw the balls nicely and put just the right amount of speed on them. He also was able to throw a couple of nice touch passes and simply demonstrated a great knowledge of how to toss a ball. That said, Winston still made some mistakes. Notably, he missed Russell Shepard in the end zone for a throw that could have been a touchdown. Winston threw the ball a split second too late and was almost picked by Sterling Moore. As Winston continues to improve, he will likely get a better sense of timing, especially in the red zone.    In terms of receiving, Mike Evans was the preferred option for the Buccaneers. He was targeted eight times, but he caught only four passes for 42 yards. Tight end Cameron Brate actually outproduced Evans, notching 47 yards on four catches. The two are probably the top receiving options for the team right now. Evans is a WR1 most weeks, while Brate can be played as a TE1 when the matchup is right. Otherwise, he is a quality depth guy.    Charles Sims (3-33) returned from injured reserve and was a factor in the passing game as well. If he is available for the last few weeks of fantasy, pick him up. He has high upside and could play a big role as a receiver moving forward. No other receiver really stood out for the Buccaneers. On the ground, Doug Martin received a lion's share of the load. He got 23 carries for 66 yards and a touchdown. Martin has not looked great this season, and once again, he appeared to be a little bit slow. Martin can definitely get the job done in short-yardage situations, but the team should look to mix Sims in a bit more. Sims only saw four carries on Sunday, but he turned them into 17 yards. Though the numbers have not been great, the running back group for the Buccaneers appears to be a solid one.    Defensively, Keith Tandy stood out at the safety position. Starting in place of the injured Chris Conte, Tandy was strong in coverage and showed some great instincts. He broke up a few passes, and based off of this performance, he should be the starter moving forward.    Final Note: A strange play occurred in this game off of a kickoff. Will Lutz sent a bouncing kick down the field toward Josh Huff, the return man. Huff tried to field the ball on a bounce, but it hit his helmet and went out inside the 1-yard line. The Buccaneers had to start from there as a result, and they surrendered a safety because of that.   ",
      "players": [
        {
          "player_id": "1484",
          "name": "Vonn Bell",
          "position": "SS",
          "height": "5-11",
          "weight": "199",
          "current_team": "New Orleans Saints",
          "birth_date": "1994-12-12",
          "birth_place": "Chattanooga, TN",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Ridgeland, GA",
          "draft_team": "New Orleans Saints",
          "draft_round": "2",
          "draft_position": "61",
          "draft_year": "2016",
          "current_salary": "630,559",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4227",
          "name": "Brandon Coleman",
          "position": "WR",
          "height": "6-6",
          "weight": "225",
          "current_team": "New Orleans Saints",
          "birth_date": "1992-06-22",
          "birth_place": "Accokeek, MD",
          "death_date": "None",
          "college": "Rutgers",
          "high_school": "Bishop McNamara, MD",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20837",
          "name": "Willie Snead ",
          "position": "WR",
          "height": "5-11",
          "weight": "195",
          "current_team": "New Orleans Saints",
          "birth_date": "1992-10-17",
          "birth_place": "Winter Park, FL",
          "death_date": "None",
          "college": "Ball St.",
          "high_school": "Muskegon Heights, MI",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2288",
          "name": "Cameron Brate",
          "position": "TE",
          "height": "6-5",
          "weight": "235",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1991-07-03",
          "birth_place": "Naperville, IL",
          "death_date": "None",
          "college": "Harvard",
          "high_school": "Naperville Central, IL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10635",
          "name": "Mark Ingram",
          "position": "RB",
          "height": "5-10",
          "weight": "215",
          "current_team": "New Orleans Saints",
          "birth_date": "1989-12-21",
          "birth_place": "Hackensack, NJ",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "Southwestern Academy, MI",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "28",
          "draft_year": "2011",
          "current_salary": "3,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20090",
          "name": "Russell Shepard",
          "position": "WR",
          "height": "6-1",
          "weight": "195",
          "current_team": "Carolina Panthers",
          "birth_date": "1990-09-17",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "LSU",
          "high_school": "Cypress Ridge, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4480",
          "name": "Brandin Cooks",
          "position": "WR",
          "height": "5-10",
          "weight": "189",
          "current_team": "New England Patriots",
          "birth_date": "1993-09-25",
          "birth_place": "Stockton, CA",
          "death_date": "None",
          "college": "Oregon St.",
          "high_school": "Lincoln, CA",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "20",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14151",
          "name": "Doug Martin ",
          "position": "RB",
          "height": "5-9",
          "weight": "223",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1989-01-13",
          "birth_place": "Stockton, CA",
          "death_date": "None",
          "college": "Boise St.",
          "high_school": "St. Mary's, CA",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "31",
          "draft_year": "2012",
          "current_salary": "5,764,706",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4443",
          "name": "Chris Conte",
          "position": "DB",
          "height": "6-2",
          "weight": "197",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1989-02-23",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Loyola, CA",
          "draft_team": "Chicago Bears",
          "draft_round": "3",
          "draft_position": "93",
          "draft_year": "2011",
          "current_salary": "1,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6598",
          "name": "Mike Evans",
          "position": "WR",
          "height": "6-5",
          "weight": "231",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1993-08-21",
          "birth_place": "Galveston, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Ball, TX",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "7",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21760",
          "name": "Keith Tandy",
          "position": "S",
          "height": "5-10",
          "weight": "202",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1989-02-12",
          "birth_place": "Hopkinsville, KY",
          "death_date": "None",
          "college": "West Virginia",
          "high_school": "Christian County, KY",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "6",
          "draft_position": "174",
          "draft_year": "2012",
          "current_salary": "840,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24497",
          "name": "Jameis Winston",
          "position": "QB",
          "height": "6-4",
          "weight": "232",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1994-01-06",
          "birth_place": "Bessemer, AL",
          "death_date": "None",
          "college": "Florida St.",
          "high_school": "Hueytown, AL",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22094",
          "name": "Michael Thomas",
          "position": "S",
          "height": "5-11",
          "weight": "196",
          "current_team": "Miami Dolphins",
          "birth_date": "1989-03-17",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Nimitz, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "1,797,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15736",
          "name": "Sterling Moore",
          "position": "CB",
          "height": "5-10",
          "weight": "190",
          "current_team": "New Orleans Saints",
          "birth_date": "1990-02-03",
          "birth_place": "Antioch, CA",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Deer Valley, CA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22095",
          "name": "Michael Thomas",
          "position": "WR",
          "height": "6-3",
          "weight": "212",
          "current_team": "New Orleans Saints",
          "birth_date": "1993-03-03",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Fork Union Military Academy, VA",
          "draft_team": "New Orleans Saints",
          "draft_round": "2",
          "draft_position": "47",
          "draft_year": "2016",
          "current_salary": "682,681",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11740",
          "name": "Cameron Jordan",
          "position": "DE",
          "height": "6-4",
          "weight": "287",
          "current_team": "New Orleans Saints",
          "birth_date": "1989-07-10",
          "birth_place": "Chandler, AZ",
          "death_date": "None",
          "college": "California",
          "high_school": "Chandler, AZ",
          "draft_team": "New Orleans Saints",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2011",
          "current_salary": "7,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2328",
          "name": "Drew Brees",
          "position": "QB",
          "height": "6-0",
          "weight": "209",
          "current_team": "New Orleans Saints",
          "birth_date": "1979-01-15",
          "birth_place": "Austin, TX",
          "death_date": "None",
          "college": "Purdue",
          "high_school": "Westlake, TX",
          "draft_team": "San Diego Chargers",
          "draft_round": "2",
          "draft_position": "32",
          "draft_year": "2001",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20338",
          "name": "Charles Sims",
          "position": "RB",
          "height": "6-0",
          "weight": "214",
          "current_team": "Tampa Bay Buccaneers",
          "birth_date": "1990-09-19",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "West Virginia",
          "high_school": "Westbury, TX",
          "draft_team": "Tampa Bay Buccaneers",
          "draft_round": "3",
          "draft_position": "69",
          "draft_year": "2014",
          "current_salary": "764,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9812",
          "name": "Tim Hightower",
          "position": "RB",
          "height": "6-0",
          "weight": "226",
          "current_team": "None",
          "birth_date": "1986-05-23",
          "birth_place": "Alexandria, VA",
          "death_date": "None",
          "college": "Richmond",
          "high_school": "Episcopal, VA",
          "draft_team": "Arizona Cardinals",
          "draft_round": "5",
          "draft_position": "149",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10387",
          "name": "Josh Huff",
          "position": "WR",
          "height": "5-11",
          "weight": "206",
          "current_team": "None",
          "birth_date": "1991-10-14",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Nimitz, TX",
          "draft_team": "Philadelphia Eagles",
          "draft_round": "3",
          "draft_position": "86",
          "draft_year": "2014",
          "current_salary": "None",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Jets",
        "Points": "23"
      },
      "Team 2": {
        "Name": "49ers",
        "Points": "17"
      },
      "comments": " I watched this game in its entirety. I can recall two primary things: One, I wanted to jump out of the window in the second quarter. And two, I have no idea how the Jets won. They didn't have a lead for a single second in this game, and they trailed for most of the afternoon, beginning with a Bryce Petty telegraphed interception, which turned into a Carlos Hyde touchdown. The rest of the first half was pretty much the same, as the 49ers outgained the Jets by intermission, 279-118. They were averaging 9.3 yards per play compared to the Jets' 3.7. It seemed like this was going to be a blowout. And then, the second half happened. The 49ers suddenly couldn't sustain any drives, thanks to Colin Kaepernick's incompetence. Kaepernick had a solid first half, but was just 4-of-11 for 17 yards following intermission. The 49ers tallied just 85 net yards in the second half and overtime as a result. Bryce Petty, meanwhile, came through in the clutch. Petty looked completely incapable of throwing for first downs throughout the opening half, as he held on to the ball too long and took countless sacks, but he made some solid throws toward the end of the game. Then again, he was lucky on some instances, like when he launched a third-and-18 pass to Robby Anderson, which resembled a punt. Petty continued to fire in Anderson's direction, as he couldn't rely on Brandon Marshall, who was hobbled with an injury. Petty finished 23-of-35 for 257 yards and the early interception. He was horrible in the first half, but his performance toward the end of the afternoon should give the Jets some hope that he can be their future No. 2 quarterback. I'd like to see what he can do against tougher defenses, however.    As mentioned, Marshall was hurt. He tweaked his ankle when he was hit late out of bounds, which would explain why he had just three catches for 33 yards. Anderson, Petty's favorite receiver, caught six balls for 99 yards. He was the only Jet who logged more than 35 receiving yards.    Bilal Powell scored the game-winning touchdown. In fact, Powell handled the majority of the workload because Matt Forte was knocked out early with a knee injury. Forte managed just three carries for eight yards before leaving, allowing Powell to gash the NFL's worst run defense. Powell gained 145 yards and two scores on 29 carries. He also caught five balls for 34 receiving yards.    The 49ers also ran the ball well, with Carlos Hyde gashing al lethargic Jet defense for 193 yards on 17 carries. It makes me wonder why Hyde had 10 attempts in the second half and overtime. Chip Kelly once again proved himself to be uttery incompetent.    Speaking of Kelly's follies, he looked stupid again by starting Kaepernick. As mentioned, Kaepernick struggled, going 15-of-26 for only 133 yards and a touchdown. He ran just thrice for some reason, picking up 23 rushing yards in the process. Christian Ponder is the best quarterback on San Francisco's roster.    Only two 49ers caught multiple passes: Jeremy Kerley (5-50) and Quinton Patton (4-31). Torrey Smith, who didn't log a reception, was carted off the field with a serious-looking injury. Smith was one of many San Francisco starters who were absent. Joe Staley was inactive, while center Daniel Kilgore and tight end Vance McDonald were knocked out during this game along with Smith.   ",
      "players": [
        {
          "player_id": "17858",
          "name": "Bilal Powell",
          "position": "RB",
          "height": "5-11",
          "weight": "204",
          "current_team": "New York Jets",
          "birth_date": "1988-10-27",
          "birth_place": "Lakeland, FL",
          "death_date": "None",
          "college": "Louisville",
          "high_school": "Lake Gibson, FL",
          "draft_team": "New York Jets",
          "draft_round": "4",
          "draft_position": "126",
          "draft_year": "2011",
          "current_salary": "3,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17509",
          "name": "Bryce Petty",
          "position": "QB",
          "height": "6-3",
          "weight": "230",
          "current_team": "New York Jets",
          "birth_date": "1991-05-31",
          "birth_place": "Thomaston, GA",
          "death_date": "None",
          "college": "Baylor",
          "high_school": "Midlothian, TX",
          "draft_team": "New York Jets",
          "draft_round": "4",
          "draft_position": "103",
          "draft_year": "2015",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14098",
          "name": "Brandon Marshall",
          "position": "OLB",
          "height": "6-1",
          "weight": "242",
          "current_team": "Denver Broncos",
          "birth_date": "1989-09-10",
          "birth_place": "Las Vegas, NV",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Cimarron-Memorial, NV",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "5",
          "draft_position": "142",
          "draft_year": "2012",
          "current_salary": "2,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "10586",
          "name": "Carlos Hyde",
          "position": "RB",
          "height": "6-0",
          "weight": "230",
          "current_team": "San Francisco 49ers",
          "birth_date": "1990-09-20",
          "birth_place": "Naples, FL",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "Naples, FL",
          "draft_team": "San Francisco 49ers",
          "draft_round": "2",
          "draft_position": "57",
          "draft_year": "2014",
          "current_salary": "822,047",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20801",
          "name": "Torrey Smith",
          "position": "WR",
          "height": "6-1",
          "weight": "205",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1989-01-26",
          "birth_place": "Colonial Beach, VA",
          "death_date": "None",
          "college": "Maryland",
          "high_school": "Stafford, VA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "2",
          "draft_position": "58",
          "draft_year": "2011",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "484",
          "name": "Robby Anderson",
          "position": "WR",
          "height": "6-3",
          "weight": "190",
          "current_team": "New York Jets",
          "birth_date": "1993-05-09",
          "birth_place": "Teaneck, NJ",
          "death_date": "None",
          "college": "Temple",
          "high_school": "South Plantation, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17230",
          "name": "Quinton Patton",
          "position": "WR",
          "height": "6-0",
          "weight": "204",
          "current_team": "None",
          "birth_date": "1990-08-09",
          "birth_place": "Nashville, TN",
          "death_date": "None",
          "college": "Louisiana Tech",
          "high_school": "La Vergne, TN",
          "draft_team": "San Francisco 49ers",
          "draft_round": "4",
          "draft_position": "128",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14688",
          "name": "Vance McDonald",
          "position": "TE",
          "height": "6-4",
          "weight": "267",
          "current_team": "Pittsburgh Steelers",
          "birth_date": "1990-06-13",
          "birth_place": "Winnie, TX",
          "death_date": "None",
          "college": "Rice",
          "high_school": "East Chambers, TX",
          "draft_team": "San Francisco 49ers",
          "draft_round": "2",
          "draft_position": "55",
          "draft_year": "2013",
          "current_salary": "2,100,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "7164",
          "name": "Matt Forte ",
          "position": "RB",
          "height": "6-1",
          "weight": "221",
          "current_team": "New York Jets",
          "birth_date": "1985-12-10",
          "birth_place": "Lake Charles, LA",
          "death_date": "None",
          "college": "Tulane",
          "high_school": "Slidell, LA",
          "draft_team": "Chicago Bears",
          "draft_round": "2",
          "draft_position": "44",
          "draft_year": "2008",
          "current_salary": "4,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12210",
          "name": "Daniel Kilgore",
          "position": "OL",
          "height": "6-3",
          "weight": "308",
          "current_team": "San Francisco 49ers",
          "birth_date": "1987-12-18",
          "birth_place": "Kingsport, TN",
          "death_date": "None",
          "college": "Appalachian St.",
          "high_school": "Dobyns-Bennett, TN",
          "draft_team": "San Francisco 49ers",
          "draft_round": "5",
          "draft_position": "163",
          "draft_year": "2011",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11849",
          "name": "Colin Kaepernick",
          "position": "QB",
          "height": "6-4",
          "weight": "225",
          "current_team": "None",
          "birth_date": "1987-11-03",
          "birth_place": "Milwaukee, WI",
          "death_date": "None",
          "college": "Nevada",
          "high_school": "Turlock, CA",
          "draft_team": "San Francisco 49ers",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2011",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "21078",
          "name": "Joe Staley",
          "position": "T",
          "height": "6-6",
          "weight": "306",
          "current_team": "San Francisco 49ers",
          "birth_date": "1984-08-30",
          "birth_place": "Rockford, MI",
          "death_date": "None",
          "college": "Central Michigan",
          "high_school": "Rockford, MI",
          "draft_team": "San Francisco 49ers",
          "draft_round": "1",
          "draft_position": "28",
          "draft_year": "2007",
          "current_salary": "8,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "12147",
          "name": "Jeremy Kerley",
          "position": "WR",
          "height": "5-9",
          "weight": "188",
          "current_team": "New York Jets",
          "birth_date": "1988-11-08",
          "birth_place": "Hutto, TX",
          "death_date": "None",
          "college": "TCU",
          "high_school": "Hutto, TX",
          "draft_team": "New York Jets",
          "draft_round": "5",
          "draft_position": "153",
          "draft_year": "2011",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14097",
          "name": "Brandon Marshall",
          "position": "WR",
          "height": "6-4",
          "weight": "229",
          "current_team": "New York Giants",
          "birth_date": "1984-03-23",
          "birth_place": "Pittsburgh, PA",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Lake Howell, FL",
          "draft_team": "Denver Broncos",
          "draft_round": "4",
          "draft_position": "119",
          "draft_year": "2006",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Packers",
        "Points": "38"
      },
      "Team 2": {
        "Name": "Seahawks",
        "Points": "10"
      },
      "comments": " Aaron Rodgers promised everyone that the Packers would win out. Well, one down, three to go. Rodgers kept his word, as his Packers demolished the Seahawks. He backed up his talk with a tremendous performance. There were signs early that this was going to be a big day for Green Bay's offense, as a Rodgers-to-Davante Adams touchdown for 66 yards, thrown 90 seconds into the game, was the Packers' longest play of the season. With the Seahawks unable to generate much offense, Rodgers made the Earl Thomas-less Seattle defense pay throughout the evening. This contest was such a blowout that Rodgers was pulled early in the fourth quarter. Rodgers misfired on just five attempts, going 18-of-23 for 246 yards and three touchdowns, and his only poor throw was when he missed a wide-open Adams for another score. If there's a dark cloud over this victory, it's that Rodgers tweaked his calf in the first quarter. That didn't affect his passing ability, obviously, but he couldn't scramble whatsoever. Rodgers' ability to move around is very crucial to his game, so we'll see if this affects him going forward.    Rodgers wasn't the only Packer who sustained an injury, as Ty Montgomery, Randall Cobb and Jared Cook all left the game. Cobb was carted off, but managed to return. Montgomery did as well, but didn't touch the ball very much upon coming back. It's a shame that Montgomery sustained an injury, as he was running the ball very well, gaining 41 yards and a touchdown on nine carries, seven of which came prior to halftime. Christine Michael (10-36) handled most of the workload following intermission in a revenge game for him. As for Cobb, he didn't do much, catching three passes for 33 yards. He was fourth on the receiving chart, trailing Adams (4-104), Montgomery (3-45) and Jordy Nelson (6-41). Nelson found the end zone twice.    Meanwhile, this was Seattle's worst loss in the Russell Wilson era, so it's no surprise that Wilson had his worst NFL start ever. He threw a career-high five interceptions, though most of those weren't his fault. The first occurred because his receiver fell down. The second one was on him, as Wilson launched a pass that hung up in the air forever. It would've been a good punt, but it was a bad pass instead. Wilson's third interception was questionable, as the Packers easily could've been flagged for pass interference on the play. The next two picks were via tipped or dropped passes. Wilson, as it turns out, was really only responsible for one pick (two at most). That won't make his fantasy owners feel better though, as Wilson went 22-of-30 for 240 yards, one touchdown and the five interceptions. He was hurt by tons of drops, so don't feel too discouraged if you own Wilson and somehow survived with him (or if you were on a bye.)    Doug Baldwin was responsible for one of the bobbled balls that resulted in a Wilson interception. He managed to lead the Seahawks with six catches and 46 yards, but he didn't have a good game. Tyler Lockett (4-41) also dropped a pass. Lockett missed some action when he was poked in the eye.    With the Seahawks down throughout, they couldn't run the ball very much. It looked like Thomas Rawls could get something going though, as he had a strong first drive and ultimately finished with 67 yards on only 12 carries. <div class=dfpAdSlots>   ",
      "players": [
        {
          "player_id": "4469",
          "name": "Jared Cook",
          "position": "TE",
          "height": "6-4",
          "weight": "235",
          "current_team": "Oakland Raiders",
          "birth_date": "1987-04-07",
          "birth_place": "Birmingham, AL",
          "death_date": "None",
          "college": "South Carolina",
          "high_school": "North Gwinnett, GA",
          "draft_team": "Tennessee Titans",
          "draft_round": "3",
          "draft_position": "89",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24421",
          "name": "Russell Wilson",
          "position": "QB",
          "height": "5-11",
          "weight": "203",
          "current_team": "Seattle Seahawks",
          "birth_date": "1988-11-29",
          "birth_place": "Richmond, VA",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "Collegiate School, VA",
          "draft_team": "Seattle Seahawks",
          "draft_round": "3",
          "draft_position": "75",
          "draft_year": "2012",
          "current_salary": "12,600,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18248",
          "name": "Thomas Rawls",
          "position": "RB",
          "height": "5-10",
          "weight": "217",
          "current_team": "Seattle Seahawks",
          "birth_date": "1993-08-03",
          "birth_place": "Flint, MI",
          "death_date": "None",
          "college": "Central Michigan",
          "high_school": "Northern, MI",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "615,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15195",
          "name": "Christine Michael ",
          "position": "RB",
          "height": "5-10",
          "weight": "220",
          "current_team": "Indianapolis Colts",
          "birth_date": "1990-11-09",
          "birth_place": "Beaumont, TX",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "West Brook, TX",
          "draft_team": "Seattle Seahawks",
          "draft_round": "2",
          "draft_position": "62",
          "draft_year": "2013",
          "current_salary": "378,800",
          "hof_induction_year": "None"
        },
        {
          "player_id": "941",
          "name": "Doug Baldwin ",
          "position": "WR",
          "height": "5-10",
          "weight": "189",
          "current_team": "Seattle Seahawks",
          "birth_date": "1988-09-21",
          "birth_place": "Gulf Breeze, FL",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "Gulf Breeze, FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18951",
          "name": "Aaron Rodgers ",
          "position": "QB",
          "height": "6-2",
          "weight": "223",
          "current_team": "Green Bay Packers",
          "birth_date": "1983-12-02",
          "birth_place": "Chico, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Pleasant Valley, CA",
          "draft_team": "Green Bay Packers",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2005",
          "current_salary": "12,550,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4130",
          "name": "Randall Cobb",
          "position": "WR",
          "height": "5-10",
          "weight": "191",
          "current_team": "Green Bay Packers",
          "birth_date": "1990-08-22",
          "birth_place": "Maryville, TN",
          "death_date": "None",
          "college": "Kentucky",
          "high_school": "Alcoa, TN",
          "draft_team": "Green Bay Packers",
          "draft_round": "2",
          "draft_position": "64",
          "draft_year": "2011",
          "current_salary": "8,600,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "60",
          "name": "Davante Adams",
          "position": "WR",
          "height": "6-1",
          "weight": "212",
          "current_team": "Green Bay Packers",
          "birth_date": "1992-12-24",
          "birth_place": "Redwood City, CA",
          "death_date": "None",
          "college": "Fresno St.",
          "high_school": "Palo Alto, CA",
          "draft_team": "Green Bay Packers",
          "draft_round": "2",
          "draft_position": "53",
          "draft_year": "2014",
          "current_salary": "956,373",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15617",
          "name": "Ty Montgomery",
          "position": "WR/RB",
          "height": "6-0",
          "weight": "216",
          "current_team": "Green Bay Packers",
          "birth_date": "1993-01-22",
          "birth_place": "Jackson, MS",
          "death_date": "None",
          "college": "Stanford",
          "high_school": "St. Mark's School, TX",
          "draft_team": "Green Bay Packers",
          "draft_round": "3",
          "draft_position": "94",
          "draft_year": "2015",
          "current_salary": "625,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22039",
          "name": "Earl Thomas",
          "position": "DB",
          "height": "5-10",
          "weight": "208",
          "current_team": "Seattle Seahawks",
          "birth_date": "1989-05-07",
          "birth_place": "Orange, TX",
          "death_date": "None",
          "college": "Texas",
          "high_school": "West Orange-Stark, TX",
          "draft_team": "Seattle Seahawks",
          "draft_round": "1",
          "draft_position": "14",
          "draft_year": "2010",
          "current_salary": "8,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16279",
          "name": "Jordy Nelson",
          "position": "WR",
          "height": "6-3",
          "weight": "215",
          "current_team": "Green Bay Packers",
          "birth_date": "1985-05-31",
          "birth_place": "Manhattan, KS",
          "death_date": "None",
          "college": "Kansas St.",
          "high_school": "Riley Co., KS",
          "draft_team": "Green Bay Packers",
          "draft_round": "2",
          "draft_position": "36",
          "draft_year": "2008",
          "current_salary": "8,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13473",
          "name": "Tyler Lockett",
          "position": "WR",
          "height": "5-10",
          "weight": "181",
          "current_team": "Seattle Seahawks",
          "birth_date": "1992-09-28",
          "birth_place": "Tulsa, OK",
          "death_date": "None",
          "college": "Kansas St.",
          "high_school": "Booker T. Washington, OK",
          "draft_team": "Seattle Seahawks",
          "draft_round": "3",
          "draft_position": "69",
          "draft_year": "2015",
          "current_salary": "695,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Giants",
        "Points": "10"
      },
      "Team 2": {
        "Name": "Cowboys",
        "Points": "7"
      },
      "comments": " The Giants talked a lot of trash leading up to this game, constantly reminding the Cowboys that they were the only team to beat them this year. New York, despite being a four-point home underdog, backed up its talk with a victory, dropping Dallas to 11-2. New York's defense deserves all the credit because the offense did absolutely nothing. The Giants forced Dak Prescott into his worst performance of his prolific rookie campaign, limiting him to 17-of-37 passing for only 165 yards, one touchdown and two interceptions. Prescott never looked comfortable in the pocket, as New York's pass rush was breathing down his throat all evening. Most didn't think this would happen in the wake of Jason Pierre-Paul's injury, but Romeo Okwara stepped up in Pierre-Paul's absence. Okwara was a monster, causing major problems for Prescott. Prescott finished 17-of-37 for only 165 yards, one touchdown and two interceptions. The first pick wasn't Prescott's fault because Dez Bryant slipped, but the second was a terrible heave into double coverage deep down the field. This led to New York's sole offensive touchdown of the evening. Aside from the turnovers, Prescott's accuracy was anemic. His pocket awareness was just as bad, as he walked into a sack on one occasion to take his team out of field-goal range. He should've thrown a third pick, but Dominique Rodgers-Cromartie dropped the ball while falling out of bounds. Despite all of this, the Cowboys appeared to be driving with about 2:30 remaining in regulation. They reached their own 40-yard line, but Bryant lost a fumble, effectively ending the game.    Bryant's miserable outing was another reason Prescott struggled. Janoris Jenkins has now limited Bryant to two catches in as many meetings this year. Bryant was targeted on both of Prescott's interceptions, and he was responsible for the game-ending fumble. His one reception went for 10 yards, but it resulted in that turnover.    With Bryant smothered by Jenkins, Prescott had to rely on other receivers. Terrance Williams led the way with five catches for 76 yards and a touchdown. Cole Beasley (4-41) and Jason Witten (4-26) were next on the receiving list. Witten's lack of production was surprising considering how awful New York's linebackers are.    Ezekiel Elliott eclipsed the century mark despite the loss. He gained 107 yards on 24 carries. He converted a fourth-and-1 in the opening quarter, though he dropped a pass - his first of the year.    As I mentioned earlier, New York's offense did nothing. Well, nothing except for one play when Odell Beckham beat Brandon Carr for a 61-yard touchdown. Outside of that play, the Giants were limited to just 199 net yards.    Eli Manning did not have a good game, and his stat line is very misleading. He finished 17-of-28 for 193 yards, one touchdown and an interception. If you take out the Beckham play, which was all Beckham, Manning would've gone 16-of-27 for only 132 yards and a pick. Manning was extremely fortunate to get away with only one interception, which he telegraphed to Victor Cruz. The Cowboys dropped a whopping three interceptions, including one by Barry Church, where the ball was thrown right to him. Had Church hung on, the Cowboys would've been set up in field-goal range, which would've allowed Dallas to tie the game. Manning also fumbled twice. He was a mess, and he's extremely fortunate that the defense once again bailed him out.    Beckham (4-94) was the offensive hero for New York. He was struggling prior to his 61-yard score, as he caught three balls for 33 yards otherwise, thanks to Carr's great coverage. Beckham also hurt himself with two drops inside the red zone. Outside of Beckham, New York's leading receiver was Sterling Shepard, who caught three balls for 39 yards. Victor Cruz (1-4) barely did anything.    The Giants struggled to run the ball once again. Paul Perkins and Rashad Jennings had identical rushing numbers, each gaining 45 yards on 15 carries. Shane Vereen finally returned to action, but didn't last very long because he was knocked out with a concussion.   ",
      "players": [
        {
          "player_id": "1342",
          "name": "Cole Beasley",
          "position": "WR",
          "height": "5-8",
          "weight": "174",
          "current_team": "Dallas Cowboys",
          "birth_date": "1989-04-26",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "SMU",
          "high_school": "Little Elm, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "3,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3897",
          "name": "Barry Church",
          "position": "DB",
          "height": "6-1",
          "weight": "222",
          "current_team": "Jacksonville Jaguars",
          "birth_date": "1988-02-11",
          "birth_place": "Pittsburgh, PA",
          "death_date": "None",
          "college": "Toledo",
          "high_school": "Penn Hills, PA",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "16771",
          "name": "Romeo Okwara",
          "position": "DE",
          "height": "6-5",
          "weight": "275",
          "current_team": "New York Giants",
          "birth_date": "1995-06-17",
          "birth_place": "Charlotte, NC",
          "death_date": "None",
          "college": "Notre Dame",
          "high_school": "Ardrey Kell, NC",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "4883",
          "name": "Victor Cruz",
          "position": "WR",
          "height": "6-0",
          "weight": "204",
          "current_team": "None",
          "birth_date": "1986-11-11",
          "birth_place": "Patterson, NJ",
          "death_date": "None",
          "college": "Massachusetts",
          "high_school": "Paterson Catholic, NJ",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24257",
          "name": "Terrance Williams",
          "position": "WR",
          "height": "6-2",
          "weight": "208",
          "current_team": "Dallas Cowboys",
          "birth_date": "1989-09-08",
          "birth_place": "Dallas, TX",
          "death_date": "None",
          "college": "Baylor",
          "high_school": "Warren Travis White, TX",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "74",
          "draft_year": "2013",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22910",
          "name": "Shane Vereen",
          "position": "RB",
          "height": "5-10",
          "weight": "200",
          "current_team": "New York Giants",
          "birth_date": "1989-03-02",
          "birth_place": "Valencia, CA",
          "death_date": "None",
          "college": "California",
          "high_school": "Valencia, CA",
          "draft_team": "New England Patriots",
          "draft_round": "2",
          "draft_position": "56",
          "draft_year": "2011",
          "current_salary": "2,150,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11047",
          "name": "Janoris Jenkins ",
          "position": "CB",
          "height": "5-10",
          "weight": "191",
          "current_team": "New York Giants",
          "birth_date": "1988-10-29",
          "birth_place": "Pahokee, FL",
          "death_date": "None",
          "college": "North Alabama",
          "high_school": "Pahokee, FL",
          "draft_team": "St. Louis Rams",
          "draft_round": "2",
          "draft_position": "39",
          "draft_year": "2012",
          "current_salary": "12,900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17907",
          "name": "Dak Prescott ",
          "position": "QB",
          "height": "6-2",
          "weight": "226",
          "current_team": "Dallas Cowboys",
          "birth_date": "1993-07-29",
          "birth_place": "Sulphur, LA",
          "death_date": "None",
          "college": "Mississippi St.",
          "high_school": "Haughton, LA",
          "draft_team": "Dallas Cowboys",
          "draft_round": "4",
          "draft_position": "135",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20091",
          "name": "Sterling Shepard",
          "position": "WR",
          "height": "5-10",
          "weight": "194",
          "current_team": "New York Giants",
          "birth_date": "1994-02-10",
          "birth_place": "Oklahoma City, OK",
          "death_date": "None",
          "college": "Oklahoma",
          "high_school": "Heritage Hall, OK",
          "draft_team": "New York Giants",
          "draft_round": "2",
          "draft_position": "40",
          "draft_year": "2016",
          "current_salary": "720,208",
          "hof_induction_year": "None"
        },
        {
          "player_id": "13982",
          "name": "Eli Manning",
          "position": "QB",
          "height": "6-4",
          "weight": "218",
          "current_team": "New York Giants",
          "birth_date": "1981-01-03",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Mississippi",
          "high_school": "Isidore Newman, LA",
          "draft_team": "San Diego Chargers",
          "draft_round": "1",
          "draft_position": "1",
          "draft_year": "2004",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6375",
          "name": "Ezekiel Elliott",
          "position": "RB",
          "height": "6-0",
          "weight": "225",
          "current_team": "Dallas Cowboys",
          "birth_date": "1995-07-22",
          "birth_place": "St. Louis, MO",
          "death_date": "None",
          "college": "Ohio St.",
          "high_school": "John Burroughs School, MO",
          "draft_team": "Dallas Cowboys",
          "draft_round": "1",
          "draft_position": "4",
          "draft_year": "2016",
          "current_salary": "1,584,379",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17382",
          "name": "Paul Perkins ",
          "position": "RB",
          "height": "5-10",
          "weight": "210",
          "current_team": "New York Giants",
          "birth_date": "1994-11-16",
          "birth_place": "Mesa, AZ",
          "death_date": "None",
          "college": "UCLA",
          "high_school": "Chandler, AZ",
          "draft_team": "New York Giants",
          "draft_round": "5",
          "draft_position": "149",
          "draft_year": "2016",
          "current_salary": "540,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "18963",
          "name": "Dominique Rodgers-Cromartie ",
          "position": "DB",
          "height": "6-2",
          "weight": "183",
          "current_team": "New York Giants",
          "birth_date": "1986-04-07",
          "birth_place": "Bradentown, FL",
          "death_date": "None",
          "college": "Tennessee St.",
          "high_school": "Lakewood Ranch, FL",
          "draft_team": "Arizona Cardinals",
          "draft_round": "1",
          "draft_position": "16",
          "draft_year": "2008",
          "current_salary": "6,980,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11088",
          "name": "Rashad Jennings",
          "position": "RB",
          "height": "6-1",
          "weight": "234",
          "current_team": "None",
          "birth_date": "1985-03-26",
          "birth_place": "Forest, VA",
          "death_date": "None",
          "college": "Liberty",
          "high_school": "Jefferson Forest, VA",
          "draft_team": "Jacksonville Jaguars",
          "draft_round": "7",
          "draft_position": "250",
          "draft_year": "2009",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "3481",
          "name": "Brandon Carr",
          "position": "DB",
          "height": "6-0",
          "weight": "207",
          "current_team": "Baltimore Ravens",
          "birth_date": "1986-05-19",
          "birth_place": "Flint, MI",
          "death_date": "None",
          "college": "Grand Valley St.",
          "high_school": "Carman-Ainsworth, MI",
          "draft_team": "Kansas City Chiefs",
          "draft_round": "5",
          "draft_position": "140",
          "draft_year": "2008",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17600",
          "name": "Jason Pierre-Paul",
          "position": "DE",
          "height": "6-5",
          "weight": "270",
          "current_team": "New York Giants",
          "birth_date": "1989-02-28",
          "birth_place": "Deerfield Beach, FL",
          "death_date": "None",
          "college": "South Florida",
          "high_school": "Deerfield Beach, FL",
          "draft_team": "New York Giants",
          "draft_round": "1",
          "draft_position": "15",
          "draft_year": "2010",
          "current_salary": "1,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2848",
          "name": "Dez Bryant",
          "position": "WR",
          "height": "6-2",
          "weight": "225",
          "current_team": "Dallas Cowboys",
          "birth_date": "1988-11-04",
          "birth_place": "Lufkin, TX",
          "death_date": "None",
          "college": "Oklahoma St.",
          "high_school": "Lufkin, TX",
          "draft_team": "Dallas Cowboys",
          "draft_round": "1",
          "draft_position": "24",
          "draft_year": "2010",
          "current_salary": "13,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "24544",
          "name": "Jason Witten",
          "position": "TE",
          "height": "6-5",
          "weight": "257",
          "current_team": "Dallas Cowboys",
          "birth_date": "1982-05-06",
          "birth_place": "Elizabethton, TN",
          "death_date": "None",
          "college": "Tennessee",
          "high_school": "Elizabethton, TN",
          "draft_team": "Dallas Cowboys",
          "draft_round": "3",
          "draft_position": "69",
          "draft_year": "2003",
          "current_salary": "7,400,000",
          "hof_induction_year": "None"
        }
      ]
    },
    {
      "Team 1": {
        "Name": "Patriots",
        "Points": "30"
      },
      "Team 2": {
        "Name": "Ravens",
        "Points": "23"
      },
      "comments": " If there was any doubt that Tom Brady was the MVP of the 2016 NFL campaign, the future Hall of Famer cemented the award with a brilliant performance Monday night. Brady was incredible, making sure the Patriots would win their 11th game and hold on to the No. 1 seed in the AFC playoff picture. The Patriots had a 10-2 record entering this contest, but hadn't been playing very well heading into Week 14. In the three weeks prior to this game, they struggled to put away the Rams; trailed the Jets in the fourth quarter; and led just 13-10 at San Francisco. They were missing Rob Gronkowski and numerous other players, and it looked like they were going to limp into the playoffs just like last year. However, if Brady continues to perform like he did versus Baltimore, the Patriots are going to be extremely difficult to defeat in the postseason. Brady finished 25-of-38 for 306 yards, three touchdowns and an interception. Despite the terrific stats, Brady could've been better had Julian Edelman not dropped two passes. Brady's only blemish was the pick, which he forced into double coverage. The pass was thrown into the end zone, so that ended up costing New England three points. It didn't appear as though Brady would be able to eclipse the 400-yard barrier, given that he was in the low 300s with six minutes remaining, but he caught Ravens safety Matt Elam napping with a 79-yard bomb to Chris Hogan. That absolutely crushed the Ravens, who were down just 23-20 at that point. Elam ruined the potential victory (or more importantly, cover) for the Ravens, and it didn't help that Jimmy Smith was knocked out early with an injury.    Thanks to the long touchdown, Hogan led the team with 129 receiving yards and the touchdown on five catches. James White (3-81) and Malcolm Mitchell (4-41) also hit big plays of 61 and 34 yards, respectively. In addition to Hogan, Mitchell and Martellus Bennett (4-70) both scored. Edelman, meanwhile, snatched seven of a whopping 15 targets for 73 yards. As mentioned, he was guilty of a drop.    LeGarrette Blount eclipsed the 1,000-yard rushing barrier for the season in this contest, thanks to his 72 yards on 18 carries. He also scored once. Blount had a huge conversion at the end, picking up a fourth-and-1 to seal the victory.    The disparity between the two quarterbacks was the obvious difference in this matchup. Whereas Brady torched Baltimore's secondary to punish blitzes, Joe Flacco responded to New England's pressures with dinks and dunks. An e-mailer actually contacted me during the game and likened Flacco's performance to that of Case Keenum's, and it was a perfect comparison. Flacco threw for 324 yards, but did so on 52 pass attempts. He completed 37 of them, throwing two touchdowns in the process, along with a forced interception into double coverage to Mike Wallace. Devin McCourty came down with the bad throw. Flacco's numbers may not seem bad, considering he threw a pair of scores, but both of those came on short fields after a Cyrus Jones muffed punt and a Matthew Slater fumbled kickoff. The Ravens were down 23-3 at the time and appeared as though they'd be blown out of the water, but they were able to get back into it thanks to New England's special-teams miscues. Then again, Baltimore had its own blunders on special teams early; Devin Hester refused to field a punt, prompting the ball to trickle down to the 1-yard line, leading to a safety when Kenneth Dixon was stuffed by Malcolm Brown. Then, Justin Tucker had a field goal blocked.    Speaking of Dixon, he was very impressive. He rushed for only 39 yards, but carried the ball just 11 times. It was more about how he ran, as he was able to drag tacklers the entire night. Dixon was also a big factor in the passing game, catching eight balls for 42 receiving yards and a touchdown. The major take-away is that while Dixon had 19 touches compared to Terrance West's six. It's about time the Ravens have begun featuring Dixon more, as he's so much more explosive than the pedestrian West. Dixon made a couple of mistakes - he false started on a fourth-and-2 and dropped a pass - but he's just a rookie, so perhaps he'll refrain from making too many careless errors in the future.    Steve Smith led the Ravens in receiving with four grabs for 57 yards. Wallace (5-52) and Breshad Perriman (3-52) were next, though the former sustained some sort of injury in the fourth quarter. Wallace also was guilty of a deep drop. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...<\/span>   ",
      "players": [
        {
          "player_id": "11541",
          "name": "Cyrus Jones",
          "position": "CB",
          "height": "5-10",
          "weight": "197",
          "current_team": "New England Patriots",
          "birth_date": "1993-11-29",
          "birth_place": "Baltimore, MD",
          "death_date": "None",
          "college": "Alabama",
          "high_school": "The Gilman School, MD",
          "draft_team": "New England Patriots",
          "draft_round": "2",
          "draft_position": "60",
          "draft_year": "2016",
          "current_salary": "623,123",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1544",
          "name": "Martellus Bennett ",
          "position": "TE",
          "height": "6-7",
          "weight": "248",
          "current_team": "New England Patriots",
          "birth_date": "1987-03-10",
          "birth_place": "San Diego, CA",
          "death_date": "None",
          "college": "Texas A&M;",
          "high_school": "Alief Taylor, TX",
          "draft_team": "Dallas Cowboys",
          "draft_round": "2",
          "draft_position": "61",
          "draft_year": "2008",
          "current_salary": "900,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "11999",
          "name": "Case Keenum",
          "position": "QB",
          "height": "6-2",
          "weight": "209",
          "current_team": "Minnesota Vikings",
          "birth_date": "1988-02-17",
          "birth_place": "Abilene, TX",
          "death_date": "None",
          "college": "Houston",
          "high_school": "Wylie, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "950,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "22566",
          "name": "Justin Tucker",
          "position": "K",
          "height": "6-0",
          "weight": "180",
          "current_team": "Baltimore Ravens",
          "birth_date": "1989-11-21",
          "birth_place": "Houston, TX",
          "death_date": "None",
          "college": "Texas",
          "high_school": "Westlake, TX",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "2,800,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "5712",
          "name": "Kenneth Dixon",
          "position": "RB",
          "height": "5-10",
          "weight": "215",
          "current_team": "Baltimore Ravens",
          "birth_date": "1994-01-21",
          "birth_place": "El Dorado, AR",
          "death_date": "None",
          "college": "Louisiana Tech",
          "high_school": "Strong, AR",
          "draft_team": "Baltimore Ravens",
          "draft_round": "4",
          "draft_position": "134",
          "draft_year": "2016",
          "current_salary": "412,941",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6236",
          "name": "Julian Edelman",
          "position": "WR",
          "height": "6-0",
          "weight": "198",
          "current_team": "New England Patriots",
          "birth_date": "1986-05-22",
          "birth_place": "Redwood City, CA",
          "death_date": "None",
          "college": "Kent St.",
          "high_school": "Woodside, CA",
          "draft_team": "New England Patriots",
          "draft_round": "7",
          "draft_position": "232",
          "draft_year": "2009",
          "current_salary": "3,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23774",
          "name": "James White ",
          "position": "RB",
          "height": "5-9",
          "weight": "204",
          "current_team": "New England Patriots",
          "birth_date": "1992-02-03",
          "birth_place": "Fort Lauderdale, FL",
          "death_date": "None",
          "college": "Wisconsin",
          "high_school": "St. Thomas Aquinas, FL",
          "draft_team": "New England Patriots",
          "draft_round": "4",
          "draft_position": "130",
          "draft_year": "2014",
          "current_salary": "690,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20664",
          "name": "Jimmy Smith",
          "position": "CB",
          "height": "6-2",
          "weight": "201",
          "current_team": "Baltimore Ravens",
          "birth_date": "1988-07-26",
          "birth_place": "Fontana, CA",
          "death_date": "None",
          "college": "Colorado",
          "high_school": "Colton, CA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "27",
          "draft_year": "2011",
          "current_salary": "775,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "15497",
          "name": "Malcolm Mitchell ",
          "position": "WR",
          "height": "5-11",
          "weight": "194",
          "current_team": "New England Patriots",
          "birth_date": "1993-07-20",
          "birth_place": "Valdosta, GA",
          "death_date": "None",
          "college": "Georgia",
          "high_school": "Valdosta, GA",
          "draft_team": "New England Patriots",
          "draft_round": "4",
          "draft_position": "112",
          "draft_year": "2016",
          "current_salary": "363,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "2240",
          "name": "Tom Brady ",
          "position": "QB",
          "height": "6-4",
          "weight": "225",
          "current_team": "New England Patriots",
          "birth_date": "1977-08-03",
          "birth_place": "San Mateo, CA",
          "death_date": "None",
          "college": "Michigan",
          "high_school": "Junipero Serra, CA",
          "draft_team": "New England Patriots",
          "draft_round": "6",
          "draft_position": "199",
          "draft_year": "2000",
          "current_salary": "1,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "23158",
          "name": "Mike Wallace",
          "position": "WR",
          "height": "6-0",
          "weight": "180",
          "current_team": "Baltimore Ravens",
          "birth_date": "1986-08-01",
          "birth_place": "New Orleans, LA",
          "death_date": "None",
          "college": "Mississippi",
          "high_school": "O. Perry Walker, LA",
          "draft_team": "Pittsburgh Steelers",
          "draft_round": "3",
          "draft_position": "84",
          "draft_year": "2009",
          "current_salary": "4,750,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "20783",
          "name": "Steve Smith",
          "position": "WR",
          "height": "5-9",
          "weight": "185",
          "current_team": "None",
          "birth_date": "1979-05-12",
          "birth_place": "Los Angeles, CA",
          "death_date": "None",
          "college": "Utah",
          "high_school": "University, CA",
          "draft_team": "Carolina Panthers",
          "draft_round": "3",
          "draft_position": "74",
          "draft_year": "2001",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "8573",
          "name": "Rob Gronkowski",
          "position": "TE",
          "height": "6-6",
          "weight": "265",
          "current_team": "New England Patriots",
          "birth_date": "1989-05-14",
          "birth_place": "Amherst, NY",
          "death_date": "None",
          "college": "Arizona",
          "high_school": "Williamsville North, NY",
          "draft_team": "New England Patriots",
          "draft_round": "2",
          "draft_position": "42",
          "draft_year": "2010",
          "current_salary": "4,250,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6977",
          "name": "Joe Flacco",
          "position": "QB",
          "height": "6-6",
          "weight": "232",
          "current_team": "Baltimore Ravens",
          "birth_date": "1985-01-16",
          "birth_place": "Voorhees, NJ",
          "death_date": "None",
          "college": "Pittsburgh",
          "high_school": "Audubon, NJ",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "18",
          "draft_year": "2008",
          "current_salary": "6,000,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "6337",
          "name": "Matt Elam",
          "position": "SS",
          "height": "5-10",
          "weight": "208",
          "current_team": "None",
          "birth_date": "1991-09-02",
          "birth_place": "Palm Veach Gardens, FL",
          "death_date": "None",
          "college": "Florida",
          "high_school": "William T. Dwyer, FL",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "32",
          "draft_year": "2013",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "14578",
          "name": "Devin McCourty",
          "position": "DB",
          "height": "5-10",
          "weight": "186",
          "current_team": "New England Patriots",
          "birth_date": "1987-08-13",
          "birth_place": "Nyack, NY",
          "death_date": "None",
          "college": "Rutgers",
          "high_school": "St. Joseph Regional, NJ",
          "draft_team": "New England Patriots",
          "draft_round": "1",
          "draft_position": "27",
          "draft_year": "2010",
          "current_salary": "6,500,000",
          "hof_induction_year": "None"
        },
        {
          "player_id": "1890",
          "name": "LeGarrette Blount",
          "position": "RB",
          "height": "6-1",
          "weight": "245",
          "current_team": "Philadelphia Eagles",
          "birth_date": "1986-12-05",
          "birth_place": "Madison, FL",
          "death_date": "None",
          "college": "Oregon",
          "high_school": "Taylor Co., FL",
          "draft_team": "None",
          "draft_round": "None",
          "draft_position": "None",
          "draft_year": "None",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "9732",
          "name": "Devin Hester",
          "position": "PR-WR",
          "height": "5-10",
          "weight": "185",
          "current_team": "None",
          "birth_date": "1982-11-04",
          "birth_place": "Riviera Beach, FL",
          "death_date": "None",
          "college": "Miami (FL)",
          "high_school": "Riviera Beach, FL",
          "draft_team": "Chicago Bears",
          "draft_round": "2",
          "draft_position": "57",
          "draft_year": "2006",
          "current_salary": "None",
          "hof_induction_year": "None"
        },
        {
          "player_id": "17396",
          "name": "Breshad Perriman",
          "position": "WR",
          "height": "6-2",
          "weight": "214",
          "current_team": "Baltimore Ravens",
          "birth_date": "1993-09-10",
          "birth_place": "Lithonia, GA",
          "death_date": "None",
          "college": "Central Florida",
          "high_school": "Arabia Mountain, GA",
          "draft_team": "Baltimore Ravens",
          "draft_round": "1",
          "draft_position": "26",
          "draft_year": "2015",
          "current_salary": "1,226,392",
          "hof_induction_year": "None"
        }
      ]
    }
  ]
}
