{
 "week":"20",
 "year":"2016",
 "numberOfGames":"2",
 "games":[
  {
   "Team 1":{
    "Name":"Falcons",
    "Points":"44"
   },
   "Team 2":{
    "Name":"Packers",
    "Points":"21"
   },
   "comments":" The Falcons will be advancing to the Super Bowl for the first time since the 1998 season. Their victory in that NFC Championship occurred because the opponent missed a field goal, and that's exactly how this conference title match opened. Mason Crosby whiffed on a 41-yard kick on the Packers' opening drive, and that set the tone for the rest of the afternoon. The Packers made so many mental errors that they didn't give themselves a chance. Countless injuries didn't help, but the unforced mistakes prevented them from being competitive. Thus, despite Atlanta's 23-point victory, this was more about Green Bay constantly screwing up than the Falcons dominating. The Falcons were up 10-0 heading into their second drive, but it easily could've been tied at 10. In addition to the botched field goal, Aaron Ripkowski lost a fumble at the 5-yard line, negating a first-and-goal opportunity for the Packers. The turnover disrupted a great drive in which Aaron Rodgers was extremely sharp. And this wasn't nearly the final time that the luck factor was on Atlanta's side. The Falcons fumbled twice, but recovered on both occasions. The Packers also had some opportunities at interceptions on instances in which Matt Ryan threw passes up for grabs, but they dropped the potential turnovers. Given that Atlanta's offense is so lethal, the Packers couldn't screw up on offense and blow opportunities on defense. This game could've gone a lot differently, and in most permutations, this wouldn't have been so lopsided.    That said, Ryan is playing on another level. He's resembling Peyton Manning in his prime, and the AFC representative in the Super Bowl will have immense issues dealing with him. Ryan, abusing the Packers cerebrally, went 27-of-38 for 392 yards and five touchdowns (four passing, one rushing). Three of his 11 incompletions were dropped, so his numbers could've looked even better. On the other hand, he made a couple of poor throws that should've been intercepted, but the Packer defensive backs dropped the ball. Ryan will have a tougher matchup in the Super Bowl by default. He won't be battling a stop unit that has absolutely no idea what it's doing. Defensive coordinator Dom Capers seemed utterly clueless and outmatched in this contest, though it didn't help that he lost Micah Hyde in the second quarter and had Morgan Burnett playing at half strength. Still, secondary help is definitely needed. Check out our to see whom Green Bay could select this April.    Julio Jones was a monster in the NFC Championship, catching nine of his 12 targets for 180 yards and two touchdowns. Jones dropped a pass, but was otherwise terrific. He made a big catch on third down of the opening drive to move the chains, and he did the same thing in the second half, hauling in an acrobatic grab over the incompetent Packer defenders. So much for that injured toe!    Ryan's two other aerial scores went to Mohamed Sanu (5-52) and Devonta Freeman (4-42). Sanu, who came up with a clutch third-and-11 grab to secure a first down, actually played well for once, though the Green Bay secondary was mostly responsible for that. Taylor Gabriel, meanwhile, didn't do much; he caught two passes for 24 yards, and he was responsible for a drop of about 15 yards.    The Falcons had a couple of nice runs, but otherwise didn't do very much on the ground. Freeman gained 42 yards on 14 carries, while Coleman managed just 29 yards and a score on 11 attempts. <div class=dfpAdSlots>    As for the Packers, Rodgers' stat line looks nice, but he'll be disappointed with this performance. Rodgers finished 27-of-45 for 287 yards, three touchdowns and an interception, but all of his scores came in the second half when Atlanta was already winning in a blowout. Rodgers was uncharacteristically off the mark on some of his throws. He also saw more pressure than he's used to. Rodgers didn't recognize what Atlanta was doing with its blitzes, and it also didn't help that the Packers lost both guards in this contest. Lane Taylor went out when the game was still in doubt, while T.J. Lang suffered a more gruesome injury near the end. Lang was carted off and covered up his face so no one could see his tears. Lang was set to hit free agency this offseason, so it's a shame that he incurred a serious leg issue just a month-and-a-half prior to his contract expiring. Lang was third in our . A couple of other things to note about Rodgers: His pick shouldn't be held against him, as he launched a ball up for grabs on third-and-21 from deep in his own end zone. It effectively was a 55-yard punt. Besides, the interception should've never happened because the officials missed a blatant defensive hold on Jordy Nelson on the same series of downs. Also, Rodgers, like Ryan, was hurt by some drops.    Speaking of Nelson, he took the field unexpectedly, but wasn't 100 percent. He was wincing in pain throughout the entire afternoon. He ended up with six catches for 67 yards and a touchdown. Davante Adams (3-16) also scored, but he wasn't completely healthy either.    Rodgers' third score was reeled in by Jared Cook (7-78), but it wasn't all good for him, as he dropped a couple of passes. Randall Cobb (6-82), the only healthy wideout, led the Packers in receiving.    The Packers need to find a running back this offseason - check out our - and that was very evident in this contest. Rodgers ended up leading the team in rushing (4 carries, 46 yards), and after that, it was a mix of Ty Montgomery (3-17), Christine Michael (6-11) and Ripkowski (3-11). Montgomery also got hurt, while Ripkowski was guilty of a second uncalled fumble, but coughed up the rock late when the game was out of hand. Dan Quinn, however, did the honorable thing and opted not to challenge.    Green Bay going on a great run to close out the year saved Mike McCarthy's job, so he won't be fired for this defeat. However, his poor coaching was on display in this contest. McCarthy failed to make any sort of appropriate adjustments, and his team simply didn't look prepared to play. Perhaps that was because several of their players were stricken with the flu this past week, but that doesn't excuse Green Bay's delay-of-game penalty on a kickoff. Let me repeat that. They had a delay of game on a kickoff. The only time I've ever seen that was in a <i>Madden</i> game. <div class=dfpAdSlots>   ",
   "players":[
    {
     "player_id":"18719",
     "name":"Aaron Ripkowski",
     "position":"FB",
     "height":"6-1",
     "weight":"255",
     "current_team":"Green Bay Packers",
     "birth_date":"1992-12-20",
     "birth_place":"Houston, TX",
     "death_date":"None",
     "college":"Oklahoma",
     "high_school":"Dayton, TX",
     "draft_team":"Green Bay Packers",
     "draft_round":"6",
     "draft_position":"206",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4824",
     "name":"Mason Crosby",
     "position":"K",
     "height":"6-1",
     "weight":"212",
     "current_team":"Green Bay Packers",
     "birth_date":"1984-09-03",
     "birth_place":"Lubbock, TX",
     "death_date":"None",
     "college":"Colorado",
     "high_school":"Georgetown, TX",
     "draft_team":"Green Bay Packers",
     "draft_round":"6",
     "draft_position":"193",
     "draft_year":"2007",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4469",
     "name":"Jared Cook",
     "position":"TE",
     "height":"6-4",
     "weight":"235",
     "current_team":"Oakland Raiders",
     "birth_date":"1987-04-07",
     "birth_place":"Birmingham, AL",
     "death_date":"None",
     "college":"South Carolina",
     "high_school":"North Gwinnett, GA",
     "draft_team":"Tennessee Titans",
     "draft_round":"3",
     "draft_position":"89",
     "draft_year":"2009",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19319",
     "name":"Matt Ryan",
     "position":"QB",
     "height":"6-4",
     "weight":"217",
     "current_team":"Atlanta Falcons",
     "birth_date":"1985-05-17",
     "birth_place":"Exton, PA",
     "death_date":"None",
     "college":"Boston Col.",
     "high_school":"William Penn Charter School, PA",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"3",
     "draft_year":"2008",
     "current_salary":"15,750,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10588",
     "name":"Micah Hyde",
     "position":"CB",
     "height":"6-0",
     "weight":"197",
     "current_team":"Buffalo Bills",
     "birth_date":"1990-12-31",
     "birth_place":"Toledo, OH",
     "death_date":"None",
     "college":"Iowa",
     "high_school":"Fostoria, OH",
     "draft_team":"Green Bay Packers",
     "draft_round":"5",
     "draft_position":"159",
     "draft_year":"2013",
     "current_salary":"2,300,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"15195",
     "name":"Christine Michael ",
     "position":"RB",
     "height":"5-10",
     "weight":"220",
     "current_team":"Indianapolis Colts",
     "birth_date":"1990-11-09",
     "birth_place":"Beaumont, TX",
     "death_date":"None",
     "college":"Texas A&M;",
     "high_school":"West Brook, TX",
     "draft_team":"Seattle Seahawks",
     "draft_round":"2",
     "draft_position":"62",
     "draft_year":"2013",
     "current_salary":"378,800",
     "hof_induction_year":"None"
    },
    {
     "player_id":"21877",
     "name":"Lane Taylor",
     "position":"G",
     "height":"6-3",
     "weight":"324",
     "current_team":"Green Bay Packers",
     "birth_date":"1989-11-22",
     "birth_place":"Arlington, TX",
     "death_date":"None",
     "college":"Oklahoma St.",
     "high_school":"Martin, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,250,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"11634",
     "name":"Julio Jones",
     "position":"WR",
     "height":"6-4",
     "weight":"220",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-02-03",
     "birth_place":"Foley, AL",
     "death_date":"None",
     "college":"Alabama",
     "high_school":"Foley, AL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"1",
     "draft_position":"6",
     "draft_year":"2011",
     "current_salary":"11,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7342",
     "name":"Devonta Freeman ",
     "position":"RB",
     "height":"5-8",
     "weight":"206",
     "current_team":"Atlanta Falcons",
     "birth_date":"1992-03-15",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Florida St.",
     "high_school":"Miami Central, FL",
     "draft_team":"Atlanta Falcons",
     "draft_round":"4",
     "draft_position":"103",
     "draft_year":"2014",
     "current_salary":"1,297,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18951",
     "name":"Aaron Rodgers ",
     "position":"QB",
     "height":"6-2",
     "weight":"223",
     "current_team":"Green Bay Packers",
     "birth_date":"1983-12-02",
     "birth_place":"Chico, CA",
     "death_date":"None",
     "college":"California",
     "high_school":"Pleasant Valley, CA",
     "draft_team":"Green Bay Packers",
     "draft_round":"1",
     "draft_position":"24",
     "draft_year":"2005",
     "current_salary":"12,550,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4130",
     "name":"Randall Cobb",
     "position":"WR",
     "height":"5-10",
     "weight":"191",
     "current_team":"Green Bay Packers",
     "birth_date":"1990-08-22",
     "birth_place":"Maryville, TN",
     "death_date":"None",
     "college":"Kentucky",
     "high_school":"Alcoa, TN",
     "draft_team":"Green Bay Packers",
     "draft_round":"2",
     "draft_position":"64",
     "draft_year":"2011",
     "current_salary":"8,600,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"60",
     "name":"Davante Adams",
     "position":"WR",
     "height":"6-1",
     "weight":"212",
     "current_team":"Green Bay Packers",
     "birth_date":"1992-12-24",
     "birth_place":"Redwood City, CA",
     "death_date":"None",
     "college":"Fresno St.",
     "high_school":"Palo Alto, CA",
     "draft_team":"Green Bay Packers",
     "draft_round":"2",
     "draft_position":"53",
     "draft_year":"2014",
     "current_salary":"956,373",
     "hof_induction_year":"None"
    },
    {
     "player_id":"7480",
     "name":"Taylor Gabriel",
     "position":"WR",
     "height":"5-8",
     "weight":"167",
     "current_team":"Atlanta Falcons",
     "birth_date":"1991-02-17",
     "birth_place":"Dallas, TX",
     "death_date":"None",
     "college":"Abilene Christian",
     "high_school":"John Horn, TX",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,746,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"15617",
     "name":"Ty Montgomery",
     "position":"WR/RB",
     "height":"6-0",
     "weight":"216",
     "current_team":"Green Bay Packers",
     "birth_date":"1993-01-22",
     "birth_place":"Jackson, MS",
     "death_date":"None",
     "college":"Stanford",
     "high_school":"St. Mark's School, TX",
     "draft_team":"Green Bay Packers",
     "draft_round":"3",
     "draft_position":"94",
     "draft_year":"2015",
     "current_salary":"625,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"3033",
     "name":"Morgan Burnett",
     "position":"DB",
     "height":"6-1",
     "weight":"210",
     "current_team":"Green Bay Packers",
     "birth_date":"1989-01-13",
     "birth_place":"East Point, GA",
     "death_date":"None",
     "college":"Georgia Tech",
     "high_school":"North Clayton, GA",
     "draft_team":"Green Bay Packers",
     "draft_round":"3",
     "draft_position":"71",
     "draft_year":"2010",
     "current_salary":"4,750,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"12856",
     "name":"T.J. Lang",
     "position":"T",
     "height":"6-4",
     "weight":"305",
     "current_team":"Detroit Lions",
     "birth_date":"1987-09-20",
     "birth_place":"Royal Oak, MI",
     "death_date":"None",
     "college":"East. Michigan",
     "high_school":"Brother Rice, MI",
     "draft_team":"Green Bay Packers",
     "draft_round":"4",
     "draft_position":"109",
     "draft_year":"2009",
     "current_salary":"3,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"19495",
     "name":"Mohamed Sanu",
     "position":"WR",
     "height":"6-2",
     "weight":"215",
     "current_team":"Atlanta Falcons",
     "birth_date":"1989-08-22",
     "birth_place":"New Brunswick, NJ",
     "death_date":"None",
     "college":"Rutgers",
     "high_school":"South Brunswick, NJ",
     "draft_team":"Cincinnati Bengals",
     "draft_round":"3",
     "draft_position":"83",
     "draft_year":"2012",
     "current_salary":"6,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"16279",
     "name":"Jordy Nelson",
     "position":"WR",
     "height":"6-3",
     "weight":"215",
     "current_team":"Green Bay Packers",
     "birth_date":"1985-05-31",
     "birth_place":"Manhattan, KS",
     "death_date":"None",
     "college":"Kansas St.",
     "high_school":"Riley Co., KS",
     "draft_team":"Green Bay Packers",
     "draft_round":"2",
     "draft_position":"36",
     "draft_year":"2008",
     "current_salary":"8,250,000",
     "hof_induction_year":"None"
    }
   ]
  },
  {
   "Team 1":{
    "Name":"Patriots",
    "Points":"36"
   },
   "Team 2":{
    "Name":"Steelers",
    "Points":"17"
   },
   "comments":" The Patriots led 10-0 at the end of the first quarter, but the game was already decided by then. The Steelers lost one of their two elite play-makers, Le'Veon Bell, to a groin injury. Bell tried to return, as he played one snap in the second quarter, but he limped back to the sideline and wasn't seen from again. The Steelers had no chance with one of their three Killer Bs. Bell is arguably the top running back in the NFL, and he's a major part of the passing game. His absence completely ruined Pittsburgh's offensive game plan, and the team struggled to move the chains as a consequence. Bill Belichick is the master of erasing one aspect of a team's offense, and so with Bell out, he only had to focus on Antonio Brown. The stud receiver struggled to do much as a result of constant double teams, forcing Ben Roethlisberger to target some horrible receivers - Sammie Coates, Cobi Hamilton, Darrius Heyward-Bey - far too often. The end result happened to be tons of dropped passes and missed opportunities. New England's offense, meanwhile, did enough to get the victory. Thirty-six points isn't indicative of their overall performance, as they scored a free, quick touchdown following an Eli Rogers lost fumble, and they were very fortunate to retain possession following a Tom Brady lost fumble that should've been rewarded to Pittsburgh. However, the Steelers struggled to stop the Patriots on too many drives, and they probably would've lost to the Patriots regardless. This game would've been a lot closer with Bell on the field, though.    Tom Brady finished 32-of-42 for 384 yards and three touchdowns. He also fumbled, but despite the Steelers getting a clear recovery, incompetent officiating ruled New England possession without any sort of explanation. That was Brady's sole mistake of the afternoon, and his numbers would've been better if it weren't for a couple of drops. It really helped that Brady was seldom hit this evening. He took a sack early, but was barely touched after that. Brady will be heading to his seventh Super Bowl, and if he gets the win, he'll have the most championships of any quarterback in NFL history, breaking the current tie he has with Joe Montana and Terry Bradshaw.    Despite Brady's high yardage total, only three Patriots accumulated more han 13 receiving yards. They were Chris Hogan (9-180), Julian Edelman (8-118) and Martellus Bennett (5-32). Hogan secured two of Brady's three touchdowns, while Edelman snatched the other. Both made big plays in this game, obviously, but Edelman really sparked the team with a 12-yard conversion on a third-and-10 between two defenders, ultimately leading to a score.    The Patriots tried to run with LeGarrette Blount in the early going, but weren't very successful; his five first-half carries went for just four yards. However, the flu-stricken Steelers wore down in the second half, and Blount finished with 47 yards and a touchdown on 16 tries. His best run was when he managed to carry what appeared to be the entire Pittsburgh defense down to the 1-yard line. <div class=dfpAdSlots>    Back to the Steelers, Roethlisberger went 31-of-47 for 314 yards, one touchdown and an interception. While Roethlisberger accumulated a bulk of his numbers in garbage time, it's still amazing that he was competent when factoring in the utter trash he was throwing to. With Bell injured and Brown constantly double teamed, he had to resort to working with the aforementioned Coates, Hamilton and Heyward-Bey. The first drive saw Roethlisberger curiously take a deep shot to Coates on a third-and-1, which fell incomplete. Hamilton dropped a touchdown in the second quarter. Coates then did the same thing right after halftime. Heyward-Bey was responsible for Roethlisberger's interception, as he wasn't even aware the ball was heading in his direction. The Steelers could have Martavis Bryant back next year, but he needs to be reinstated. It's difficult for the Steelers to trust him, so they may target one of the in the early rounds. Roethlisberger desperately needs someone reliable to throw to outside of Brown.    Pittsburgh's two leading receivers were predictably Brown (7-77)and Rogers (7-66). However, Brown didn't do much when this game was in doubt, while Rogers was responsible for a lost fumble that gave the Patriots a quick touchdown, putting this game completely out of reach.    With Bell limited to just six carries (20 yards), DeAngelo Williams saw most of the workload. He had a nice, 15-yard burst, but didn't do much else. He was stuffed at the goal line on one occasion, when it's likely that Bell would've scored. Williams gained just 34 yards and a touchdown on 14 carries. Williams is a free agent, which is why I have the Steelers taking a running back in my . <div class=dfpAdSlots> <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span>   ",
   "players":[
    {
     "player_id":"1544",
     "name":"Martellus Bennett ",
     "position":"TE",
     "height":"6-7",
     "weight":"248",
     "current_team":"New England Patriots",
     "birth_date":"1987-03-10",
     "birth_place":"San Diego, CA",
     "death_date":"None",
     "college":"Texas A&M;",
     "high_school":"Alief Taylor, TX",
     "draft_team":"Dallas Cowboys",
     "draft_round":"2",
     "draft_position":"61",
     "draft_year":"2008",
     "current_salary":"900,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18994",
     "name":"Eli Rogers ",
     "position":"WR",
     "height":"5-10",
     "weight":"187",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1992-12-23",
     "birth_place":"Miami, FL",
     "death_date":"None",
     "college":"Louisville",
     "high_school":"Northwestern, FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"540,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"6236",
     "name":"Julian Edelman",
     "position":"WR",
     "height":"6-0",
     "weight":"198",
     "current_team":"New England Patriots",
     "birth_date":"1986-05-22",
     "birth_place":"Redwood City, CA",
     "death_date":"None",
     "college":"Kent St.",
     "high_school":"Woodside, CA",
     "draft_team":"New England Patriots",
     "draft_round":"7",
     "draft_position":"232",
     "draft_year":"2009",
     "current_salary":"3,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"9751",
     "name":"Darrius Heyward-Bey",
     "position":"WR",
     "height":"6-2",
     "weight":"205",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1987-02-26",
     "birth_place":"Silver Spring, MD",
     "death_date":"None",
     "college":"Maryland",
     "high_school":"McDonogh School, MD",
     "draft_team":"Oakland Raiders",
     "draft_round":"1",
     "draft_position":"7",
     "draft_year":"2009",
     "current_salary":"1,200,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"2240",
     "name":"Tom Brady ",
     "position":"QB",
     "height":"6-4",
     "weight":"225",
     "current_team":"New England Patriots",
     "birth_date":"1977-08-03",
     "birth_place":"San Mateo, CA",
     "death_date":"None",
     "college":"Michigan",
     "high_school":"Junipero Serra, CA",
     "draft_team":"New England Patriots",
     "draft_round":"6",
     "draft_position":"199",
     "draft_year":"2000",
     "current_salary":"1,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"24043",
     "name":"DeAngelo Williams",
     "position":"RB",
     "height":"5-8",
     "weight":"210",
     "current_team":"None",
     "birth_date":"1983-04-25",
     "birth_place":"Little Rock, AR",
     "death_date":"None",
     "college":"Memphis",
     "high_school":"Wynne, AR",
     "draft_team":"Carolina Panthers",
     "draft_round":"1",
     "draft_position":"27",
     "draft_year":"2006",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"18977",
     "name":"Ben Roethlisberger",
     "position":"QB",
     "height":"6-5",
     "weight":"240",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1982-03-02",
     "birth_place":"Lima, OH",
     "death_date":"None",
     "college":"Miami (OH)",
     "high_school":"Findlay, OH",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"1",
     "draft_position":"11",
     "draft_year":"2004",
     "current_salary":"12,000,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"8875",
     "name":"Cobi Hamilton",
     "position":"WR",
     "height":"6-2",
     "weight":"212",
     "current_team":"Houston Texans",
     "birth_date":"1990-11-13",
     "birth_place":"Texarkana, TX",
     "death_date":"None",
     "college":"Arkansas",
     "high_school":"Texas, TX",
     "draft_team":"Cincinnati Bengals",
     "draft_round":"6",
     "draft_position":"197",
     "draft_year":"2013",
     "current_salary":"190,590",
     "hof_induction_year":"None"
    },
    {
     "player_id":"10016",
     "name":"Chris Hogan ",
     "position":"WR",
     "height":"6-1",
     "weight":"220",
     "current_team":"New England Patriots",
     "birth_date":"1988-10-24",
     "birth_place":"Ramapo, NJ",
     "death_date":"None",
     "college":"Monmouth",
     "high_school":"Ramapo, NJ",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"2,500,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1465",
     "name":"Le'Veon Bell",
     "position":"RB",
     "height":"6-2",
     "weight":"230",
     "current_team":"Pittsburgh Steelers",
     "birth_date":"1992-02-18",
     "birth_place":"Reynoldsburg, OH",
     "death_date":"None",
     "college":"Michigan St.",
     "high_school":"Groveport Madison, OH",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"2",
     "draft_position":"48",
     "draft_year":"2013",
     "current_salary":"12,120,000",
     "hof_induction_year":"None"
    },
    {
     "player_id":"1890",
     "name":"LeGarrette Blount",
     "position":"RB",
     "height":"6-1",
     "weight":"245",
     "current_team":"Philadelphia Eagles",
     "birth_date":"1986-12-05",
     "birth_place":"Madison, FL",
     "death_date":"None",
     "college":"Oregon",
     "high_school":"Taylor Co., FL",
     "draft_team":"None",
     "draft_round":"None",
     "draft_position":"None",
     "draft_year":"None",
     "current_salary":"None",
     "hof_induction_year":"None"
    },
    {
     "player_id":"4121",
     "name":"Sammie Coates",
     "position":"WR",
     "height":"6-2",
     "weight":"213",
     "current_team":"Cleveland Browns",
     "birth_date":"1993-03-31",
     "birth_place":"Leroy, AL",
     "death_date":"None",
     "college":"Auburn",
     "high_school":"Leroy, AL",
     "draft_team":"Pittsburgh Steelers",
     "draft_round":"3",
     "draft_position":"87",
     "draft_year":"2015",
     "current_salary":"615,000",
     "hof_induction_year":"None"
    }
   ]
  }
 ]
}
