{
    "year": "2017",
    "week": "09",
    "Game 1": {
        "Team 1": {
            "Name": "Jets",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Bills came into this game at 5-2, having high hopes of achieving another victory over the Jets to tie the Patriots for the lead in the AFC East. They were favored following a blowout victory over the Raiders four days ago, so their focus was going to be a big factor against a divisional opponent that has been playing close games for most of the year. As it turns out, their focus clearly wasn't there, and they underestimated the Jets, who took advantage of numerous Buffalo mistakes. While the Bills were responsible for some turnovers and numerous missed tackles, their greatest problem was pass protection. The Jets, who recorded only 11 sacks on the year heading into this game, racked up seven sacks on Tyrod Taylor, a mobile quarterback. Taylor took five sacks in the opening half alone, as the Jets interior defensive linemen beat up on the pedestrian Buffalo right guard. Taylor never had a chance to find his receivers consistently downfield, so it wouldn't have even mattered had Kelvin Benjamin been playing. ",
            "2": "Taylor finished 29-of-40 for 285 yards and two passing touchdowns to go along with six scrambles for 35 rushing yards and a score on the ground. Stats can be misleading, however, and that's certainly the case in this situation. Taylor didn't play poorly, or anything; outside of a couple of dropped interceptions and a lost fumble late in the game, he did what he could. However, he just didn't have much of an opportunity to accomplish anything because of all the pressure he saw. Two of his touchdowns as well as a chunk of his yardage came in garbage time when the Jets were up 34-7. ",
            "3": "What's truly amazing about this result is what LeSean McCoy didn't do. McCoy mustered only 25 yards on 12 carries, and about half of that yardage (13) came on one burst. The Jets had surrendered at least 119 rushing yards to five of eight opponents this year, yet all McCoy could generate was 25 yards. Don't blame McCoy, however, as the blocking just wasn't there. McCoy had an opportunity to score a touchdown in the early going, but Taylor threw wide of him. ",
            "4": "The silver lining for the Bills is that rookie receiver Zay Jones has been a terrible disappointment thus far, but he thrived in this game. Jones caught six passes for 53 yards and a touchdown, with Tony Romo complimenting his route running. Jones appeared to suffer a brutal, non-contact knee injury in the opening half, but he returned to the field shortly afterward. Elsewhere, Deonte Thompson led Buffalo in receiving with seven catches for 81 yards and a touchdown. Most of this came in garbage time, however. Jordan Matthews (6-46), meanwhile, lost a fumble in the second quarter. Nick O'Leary (4-51) also coughed up the ball, doing so in Jets territory. ",
            "5": "On the other side of the ball, Buffalo's horrible tackling was most apparent on a 51-yard Bilal Powell run in the third quarter. Powell made a great cut after he stopped on a dime, but Buffalo still had an opportunity to bring him down without him sprinting downfield. Matt Forte later was able to benefit from a missed tackle as well, scoring a touchdown because of a Lorenzo Alexander whiff. Despite the long run, Forte outgained Powell, 77-74, doing so on five more carries (14-9). Eli McGuire was also mixed in for some reason, though he was far less effective (13-30). Forte also caught four passes, but didn't do much with them, generating 19 receiving yards. ",
            "6": "Josh McCown had an efficient performance, going 14-of-20 for 140 yards and two touchdowns (one passing, one rushing). McCown almost wanted to get off to a rough start, as he threw a pass right to cornerback Leonard Johnson. However, the Buffalo corner dropped what could've been the easiest interception of his life. ",
            "7": "Only three Jets accumulated double-digit receiving yards: Robby Anderson (4-48), Jermaine Kearse (2-38) and Austin Seferian-Jenkins (2-20). Anderson scored a touchdown, while Seferian-Jenkins also found the end zone, but had the score negated by offensive pass interference. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Falcons are now 4-4, but three of their losses have been by a combined 12 points. They've been close to winning, but have been off by just a bit. With that in mind, two plays in this game perfectly epitomized their season. The first play was on the opening drive. Matt Ryan had an open Julio Jones running free downfield. Ryan would've hit Jones if this were 2016, but he overshot the star receiver by just a bit. The second play came with eight minutes remaining in regulation. Ryan once again had Jones open in the end zone. He launched a pass toward Jones, and this time, it was perfect. Jones, however, returned the favor from earlier by dropping the ball. A catch there may have won the game for the Falcons, who scored a touchdown later in the fourth quarter to draw to within 20-17 rather than to take a 24-20 lead. The Panthers, meanwhile, look to be the team to challenge the Saints for the NFC South crown. There were some questions about how they would move the chains in the wake of the Kelvin Benjamin trade, but they did a good job of doing so in this contest, generating 330 yards of offense. A 20-point output may not seem like much, but the Panthers would've had better success on the scoreboard if it weren't for two turnovers in Atlanta territory. ",
            "2": "Cam Newton finished 13-of-24 for 137 yards. The passing numbers were underwhelming, but Newton made up for it with what he accomplished on the ground. Newton scrambled nine times for a team-leading 86 rushing yards. He also scored once as a runner. Newton had a nice performance overall, but his accuracy remains an issue. For example, he overthrew a wide-open Ed Dickson in the first half, and then he passed behind Christian McCaffrey for a potential passing touchdown. Newton missing McCaffrey wasn't a big deal, however, as Newton ran into the end zone on the next play. ",
            "3": "Speaking of McCaffrey, it seems very likely that the Panthers will continue to get him more involved based on what happened in this game. What happened was Stewart coughing up the ball twice. Stewart fumbled on two occasions in Atlanta territory, with both turnovers being forced by Keanu Neal. It seemed inexplicable that the Panthers would focus on pounding the ball with Stewart, given that they used the eighth-overall pick in the 2017 NFL Draft on a running back. Yet, that's what happened, and Carolina was penalized for it. McCaffrey was given more work in the second half - 13 touches following intermission, compared to seven beforehand - and it paid off. McCaffrey generated 66 rushing yards and a touchdown to go along with five catches for 28 receiving yards. Stewart, meanwhile, plodded for 21 yards on 11 attempts, with most of his yardage coming on a 9-yard burst. Stewart sucks at this stage of his career, so it's inexcusable for McCaffrey to lose any touches to him. ",
            "4": "Believe it or not, only one Panther logged more receiving yards than McCaffrey's 28. That was Devin Funchess, who played well; he hauled in five balls for 86 yards. Curtis Samuel (3-23) made a nice, 12-yard catch along the sideline. ",
            "5": "Going back to the Falcons, Ryan had a solid statistical performance - 24-of-38 for 313 yards, two touchdowns and an interception - but his day could've been much better if it weren't for the two aforementioned miscues with Jones in the end zone. Ryan's pick wasn't all his fault, as it was the result of a miscommunication with Austin Hooper (3-36). As for Jones, he caught six passes for 118 yards, but his fantasy owners have to be extremely frustrated with the two blown opportunities for touchdowns. Jones had a gritty game otherwise, as he kept coming in and out of the lineup with some sort of ankle injury. Jones looked like he was in pain, so he deserves credit for gutting it out. ",
            "6": "The Falcons had trouble running the ball versus the Luke Kuechly-led Panthers, with Devonta Freeman gaining 46 yards on 11 carries. Nearly half of his yards (20) came on one burst, and he was stuffed on a fourth-and-1 try that set up the Panthers with a touchdown on a short field. Tevin Coleman (5-5) didn't do anything. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Titans",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "Given Baltimore's offensive issues, the defense needed to step up in this game to give the team a chance. And that appeared to be the case for most of the afternoon. This was a 16-13 affair in the fourth quarter, with six of Tennessee's points coming off a botched Baltimore 17-yard punt that occurred following a penalty on Ravens rookie Tyus Bowser. Following the Ravens' sole touchdown of the afternoon, the stop unit had to force the Titans into a punt, or at the very least, a field goal. Instead, the defense looked helpless as the Titans marched down the field on a 75-yard touchdown drive, converting multiple third-down opportunities, to seal the victory. Marcus Mariota was terrific on the decisive possession. He hit Derrick Henry with a completion on a third-and-3, then fired a 25-yard strike to Delanie Walker to move into Baltimore territory. Following a 17-yard DeMarco Murray reception, Mariota escaped some pressure to find a wide-open Eric Decker in the end zone. Mariota finished 19-of-28 for 218 yards, two touchdowns and a careless interception in the fourth quarter. He threw well for the most part, but still didn't show that he has recovered from his hamstring. He scrambled just two times for seven yards. ",
            "2": "Speaking of formerly injured Titans, Walker and rookie receiver Corey Davis made their return to the field. They tied for second in targets with five each, with Walker outgaining Davis, 71-28. Davis was matched up against fellow rookie cornerback Marlon Humphrey. As for the Titans' leader in targets, that was Rishard Matthews, who secured four of the seven balls thrown his way for 70 yards and a touchdown. Matthews' sole blemish dropped pass in the second half. ",
            "3": "Murray, who also fits under the category of banged-up Tennessee players, missed some action in this game with an injury, though he returned to the field in the second half. Despite this, Murray had more carries than Henry, 9-8. Unsurprisingly, Henry generated more yardage than Henry, 26-19. Henry, who scored a touchdown, needs to get more work than Murray because he's just better at this stage of their careers. Still, neither had much running room against a Baltimore defense that has been better against ground attacks with Brandon Williams back in the lineup. ",
            "4": "The Ravens, meanwhile, had to throw 52 times because they trailed for most of the afternoon. Flacco completed 34 of those passes for 261 yards, two touchdowns and a couple of interceptions. The numbers are misleading, as Flacco's two scores came in the fourth quarter when the Titans took their foot off the gas. Flacco didn't have much of a chance because of poor protection, plus Breshad Perriman's incompetence didn't help. One of Flacco's picks occurred because Perriman showed alligator arms on a potential long completion. Flacco's other interception was the result of horrible mechanics on his part, as he heaved the ball off his back foot. ",
            "5": "Jeremy Maclin led the Ravens in receiving with eight catches for 98 yards. No other player topped the 50-yard mark. Ben Watson (7-41) had a decent outing, while Mike Wallace (4-19) was invisible until he found the end zone in the final minute. Perriman, meanwhile, caught three balls for 28 yards. In addition to being responsible for the interception, he also was guilty of a drop in Tennessee territory. The Ravens need to go back to the drawing board by finding a new wideout this upcoming offseason to pair with Maclin. Here are the 2018 NFL Draft Wide Receiver Prospect Rankings. ",
            "6": "Alex Collins had a terrific performance last Thursday, but was severely limited by the Titans, who restricted him to 43 yards on 13 carries. This wasn't too much of a surprise, as Collins took advantage of the Dolphins, who were lethargic in that game. Buck Allen (7-21) did some nice work as a receiver out of the backfield, logging seven receptions for 44 yards and a touchdown. Allen converted a fourth-and-2 in the opening half. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "51"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "Carson Wentz is one of the top two MVP candidates this year (Tom Brady), so despite his matchup against the vaunted No Fly Zone secondary, he was still able to put together a strong performance to lead Philadelphia to a blowout victory. The Eagles, now 8-1, are heading into the bye with an impending matchup against the Cowboys following the week off. What's scary about the Eagles is that they're only going to be better following their bye. Top cornerback Ronald Darby and Zach Ertz will be back from injury, while Jay Ajayi will have a better understanding of the offense, so he'll be a greater part of the scoring unit in the second half of the season. Eagles fans had a taste of Ajayi in this game when he broke free for a 46-yard touchdown burst right before halftime. True to his word, Doug Pederson limited Ajayi's workload, giving him eight carries compared to LeGarrette Blount's nine and Corey Clement's 12. Clement's attempts were the byproduct of garbage time, but there's no doubt that in a few weeks, Ajayi will handle more carries than Blount. Ajayi outgained Blount, 77-37. Ajayi's production was not a surprise, as he had success last year with the Dolphins when they had a strong offensive line. The Eagles, despite Jason Peters' injury, have one of the top fronts in the NFL, so Ajayi should be able to replicate what he was able to accomplish with Miami in 2016. ",
            "2": "Wentz, meanwhile, didn't seem to care that he was throwing into one of the top secondaries in the NFL. His yardage was low (199), but only because the Eagles didn't have to throw much as a result of being up 31-9 at halftime. Wentz carved up Denver's defense when he had to, going 15-of-27 with four touchdowns. One of his scores was a perfect back-shoulder toss to Trey Burton. ",
            "3": "Speaking of Burton, I wrote that I liked him as an emergency play with Zach Ertz ruled out 90 minutes prior to kickoff. I expected more than two catches for 41 yards, but the touchdown helped. Meanwhile, Clement and Alshon Jeffery had Wentz's other scores, with the latter finding the end zone twice. Jeffery led the Eagles in receiving with six grabs for 84 yards, but was guilty of a couple of drops, one of which ruined a scoring opportunity right before halftime. ",
            "4": "Moving on to the Broncos, it was another rough game for them, as they couldn't generate any semblance of offense. Ignore the 23-point total; the Eagles were up 44-9 when they pulled Wentz. Denver scored a touchdown in garbage time, and then the defense reached the end zone on a strip-six when Von Miller forced the ball out of Nick Foles' hands. The Broncos are just a fundamentally flawed team because they can't block. They have only one viable offensive lineman in Ronald Leary, so they simply couldn't pass protect against Philadelphia's dominant pass rush. ",
            "5": "Brock Osweiler completed only half of his passes, going 19-of-38 for 208 yards, one touchdown and a couple of interceptions. A chunk of Osweiler's stats came in garbage time, as he had just eight completions in the opening half. Osweiler was a mess, as he easily could've been picked on a couple of other occasions. For instance, Rasul Douglas nearly had a pick-six on the opening drive. Osweiler's only interception in meaningful action occurred when he locked in on his receiver and didn't seem to care that there was a defender to make the play. This turnover set up the Eagles with an early touchdown. The Broncos had some good times with Osweiler back in 2015, but it's clear that he's not the answer. Trevor Siemian isn't either. Paxton Lynch should be back next week, and the Broncos need to see what they have in him. That said, it probably won't matter, as the Broncos are intently scouting quarterbacks, according to Charlie Campbell. ",
            "6": "Emmanuel Sanders returned from injury this week, but he might as well have taken the game off. Sanders caught just one of his five targets for 30 yards, and he dropped a pass on third down. Demaryius Thomas, meanwhile, hauled in eight balls for 70 yards and a touchdown. ",
            "7": "Devontae Booker led the Broncos in rushing, partly because C.J. Anderson missed about a quarter with a hip injury, as he twisted awkwardly on a first-quarter carry. Anderson mustered only 13 yards on nine attempts. He also dropped a pass. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Jaguars came into this game with Leonard Fournette being deactivated an hour-and-a-half prior to kickoff because he missed some team events. This apparently did not matter at all. Despite Fournette's absence, Jacksonville was able to control possession and dominate a Cincinnati defense that played with no energy. When I say that Jacksonville controlled possession, I mean it. The Jaguars held the ball for 40 minutes in this game, and it was even worse in the opening half, when Jacksonville's offense was on the field for 21:27 of the 30 minutes. Jacksonville somehow converted third down after third down - the team was 12-of-18 on third downs - as the horrible Bengals just couldn't get off the field. ",
            "2": "Blake Bortles somehow wasn't horrible in this game, as Cincinnati inexplicably couldn't generate any sort of pass rush on him. Bortles went 24-of-38 for 259 yards and a touchdown. He missed some throws, including a potential touchdown to a wide-open Marcedes Lewis, and he had a couple of potential interceptions dropped, so don't think that Bortles played well. He just wasn't terrible, though he's sure to regress against defenses that actually show up to play. ",
            "3": "With Fournette out, the Jaguars had Chris Ivory and T.J. Yeldon split the workload. Ivory had more attempts than Yeldon, 20-11, which may not have been the case had Yeldon not lost a fumble on the opening drive. Ivory outgained Yeldon, 69-41, and he also caught three passes for 34 receiving yards. ",
            "4": "Jacksonville's primary receiver was Marqise Lee, who hauled in eight of his 12 targets for 75 yards and a touchdown. Keelan Cole (3-47) didn't have the best stat line, but he made a sick, one-handed catch on a third-and-10 in the opening quarter. ",
            "5": "As for the Bengals, you can see that their stats were suppressed because of the lost time-of-possession battle. Dalton was just 10-of-18 for 136 yards. Considering that Cincinnati trailed throughout, it's an indication that the Jaguars dominated the clock. While Cincinnati's defense couldn't get off the field, the offense struggled to keep drives alive, converting only 1-of-8 third-down attempts. The Bengals simply couldn't block Jacksonville's front. ",
            "6": "Only two Bengals generated more than 15 receiving yards: Tyler Kroft (2-79) and Brandon LaFell (2-28). A.J. Green, who had just one catch, was limited because he, along with Jalen Ramsey, were ejected for throwing punches in a second-quarter brawl. Kroft's big play was a 59-yard gain to set up Cincinnati's only touchdown, a Joe Mixon run. He was able to make the big play because two Jacksonville defenders collided while trying to make the tackle. ",
            "7": "And speaking of Mixon, the rookie runner found no room, as he was limited to just 31 yards on 13 carries, though he did score the aforementioned touchdown to help his fantasy owners. Jeremy Hill was not active. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Rams",
            "Points": "51"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Giants were discombobulated heading into the game, thanks to numerous injuries and a Janoris Jenkins deactivation for violating team rules, and they certainly played like it in this blowout loss. Both Eli Manning and the defense made numerous mistakes in what turned out to be a blowout victory for the Rams. It began right away when the Rams turned two Giants turnovers into a pair of touchdowns. Aaron Donald strip-sacked Manning, which led to Goff throwing a short touchdown to Tyler Higbee. Wayne Gallman then coughed the ball up, and Los Angeles took over. It appeared as though nothing was going to materialize, as the team was stuck in a third-and-33, but Goff lobbed a short toss to Robert Woods in the slot, and Woods ran the distance for 52 yards, thanks to Landon Collins taking a horrible angle on the play. If that wasn't bad enough for the Giants, the Rams scored once again on a long play, with Goff hitting Watkins with a 67-yard bomb. Watkins was wide open because Eli Apple blew the coverage. And just like that, the Rams carried a 27-10 lead into halftime, and New York couldn't muster anything in the second half because of the team's severe limitations. ",
            "2": "Goff finished 14-of-22 for 311 yards and four touchdowns. He was excellent once again, taking advantage of a New York defense missing numerous key players. In addition to Jenkins, Olivier Vernon and top linebacker B.J. Goodson were both out, and Goff had a terrific performance as a consequence. ",
            "3": "Given that Woods and Watkins both had big gains of 50-plus yards, it's not a surprise that they led the team in receiving. Woods caught four balls for 70 yards and two touchdowns, while Watkins' 67-yard score was his only reception. Cooper Kupp (3-54) had a solid outing. ",
            "4": "Todd Gurley didn't have much room on the ground for most of the afternoon, but he was able to break free for a 36-yard burst in the opening half. Gurley had an underwhelming rushing line - 16 carries, 59 yards - but he scored twice and also caught two passes for 45 receiving yards. ",
            "5": "Meanwhile, the Giants were guilty of more turnovers than the ones I referenced earlier. Eli Manning nearly had a couple of other turnovers late in the second quarter. He was picked off, and then fumbled the ball when Donald hit him again, but was very fortunate that the ball bounced back to him. Manning had an opportunity to take advantage of the lucky bounce, but overthrew Tavarres King twice for a couple of potential scores. Manning finished 20-of-36 for 220 yards, two touchdowns (one in garbage time) and an interception. Manning played poorly, though he wasn't helped with numerous drops. That said, it was irresponsible of the Giants not to dress rookie quarterback Davis Webb. The fourth quarter would've been a perfect opportunity to give Webb a look, but Geno Smith attempted a couple of passes instead. ",
            "6": "Sterling Shepard led the Giants with five catches for 70 yards. However, he didn't have a solid performance, as he dropped a couple of passes. Most of his yardage came in garbage time. Elsewhere, Evan Engram (4-70) and King (3-33) both caught touchdowns. Engram's score came in meaningless action, but I'm sure his fantasy owners won't complain. ",
            "7": "Orleans Darkwa could've eclipsed the century mark with a full workload, but had 71 yards on just 16 carries. Gallman (9-41) had some opportunities, but was guilty of the aforementioned fumble. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Colts",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: The Texans were favored by 13 with Deshaun Watson. They ended up losing by six. Does that mean Watson is worth 19 points? Seems crazy, but that's probably the case, considering how bad Tom Savage is. The real winner of this game was the Cleveland Browns, as they hold Houston's first- and second-round picks in the 2018 NFL Draft. With the Ravens and Jaguars getting wins, the Texans' loss to the Colts puts their postseason hopes on life support. As expected, the season-ending injury to Deshaun Watson was a death blow to Houston after losing J.J. Watt and Whitney Mercilus, but that was given further evidence as backup quarterback Tom Savage was awful for three quarters. The Texans look poised to produce some high picks for Cleveland after sustaining those injuries. The Colts were finally able to finish off a game, and got a close win, their third of the season. However, Indianapolis has no playoff hopes with Andrew Luck out for the year, so each victory just hurts the team's draft position. ",
            "2": "The Colts struck first, as T.Y. Hilton got wide open in busted coverage for a 45-yard touchdown with a well-thrown pass from Jacoby Brissett. In the second quarter, another completion to Hilton set up a field goal and a 10-0 lead for Indianapolis. The Texans missed a field goal to spoil a drive, and that turned out to be a huge play in the game as the Texans had to go for a touchdown late in the fourth quarter rather than a game-tying field goal. Brissett was rocked on a blitz by Eddie Pleasant during the 2-minute drill at the end of the first half, forcing a fumble. Lamarr Houston scooped up the loose ball and returned it 34 yards for a Houston touchdown. The Colts took a 10-7 lead into the locker room. Hilton got loose again in the third quarter, as Brissett hit him on the run. After breaking free downfield, Hilton leapt over Kareem Jackson. Hilton got up and ran another 30 yards for a touchdown, and the officials ruled that Jackson didn't touch him, so Hilton scored on an 80-yard touchdown. Down 20-17, the Texans finally got moving on a drive that ended with a 34-yard touchdown pass to DeAndre Hopkins. Houston's defense got Savage one more chance, and he moved the ball down the field inside the Colts' 10-yard line with completions to Bruce Ellington, Stephen Anderson and Hopkins. In the final seconds, the Colts put together a goal-line stand that ended with Jabaal Sheard's second strip-sack of the game to clinch the win for Indianapolis. ",
            "3": "Brissett completed 20-of-30 passes for 308 yards with two touchdowns. Hilton had five receptions for 175 yards and two scores. ",
            "4": "Frank Gore ran for 51 yards on 17 carries with three receptions for 26 yards. ",
            "5": "Savage completed 19-of-44 passes for 219 yards with a score. Hopkins had six reception for 86 yards and a score. Will Fuller (2-32) was limited without Watson at quarterback. ",
            "6": "Lamar Miller had 57 yards on 10 carries with three receptions for 34 yards. ",
            "7": "Defensively, Jabaal Sheard had two sacks, with each resulting in a fumble. He had his way with Julie'n Davenport and Chris Clark, the Texans' replacements for Duane Brown. Jadeveon Clowney played well for Houston with a sack and numerous pressures. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Saints",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "10"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: Enough's enough. It's time to fire Dirk Koetter. The Buccaneers don't look like they're prepared for any of their games. It's a miracle they have two victories. ",
            "2": "This game was a blowout from the start. The Buccaneers never stood a chance against the Saints, and it was apparent from the first whistle. New Orleans came away with its sixth straight win, while the Buccaneers came away with a lot of questions. Many of the questions are surrounding quarterback Jameis Winston. The third-year pro was expected to make the leap this year, but that hasn't happened yet. Against the Saints, he demonstrated that he wasn't ready to compete, though that could be due to injury. Winston played only the first half of the contest against the Saints. He went out just before halftime after being driven into the turf on a hit from a defender. Winston aggravated the shoulder injury that has been troubling him in recent weeks. Still, when he was on the field, he wasn't particularly good. Winston only went 7-of-13 for 67 yards. He didn't have the same arm strength that we're accustomed to seeing from him, and he was limited to short passes for most of the day. This was probably due to his shoulder injury, which has been bothering him for weeks. At the same time, Winston just doesn't look comfortable in the pocket and has held the ball for too long repeatedly as he tries to do too much on most plays. That was on display Sunday, as he took two sacks and made some risky throws. Despite being out for the second half, Winston did have an impact on the game. It happened to be a negative one. In the third quarter, Winston came off the bench to poke fun at Saints rookie Marshon Lattimore. Literally. Winston poked him in the back of the helmet, and Lattimore took exception to it. Lattimore shoved the Tampa quarterback, which prompted outrage from the other Buccaneers. Mike Evans came over and decked Lattimore from behind on what was a dirty play. Somehow, the referees didn't eject Evans in a move that was extremely incompetent. After all this, Sean Payton was rightfully livid. ",
            "3": "In Winston's stead, Ryan Fitzpatrick was predictably pedestrian. He went 8-of-15 for 68 yards and a garbage-time touchdown. He scrambled for 30 yards as the Saints were content to let him run the ball. Fitzpatrick, realistically, did little to help keep the Bucs afloat. ",
            "4": "Due to the issues the Bucs had at quarterback this week, the receivers had trouble getting anything going. Evans (1-13) saw the most targets with six, but he made little impact on the offense. He was too focused on decapitating Saints defenders and was never able to break free from the solid Saints corners. Meanwhile, DeSean Jackson was the second-leading receiver, generating 25 yards on two catches. He had some nice looking routes, but he won't be a trustworthy fantasy play until Winston is fully healthy. ",
            "5": "The only touchdown of the day went to Luke Stocker. He's a third-string tight end and only saw action due to the blowout. ",
            "6": "The running offense was virtually non-existent for the Bucs. Doug Martin saw eight carries and only was able to total a measly seven yards. The team actually abandoned him and rolled with Peyton Barber. The former undrafted free agent out of Auburn totaled 34 yards on 11 carries and looked more athletically gifted than Martin. However, he's not a recommended add in fantasy, as Martin is likely to hold onto the starting role despite the poor performance. ",
            "7": "For the Saints, this was a huge divisional win. They managed to win their sixth consecutive game and proved that they are the class of the NFC South. New Orleans' offensive leader on Sunday was running back Alvin Kamara. The rookie out of Tennessee was an electric play-maker and was reminiscent of a bigger version of Darren Sproles. Kamara did a lot of damage as a receiver, and in the first half, he had one of the best touchdowns of the year. Kamara caught a dump-off pass and managed to weave in and out of the defense for a 33-yard touchdown. He broke multiple tackles en route to the end zone, and that helped to spark the Saints' scoring outburst. Kamara finished with six catches for 84 yards and a touchdown, and on the ground, he had 10 carries for 68 yards and a touchdown. The Saints will continue to heavily involve him on offense moving forward, as he is clearly one of their most dangerous weapons. Mark Ingram had a nice performance on Sunday as well. He ran the ball 16 times for 77 yards. He played second fiddle to Kamara as a receiver, but he should still have a chance to see many carries each week. ",
            "8": "In the passing game, the Saints also found a lot of success. Drew Brees had one of his most efficient performances of the season. He was very accurate for most of the day and performed very well in the second half. Brees was able to do a lot of damage thanks to near-perfect ball placement and his ability to move around the pocket. Brees was surprisingly mobile today, and he had some very nice throws on the move. On one instance, he hit Coby Fleener on a pass over the middle of the field where he threw a bit across his body. Brees knew exactly what he had to do to make the play, and he got the job done. Brees' one mistake was missing Ted Ginn Jr. on an open downfield pass. Ginn had beaten the defense and was heading straight for the end zone. Brees just overshot him by a couple yards. It was a simple mistake and a throw that Brees wishes he could have had back, but it had minimal impact on the end result. Brees finished 22-of-27 for 263 yards and two touchdowns. ",
            "9": "Brees' favorite receivers on Sunday were Michael Thomas (8-65) and Ginn (4-59, 1 TD). Thomas should continue to be a WR2 in fantasy, though his touchdown production hasn't been quite as good this season. He is the top option for the Saints' passing attack, and he should do well down the stretch. Ginn had a long touchdown this week, and is a potentially game-breaking athlete who could serve as a boom-or-bust FLEX play most weeks. He's not usually a recommended start, but he can be stashed on a bench as a depth guy. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "EDITOR'S NOTE: I know that the 49ers host the Giants next week, but if they couldn't beat Drew Stanton at home, I don't think they'll be able to beat anyone. This looks like 0-16 to me. ",
            "2": "The Cardinals' trade for Adrian Peterson paid off again, with the veteran back carrying them to a road win in San Francisco. This win puts the Cardinals at 4-4 and keeps them in the playoff chase. The 49ers fell to 0-9, but maintain their draft position for the 2018 NFL Draft. ",
            "3": "Early in the first quarter, Cardinals quarterback Drew Stanton hit John Brown for 52 yards (his only catch), but Phil Dawson missed a short field goal for Arizona. The 49ers then gifted Arizona some points as Kyle Juszcyk was stripped by Tyrann Mathieu and the loose ball was scooped up by Patrick Peterson for a return to inside the 49ers' 10-yard line, which set up the Cardinals' offense. Stanton found Jaron Brown alone in the end zone for a short touchdown a few plays later. The 49ers got moving when Marquise Goodwin ran by Mathieu to make a 55-yard reception, and that set up a Robbie Gould 42-yard field goal. Arizona answered with Adrian Peterson leading the way down the field. To cap the drive, Jermaine Gresham (2-23-1) snatched a touchdown in front of Akhello Witherspoon to put Arizona up 14-3. The Cardinals were led by Adrian Peterson and Larry Fitzgerald down the field for more points, but Eric Reid outfought Gresham on a jump ball in the end zone for an interception. That kept the 49ers down by 11 entering the half. The 49ers got moving in the third quarter when C.J. Beathard hit wideout Kendrick Bourne (2-39) for 25 yards and Goodwin for 13 yards. The drive finished with Beathard, taking a short read-option run into the end zone. Twice in the fourth quarter, Arizona got field goal on a drives led by Peterson and Fitzgerald to take a 20-10 lead. The Cardinals were in position to salt the game away midway through the fourth quarter, but Peterson fumbled the ball away. After a hit going to the head of Beathard, a big fight erupted between the two teams with punches thrown. Frostee Rucker, Haason Reddick and Carlos Hyde were all ejected. Hyde's loss hurt as he was really hurting Arizona's defense as a receiver. The 49ers moved close to the end zone, but then a deflected pass was picked off by Karlos Dansby to clinch the win for the Cardinals. ",
            "4": "Peterson totaled 159 yards on 37 carries for Arizona. The Cardinals wisely leaned on him rather than the pedestrian Stanton. Stanton was 15-of-30 for 201 yards with two touchdowns and one interception. Fitzgerald caught five passes for 70 yards. ",
            "5": "Beathard was 24-of-51 for 294 yards with an interception. He was pounded as the 49ers' offensive line really struggled to keep defenders from hitting their quarterback. Hyde had 41 yards on 12 carries with nine receptions for 84 yards before getting ejected. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "14"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: The NFL really needs to come out and explain when there happens to be a 10-second run-off, or not. I thought Seahawk fans would pelt the field with beer bottles when a call at the very end was reviewed. There was no 10-second run-off, mysteriously, which has to make the Detroit fans feel pretty s***ty right now. ",
            "2": "This was an absolutely crazy game. For the first three quarters, it was a great defensive battle that saw both quarterbacks struggle. But in the final quarter, it became an offensive shootout that saw the Redskins strike last. The Seahawks probably should have won this one, but the Redskins, in spite of all their injuries, pulled out a miracle. The main party to thank for the Redskins' victory, aside from Blair Walsh and his three missed field goals, was the team's defense. Greg Manusky had his beat-up unit ready to go on Sunday afternoon. Despite missing three starters from the front seven in Jonathan Allen, Mason Foster and Matt Ioannidis, the team was able to contain Russell Wilson for most of the day. Washington was able to consistently put pressure on Wilson thanks to the efforts of the front four and linebacker Zach Brown. Brown was the best performer on the field for either side. Excelling against the run and spying on Wilson late in the game, Brown racked up 11 tackles and a sack, and was able to hit the quarterback multiple times. Brown was all over the field, and his energy rubbed off on the rest of the defense, which did well to limit the strong Seattle offense. ",
            "3": "On the offensive side, the Redskins can thank Kirk Cousins for the win. In the first 58 minutes of the contest, the team was barely able to do anything on offense. The run game was going nowhere, and the receivers were having trouble stepping up against the Seattle secondary. And with the Redskins down by four with just a couple minutes left, things looked hopeless. However, Cousins delivered with one of his best drives of the season. The possession only lasted four plays. After initially tossing an incompletion, Cousins connected on a throw to Brian Quick for 31 yards. It was a perfectly thrown ball despite the fact that he was under pressure, and that really gave the team momentum. The next play was another perfect throw to Josh Doctson, who had a step on his man. Doctson rolled to a stop at the 1-yard line. After Rob Kelley punched the ball in on the next play, that was all she wrote. Cousins was able to do this despite having four missing offensive line starters. He did this despite the pressure. He really delivered when it mattered. Though his final stat line may look only decent, 21-of-31 for 247 yards, he really helped to carry the Redskins to victory at the end of the day. Cousins deserves a lot of credit for this surprising win. ",
            "4": "Cousins' top targets on Sunday were Vernon Davis (6-72) and Josh Doctson (3-59). Davis filled in admirably for Jordan Reed and showed that he still has the athletic ability that once made him a major weapon. As long as Reed is out, Davis can be started as a low-end TE1. If he is available in your league, make sure to pick him up. Meanwhile, Doctson did most of his damage on the 38-yard pass on the final drive of the game, but it's clear that he's becoming a bigger part of the team's offensive system. Doctson can be added, and in certain matchups, he can be used as a FLEX. Elsewhere in the pass game, Terrelle Pryor (2-17) disappointed again, while Brian Quick (3-49) looked good when on the field. Pryor can be dropped in all leagues, while Quick is a player to monitor given his veteran status. ",
            "5": "As mentioned earlier, the Redskins didn't do much on the ground. Kelley got 14 carries, but only managed 18 yards, though he did score twice. Chris Thompson was more explosive, gaining 20 yards on four carries, but he didn't see much work in the red zone. ",
            "6": "For the Seahawks, this was a crushing loss. They were expected to manhandle the Redskins, and they just didn't have it from the start. The only reason Seattle was able to stay competitive was due to the performance of Russell Wilson. Wilson had a superb performance considering everything that he had to deal with in this contest. For the entirety of the game, his weak offensive line allowed pressure onto him. New left tackle Duane Brown was supposed to help solidify the unit, but the other pieces are still big weaknesses. The Seahawks have to look into getting Wilson offensive line help in the offseason if they want to be competitive. Despite the pressure that Wilson saw on every play, he was able to find space and make plays. He showcased his scrambling ability quite a lot, and he finished the day with 77 yards on 10 carries. Wilson really did well to know when to get out of the pocket. A less-mobile quarterback would have been sacked 10 or more times. In terms of passing, Wilson did everything he could to help his team. He had a couple of overthrows on deep balls, but again that was due to issues that his offensive line had in protection. But for the most part, Wilson was able to find his receivers when they were open. He had a few mistakes, and none were worse than the interception he threw when he didn't see Will Compton in underneath coverage. Overall, Wilson went 24-of-45 for 297 yards, two touchdowns and two interceptions. The stat line isn't quite indicative of how he played. He was better than the numbers show, and his offensive line is to blame for some of his performance. ",
            "7": "Wilson's top receivers in this contest were Doug Baldwin (7-108, 1 TD) and Jimmy Graham (5-59). Baldwin had the key, go-ahead touchdown catch that looked to seal the game for the Seahawks late. He was once again Wilson's top target and given the state of the Seattle offense, he looks like a WR1 every week henceforth. Graham had one scary moment when he bent in an awkward way on a horse-collar tackle, but he returned and was a threat over the middle. He is a TE1 every week as well. In terms of other receivers, Paul Richardson (3-41) made a couple of good catches while Luke Wilson (1-10) caught the team's other touchdown. Tyler Lockett (2-10) was largely a non-factor and disappointed fantasy owners. ",
            "8": "The Seahawks spent a good chunk of the first half trying to get their run offense going. Eddie Lacy saw six carries and totaled 20 yards before getting hurt. Thomas Rawls was the better of the two backs today, as he got nine carries for 39 yards. Rawls looked more athletic, and if he's finally healthy, he could have an impact on the team. J.D. McKissic handled the passing role and 26 scrimmage yards. As long as this is a committee, none of Seattle's backs are viable options as starters in fantasy. ",
            "9": "As mentioned earlier, Walsh whiffed on three field goals, missing from 49, 48 and 35. Walsh's confidence could be shattered, so the Seahawks may opt to look for another kicker this week. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: Everyone will laugh at Kansas City's potato-sack celebration, but the fact remains that the Chiefs didn't score after that demonstration. That makes it seem stupid in hindsight. I'm probably in the minority, but I'm not a fan of these touchdown celebrations. At the risk of sounding like an old, fat man, I just want the players to play the damn game. ",
            "2": "Ezekiel Elliot didn't look like he'd be eligible to play this week. But after getting his third stay from suspension on Friday, just two days before the game, he was thrust back, which in the end, likely gave Dallas enough of an edge to prevail. The Cowboys got off to an early lead as Prescott completed 6-of-7 passes for 53 yards, ending in a six-yard touchdown pass to Cole Beasley, giving them a 7-0 advantage. Beasley amazingly caught yet another touchdown to help seal the game away in the fourth quarter, and now has two two-touchdown games in his last four games. He only has 165 receiving yards on the season, but his nose for the end zone lately has been a big help to this offense. ",
            "3": "With just a minute and 44 seconds left in the first half, Prescott completed a 21-yard first down to Dez Bryant on 3rd-and-15, and on the next play, hit Terrance Williams for a 51-yard big gainer. Prescott then finished that drive off with a great 10-yard touchdown run to give his team a 14-3 lead with just 13 seconds remaining. This is where you can say, fairly confidently, that Prescott is this team's MVP. Yes, Elliott is a much-needed piece to this offense and the Cowboys will lose games because he isn't playing, but without Prescott, this team is dead in the water. So, on we go to the second half! Wait, there's still a few clicks on the clock and the Chifes have the ball at their 37-yard line with nine seconds remaining. Dallas goes into a deep, prevent defense, so deep that seven defensive backs are hovering around the goal line, which sets up one of the crazier plays of the week. Smith takes the snap and has no real pass rush to deal with, while Tyreek Hill runs to the middle of the field, catches an easy pass with nobody to meet him other than his teammates setting up to block. From there, they work their way down the field, Demarcus Robinson makes a couple of beautiful blocks and Hill uses his speed to go into the end zone, easy-peasy. It was truly one of the dumbest defensive efforts ever by a professional football team. That touchdown made the game 14-10 Dallas, and then on his first drive of the second half, Alex Smith led his team down the field and hit Travis Kelce for a 2-yard touchdown to give Kansas City a 17-14 lead, and we had a game! In that short time frame, we saw some of the best, worst and most exciting football of the season. At this point, Elliott hadn't done much, but in response to giving up 14 quick points, this Cowboys offense began to force their will a bit more with the running game, and moved down the field and responded with a two-yard touchdown run by Elliott to take a 21-17 lead, which they wouldn't relinquish. ",
            "4": "Alex Smith ended up throwing his first interception of the season, trying to bring his team back, giving him 18 touchdowns to just one pick on the season. That's amazing, considering he's thrown more 20-plus-yard completions so far, this season, than he did all of last season. This loss wasn't on Smith's shoulders. The Kansas City defense deserves much of the blame. The Chiefs usual bend-but-don't-break play was broken by Prescott. Kansas City couldn't get him off the field, especially in the second half. In the end, Dallas was able to convert on 7-of-12 third downs. The Chiefs also have some questions that need to be answered about their offense. Why did Kareem Hunt run the ball just nine times, and why did Tyreek Hill see just four targets? The answer is likely to be the offensive line, which was not at its best despite being healthy. And as the run game has declined, so have Kansas City's wins. After getting off to a 5-0 start, the Chiefs have now lost three of their last four games, and a lack of strong ground game has been a big part of those losses. ",
            "5": "The Cowboys should be riding high after a big win like this, which took them to 5-3 on the season, but there's a strong chance that Elliott will finally have to serve his six-game suspension. I have no idea, but that does seem to be the way of the prevailing winds right now. This game by Prescott should at least give Dallas fans some hope though. Elliott rushed 27 times for 93 yards and a touchdown, but didn't see a target. That 3.4 yards per carry can probably be garnered from Alfred Morris and friends, and Prescott will take the lead. At least we'll really get to see just how good Prescott can be without Elliott, which I'm betting is pretty darn good. ",
            "6": "Dez Bryant left this game with an ankle injury, but said afterward that he was just sore and bruised. We'll see where he is next week against Atlanta, but for now, it looks like he could be ready. ",
            "7": "Terrance Williams did more than just bring in that 51-yard pass to set up Prescott's rushing touchdown; he ended up catching all nine of his targets for 141 yards, the most in his career and the most since Week 1, when he gained 68 yards. Unfortunately, he did hurt his knee late in the game, but there isn't much info just yet. ",
            "8": "Kansas City will get a bye next week and then face the crumbling Giants on the road, while Dallas takes on Atlanta on the road, in what will be an important NFC matchup for both teams. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Raiders, at 3-5, desperately needed a victory in this game to stay alive in the playoff race. Though it wasn't the prettiest effort, they managed to defeat the Dolphins to pull within one game of .500 again. With the Chiefs suddenly struggling, Oakland remained in play for a divisional crown. Derek Carr focused on getting Jared Cook involved as much as possible, which was a terrific plan. The Dolphins have struggled against tight ends all year, thanks to Kiko Alonso's inability to cover. Cook repeatedly abused Alonso throughout the evening. He caught three passes on the opening drive alone, converting a pair of third-and-9s. Cook ended up hauling in eight receptions for a whopping 126 yards, converting all but one pass thrown his way. With Carr having such a reliable target, it's no surprise that he misfired on just eight occasions, with two of the incompletions being drops. Carr finished 21-of-30 for 300 yards, a touchdown, which was a deep shot to Johnny Holton, and an interception on a careless heave with two minutes remaining in the game. Carr's one big mistake, aside from the pick, was a lost fumble on a third down. Right tackle Marshall Newhouse actually picked up the ball and ran a bit, but fumbled after taking a hit to the leg. The Dolphins recovered the ball in favorable field position early in the fourth quarter as a result, but couldn't do anything with the possession. ",
            "2": "Carr's two drops were by Michael Crabtree and Amari Cooper. Despite the great matchup, neither receiver produced very much. Cooper caught just four balls for 58 yards, while Crabtree reeled in three passes for 40 yards. Crabtree did, at least, draw a pass interference in the end zone to set up a Marshawn Lynch touchdown. ",
            "3": "Speaking of Lynch, he had trouble finding room to run in the early stages of the game - just eight yards on five carries in the opening half - but he eventually found some holes versus a Miami defense that was tired following intermission because the unit was on the field for a long time. The Raiders converted 8-of-15 third downs and maintained possession for a big chunk of time entering the fourth quarter. This allowed Lynch to gain 57 yards on 14 carries, scoring twice in the process. ",
            "4": "As for the Dolphins, their offense moved the chains well and looked good overall when they weren't being penalized. It seemed like every other drive featured a holding penalty, however, especially when a big play was involved. Some of the calls were legitimate, as they were a byproduct of a poor offensive line trying to block, but some of the infractions were ticky-tack and should've been let go by an overzealous officiating crew led by the corrupt Terry McAuley. Despite all the infractions, Jay Cutler went 34-of-42 for 311 yards and three touchdowns. This was a great performance considering the offensive line woes and countless holding infractions. Cutler didn't make any mistakes, which is a rare occurrence for him. ",
            "5": "As with the Raiders, the Dolphins made sure to abuse Oakland's linebackers by targeting their tight end extensively. Julius Thomas caught six passes for a team-high 84 yards and a touchdown. DeVante Parker (5-76) was next on the receiving chart, while Jarvis Landry (6-32) caught a touchdown. Parker made an amazing, one-handed grab in the fourth quarter to set up the covering score. ",
            "6": "In the wake of Jay Ajayi's departure, Kenyan Drake and Damien Williams split touches. Drake had more carries than Williams, 9-7, and outgained him 69-14, thanks to a 42-yard burst. However, Drake hurt his team with a lost fumble in the red zone when Miami led 6-3. Instead of taking control of the game, the Dolphins saw the Raiders capitalize with a score of their own following the turnover. Drake and Williams caught six passes each for 35 and 47 yards, respectively, with Williams scoring once aerially. Williams also had a long reception negated by a Landry hold. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Lions",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Lions were coming off a deflating loss to the Steelers last Sunday night in which they made countless mistakes in the red zone. Their issues close to the goal line still haven't been resolved, but they were at least able to demolish the Packers to improve to 4-4. Matthew Stafford torched the Packers mercilessly. Despite playing behind a practice squad-caliber left tackle, Stafford found all of the open receivers with pin-point accuracy throughout the entire evening. He was especially lethal on third down, as he was able to convert 8-of-13 attempts in those situations. The Lions, as a result, scored on every single possession, save for a drive that concluded with an Ameer Abdullah lost fumble, and an instance in which Matt Prater was a tad short on a long field goal. Detroit was also helped by an early Mike Daniels personal-foul penalty on a third-and-15 incompletion, which negated a punt. The Lions would end up scoring on the drive, and they didn't even punt throughout the entire game! Stafford finished 26-of-33 for 361 yards and two touchdowns. He couldn't have played better in between the 20s, but made a poor fade toss in the end zone. He was also stuffed on a third-down try at the 1-yard line. Detroit absolutely needs to improve its red-zone offense if it's to make the playoffs, but the action in between the 20s was good enough for this matchup. Stafford's ability to convert third downs and maintain drives was devastating for the Packers, who didn't have many drives as a consequence. The Lions held the ball for 36:55 of the final 52 minutes of the game. ",
            "2": "Part of the problem in the red zone is the lack of a running game. Abdullah, who lost a fumble earlier in the contest, coughed the ball up again in the fourth quarter, though a teammate of his recovered it. Abdullah was promptly benched, and his night ended with just 48 yards and a touchdown on 21 carries. Theo Riddick is not the answer on the ground either - five attempts, 11 yards - but he did have a 63-yard reception late in the evening. Here's a list of NFL Free Agent Running Back Rankings for the Lions to consider. ",
            "3": "Golden Tate and Marvin Jones each caught seven passes and eclipsed the century mark, generating 113 and 107 yards, respectively. Jones scored twice, and he was targeted in the end zone a third time late in the game, but Stafford made a rare, poor throw on that occasion. As for Tate, offensive coordinator Jim Bob Cooter did a great job of creating mismatches for his slot receiver. ",
            "4": "The Packers, meanwhile, had a very impressive opening drive, eating up eight minutes to move inside the red zone. However, it was a scoreless possession because the field goal was blocked. Green Bay didn't get many drives after that in meaningful action, as the team held the ball for only 15 minutes the rest of the way. Brett Hundley finished 26-of-38 for 245 yards to go along with four scrambles for 22 rushing yards and a touchdown on the ground. The numbers look solid, but keep in mind that most of his yardage came in garbage time. At halftime, Hundley was at only 80 yards. He failed to push the ball downfield when the game was in doubt, he held the ball way too long to take some bad sacks, and he failed to see some open receivers downfield. He also made some extremely risky throws across his body, but was very fortunate they weren't picked off. He won't be as lucky against tougher defenses, so there will certainly be numerous pick-sixes in his future unless he corrects this problem. ",
            "5": "Because of Hundley's incompetence, no Packer receiver eclipsed 60 yards. Randall Cobb led the way with five grabs for 58 yards, though most of it came on a 46-yard reception in garbage time. Davante Adams (7-53) made a poor effort on a deep shot in the second quarter. Jordy Nelson (4-35) battled an extremely talented cornerback in Darius Slay, who made two terrific pass break-ups on Nelson when the game was still in doubt. ",
            "6": "This was a disappointing night for Aaron Jones, who managed to gain only 12 yards on five carries. Ty Mongtomery (5-33) saw more action because the Packers were trailing throughout. ",
            "7": "Adding injury to insult, offensive tackle Bryan Bulaga suffered an injury in the fourth quarter, and he had to be helped off the field. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "13"
}