{
    "year": "2017",
    "week": "10",
    "Game 1": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "Thursday Night Football has been a failure for the NFL. The ratings aren't very good (just Google it for proof), and the games are even worse. Sometimes there are competitive affairs, but they're typically these sloppy grinders because teams have trouble preparing for a game with just three days off. It's almost an impossible task, and it's why the better team always wins as long as it happens to be focused for the opposition. The worst aspect of these Thursday games happen to be the injuries. It's only logical that players would suffer numerous maladies on such short rest, and athletes on both teams went down like flies in this contest. It began early when the Cardinals lost left tackle D.J. Humphries, their best offensive lineman, and defensive back Tyvon Branch to a knee issue. The Seahawks suffered the majority of the injuries after that, losing Jarran Reed early and Duane Brown in the third quarter. Russell Wilson got a bit banged up and missed a play. Kam Chancellor also went into the tent for some undisclosed reason. The worst injury, however, was to Richard Sherman when he grabbed his Achilles. The NBC announcing crew noted that Sherman didn't trust his Achilles entering this contest, and it turned out that his decision to play would end up costing him the season. Sherman was seen telling his teammates that he tore his Achilles on the sideline. For more, check out my <a href=/disastergrades.php>Disaster Grades</a>. If there was any proof needed that Thursday night games should be abolished, this game was it. The Seahawks-Cardinals clash was a sloppy struggle with way too many injuries, and had Sherman been playing on proper rest, he almost certainly wouldn't have gotten hurt. ",
            "2": "Wilson, as mentioned, missed only one snap, and he proved that he was healthy with one of the most spectacular plays of the season. Wilson was under duress by two defenders in the pocket. He spun around twice, avoiding them for eight seconds. He then launched a ball downfield, and Doug Baldwin caught it and ran toward the end zone for a 54-yard gain. The Seahawks scored a touchdown on the next play. Wilson finished 22-of-32 for 238 yards and two touchdowns. Wilson was under pressure more than he anticipated because of Brown's injury. Brown was supposed to provide some stability up front for the Seahawks, but once he left the game, the Seahawks reverted to their previous state where Wilson is constantly hounded and needs to make some amazing plays to give his team a chance to win. ",
            "3": "Both of Wilson's touchdowns went to Jimmy Graham, who caught six balls for 27 yards. On both scores, he out-muscled the defender in the end zone like a physical rebounder in the NBA. Baldwin, meanwhile, led Seattle's receivers with five catches for 95 yards. ",
            "4": "The Seahawks predictably struggled to run the ball. Thomas Rawls was given 10 carries, which he turned into 27 yards. JD McKissic was more impressive, darting for 26 yards on five attempts, though most of it came on a 17-yard burst. C.J. Prosise, who returned to the field from injury, was barely part of the game plan, as he gained three yards on as many carries, and he didn't catch any passes. ",
            "5": "Arizona's running game didn't fare any better. Adrian Peterson had a disaster of a night, as his first carry was a lost fumble. He was later tackled in his own end zone for a safety. Peterson had a nice, 9-yard burst in the second half, but did nothing otherwise. He simply had no lanes to plow through. Seattle's stingy run defense bottled everything up, restricting Peterson to just 29 yards on 21 attempts. ",
            "6": "The Cardinals needed Peterson to have a big game, as Drew Stanton had very little success against the Legion of Boom prior to Sherman's injury. Stanton finished 24-of-47 for 273 yards and a touchdown, but that hardly tells the whole story. Stanton missed open receivers all evening, including some who could've scored touchdowns. The only way the Cardinals moved the chains in the early going was via penalty - they had six first downs as a result of yellow flags - but Stanton was able to pick up the slack once Sherman left the game. Stanton had just 69 of his 273 yards in the opening half, but he engineered a late touchdown drive to give his team a chance to cover the spread. It ended up being a push on the closing number, however, because of a block on the extra-point attempt. Stanton struggled, but it wasn't all his fault. Humphries being out worsened his pass protection. Plus, Arizona dropped some passes. Jermaine Gresham, for example, had the ball fall through his hands for a potential touchdown in the fourth quarter. ",
            "7": "Speaking of Gresham, he reeled in Stanton's sole touchdown, catching five balls for 64 yards. He trailed only Larry Fitzgerald and his 10 receptions for 113 yards. Fitzgerald did the best he could despite being guilty of a drop. He also drew a pass-interference flag on a third down. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Saints",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Saints have historically performed much worse in outdoor road games than they have at home over the years, but if this result is any indication, this might be a very special team. The Saints, who were 0-2 once upon a time, have accumulated seven consecutive victories, including this latest dominant performance in Buffalo, which has been a tough place for the opposition to play recently. A big reason for New Orleans' seven-game winning streak has been a terrific ground attack, and the Saints continued to move the chains very effectively on the ground in this contest. New Orleans pushed Buffalo's front around, creating big holes for Mark Ingram and Alvin Kamara. Ingram gained 131 yards and three touchdowns on 21 carries. He easily bulldozed the Bills, and he was clutch on an early play as well, picking up a fourth-and-1 on the team's initial drive. Ingram wasn't a factor in the aerial attack, but Kamara was, catching all five of his targets for 32 receiving yards. Like Ingram, Kamara eclipsed the century mark on the ground, gashing the Bills for 106 yards and a touchdown on only 12 attempts. As with Ingram, Kamara moved the chains on a third down, but he did it after catching a pass. Kamara is probably the overall superior back, but the two will trample opposing defenses down the stretch as long as the offensive line remains intact. Of course, teams can't stack the line of scrimmage, or Drew Brees will torch them. Brees didn't post mind-boggling numbers or anything versus a talented Buffalo secondary, but he made precise, clutch throws to keep the chains moving throughout the afternoon. Brees finished 18-of-25 for 184 yards. He didn't throw a touchdown, but he scored one on the ground on a 7-yard scramble. Brees and his backs converted 6-of-11 third downs, while the Bills were 2-of-11 in those situations. As a result, New Orleans held the ball for more than 41 minutes. ",
            "2": "Aside from Kamara, only two Saints had double-digit receiving yardage, with Michael Thomas leading the way. He caught nine of his 10 targets for 117 yards. Brandon Coleman, meanwhile, caught only one ball, but made it count, as it was a 30-yard reception. ",
            "3": "As for the Bills, they opened the game with a field-goal drive, set up by a 36-yard LeSean McCoy run. They reached the red zone, but Tyrod Taylor missed Kelvin Benjamin twice for potential touchdowns. Buffalo put three points on the board, and yet the team didn't score again after that until the starters left the game! McCoy generated just 13 rushing yards outside of his long burst, gaining 49 yards on eight attempts in total. He also caught three passes for 11 receiving yards. This was a huge disappointment for McCoy, who appeared to have a strong matchup heading into this contest. Of course, it's not McCoy's fault, as the Bills trailed throughout and couldn't run more than eight times with him. ",
            "4": "Taylor deserves a big chunk of the blame, as he completed just half of his passes - 9-of-18 - for only 56 yards and an interception, though that wasn't his fault because Charles Clay bobbled the ball. Taylor was inaccurate, obviously, but he didn't have much time in the pocket, as Alex Okafor had a huge performance against rookie left tackle Dion Dawkins. ",
            "5": "Speaking of Clay, much was made of his return from injury because of a potential great matchup versus New Orleans' poor linebackers. Clay was a big disappointment with two catches for 13 yards. As mentioned, he was responsible for Taylor's sole pick. Benjamin also had a disappointing outing, catching three passes for 42 yards in his Buffalo debut. His yardage came late when the game was already decided. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Titans",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Titans managed to squeak out a victory against a bad Cincinnati squad, but they should feel optimistic about their chances going forward because Marcus Mariota is finally healthy since suffering an injury against the Texans. This was evident when Mariota scrambled for 28 yards on the opening drive, setting up a DeMarco Murray touchdown. For the first time since injuring his hamstring, Mariota scrambled around effectively, picking up 51 rushing yards on six running attempts. Mariota is developing as a passer, so his legs are his greatest strength right now. Being able to use them should make Tennessee the favorite to win the division. As for Mariota's passing, he went 25-of-44 for 264 yards, one touchdown and an interception on what was a terrible read on his part. The pick set up a Cincinnati touchdown, and the Titans may have run away with this game as a result. Mariota should've thrown two other scores, but Rishard Matthews committed a terrible drop, and Corey Davis fumbled the ball into the end zone, which resulted in a touchback. ",
            "2": "I mentioned earlier that Murray found the end zone on the initial drive. He actually scored thrice. He picked up 42 yards and two scores on the ground. He also caught four passes for 30 receiving yards and his third touchdown. Derrick Henry was more effective on the ground (11-52), which wasn't a surprise because Murray came into the game with an injury. It's unclear why Tennessee gave Murray so much work; it wouldn't been a better strategy to allow him to heal. Instead, Murray looked sluggish and risked further injury. ",
            "3": "Matthews, who had the aforementioned dropped touchdown, was second on the team with 50 receiving yards on five catches. However, his drop not only took seven points off the board; Tennessee didn't even get any points on the drive because of a missed field goal. Delanie Walker (6-63) was the only player ahead of Matthews on the stat sheet. ",
            "4": "The Bengals, meanwhile, need to change their time-of-possession trend. The Jaguars out-clocked them by about 20 minutes last week, and Tennessee had the same advantage in this contest. The Bengals simply can't sustain drives because of their poor offensive line. The blocking unit betrayed Andy Dalton quite often in this affair, including on one instance in which Brian Orkapo beat a tackle to strip-sack Dalton. Murray would score a touchdown on the ensuing possession on a bizarre sequence in which Vontaze Burfict was penalized for a late hit and then thrown out of the game several plays later for contacting an official. ",
            "5": "Dalton finished 20-of-35 for 265 yards, two touchdowns and the lost fumble. Considering that his team barely had the ball, those were solid numbers. Dalton did what he could, and even led an impressive touchdown drive to take the lead in the fourth quarter, but Tennessee marched back down the field for the decisive score. ",
            "6": "A.J. Green had the fourth-quarter score, and he finished with a terrific fantasy stat line as a result, catching five balls for 115 yards and the touchdown. Brandon LaFell (6-95) also found the end zone. ",
            "7": "Joe Mixon had Cincinnati's third touchdown, finding the end zone right after Mariota's interception. Because the Bengals were trailing throughout, Mixon couldn't even get double-digit carries, mustering 37 yards and the score on just nine tries. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "17"
        },
        "comments": {
            "amount": "5",
            "1": "The Jaguars improved to 6-3, but it wasn't pretty. They needed a lot of luck and some crazy bounces, but they managed to prevail in overtime to keep pace with the Titans for the lead in the AFC South. It's a borderline miracle that the Jaguars prevailed when considering how poorly Blake Bortles performed. Bortles, who went 28-of-51 for 273 yards, one touchdown and two interception, threw inaccurate passes all afternoon, save for one inexplicable drive in the second half. Bortles also ran well - five scrambles, 34 rushing yards - but Jacksonville could have won by a much wider margin if he wasn't so off. Bortles began the game with an overthrow on a third down. He later had a pick-six dropped on what should've been an easy interception, as the Charger defender had the ball right in his hands. And if that wasn't bad enough, Bortles committed an utterly inexcusable mistake, heaving a horrible interception on an overthrow in Charger territory when Jacksonville was in position for a game-tying field goal late in regulation. But as bad as Bortles was, he didn't make the worst mistake. That came from Philip Rivers (21-of-37, 235 yards, two touchdowns, one interception), who hurled a pass toward Travis Benjamin in overtime. Benjamin wasn't open, and A.J. Bouye hauled in the pass. Bouye ran toward the end zone and nearly scored. After a couple of runs, the Jaguars tried a field goal, which was blocked. Except, Josh Lambo, who was cut by the Chargers in the summer in favor of Younghoe Koo, still somehow made the kick anyway. This gave Jacksonville its sixth victory of the season. ",
            "2": "Rivers' interception wasn't the Chargers' only stupid sequence. They allowed a touchdown on a fake punt in the opening half, and before you say that any team could've done that, Jacksonville scored on the same exact play it ran versus the Ravens in London back in Week 3. Of course, the inept Charger coaches didn't recognize this, and they couldn't put their players in a position to stop it. Another huge mistake was Austin Ekeler's fumble in the fourth quarter. The Chargers were attempting to run out the clock, but Ekeler, who was running instead of Melvin Gordon for some unknown reason, coughed it up. It appeared as though Tashaun Gipson ran back for a touchdown, but after replay review, it was ruled that Gipson was down by contact. It didn't seem like he was down by contact, so it was very curious that they changed the call on the field. Still, Gordon (16-27) wasn't doing much on the ground, but it was still extremely puzzling as to why Ekeler (10-42) was getting the touches in such an important situation. Ekeler was a big factor in the passing game - five catches, 77 receiving yards, two touchdowns - but he's obviously not the talented runner Gordon has to be. ",
            "3": "There was a Mike Williams sighting in this game, as the seventh-overall pick caught two passes for 24 yards. The other Williams, Tyrell, dropped a deep touchdown in the second quarter. Neither Tyrell Williams (2-49) nor Keenan Allen (4-48) could do much versus Jacksonville's elite secondary. ",
            "4": "As for the Jaguars, everyone was expecting Leonard Fournette to run all over the Chargers because of some DVOA numbers. However, what those figures didn't account for was Denzel Perryman's return to action from injury. Perryman, a very talented linebacker, made numerous big plays in this contest and helped limit Fournette to only 33 yards on 17 carries. It also didn't help that the Jaguars didn't have their starting right tackle, Jermey Parnell. His backup was abused by Joey Bosa, who had a terrific performance as well. ",
            "5": "Bortles' sole touchdown went to Marqise Lee (6-55), who had a stupid taunting penalty in the fourth quarter. Lee trailed Allen Hurns (7-70) and Keelan Cole (3-61) on the stat sheet. Cole dropped a touchdown, though Lee would end up scoring on the same drive anyway. Hurns, meanwhile, suffered an injury at the end of the game. He actually crawled off the field to prevent the Jaguars from having a 10-second run-off, as they didn't have any timeouts remaining. <div class=dfpAdSlots> "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Jets won themselves out of the first-overall sweepstakes, so they needed to at least compete for a playoff spot to validate this lost 2017 campaign. Now 4-6 in the wake of losing to the Buccaneers, the Jets are out of postseason contention. This was a slap in the face to the fans, as the Jets' meaningless wins will prevent them from improving in the near future. The Jets failed to move the chains consistently in this game, often sputtering. They were a horrific 3-of-15 on third downs. They've played hard all year, but not in this game. It appeared as though they read the press clippings a bit too much following their blowout victory over the Bills. Their effort was lacking, and they lacked focus, committing too many untimely, sloppy penalties. And adding insult to injury, the quarterback who dealt this death blow was their signal-caller last year, Ryan Fitzpatrick. Of course, Fitzpatrick wasn't great, by any means. He was able to get revenge on the Jets, but went just 17-of-34 for 187 yards, one touchdown and an interception, which was an inaccurate throw in Jets territory. It was Fitzpatrick's only major mistake that counted, as he was able to have an economical showing versus a New York secondary that saw Morris Claiborne leave early with a foot injury. Still, Fitzpatrick was close to tossing a couple of other picks, so this game could've gone much differently for Tampa Bay. ",
            "2": "With Mike Evans suspended, DeSean Jackson led the Buccaneers with six catches for 82 yards. Jackson and rookie Chris Godwin (5-68) were the only Tampa players with more than 20 receiving yards. Cameron Brate was a massive disappointment, failing to take advantage of the Jets' poor linebackers. He caught only one ball for 10 yards. ",
            "3": "Doug Martin struggled to find running room, as the Jets can still stuff ground attacks effectively. Martin managed just 51 yards on 20 carries. I have the Buccaneers taking his replacement in the second round of my <a href=/draft2018.php>2018 NFL Mock Draft</a>. ",
            "4": "Moving back to the Jets, Josh McCown went 23-of-39 for 262 yards, one touchdown and an interception that was heaved into double coverage. Don't be fooled by McCown's final stat line; he was just 6-of-16 for 82 yards and a pick in the opening half, and he generated a big chunk of his yardage in garbage time. ",
            "5": "Robby Anderson was the lucky recipient of McCown's yardage and score. Anderson caught four passes for 85 yards and a touchdown, which occurred in the final minute of regulation. Austin Seferian-Jenkins (6-67) was also able to benefit from meaningless action. ",
            "6": "Matt Forte was out, so Bilal Powell was expected to be a big factor. However, Powell gained just 30 yards on 10 carries. Curiously, he caught only one pass. Eli McGuire (8-22) was an even greater factor in the aerial attack for some reason, as he caught four balls for 36 receiving yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "So... where was this Monday night? Brett Hundley looked hopelessly inept against the Lions until very late in meaningless action, but he was a completely different player just six days later. Hundley went into Chicago and upset a Bear team that had defeated the Steelers and Panthers as hosts, helping the Packers to improve to 5-4. That allowed Green Bay to somehow remain alive in the playoff hunt. Hundley made exceptional strides somehow despite being on a short work week. He had a shaky start, as he was nearly intercepted in the red zone, and he was also bailed out by a horrible pass-interference flag on Prince Amukamara on a later drive, but he was very accurate, particularly in the second half. Hundley was 10-of-13 for 126 yards and a touchdown following intermission. Chicago had no answer for him, and Hundley made some pinpoint passes that Aaron Rodgers typically makes. And no, that's not an exaggeration. On Hundley's touchdown throw to Davante Adams, I saw it out of the corner of my eye as I was typing, and immediately thought, <i> What a typical Rodgers throw,</i> and I recalled that this was Hundley seconds later! Hundley finished 18-of-25 for 212 yards and a touchdown. It was an amazing performance, considering what we saw out of him six days ago. Was this a fluke? Or perhaps a sign of things to come? It's unclear what the answer is, but I look forward to finding out. ",
            "2": "What's amazing about Hundley's effort in Chicago is that the Packers lost both of their top running backs in the opening half. Aaron Jones (3 carries, 12 yards) was knocked out with a knee injury, and then Ty Montgomery (6-54) also had to leave the game with a rib issue, though he did so following a 37-yard touchdown burst. Jamaal Williams handled the majority of the workload in the second half, but didn't have much success, mustering 67 yards on 20 carries. Williams did, however, pick up a fourth-and-1. Still, with no running game to support him, Hundley's surprising performance was extra spectacular. ",
            "3": "Adams, who had the aforementioned touchdown, led the Packers with five catches for 80 yards. Randall Cobb (3-52) and Jordy Nelson (3-20) were the only other Packers who generated at least 20 receiving yards. ",
            "4": "The Bears, meanwhile, lost this game by a touchdown, so you'd have to wonder what would've happened if it wasn't for John Fox's horrible gaffe prior to intermission. Benny Cunningham dived for the pylon on a great screen, but was ruled out of bounds shy of the goal line. Fox challenged the ruling because he thought Cunningham reached the pylon. Cunningham did... but the ball didn't. Cunningham lost control of the ball, which hit the pylon, resulting in a touchback. This may go down as one of the worst challenges of all time, as Fox inexplicably took away a scoring opportunity from his team. ",
            "5": "Mitchell Trubisky went 21-of-35 for 297 yards and a score. He opened the game well, making a nice third-down conversion to Tarik Cohen while under pressure, but Cohen ended up betraying him with a drop later on the drive. This was a common theme throughout the afternoon, as Trubisky suffered numerous drops, including one by Dontrellen Inman during a crucial fourth-quarter drive. Trubisky can't complain too much, however, as he had an open receiver earlier on the possession, but missed him. ",
            "6": "Inman, despite his drop, played well in his first extensive action with the Bears. Inman caught six of his eight targets for 88 yards. The eight passes he saw tied a team high for the Bears with Kendall Wright (5-46). Jay Bellamy (2-57) snared Trubisky's sole touchdown. ",
            "7": "Jordan Howard seemed to have a fairly decent matchup heading into this contest, but he mustered only 54 yards on 15 carries. Cohen, who dropped the pass, didn't see any action after that. He had just two touches on the afternoon, which didn't make any sense. Instead, Fox attempted to have Cunningham be a bigger part of the game plan, which didn't make any sense. Fox is coaching like it's 1995, so he needs to understand that getting the ball to superior talents gives his team the best chance to win. <div class=dfpAdSlots> "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Lions",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> What a horrible front-door cover by the Lions. I didn't even bet on the Browns, but as someone who has suffered similar terrible luck throughout the year, I felt everyone's pain. ",
            "2": "The Lions continued to get their season back on track, taking care of business at home against the winless Browns. Both Matthew Stafford and DeShone Kizer played well for their teams, but the Browns once again shot themselves in the foot with dumb plays and mental mistakes. On the plus side, they remained in the race for the No. 1 pick. ",
            "3": "On Kizer's first play, he lofted in a pretty 38-yard pass to Sammie Coates (2-38) to set up a field goal for Cleveland. Shortly later, Stafford threw a pass into a crowd, and it was intercepted by Jamie Collins. Kizer quickly hit Kenny Britt (2-38-1) in the flat, and Nevin Lawson missed a tackle, to let Britt dart into the end zone from 19 yards out. The Lions got on the board with a field goal set up mainly by a 20-yard run by Ameer Abdullah. Early in the second quarter, Detroit moved into Cleveland territory when Stafford made a nice play to buy time before hitting Tate on the run for a 35-yard gain. A 10-yard run by Stafford set up Abdullah to finish the drive with an 8-yard touchdown run that tied the game at 10. Then, the Browns started to play like the Browns; Nevin Lawson stripped tight end Seth DeValve of the ball and scooped it up. Lawson was untouched by DeValve and was able to bolt down the sideline for a 44-yard touchdown. In the final minutes of the half, Kizer made some nice throws to move ball into Detroit territory. He took off on an 18-yard run to get the ball to the 2.5-yard line with 19 seconds remaining. On second-and-goal with 15 seconds, Cleveland ran a quarterback sneak from over two yards out, and it was stuffed by Detroit. Before the Browns could get set up to spike the ball, the clock ran out, and they went into the half missing out on the points opportunity. It was a horrible play call, but hilarious and typical of the Browns. Cleveland opened the third quarter by moving down the field with Isaiah Crowell, who tied the game up from a few yards out. The Browns got the ball back and moved it again with Kizer, who took off on a 20-yard run to defeat a poorly designed blitz to convert a third down. Kizer then hit DeValve (4-70) for 35 yards to the one-yard line. Kizer then used the sneak that didn't work in the first half to get a touchdown. Cleveland's offensive line, especially the interior, was rolling Detroit at the point of attack in the third quarter. Detroit responded with Stafford hitting Kenny Golladay (2-64) for 50 yards as he beat Jamar Taylor. A couple plays later, Stafford hit Theo Reddick (3-12-1) for a short touchdown pass to tie the score at 24. Browns rookie David Njoku made a terrible play to not move his head to look to the outside. He missed a blitz on a max-protect play, and that allowed a bone-rattling hit from Quandre Diggs on Kizer. That knocked Kizer out of the game and into the locker room. The Lions took the lead with a drive that culminated with a 29-yard touchdown pass to Eric Ebron (2-39-1) as he beat Derrick Kindred down the sideline. Cody Kessler had Bryce Treggs running wide open down the sideline after he burned D.J. Hayden for what would have been about a 75-yard touchdown, but Kessler threw a terrible pass too long for Treggs. Detroit put the game away with a 40-yard touchdown pass to Golden Tate on a simple wide receiver screen, and Tate went virtually untouched down the field for the score. Kizer came back into the game late in the fourth quarter, but he was out for some possessions, and Kessler was incompetent. In garbage time, Kizer led a drive close to Detroit's end zone before throwing an interception to Darius Slay on a fade pass to end the game. ",
            "4": "Stafford was 17-of-26 for 249 yards with three touchdowns and an interception. Tate led the Lions in receiving with six catches for 97 yards and a touchdown. Marvin Jones (1-22) didn't make a big impact. ",
            "5": "Abdullah led Detroit in rushing with 52 yards on 11 carries and a touchdown. ",
            "6": "Kizer completed 21-of-37 for 232 yards with a touchdown and an interception. He also ran for 57 yards and a touchdown. This was a positive performance from the rookie. ",
            "7": "Crowell had 90 yards on 16 carries and a touchdown. ",
            "8": "Defensively, Emmanuel Ogbah was excellent for the Browns with three tackles and two sacks. Cornelius Washington had two sacks for Detroit. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "27"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> If you needed proof that football is extremely unpredictable, just look at Case Keenum's stat line. The Redskins shut down the Seahawks last week, yet they couldn't stop Keenum at all. Yeah, that makes so much sense. ",
            "2": "In a game that many expected to be a defensive battle, the Redskins and the Vikings ended up having a shootout. That's just a microcosm of how the NFL has gone this season. With the win, the Vikings improved to 7-2 and now have a stranglehold on the NFC North. Much of the Minnesota's early success came thanks to the excellent performance of Case Keenum. It's pretty amazing that the Vikings were able to sign him for a deal that was worth just $2 million this offseason. He has been a very solid starter for them and is one of the top backups in the NFL. This week, Keenum was unstoppable in the early going. He helped to lead the Vikings to touchdowns on five of their first six drives. His ability to find open receivers and also to throw them open was paramount to the early success of the Vikings. On two occasions, Keenum was able to throw perfect passes to Adam Thielen to get him into open space. Keenum also did well to find players in the red zone, and he made a pretty throw to Stefon Diggs for a score. Overall, Keenum ended up going 21-of-29 for 304 yards, four touchdowns and two interceptions. The picks came late in the game, one on a lofted pass that he threw into double coverage, and another where he stared down the receiver and allowed D.J. Swearinger to undercut the route. These mistakes were emblematic of why Keenum shouldn't be counted on as an every-day starter for a Super Bowl contender. But, like Ryan Fitzpatrick, he could become one of the best spot starters in the league while he is in his prime. ",
            "3": "Keenum's top receivers during the contest were Adam Thielen (8-166, 1 TD) and Stefon Diggs (4-78, 1 TD). The two were able to break away from the Washington corners seemingly all day. In particular, Thielen looked very good, as he made a couple of tough grabs, and also had a long catch that saw him catch the ball in space and use his speed to shred the defense. He can be started as a high-upside FLEX play most weeks. Meanwhile, Diggs was efficient, catching all but one of his targets, and he looks healthy again. He can be counted on as a WR2 for the rest of the year. Elsewhere, Kyle Rudolph (5-37) had a decent day, but wasn't as effective as fantasy owners would have hoped against the Redskins' poor tight end defense. Still, he is a solid TE1 who can be started most weeks. ",
            "4": "The running game for the Vikings was surprisingly good in this contest. The Redskins' run defense had been playing well, but Latavius Murray was able to expose them a bit. Murray generated 68 yards and a touchdown on 17 carries, and he looked good doing so. He looked strong and powerful, and he could finally be healthy after the ankle surgery he had this offseason. Jerick McKinnon contributed 32 yards on 10 carries, but he was clearly the No. 2/passing-downs back for the team. ",
            "5": "For the Redskins, this is a bitter loss. Their offense played generally well, but their defense just couldn't compete with the Vikings. If they had managed a couple of stops, they could have won. Kirk Cousins had a very good showing for the Redskins. For the first time in a long while, he had all five of his starting offensive linemen available to play. The group gave Cousins the best protection he had in weeks, and it showed. Early on, Cousins took advantage of the better blocking and was able to methodically march the Redskins down the field. He threw a near-perfect ball to Maurice Harris, who made an acrobatic catch for the opening score of the game. As the first half continued, Cousins was able to find his receivers open over the middle of the field, as the lateral movement was what allowed the Redskins to find success against Minnesota's strong defense. However, Cousins did have one critical mistake. He threw a bad interception at the end of the first half that allowed the Vikings to have the ball in good field position. The Vikings converted for a touchdown, and that stretched the lead by seven. It was a costly play by Cousins that ensured Washington would be playing from behind in the second half. Overall, Cousins went 26-of-45 for 327 yards, one touchdown and a pick. He also ran the ball four times for five yards while scoring twice on the ground. Cousins was more effective than the numbers indicate, given that his team was playing from behind for the whole contest. ",
            "6": "Cousins' favorite receivers were his over-the-middle weapons. Jamison Crowder (4-76) and Vernon Davis (7-76) each saw 11 targets and were very effective. Their ability to run cross-field routes separated them from the other Redskins who saw the field. Crowder had one nice catch that saw him find open space and turn on the jets to get 36 yards. He looks like a WR3 candidate for the rest of the season. As for Davis, he was able to steadily rip off chunks of yardage throughout the day. He was reliable for the Redskins, and at this point, they may want to consider keeping him as the starter over the disappointing and oft-injured Jordan Reed. Whenever Reed is out, Davis can be used as a TE1. Meanwhile, Josh Doctson (4-30) had a couple of nice catches, and he continues to improve each week. Maurice Harris (2-50) caught the other touchdown. Terrelle Pryor was nowhere to be seen. ",
            "7": "On the ground, the Redskins actually had a good deal of success despite the Vikings' strong front seven. Rob Kelley had some nice gains early, but he suffered an ankle injury early that kept him out of the game. Samaje Perine was actually the best runner on the field, as he saw nine carries and was able to gain 35 yards. He had a couple of explosive bursts that show why he has the potential to be a quality starter at the NFL level. If Kelley misses any time, Perine is worth a speculative add. Chris Thompson saw the most action of any running back and had 67 scrimmage yards. He is a high-upside FLEX play most weeks and a must-start in PPR leagues. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I know the Steelers like to fix these sort of games, but they really should make it less obvious next time. Anyone could've seen this from a mile away. ",
            "2": "Road losses to scuffling teams have been a Steelers specialty over the last few years, and the Colts did all they could to keep that narrative alive, taking a 14-point lead deep into the third quarter. Colts quarterback Jacoby Brissett put his team ahead early in the second frame, as rookie Artie Burns bit on a double move by Donte Moncrief, which helped Brissett connect for a 60-yard touchdown and a 7-0 lead. Brissett continued to be inconsistent, but he also flashed big-play ability, as he did with his strike to Moncrief, and then again, this time in the third quarter, when he hit Chester Rogers on a 61-yard touchdown. The big plays are there, but he still makes too many mistakes to hold off better teams like the Steelers. For most of this game, the Colts looked like the better team. Ben Roethlisberger was errant on multiple deep passes; the Steelers were constantly backing up due to holding penatlies; and the Colts were taking away Roethlisberger's first reads. It wasn't until the reality of their impending loss took hold, that the Steelers fought back into this game. After Brissett's touchdown to Rogers, the Colts had a 17-3 lead midway through the third-quarter, and with the Steelers on the ropes, they finally punched back with a drive led by Le'Veon Bell and Roethlisberger to Juju Smith-Schuster, as they were the only two Steelers players to touch the ball on a eight play, 78-yard drive, which ended in a seven-yard touchdown to Smith-Schuster. With Antonio Brown getting the bulk of the secondary's attention, it was Smith-Schuster's time to step up, which he did. On the day, Smith-Schuster caught 5-of-7 targets for 97 yards and a touchdown, leading the team. Smith-Schuster's touchdown should have brought the Steelers within seven points, but Chris Boswell's extra point was blocked and returned just yards from the end zone and two points for the Colts. This was a close game, and the hustle by the Steelers to get him down was a huge play. The Colts managed to hold the Steelers scoreless on the next two possessions, as they held to a 17-9 lead in the fourth quarter, but Jacoby Brissett's inconsistencies hurt him, as he tossed an interception deep in Indianapolis territory, which wasn't totally on him, but it was a ball he probably shouldn't have thrown. Ryan Shazier made a nice catch and set the Steelers up for a short field, which they capitalized on. On third-and-goal from the seven-yard line, Roethlisberger avoided pressure and finally found Vance McDonald wide open for a touchdown, which brought the Steelers within two points and pushed them to go for two, which they converted with a strong pass from Roethlisberger to Martavis Bryant to tie the game. ",
            "3": "Bryant was benched last week after he complained about his playing time on Instagram. In his absence, Smith-Schuster went off and solidified his No. 2 receiver status, which continued in full force this week. ",
            "4": "The Colts did get a great game out of Rogers, as T.Y. Hilton had been limited in practice this week with a groin injury, giving Rogers a bit more work this week, as he caught all six of his targets for 104 yards and a touchdown. He had returned from injury a month ago, but had only seen six targets total over his last three games. ",
            "5": "Besides the two big touchdown passes, Pittsburgh's defense played well, sacking Brissett three times and forcing a huge interception to put their team into scoring position. It will be a quick turnaround for the Steelers though, as they, along with the offense, have to play on Thursday night against the Titans, while the Colts get a bye and then also get to face the Titans. ",
            "6": "The Steelers, despite tremendous inconsistency on offense this season, are 7-3 and have a commanding lead in the AFC North. They will have to tighten the ship and Roethlisberger's deep ball if they want to contend in the playoffs though. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> Why isn't Davis Webb even dressed for the Giants? I'm fine with starting Eli Manning every game, but when it's 31-13 in the fourth quarter, should Webb be given a look? The Giants have a big decision to make in 5-and-a-half months, so they probably figure out what they have in Webb! ",
            "2": "The 49ers got their first win of the season, and it was only a matter of time because they had played a lot of tough football against a number of teams this season. The lone negative for the 49ers is they are no longer in pole position to land the No. 1 overall pick in the 2018 NFL Draft. The winless Browns now are on track to get that selection. The Giants, meanwhile, lost a winnable game, and this further illustrates that New York is in free fall. The No. 1 pick is probably coming down to the Giants or the Browns, which is an utter shocker considering New York was in the playoffs last year after 11 wins. ",
            "3": "In the first quarter, the teams exchanged field goals before New York added on three more for a 6-3 lead. After driving into San Francisco territory, Manning tried to flip a pass forward while getting sacked by Ronald Blair, but it was ruled a fumble that San Francisco recovered. A few plays later, C.J. Beathard laid out a bomb to Marquise Godwin for an 83-yard touchdown. The Giants responded with a nice 26-yard catch by Sterling Shepard. Manning then hit a few more receptions before throwing a nine-yard touchdown strike to Evan Engram. The Giants' defense continued to struggle with tight ends and allowed a score to a tight end for the 10th-straight game. Beathard hit Garrett Celek (4-67-1) on the run, and he broke a tackle from Janoris Jenkins to get into end zone for a 47-yard score. That gave the 49ers a 17-13 lead at the half. In the third quarter, the Giants had a drive end with a missed 34-yard field goal. The 49ers soon moved inside the 30-yard line, but Olivier Vernon intercepted a screen pass to snatch the scoring opportunity away. San Francisco got the ball back and continued to move the chains on New York. On the first play of the fourth quarter, Beathard kept a bootleg to run into the end zone for an 11-yard touchdown. A few minutes later, the 49ers put the game away with Matt Breida (9-55-1) running up the middle untouched for a 33-yard touchdown as Landon Collins took a bad angle to let Breida cut upfield for pay dirt. ",
            "4": "Beathard completed 19-of-25 passes for 288 yards with two touchdowns and one interception. ",
            "5": "Carlos Hyde led the 49ers on the ground with 17 carries for 98 yards. ",
            "6": "Manning was 28-of-37 for 273 yards and two touchdowns. Shepard caught 11 passes for 142 yards. Engram hauled in six passes for 31 yards and a touchdown. ",
            "7": "Orleans Darkwa ran for 70 yards on 14 carries. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Everyone's going to make a big deal about Ezekiel Elliott missing this game, but I agree with what Jacob wrote below. The absences of Tyron Smith and Sean Lee had a much greater impact, as far as I'm concerned. ",
            "2": "The Falcons utterly dominated the Cowboys in the contest. While the big story was how the Cowboys would look without Ezekiel Elliott, it became apparent that their true problems lie on the offensive line. This can be seen from the performance of Adrian Clayborn. Clayborn is not one of the better pass-rushers in the NFL. At best, he is an average player. But on Sunday afternoon, he looked like the second coming of Lawrence Taylor. Throughout the game, Clayborn tortured the Cowboys' left tackle, Chaz Green. Normal starter Tyron Smith was out with an injury, and Green couldn't contain Clayborn. The Atlanta end registered a whopping six sacks during the day, upping his season total to eight. He was unstoppable, and the only way that the Cowboys could avoid him was to roll away from him. And even then, he still made some nice plays on chase downs. Clayborn's six sacks were one shy of the NFL single-game record (Derrick Thomas, 7). ",
            "3": "On the offensive side of the ball, Matt Ryan had one of his most consistent performances of the season. Of course, his job got a lot easier when Sean Lee went out for the game, but Ryan was still solid. He spent the whole day throwing accurate passes to his receivers and fitting balls into tight windows. On one of his best throws, he hit Justin Hardy for a touchdown that saw him cram the ball in between two defenders in the middle of the end zone. Hardy got his feet down just before going out, and it was a very nice play overall. Ryan's ability in the play-action passing game was great on Sunday as well, and that allowed him to find some success. On his short touchdown pass to Austin Hooper, he got the Cowboys to bite on the run and tossed the ball to the wide-open Hooper. Part of the success was due to the strong play call, but Ryan's ability to sell it helped the team to succeed. Overall, Ryan went 22-of-29 for 215 yards, two touchdowns and one interception. The pick wasn't entirely his fault, as it was tipped in the air by his receiver. The numbers aren't terrific, but Ryan looked closer to the quarterback who nearly won the Super Bowl last year in this contest. He may be limited by Steve Sarkisian's mediocre play calling most weeks, but maybe this will give Ryan some momentum going forward. ",
            "4": "Thanks to Ryan's success, the Falcons' receiving attack was able to support multiple players on Sunday. His top targets were Julio Jones (6-57) and Hooper (6-49, 1 TD). Jones was able to beat the Dallas defensive backs easily and made some nice grabs throughout the day. Ryan did spread the ball around a lot though, which limited Jones' upside. Still, he is a WR1 most weeks, and at the worst, he is a very high-end WR2. Hooper continued to have an up-and-down season in this contest. He was able to find space over the middle of the field with Sean Lee out, and that's where he generated a lot of his yardage. It's hard to trust Hooper as a TE1, but he can be streamed depending on the matchup. Elsewhere in the passing game, Taylor Gabriel (3-58) had a nice day thanks to his speed, while Justin Hardy caught Ryan's second touchdown. ",
            "5": "On the ground, the Falcons had to make a quick adjustment very early in the contest. On his second carry, Devonta Freeman took a shot to the head and was evaluated for a concussion. He was declared out, and the Falcons handed over the reigns to Tevin Coleman. The third-year man out of Indiana had a strong performance for the team. He had some nice, tough runs that saw him hit the hole and use his strength to beat the Dallas front. Coleman finished the day with 83 yards on 20 carries and also got a touchdown. He probably has earned himself with a larger role in the backfield and could split carries with Freeman. ",
            "6": "For the Cowboys, this was not a good look. Many expected that they would remain competitive without Elliott in the lineup. If Sunday is any indication, that won't be possible. With Elliott in the lineup, opponents had to respect the Cowboys' run game. Even though their offensive line was weaker than it was in the past, opposing defensive coordinators spent a lot of time trying to stop Elliott. Without him, the Falcons and Dan Quinn focused more on stopping Dak Prescott. It showed. Prescott simply didn't have enough times to make plays. Usually, Prescott would have a clean pocket and would be able to go through his progression to find an open receiver. Not on Sunday. Prescott struggled out the gate because he was constantly being chased down by opposing pass-rushers. He was sacked eight times and evacuated the pocket on a majority of his pass attempts due to the pressure. When he was able to throw, Prescott was accurate on short- to medium-length passes. But there wasn't enough time for anything to develop downfield. So, Dallas' offense became limited to quick, short plays that had a high level of success, but didn't move the needle much when the team got down. This can't be entirely blamed on Prescott, as it was a product of the poor offensive line play. Prescott finished the day 19-of-29 for 176 yards. It was not a pretty performance for him, and the only saving grace for him was that he scrambled for 42 yards on six rushes and scored the team's lone touchdown on a scamper. Prescott will have better weeks, but the Cowboys need Tyron Smith to come back if they want to be competitive. And even then, Prescott won't be as effective due to the absence of Elliott. ",
            "7": "With Prescott under pressure, Jason Witten (7-59) and Dez Bryant (3-39) saw a lot of targets on shorter passes. Witten was able to do the most as he worked the middle of the field. He can be a streamer at tight end most weeks, but is likely limited to being a TE2. Meanwhile, Bryant's potential will be capped as long as the offensive line struggles. He has had a tough season as it is, so he is only an average WR2 at this point in time. ",
            "8": "With Elliott out, the Cowboys' running game was led by Alfred Morris. The backup runner looked a bit like he did as a member of the Redskins. He had some tough runs that saw him push through defenders, and on one play, he bulled forward for an extra four yards before he was whistled down as his offensive line picked him up and moved him downfield. He finished the day with 53 yards on 11 carries and should perform better when the Cowboys have a lead. Morris didn't see much action as a passing back, which makes sense given that he's not a great receiver. Rod Smith held that role, and he made four catches for 15 yards. He is worth monitoring as the Dallas coaching staff is high on him. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Rams",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "It's difficult to believe that despite what this final score says, it seemed as though the Texans were going to pull the upset for at least half of this game. After all, they led at intermission, 7-6, and they could've held a larger advantage. They gave three points away immediately when Aaron Donald bulldozed through Xavier Su'a-Filo to force a fumble and set up a field goal. Later, Houston's kicker missed a chip-shot field goal, and then an interception in the red zone negated a scoring chance. So, if the Texans had better luck in the early going, they could've led 13-3 at halftime at the very least. Things unraveled in the third quarter. Tom Savage was pick-sixed under pressure when he threw the ball right to Alec Ogletree. The interception was overturned by what the announcers called a ticky-tack call on an Ogletree hold. However, this set the tone for the second half. Savage was nearly picked right after that when he threw a ball up for grabs. He was then strip-sacked, setting up one of many Rams touchdowns in the second half. Savage had four turnovers in total, as he didn't give the Texans much of a chance once the Rams woke up in the second half. ",
            "2": "Jared Goff, conversely, was unstoppable following halftime. He was 14-of-17 for 251 yards and three touchdowns - in the second half alone! The big play was a 94-yard bomb to Robert Woods, and that was just one of Goff's many terrific throws. Goff had some issues with pressure early, but the Rams made the appropriate adjustments at halftime to help Goff finish 25-of-37 for 355 yards and the trio of scores. ",
            "3": "Woods continued his terrific play, catching eight passes for 171 yards and two scores. Despite Sammy Watkins' presence, Woods is the ex-Bill who has transformed into the Rams' No. 1 receiver. Watkins also found the end zone, but caught only two passes for 41 yards. Cooper Kupp (6-47), meanwhile, hauled in all but one target thrown his way. ",
            "4": "Todd Gurley failed to reach the end zone, but generated more than 100 scrimmage yards. He rushed the ball only 11 times for 68 yards, but was a big factor in the aerial attack, catching six passes for 68 receiving yards. ",
            "5": "Going back to the Texans, I already discussed Savage's struggles. Savage completed only half of his passes, going 18-of-36 for 221 yards, one touchdown, two interceptions and two lost fumbles. Despite Savage's struggles, DeAndre Hopkins was able to put together a strong performance. Hopkins caught seven passes for 111 yards, including a terrific sideline catch in which he somehow tapped both feet in bounds for a 32-yard gain. Hopkins' only blemish was an offensive pass interference where he blatantly pushed off. He also dropped a pass late in the game, but the contest was well decided by then, so it didn't really matter. Elsewhere in Houston's receiving corps, Will Fuller (2-15) barely played because he left early with a rib injury. Bruce Ellington (4-41) picked up the slack in Hopkins' absence, scoring a touchdown in the second quarter. ",
            "6": "Lamar Miller had some nice gains in the early going. He could've finished with a great stat line, but the Texans couldn't run the ball at all beginning in the middle of the third quarter because of a suddenly large deficit. Miller finished with 60 yards on 11 attempts. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "Teams aiming to upset the Patriots need to refrain from committing stupid mistakes, and the Broncos simply couldn't do that. In fact, they had numerous egregious errors in the opening half, particularly on special teams. The Broncos opened the evening by forcing a punt, but they muffed the ball, setting up New England with a short field. Tom Brady made them pay, throwing a touchdown to Rex Burkhead two plays later. Following a Denver field goal, the Broncos kicked off, only to watch Dion Lewis take it the distance to give his team a 14-3 advantage. The special-teams gaffes didn't even stop after that, as the Patriots blocked a punt when they were up 17-6. The nail in the coffin was the Broncos being whistled for a hold to negate a C.J. Anderson touchdown in the third quarter. The Patriots capitalized on all of these errors and were able to win in a blowout as a result. ",
            "2": "Of course, Brady was terrific as usual, despite battling the No Fly Zone. Picking up where Carson Wentz left off last week, Brady torched the Broncos, going 25-of-34 for 266 yards and three touchdowns. Brady, who had fantastic pass protection for most of the evening, should've thrown a fourth touchdown, but the officials incorrectly ruled that Rob Gronkowski let the ball hit the ground. Replay showed that Gronkowski made the reception, but Walt Coleman was too incompetent to overturn the call. ",
            "3": "Gronkowski ended up scoreless as a result of this horrible officiating, though he tied for the team lead with 74 receiving yards with Brandin Cooks. This wasn't the type of performance Gronkowski fantasy owners were looking for, considering how poor the Broncos have been against tight ends this year. Part of the problem was that the newly signed Martellus Bennett took away three receptions, which he turned into 38 yards. Also, Dwayne Allen vultured a touchdown on his only reception, an 11-yarder. ",
            "4": "In addition to scoring on his kickoff return, Lewis found the end zone on offense, dashing for 55 yards on 14 carries. Rex Burkhead (10-36), who had the aforementioned blocked punt, also scored as a receiver, catching three balls for 27 yards. James White did the same. Mike Gillislee, meanwhile, was inactive. He has been in Bill Belichick's dog house ever since fumbling a few weeks ago. ",
            "5": "Quarterback play has been a huge problem for the Broncos, but that wasn't the case tonight, despite the mere 16 points for Denver. Brock Osweiler was just fine, as he went 18-of-33 for 221 yards, one touchdown and an interception, which occurred very late in the game when Osweiler desperately was trying to make stuff happen. Osweiler did a good job of moving the chains in between the 20s, but the offense stalled in the red zone. ",
            "6": "Emmanuel Sanders is clearly healthy again, as he had a huge performance, catching six of his 11 targets for 137 yards. Demaryius Thomas found the end zone, but was limited to five grabs for 44 yards. Stephon Gilmore returning from injury, did a great job of limiting Thomas. It's clear that the film work that Gilmore put in during his time off has clearly paid off, as the Patriots didn't have nearly as many miscommunications in this contest as they did earlier in the year. ",
            "7": "The Broncos, who trailed the entire evening, couldn't run the ball very much. C.J. Anderson was limited to just 10 carries, though he managed to turn those into 54 yards, thanks to a 21-yard burst in the opening half. Anderson, as mentioned, scored a touchdown, but Bolles' hold negated it. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "The Panthers were coming off an important divisional victory over Atlanta last week, while the Dolphins needed a win to put themselves in better position in the AFC playoff race. One team played much harder than the other, and it certainly wasn't the squad that needed it more. Carolina demolished Miami, trampling its AFC opponent relentlessly on the ground. Prior to some kneel-downs, the Panthers tallied 550 net yards of offense, 296 of which came on the ground. The Dolphins looked like they didn't want to tackle whatsoever, as Carolina effectively did whatever it wanted in the second half. The Panthers could've named their score; had they wanted to win 70-21, they could've easily done so. ",
            "2": "Cam Newton was a big part of the team's ground attack, as he rushed for 95 yards on five scrambles, 69 of which came in the third quarter to set up a short touchdown. Newton was also lethal aerially, going 21-of-35 for 254 yards and a whopping four touchdowns. Newton could've thrown a fifth score, but Curtis Samuel dropped the ball in the end zone. Newton also suffered some drops from Russell Shepard, so his stats were nearly so much better than they already were. He made just one mistake on the evening, throwing what appeared to be an interception in the red zone, foolishly heaving the ball across his body over the middle of the field. T.J. McDonald snatched the pick, but replay review showed that the ball hit the ground. ",
            "3": "Jonathan Stewart was Carolina's leading rusher, generating 110 yards on only 17 carries. Stewart isn't normally good enough to produce those sort of numbers, but the Dolphins showed a severe lack of interest in tackling. Stewart didn't find the end zone, but Christian McCaffrey did twice. In addition to his two touchdowns, he gained 23 yards on five carries and also caught three balls for 27 receiving yards. Both of McCaffrey's touchdowns were special. His rushing score had two Miami players set to tackle him. They had him dead to rights, but McCaffrey juked both of them and galloped into the end zone. His receiving score featured a magnificent toe tap along the sideline. McCaffrey should be getting way more than eight touches, but it didn't matter in this contest. The Panthers could've given the ball to anyone and have gotten great production. This was proven when Cameron Artis-Payne was able to burst on a 43-yard scamper toward the end of regulation. ",
            "4": "Newton wasn't getting much help from his receivers in the early going. Shepard, as mentioned, dropped two passes, one of which was when he was wide open downfield. Samuel also had two drops. Samuel, who caught five balls for 45 yards in just one half of action, left the game with an injury. Carolina's leading receiver was Devin Funchess, who had a huge night. Funchess hauled in five receptions for 92 yards and two touchdowns. He also drew a pass-interference flag in the end zone. Funchess will continue to serve as Newton's top receiver, though the Panthers will be getting Greg Olsen back from injury right after next week's bye. ",
            "5": "While Miami's defense was lethargic for two-and-a-half quarters, the offense did a decent job of moving the chains at times considering the edge Carolina had in the trenches with Miami's top lineman, Ja'Wuan James, out with an injury. The Dolphins put together a touchdown drive in the second quarter to trim Carolina's lead to 10-7. Miami had a chance to tie or take the lead in the final minute of the opening half, but Jay Cutler crushed his team with a horrible interception when he stared down his receiver, allowing Luke Kuechly to jump the route. The Panthers scored on the ensuing possession, and their 17-7 intermission lead only expanded exponentially after the break. Cutler didn't have a bad game outside of the crucial pick. He finished 22-of-37 for 213 yards, two touchdowns and the interception. Cutler nearly had a third score, but Julius Thomas dropped a deep pass in the second quarter. Cutler had to release the ball quickly because of Carolina's pressure, so he did what he could considering the unfavorable conditions. ",
            "6": "DeVante Parker (6-66) and Jarvis Landry (5-42) had middling numbers and didn't seem as though they'd make any fantasy impact in non-PPR leagues, but Landry scored very late in regulation. Kenny Stills (5-67) led Miami in receiving. ",
            "7": "Speaking of late touchdowns, Kenyan Drake had a 66-yard touchdown run at the end of the third quarter. Drake (7-82), who did nothing prior to that burst, seemed to catch the Panthers off-guard, as Carolina was enjoying a 31-7 lead at the time. Damien Williams saw the majority of the workload, but was limited to just 19 yards on nine carries. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "14"
}