{
    "year": "2017",
    "week": "03",
    "Game 1": {
        "Team 1": {
            "Name": "Rams",
            "Points": "41"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "39"
        },
        "comments": {
            "amount": "7",
            "1": "What a weird game. The Rams dominated from start to almost finish, leading by double digits for most of the evening. However, the 49ers were able to inexplicably put together a late charge, as Brian Hoyer caught fire against Wade Phillips' defense. San Francisco would've tied the game had Robbie Gould not whiffed on an extra point. In the end, the Rams prevailed, 41-39, in what turned out to be the highest-scoring game in Thursday Night Football history. It began very poorly for Hoyer, who was picked off on his very first pass. The Rams corner jumped the route, and Todd Gurley scored a touchdown on the very next play. Just like that, the Rams were up by seven with 12 seconds later. The 49ers continued to struggle throughout the opening half, scoring their only touchdown as a result of the Rams being offside on a punt that gave the 49ers a first down. The primary problem for San Francisco was that it made lots of mistakes prior to intermission. A holding penalty negated a Jared Goff sack, setting up another Gurley touchdown. Third-string running back Raheem Mostert fumbled, which allowed the Rams to kick a field goal. Hoyer missed an open Pierre Garcon. George Kittle dropped a pass. It was a comedy of errors for the 49ers, who were playing in front of lots of empty seats in Santa Clara. The 49ers stopped committing unforced mistakes in the second half, perhaps because the Rams were so exhausted defensively. The injuries didn't help either. They lost star safety Lamarcus Joyner to a hamstring, and Michael Brockers and Robert Quinn had to leave the game with injuries at some point. San Francisco, a team that hadn't scored a single touchdown entering this contest, transformed into an offensive machine, as both Garcon and Marquise Goodwin made circus catches along the sidelines to help Hoyer, who was gaining more confidence with every throw. A Pharoh Cooper fumbled kickoff return helped, setting up the 49ers with the opportunity to tie the game, deep in Rams territory. They managed to score on fourth down with a tough Carlos Hyde run, but missed on the two-point conversion, as the receiver Hoyer threw to ran a bad route. The 49ers still had a chance after that because they recovered an onside kick. However, Aaron Donald closed out the game, sacking Hoyer on fourth down. ",
            "2": "Gurley was an absolute monster for the Rams. He rushed for 113 yards on 28 carries, and he was once again a big-time factor in the passing game, catching five of his seven targets for 36 receiving yards. He scored thrice, but would've had five touchdowns had he not been stuffed on the goal line on two separate drives. A major reason for this was center John Sullivan getting knocked out with an injury. Backup Austin Blythe couldn't get as much of a push. It'll be important for the Rams to have Sullivan in next week's game against the Cowboys. ",
            "3": "Goff continued to improve, as he misfired on just six occasions. Granted, this was against San Francisco's inept defense, but he looked so much better than last year, going 22-of-28 for 292 yards and three touchdowns. Goff still holds on to the ball too long, and as Cris Collinsworth mentioned, he drifts back in the pocket too often. That said, he works hard, so he should be able to improve in these facets. Until he does, however, he'll be in trouble when battling tough defenses. The 49ers simply couldn't get to the quarterback very often, but some other teams - like the Redskins last week - will be able to. ",
            "4": "Two of Goff's touchdowns went to Sammy Watkins (6-106), who finally had a big game. He and Robert Woods (6-108) weren't met with much resistance, as safety Eric Reid was inactive. The only Ram who disappointed was Cooper Kupp, who snatched just two balls for 17 yards. ",
            "5": "Going back to the 49ers, Hoyer shook off his initial pick to have a solid outing otherwise. He went 23-of-37 for 322 yards and two touchdowns. As a reminder, the Rams lost a couple of star players, but Hoyer did a good job of bouncing back from a horrible throw to start the game. He could've melted down quite easily, but didn't. ",
            "6": "Hoyer was locked in on Garcon, which wasn't surprising at all. Garcon snared seven of his 10 targets for 142 yards. Goodwin (2-62) hauled in a 50-yard grab, while fifth-round rookie Trent Taylor (3-32) secured a touchdown after suffering what appeared to be a possible concussion. ",
            "7": "Hyde found the end zone twice, gaining 84 yards on 25 tries. For a while, it looked like Hyde fantasy owners were going to be extremely upset, as their running back was barely on the field in the first quarter because of some sort of injury. However, Hyde was able to return, and he had some impressive short-yardage runs on fourth down to score both of his touchdowns. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Jaguars may not be able to sell out their home games, so perhaps they should permanently re-locate to London. Granted, there's no swimming pool at Wembley, but it appears as though Jacksonville is much more comfortable playing in England, particularly in these 9:30 a.m. starts. The Jaguars won the previous two such contests, and they continued that trend, absolutely crushing the Ravens in a completely dominating performance. Blake Bortles did a great job of avoiding mistakes in this game, which was a complete reversal from last week's blowout loss to the Titans. He opened with a pretty touch pass to Marqise Lee, which went for 35 yards, setting up a field goal. Bortles found the end zone later in the opening quarter, lofting another nice touch pass to Marcedes Lewis for a touchdown, marking the first time the Ravens allowed an opponent to convert in the red zone all year. Bortles continued the onslaught in the second quarter, scrambling for a first down to convert a third-and-7. A few plays later, Bortles fired a strike to Allen Hurns into the end zone, giving the Jaguars an insurmountable 20-0 lead. By halftime, the Jaguars were up 23-0, and they were outgaining the Ravens, 261-15. Baltimore averaged a ghastly 0.7 yards per play in the opening half. Bortles' final numbers were 20-of-31 for 244 yards and four touchdowns. He also a drew deep pass interference on a shot to Lee, so his numbers could've been even better. The people of London must think that Bortles is the greatest quarterback of all time. ",
            "2": "Three of Bortles' scores went to Lewis, who hauled in four grabs for 62 yards. Hurns (3-20) had the other. Lee, meanwhile, led the Jaguars in receiving (4-65). ",
            "3": "Leonard Fournette was able to reward his fantasy owners with a touchdown in garbage time. He didn't have the best stat line otherwise (17-59), but he converted an important fourth-and-1 early in the game with a 7-yard burst. ",
            "4": "Nothing went right for the Ravens in this game. With Marshal Yanda out, Baltimore couldn't pass protect whatsoever. Joe Flacco was sacked twice on the first three drives, and the pressure affected his throws as well, as his ball placement was way off. The Ravens couldn't reach positive yardage until their fourth drive, and they failed to convert a first down or complete a pass until 4:15 was remaining in the second quarter! It didn't help that there were some drops by Jeremy Maclin, Terrance West and Michael Campanaro in the opening half. In addition to being sloppy and inefficient, the Ravens also suffered injuries. Defensive lineman Brent Urban was knocked out with a foot sprain, while Maclin exited with a concussion (though he returned in the second half). Baltimore did not look prepared to play this silly 9:30 a.m. Eastern game, and it may have impacted the team's health as well. The NFL needs to abolish these horrible early games, as it is alienating West Coast football fans, who need to wake up at 6 a.m. to set their fantasy lineups. At any rate, Flacco finished 8-of-18 for 28 yards and two interceptions. One wasn't his fault, as the ball bounced off Maclin's hands, but the other occurred because Flacco stared down his receiver, allowing Jalen Ramsey to jump the route. As horrific as Flacco's stat line was, almost all of his yardage - all 28 of it - came in garbage time in the second half. Prior to intermission, Flacco was just 4-of-12 for only EIGHT yards and an interception. ",
            "5": "Baltimore's leader in receiving yardage was tight end Nick Boyle, who had two catches for 14 yards. Buck Allen (5-13) and Ben Watson (3-12) were close behind, as Watson caught a touchdown at the very end of this game. Maclin and Mike Wallace each had one reception for eight and six yards, respectively. Maclin dropped two passes. ",
            "6": "West was expected to sit this game out, but he started for some reason. West predictably disappointed, gaining 26 yards on six carries. He dropped a pass and lost a fumble as well. West is a waste, and Allen should be the starter. Even Alex Collins looked better, though all of his 82 rushing yards came in garbage time. ",
            "7": "It should be noted that the Jaguars ran a fake punt despite being up 37-0. It was a classless move by a classless head coach, though perhaps the Jaguars just aren't used to being up by so much that they didn't know how to react. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "33"
        },
        "comments": {
            "amount": "6",
            "1": "Rookie quarterbacks playing in Foxboro were a combined 0-8 against Bill Belichick, all time. Deshaun Watson, however, didn't get the memo. Making just his second start, Watson was mostly brilliant, giving the Texans a chance to go toe to toe with the defending Super Bowl champions. It actually appeared as though the Texans were going to come away with a victory, as they were winning with two minutes remaining in the game. However, Tom Brady showed the rookie quarterback why he's the greatest player at his position in league history, as he engineered a trademark last-minute touchdown drive to win the game. The Patriots may have won, but the Texans were more impressive, as they played evenly with the Patriots despite going into Foxboro with a rookie quarterback and an absent left tackle. Watson was especially brilliant, as he went 22-of-33 for 301 yards, two touchdowns and a pair of interceptions to go along with eight scrambles for 41 rushing yards. Only one of his picks was legitimate, as the second occurred on a last-second Hail Mary. Watson made some mistakes in the early going. He had Braxton Miller wide open, but didn't see him. He took off for a scramble and was short of the line to gain, so the Texans had to punt. Watson also panicked on his real interception, as he threw off his back foot because of a heavy pass rush. What Watson did otherwise more than made up for it. He fired a touchdown to Bruce Ellington, with a perfect pass down the seam. He overthrew a tight end for a potential touchdown in the second half, but came back to get out of a potential sack by four New England defenders and connected with D'Onta Foreman for a 31-yard reception. Watson was brilliant considering the circumstances, and this game made it clear that he has the potential to be a star in the NFL. He still needs to work on his ball placement, but he could conceivably lead the Texans into the playoffs this year. If there's a rematch against the Patriots in January, I'll be looking for to it. ",
            "2": "Only four Texans caught multiple passes, and the leading receiver was DeAndre Hopkins, who secured seven receptions for 76 yards. He also drew a deep pass interference flag on Stephon Gilmore. Foreman (2-65), Ryan Griffin (5-61) and Ellington (4-59) were the others. Griffin caught Watson's other touchdown. ",
            "3": "In addition to Foreman's receiving yardage, the rookie also rushed for 25 yards on eight carries. Lamar Miller (14-56) handled more of the workload, but I can't help but think that Foreman should be featured more often. ",
            "4": "Going back to the Patriots, Brady needed a heroic effort to win this game. Missing his right tackle and having his blind-side protector banged up, Brady had to fight a fierce Houston pass rush that harassed him all afternoon. Brady took five sacks in total, which is a high number for him. One of the sacks involved a strip, which Jadeveon Clowney secured and ran back for a touchdown. It was telling that the Patriots waved the white flag just before halftime, opting to run out the clock despite being on their own 41-yard line with 40 seconds remaining. Despite all of this, Brady misfired on just 10 attempts and managed to throw five touchdowns. He was 25-of-35 for 378 yards. Brady was amazing considering the circumstances, and he looks like he's in his prime rather than being near the end of his career as a 40-year-old. ",
            "5": "Two Patriots caught multiple touchdowns, including Brandin Cooks, who had the game-winning score. Cooks was brilliant, catching five balls for 131 yards and his pair of touchdowns. Chris Hogan (4-68) also found the end zone twice, while Rob Gronkowski (8-89) secured Brady's fifth touchdown, though he got away with what looked like offensive pass interference. Danny Amendola, returning from a concussion, converted three of his five targets for 48 receiving yards. I expected more out of Amendola, but Hogan had the bigger day even though the two were separated by just one target. ",
            "6": "Mike Gillislee didn't score a touchdown for the first time all year, and he was limited to just 31 yards on 12 attempts. This was a disappointing showing by Gillislee, as Rex Burkhead was out of the lineup. Dion Lewis picked up the slack with three catches for 12 receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Jets",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "Heading into the season, it was clear that an AFC East team was tanking for a very talented 2018 NFL Draft class. Based on the way these teams played, it looked like the tanking team happened to be the Dolphins. Miami has a trip to London coming up, and it was clear that the team was more concerned about that game than this one. The Dolphins came into this affair completely unprepared. They lacked focus throughout, and that was apparent when they were flagged on pre-snap penalties on four occasions in the opening quarter alone! They dropped passes, whiffed on tackles and ran lethargically. It was an embarrassing effort all around, losing to a team that has absolutely no talent at most positions. The Jets, meanwhile, made a huge mistake by winning this game, as they are no longer the favorites to select Sam Darnold (as seen in the ). Unless the Jets believe Josh McCown is the long-term answer, they may have set themselves back once again. It's embarrassing that they can't even tank correctly. ",
            "2": "McCown, by the way, was 18-of-23 for 249 yards and a touchdown, as he was throwing against a completely disinterested defense. The Jets may have to use him as a starter next year if they can't obtain a franchise quarterback. ",
            "3": "On the bright side, the Jets finally used Bilal Powell more than Matt Forte. Sure, that was because of a Forte injury, but it's still good news nonetheless. Powerll couldn't find much running room, as he was limited to 37 yards on 15 carries. He managed to score a touchdown, however, and he also had a long carry negated by a horrible penalty. He didn't catch a pass, which was curious. Matt Forte, meanwhile, gained 25 yards on eight tries. ",
            "4": "Robby Anderson scored on a 69-yard bomb, and in the end, he converted three of his six targets for 95 yards. He's not relevant in fantasy, and Jermaine Kearse (3-42) isn't really either. Austin Seferian-Jenkins, making his first appearance following a suspension, hauled in five grabs for 31 yards. ",
            "5": "As for the Dolphins' dreadful offense, the unit failed to score a single point until the final play of the game. Jay Cutler was able to put together some garbage yardage as well; he was 26-of-44 for 220 yards, one touchdown and an interception, but by halftime, he was only 6-of-12 for just 38 yards. ",
            "6": "Perhaps the most disappointing player this week was Jay Ajayi, who mustered only 16 yards on 11 carries even though Muhammad Wilkerson didn't play many snaps. Ajayi hurt his hand on the second offensive play of the game, so perhaps that impacted his performance. Nevertheless, he really struggled, but could bounce back next week in a favorable matchup versus the Saints. ",
            "7": "DeVante Parker scored a touchdown, which was the very definition of a garbage-time fantasy score, as it occurred as the clock hit zero. Parker caught eight of his 10 targets for 76 yards and that touchdown, and all that production came in the second half. Jarvis Landry's fantasy owners weren't as fortunate; he caught six balls for 48 yards, and he dropped a pass as well. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Colts",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "28"
        },
        "comments": {
            "amount": "7",
            "1": "The Browns have to be considered the worst team in the NFL in the wake of this result. They were actually favored in Indianapolis, yet were completely blown out and dominated in every facet. The final score may say that Cleveland lost by three, but the team was down 31-14 in the fourth quarter prior to a pair of garbage-time touchdowns. This was a complete embarrassment for a team that was supposed to be more competitive this season. Granted, Myles Garrett has been out, but getting drilled by an Andrew Luck-less team to drop to 0-3 is not where the Browns thought they would be at this point. ",
            "2": "The Colts, meanwhile, appear as though they have something in Jacoby Brissett. He's obviously not any sort of long-term plan for the Colts because Luck will return at some point, but perhaps that means Indianapolis can trade Brissett for something viable in the near future. That, or perhaps the Colts will hold on to Brissett, just in case Luck continues to suffer injuries. Brissett finished 17-of-24 for 259 yards and a passing touchdown. He also had two rushing scores. Brissett was precise for the most part and averaged more than 10 yards per attempt, which is just amazing, considering that he hasn't been on the roster for very long. Brissett made just one glaring mistake, as he was nearly intercepted in the end zone prior to gaining his first touchdown. Brissett bounced back, however, and only misfired on just two other occasions in the opening half. Granted, Cleveland's abomination of a secondary made things easy for him - Jamar Taylor played like utter garbage - but it was still an impressive showing nonetheless. ",
            "3": "T.Y. Hilton had a huge game, catching seven balls for 153 yards and a touchdown. The Browns had no answer for him. Hilton was the only Colt who even had more than two receptions, and Donte Moncrief (2-44) was next on the stat sheet. Moncrief was actually benched in favor of Kamar Aiken to start the game, but Aiken left early with a concussion. ",
            "4": "The Browns at least were able to clamp down on the run. Frank Gore managed just 57 yards and a touchdown on 25 carries, and nearly half of his yardage came on a 21-yard burst in the opening half. ",
            "5": "While Brissett had a strong showing, DeShone Kizer struggled. He failed to complete half of his passes, going 22-of-47 for 242 yards, two touchdowns (one in garbage time) and three interceptions. Kizer didn't get much help from his receivers, who dropped a combined eight passes. However, he tossed two picks in the red zone. One was his fault, while the other appeared to be a miscommunication. Granted, Kizer was missing his top weapon in Corey Coleman, but he was also going up against a dreadful defense that surrendered 46 points to the Rams. ",
            "6": "With Coleman out, Kenny Britt saw the most targets. Britt continued to be painfully inefficient, hauling in only three of his 10 targets for 54 yards and a touchdown. Britt, who dropped yet another pass, continues to be a waste of football talent. The Browns should cut him. Elsewhere in the Cleveland receiving corps, Rashard Higgins proved to be a waiver-wire flop. After his big game last week, he caught just two passes for 10 yards. He also dropped a ball. David Njoku (2-12) caught Kizer's other touchdown. ",
            "7": "Isaiah Crowell didn't get much of an opportunity to handle the workload, with Cleveland trailing throughout. He managed just 44 yards on 12 carries. Because of the circumstances, Duke Johnson had the bigger game. He caught six balls for 81 receiving yards, and he also scored once on the ground on two of his rushes (23 yards). <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "26"
        },
        "comments": {
            "amount": "8",
            "1": "The Lions are cursed. That's the only explanation for what happened. They were trailing this game from start to finish, but appeared to throw a game-winning touchdown with eight seconds remaining. The FOX announcers stated that Golden Tate clearly crossed the goal line, but Walt Coleman, the most incompetent official in the NFL, summoned a replay review. The call was close, but the replay showed that Tate was barely short of the goal line when he was touched down. Coleman, who has a long history of not overturning calls when they should be, actually changed the ruling for once. Making matters worse for Detroit, he announced that because the Lions had no timeouts, they would be charged with a 10-second run-off, ending the game. It was the correct call, which in itself is remarkable because Coleman usually gets things wrong. It figures that the Lions, who have never had any great fortune throughout franchise history, would suffer as the result of this. The crowd went from chanting MVP for Stafford to showering the officials with a chorus of boos. The Lions were 3-0 for a minute, but dropped to 2-1 as a result of a horrendous rule. To not give the Lions a chance because the officials stopped the game is just awful. It's unclear if they could've gotten a snap off with eight seconds remaining, but because everyone was close by, it may have been possible. In fact, the Lions' Twitter feed posted a video of the offense previously getting a snap off in seven seconds, so it was definitely possible. ",
            "2": "As for the victors, it was no Ryan Schraeder, no problem. The Falcons were missing their talented right tackle, but that didn't matter at all against the Lions. Atlanta's offense did whatever it wanted to in this contest, quickly jumping out to a 17-3 lead in the middle of the second quarter. Seemingly getting double-digit yards on every single play, Detroit had no answer for the Falcons without rookie middle linebacker Jarrad Davis, as the tackling efforts were atrocious. This was apparent on the opening drive when Matt Ryan converted a third-and-16 to Devonta Freeman after taking a sack. The play helped set up a touchdown to Mohamed Sanu. A bit later, the awful tackling was on display once again, as numerous defenders whiffed on a Freeman 12-yard reception, allowing the Falcons to reach the red zone once again. Freeman scored a couple of plays later, giving the Falcons a two-touchdown lead that the Lions couldn't overcome despite some late heroics. Atlanta didn't punt until the fourth quarter. ",
            "3": "Despite the offensive brilliance, Ryan didn't have a great fantasy outing because of three interceptions. One was his fault, as Glover Quin jumped the route and returned the turnover for a touchdown. The other two weren't on Ryan, as the ball bounced off the hands of Tevin Coleman and Mohamed Sanu. Ryan finished 24-of-35 for 294 yards, two touchdowns and the three picks. ",
            "4": "Coleman looked good otherwise, gaining 46 yards on just four carries and snatching three catches for 43 receiving yards. However, it was Freeman who had the monstrous performance. He burst for 106 yards and a touchdown on just 21 attempts, and he also added three catches for 32 receiving yards. ",
            "5": "Julio Jones predictably paced the Falcons in receiving with seven grabs for 91 yards. He didn't score, but Taylor Gabriel did. Gabriel logged five receptions for 79 yards and a 40-yard touchdown, which involved him doing all of the work after catching a short pass. ",
            "6": "Detroit's offense did well as the game progressed, but the team killed itself with numerous mistakes. For example, T.J. Lang ruined a drive with an unsportsmanlike penalty, and a Ricky Wagner infraction negated a pass that would advance the Lions near the red zone. Stafford was able to nearly overcome this, going 25-of-45 for 264 yards and a touchdown. He appeared to have two scores, but the football gods were once again unfriendly to the Lions. ",
            "7": "Tate's near-touchdown at the very end also would've been his second. He caught seven balls for 58 yards and one other score. He trailed only T.J. Jones (3-63) on the stat sheet, while Marvin Jones (3-24) and Kenny Golladay (2-25) both were underwhelming. And speaking of underwhelming, they were nothing compared to Eric Ebron. The tight end had as many drops as catches, as his two receptions went for only nine yards. One of Ebron's drops effectively lost the game. Had he hauled in the pass, the Lions could've kicked a field goal, meaning they would've just needed three points at the very end. ",
            "8": "Ameer Abdullah didn't have much running room with some members of the Detroit offensive line out. He gained 47 yards on 14 carries and also chipped in with three catches for 39 receiving yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Saints",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Saints have an upcoming trip to London, but they couldn't afford to look past their opponent like the Dolphins did. At 0-2, a loss would be a crushing blow to their dwindling playoff chances, but they came up huge in Carolina, destroying a banged-up Panther squad. Despite missing both tackles once again, Drew Brees was brilliant. He finished 22-of-29 for 220 yards and three touchdowns, scorching a Carolina secondary that hasn't been the same ever since losing Josh Norman. Brees only made one mistake, as he overthrew Ginn for a potential touchdown, but this was Brees in vintage form. His performance was very impressive, considering the blocking woes the Saints have endured, and he'll only get better once Terron Armstead and Zach Strief return. ",
            "2": "Ginn may have missed out on the aforementioned potential touchdown, but he managed to score again later. Ginn (2-44), Brandon Coleman and Michael Thomas all found the end zone. Thomas, the only Saint who had more yardage than Ginn, caught seven of his eight targets for 87 yards. ",
            "3": "The Saints once again involved all three running backs, mixing them in randomly. Adrian Peterson was given nine carries, which he turned into 33 yards. He didn't look explosive, but had a punishing stiff-arm on one of the plays. Mark Ingram led the team with 56 rushing yards on 14 attempts to go along with two catches for 30 receiving yards. Alvin Kamara, meanwhile, scored a late touchdown, which was an impressive 25-yard burst. He turned five touches into 42 yards and a score. He should be getting more of the workload, as he's the best fit for New Orleans' offense. Peterson needs to be phased out. ",
            "4": "Cam Newton, meanwhile, had another disaster of a game. It's the second poor showing in a row for him, which isn't a surprise considering that he continues to miss center Ryan Kalil. The perennial Pro Bowler is such an important part of the offense, and he'll need to return for the Panthers to rebound. Newton finished 17-of-26 for 167 yards and three interceptions. As ugly as his afternoon was, it could've been even worse. He was nearly picked on a couple of other occasions, and he was strip-sacked, but the ball popped into the air and landed right into his arms. ",
            "5": "If there's a silver lining, it's that the Panthers finally got Christian McCaffrey going. The rookie didn't do much on the ground - four carries, 16 rushing yards - but he caught nine balls for 101 yards. McCaffrey nearly had a better performance, but an apparent 66-yard reception of his was turned into a 37-yarder because a Saint defender got his fingertips on McCaffrey while he was on the ground. ",
            "6": "Aside from McCaffrey, only Devin Funchess had more than two catches. Funchess was inefficient, however, as he managed to secure just four of his 10 targets for 58 yards. He was also targeted on two of Newton's three interceptions. Kelvin Benjamin, meanwhile, caught only two balls for eight yards, as he left the game early when he was bent backward awkwardly. He could be out for a few games, but no diagnosis has been made yet. If he is, this is yet another blow for the Panthers, who have already lost Greg Olsen for a while. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bills",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "Trevor Siemian came into this game completely on fire. Some were calling him the next John Elway following his big victory over the Cowboys, but he regressed to the mean in this loss. As great as Siemian was last week, he was that bad in this contest. Siemian finished 24-of-40 for 259 yards and two interceptions, but that stat line doesn't tell the whole story. Siemian had ball-placement issues all afternoon when he wasn't checking down, and that was apparent early when he overthrew Emmanuel Sanders. Siemian later had a pick that was dropped, as a linebacker read his eyes perfectly, but had the ball fall right through his hands. Siemian's accuracy was so poor that he actually hurled an interception when he was trying to throw the ball out of bounds. He was picked on another occasion because he made a poor decision to force a throw in a close game. ",
            "2": "Demaryius Thomas led the Broncos in receiving, as he registered six catches for 98 yards. Sanders nearly held that distinction, however, but a deep reception of his was wiped out by replay review. Sanders caught the ball, but apparently didn't complete the process of the catch, whatever that means. It appeared as though Sanders had the reception, but the NFL's rules are way too cryptic. ",
            "3": "Jamaal Charles outgained C.J. Anderson, 56-36, as newly acquired guard Ronald Leary was able to spring some big runs for them with terrific blocks. Charles also had one more carry and a touchdown. This was a feel-bad game for Anderson's owners, as Anderson wasn't rewarded with his big performance versus Dallas for some reason. However, Charles showed that he still has some explosion, and it wouldn't surprise me if this is close to a 50-50 time share in the near future. ",
            "4": "As for the Bills, they are now 2-1 despite all the talent they unloaded in the preseason. Tyrod Taylor, who looked like he would only last one year in Buffalo, misfired on just six occasions, going 20-of-26 for 213 yards and two touchdowns. One of his incompletions was a Mike Tolbert drop in the end zone, but Taylor was able to throw a touchdown on the next play, as Andre Holmes caught a deflected ball. Speaking of Taylor, there was a very controversial call late in the game that involved the Bills quarterback. Von Miller reached his hand to help Taylor up after hitting him, then pulled the hand away. The officials threw a flag on Miller, citing that he was being unsportsmanlike. Perhaps they were correct, but I've never seen anything like that before. The penalty helped the Bills ice their victory. ",
            "5": "LeSean McCoy couldn't get much on the ground versus a ferocious run defense - 14 carries, 21 yards - but he made up for it with seven catches for 48 receiving yards. He had a 14-yard gain negated by a Richie Incognito hold, which ruined a red zone chance. Instead, the Bills were forced to punt. ",
            "6": "McCoy trailed only Jordan Matthews (3-61) in receiving. Charles Clay (6-39) caught the other touchdown, while Zay Jones didn't log a single catch. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Doug Pederson has to be fortunate that his team won this game because his decision to go for it on a fourth-and-8, up 7-0, near midfield in the second quarter was as stupid as it gets. That said, I questioned his decision to try a 61-yard field goal at the very end, but it obviously paid off! ",
            "2": "The Eagles appeared to have this game in control. Leading 14-0 into the fourth quarter, the team had done a good job of limiting the Giants' offense. However, in the final quarter, everything changed. It started innocently enough. The Eagles allowed Eli Manning and the Giants to move down the field bit by bit before the quarterback threw a nice strike to Odell Beckham Jr. for a touchdown. Then, the Eagles immediately turned the ball over after a poorly timed fumble by Zach Ertz. That tied things up. Following another quick drive by the Eagles, the Giants were able to take their first lead of the season. Sterling Shepard caught a 77-yard touchdown from Manning that gave the team a 21-14 lead with just seven minutes left to go. But the Eagles would drive to tie it. After exchanging field goals, the game looked destined to be heading to overtime. Then, Jake Elliott happened. Elliott, the rookie kicker who had replaced an injured Caleb Sturgis just a week ago, was given a chance to kick a 61-yard field goal to clinch the win for the Eagles. The choice was not too surprising, given that Doug Pederson had been aggressive in going for it on fourth down in multiple occasions in the contest. Still, handing the game over to a rookie for the longest kick of his life was risky, but it paid off. ",
            "3": "Though the Eagles won, they still had a mediocre performance for most of the contest. Part of the the problem was their offense's lack of ability to consistently move the ball. Carson Wentz had his worst performance of the 2017 season and definitely didn't look great. He held onto the ball too long against the Giants' stellar pass rush, and he took three sacks as a result. The pressures occurred early in the game and seemed to get him out of rhythm. Wentz went 21-of-31 for 176 yards and a touchdown, but had issues with his downfield accuracy during the contest. He couldn't hit Alshon Jeffery down the field on a play that would have been a touchdown. In other circumstances, Wentz just misfired by a bit, but he was bailed out by a couple of pass interference calls. Despite all this, Wentz still had some bright spots. In one instance, he made a nice 11-yard run that saw him put a terrific juke move on a Giants defender. Additionally, he had a couple of nice throws in the red zone to Zach Ertz and deserves credit for that. The Giants are a solid defensive unit, but Wentz will have a chance to improve in their next matchup. ",
            "4": "For the second straight week, Ertz (8-55) was the top target for Wentz. Though he caught the lone touchdown pass of the contest, Ertz had his fair share of issues. He dropped a touchdown pass on which he was wide open, though he did get the score one play later. However, his worst play came when he fumbled the ball to the Giants and gave them great field position on their game-tying drive. Ertz still put up TE1 numbers, but he could have had a much-better performance. As for the other receivers, Alshon Jeffery (4-56) and Torrey Smith (4-29) led the way. Jeffery had a nice afternoon, battling Janoris Jenkins and catching the crucial pass that set up the Elliott field goal. Jeffery will be an up-and-down fantasy performer, but is a high-end WR2 most weeks. Smith is a boom-or-bust play, but he did well to catch most of his targets on Sunday. ",
            "5": "Doug Pederson got some criticism for refusing to give LeGarrette Blount a carry against the Chiefs in Week 2. Against the Giants, Blount split the workload with Wendell Smallwood and got 12 carries for 67 yards and a score. Blount looked strong and was able to run through some of the Giants' defenders. However, his inconsistent workload will make him a FLEX play most weeks. Smallwood actually outgained Blount with 71 yards on 12 carries. He looked fairly good, but Blount will continue to see goal-line work. Darren Sproles suffered a wrist injury in this game and was replaced by Corey Clement, who had a nice 15-yard touchdown scamper late in the contest. Clement looked good, but will be kept in a limited role. ",
            "6": "The Giants lost to fall to 0-3, but the most encouraging part of the victory for the team was the improvement of Manning. In the second half, Manning was able to help lead the team's offense without making many mistakes. He had issues throwing the ball downfield in the early portion of the contest, but once the fourth quarter hit, he caught fire. On the first three drives of the fourth quarter, Manning threw no incompletions and had the three touchdown passes. He was sharp and accurate, and finally looked to be in rhythm with his receivers. He was able to spread the ball around to his top options and really get everyone involved down the stretch. Overall, Manning finished 35-of-47 for 366 yards, three touchdowns and two picks. Though the picks were not good-looking plays, his second-half performance was very strong. The Giants are going to need him to play like that moving forward. Manning has to carry the offense. He truly is the team's catalyst. ",
            "7": "Manning's top receiver was predictably Beckham for most of the contest. After missing Week 1 and being limited in Week 2, Beckham looked to be healthy for the first time. He caught the two touchdown passes and was able to rack up 79 yards on nine catches. He also led the team with 13 targets. Beckham is undoubtedly a WR1 in fantasy, and he can be trusted in any matchup going forward. Elsewhere, Brandon Marshall (8-66) and Sterling Shepard mixed in well as the second and third options. Marshall finally looked to be putting forth a strong effort in his third game. Beckham's presence opened the field for him more, and Marshall can be played as a FLEX in certain matchups. Meanwhile, Shepard led the team with 133 yards, but a lot of it came on the 77-yard touchdown catch. He can be a FLEX in certain matchups, but is too inconsistent to be in the lineup. ",
            "8": "In the running game, the Giants struggled continued. Orleans Darkwa led the team with 22 yards on seven carries. However, most of that came on a 20-yard burst that saw strong blocking. Paul Perkins got eight carries for 20 yards, but was largely ineffective. The team needs to consider adding a player who could help the team improve in this area. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I understand that the Buccaneers had injury concerns entering this game, and they were dealing with a flu bug that was spreading throughout the locker room, but there's no excuse for getting blown out against Case Keenum - not for a team that has playoff aspirations like Tampa. Oh, and by the way, would it kill DeSean Jackson not to celebrate touchdowns when down 14 points? ",
            "2": "With Case Keenum at quarterback, nobody was really giving the Vikings a chance to beat the up-and-coming Tampa Bay Buccaneers, but Keenum looked like Fran Tarkenton as he shredded the Bucs' defense to lead Minnesota to a shocking victory. Tampa Bay's secondary had no answer for Keenum, Adam Thielen and Stefon Diggs, as they led Minnesota to 21 first-half points. The Vikings then used their defense to close out the win by generating three interceptions. ",
            "3": "To get the game started, Keenum lofted in a beautiful pass to Adam Thielen for 45 yards after he got separation on Vernon Hargreaves running a go route down the sideline. A 16-yard pass to Dalvin Cook set up Cook to plunge over the goal line for his first career touchdown. The Bucs answered with a field goal drive. The Vikings were set up for more points as Keenum hit Thielen (5-98) for 19 yards and a holding call on T.J. Ward in the end zone set up a first-and-goal. Keenum tossed an easy pass to Jarius Wright to give Minnesota a 14-3 lead. The Bucs started moving the ball with DeSean Jackson getting the best of Trae Waynes for a nice gain, but then Winston forced a pass downfield to Jackson, who didn't have separation on Waynes, and the third-year corner picked off the pass. Keenum took advantage, hitting Diggs for a 43-yard gain, and then Diggs jumped over Hargreaves for a 17-yard touchdown. That put the Vikings up 21-3 at halftime. The domination continued in the third quarter with Diggs ripping the Bucs' secondary for a 59-yard touchdown. Tampa Bay came up with an answer as Winston threaded a needle to Cameron Brate for a short touchdown. The Vikings responded with a field goal. The Bucs seemed to get back into the game with a drive where Jackson made a leaping touchdown grab over Trumaine Brock for a 25-yarder. That made it 31-17 Vikings entering the fourth quarter. After getting the ball back, Winston and Jackson weren't on the same page, and that let a pass float to Vikings safety Andrew Sendejo for an interception. Minnesota turned that into a field goal. The next drive ended with another interception, as Winston forced a pass to Mike Evans in triple coverage. Sendejo batted it up in the air, and Harrison Smith caught the tipped ball. ",
            "4": "Keenum completed 25-of-33 passes for 369 yards with three touchdowns and no interceptions. Diggs had a tremendous game, catching eight passes for 173 yards with two touchdowns. ",
            "5": "Cook ran for 97 yards on 27 carries with a touchdown and caught five passes for 72 yards. At a critical time in the game, Cook had a tremendous block on Gerald McCoy to let Keenum complete a pass downfield to Diggs. Cook was excellent for Minnesota. ",
            "6": "Winston was 28-of-40 for 328 yards with two touchdowns and three interceptions. Tampa Bay had no running game, as Jacquizz Rodgers had only 15 yards on five carries. Evans had seven receptions for 67 yards, while Jackson led Tampa Bay with four catches for 84 yards and a touchdown. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bears",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "17"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> Marcus Cooper, what the f***? There's no reason to slow down before the goal line. Like, really, why not just cross the goal line, and then strut around like a jacka**? Oh, and how was that play not a safety? I still don't understand what the hell happened. ",
            "2": "The Steelers have had little luck when traveling to Chicago in their long history, having won only one game in 12 tries, but this Bears team hasn't looked good on offense with Mike Glennon at the helm, so the Steelers came into Chicago with a seven-point Vegas advantage and supposedly a team advantage. Neither turned out to be prescient. This game was crazy, with a showboating fumble at the 1-yard line before halftime and a walk-off touchdown run to win the game in overtime. The Chicago Bears committed both of those, with the latter being the most important. ",
            "3": "The Steelers, again, had trouble moving the ball with consistency this week, as Ben Roethlisberger was not on target, completing just 22-of-39 passes for 235 yards and a touchdown. He continues to not turn the ball over, with five passing touchdowns to one interception, but he's been hit and miss as a field general. The Bears' defense is notoriously bend, but don't break, which was about where they were in this game. Add that to Roethlisberger's road woes, and there was no doubt this game was going to go down to the wire. ",
            "4": "On the other side of the field, leading the way was Mike Glennon. I call lots of quarterbacks the Checkdown King, but this week, Glennon was the emperor, as he completed 15-of-22 passes for 101 yards, one touchdown and one interception. How does a team win when its quarterback throws for 101 yards? The answer was clear in this one; it was the running game. Through two games, Chicago's star running back, Jordan Howard, had run the ball 22 times for 59 yards and no touchdowns, with three receptions for 14 yards tacked onto that. That 2.7 yards per carry, lack of targets, strong play by Tarik Cohen, a supposedly tough Pittsburgh run defense and a hurting shoulder, were all signs that Howard might not be the point man in this game, but as he ran in the game-winning touchdown from 17 yards out in overtime, everyone knew none of that mattered. Howard ended the game with 23 carries for 138 yards and two touchdowns, plus five receptions for 26 yards. It was a huge bounce-back effort by Howard, especially as he seemed to be feeling the effects of his shoulder and other nicks and twinges as the game went on. Howard's running mate, Tarik Cohen, looked great as well, rushing 12 times for 78 yards and catching all four of his targets for 24 more yards. Unfortunately for him and his fantasy backers, Cohen appeared to have made the walkoff run from 73 yards out, but he was ruled to have stepped out of bounds, which on review, was hard to agree with. ",
            "5": "The Steelers did make a game of it after getting down 17-7 at halftime. We saw a bit more from Le'Veon Bell this week than we have in his first two games, as he rushed 15 times for 61 yards and a touchdown, while also catching six passes for 37 yards. His 1-yard touchdown run in the third quarter, his first of the season, brought the Steelers within three points in the third quarter. ",
            "6": "Antonio Brown was his usual self, seeing 14 targets, catching 10 for 110 yards and a touchdown. Xavier Rhodes shut him down last week, but that's an outlier for Brown, who can put good numbers up in the most difficult of spots. ",
            "7": "In the end, it was a complete defensive breakdown for the Steelers, as they let Cohen and Howard drive Mack trucks through the holes in the defense. This from a team that had absolutely no passing game. Of the 15 completions by Glennon, 12 went to running backs for 73 yards, one to a tight end for 17 yards, and two to wide receivers for 11 yards. Chicago's leading receiver, Kendall Wright, didn't even get a target. In most games, that will not get it done. ",
            "8": "The Bears will go to Green Bay next week, where they will again need to establish the run to try to slow down Aaron Rodgers and company, but if the Packers get up on them, the game could get out of hand quickly. ",
            "9": "The Steelers head to Baltimore for their third road game of the season. We just saw the Ravens get embarrassed in London, so they should be keyed up to play their division rival at home for the division lead. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> I can't believe this was Aaron Rodgers' first overtime victory ever. You'd think he'd have like 20, 30, or even 500 by now. Weird. ",
            "2": "It wasn't a pretty first half, but Aaron Rodgers pulled off the fourth-quarter comeback and overtime win to get Green Bay to a 2-1 start on the 2017 season. This victory has the Packers keeping pace with the Vikings and Lions at 2-1 in the NFC North. Green Bay, however, will need to fix its leaky offensive line in the weeks to come. The Bengals changed their offensive coordinator after their 0-2 start, and the early returns were good as their scoring unit played well in the first half, but the offensive line wasn't changed out, and that weakness led to Green Bay holding the Bengals to only three points over the final two quarters and overtime. ",
            "3": "On the first drive of the game, Cincinnati went down the field for a touchdown with A.J. Green and Joe Mixon ripping off some good gains. To finish the drive, Dalton tossed a well-located pass to Green for a score. Cincinnati promptly set up Green Bay with a kickoff that went out of bounds. A pass interference penalty, a completion to Jordy Nelson, and a conversion to Davante Adams (3-60) put the Packers at the 1-yard line. Rodgers found Lance Kendricks (2-51-1) wide open in the end zone for a short touchdown. In the second quarter, Cincinnati moved down the field with Gio Bernard (3-27 rushing, 2-12-1 receiving) ripping off a 25-yard run and getting wide open for a six-yard touchdown catch. Green Bay got moving using a flea-flicker for a 41-yard completion to Adams, but then Rodgers had a 10-yard out to Neldon jumped by William Jackson, who raced down the sideline for a 75-yard touchdown. It was only the second pick-six that Rodgers has thrown in his career. That play had Cincinnati ahead 21-7 at the half. Rodgers immediately got Green Bay moving in the third quarter, hitting Kendricks in the open field for a gain of 51 yards. A pass interference on Dre Kirkpatrick in the end zone set up the Packers at the 1-yard line, and on third-and-goal, Rodgers found Nelson open in the end zone. The Bengals moved into field goal range, but the second sack from Packers rookie safety Josh Jones pushed Randy Bullock back, and he missed the field goal attempt. A run by Rodgers with completions to Geronimo Allison and Nelson pushed the ball into the red zone before settling for a field goal to cut the Bengals lead to 21-17. Some nifty running by Bengals rookie Joe Mixon set up the Bengals for a short field goal to extend their lead to 24-17 with just under four minutes remaining. Rodgers got started as Allison made a phenomenal leaping catch for 17 yards and then converted a third-and-long with a superb hands catch along the sideline. Nelson followed with a great sideline reception, and shorter gains by Rodgers moved the ball inside the 5-yard line for a first-and-goal with 21 seconds remaining. Rodgers then threaded a needle to Nelson for the game-tying touchdown. The first possession of overtime ended with the Bengals punting. Rodgers promptly found Allison for a 73-yard reception to the Bengals' 7-yard line. Mason Crosby nailed the 27-yard field goal to give Green Bay the overtime victory. ",
            "4": "Rodgers completed 28-of-42 for 313 yards with three touchdowns and one interception. Nelson had six receptions for 52 yards and two scores. Allison led Green Bay in receiving with six catches for 122 yards. ",
            "5": "Montgomery ran for 35 yards on 12 carries. ",
            "6": "Dalton was 21-of-27 for 212 yards with two touchdowns and zero interceptions. He did miss on a few opportunities for big plays. Green had 10 receptions for 111 yards and a touchdown. ",
            "7": "Mixon led the Cincinnati ground game with 62 yards on 18 carries and three receptions for 39 yards. ",
            "8": "Both teams really struggled with their offensive line play. Packers rookie left tackle Kyle Murphy was awful for Green Bay, as Bengals rookie Carl Lawson beat Murphy for 2.5 sacks. The Bengals totaled six sacks. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Titans",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Seattle's offensive line continues to be a disaster, but at least the team's penchant for keeping games close came to fruition at the very end. Thanks for making sure my teaser won, Russell Wilson! ",
            "2": "The final score of this game is deceiving. While the scoreboard says it was a one-score contest, the Titans led by two scores for most of the second half. The Seahawks had a chance at a late comeback, but that was more a result of the Titans playing prevent defense on Seattle's last offensive possession of the game where the Seahawks cut the deficit to six. The Titans looked good for the entirety of this game, but they really turned things on in the second half. In the third quarter, they scored 21 points, which really helped to put the contest out of reach. All of this was thanks to the performance of their offense, especially their rushing attack. While it was widely expected that Derrick Henry would shoulder the load for the Titans' ground game, that was not the case. DeMarco Murray continued to lead the backfield and showed no signs of the hamstring injury that had made him questionable in the leadup to the contest. Overall, Murray totaled 115 yards on 14 carries, including a 75-yard touchdown run that saw him follow his blockers perfectly and cut into open space all across the field. He is a low-end RB1 right now, though Henry could take some opportunities away from him in the future. Speaking of Henry, he started the game poorly, and at one point, had four carries for minus-6 yards. By the end of the day, Henry had racked up 54 yards on 13 carries, and he looked good in the second half. Henry has RB1 potential for the future, but that won't happen this year unless Murray misses time. ",
            "3": "Tennessee's offensive line also deserves credit for this performance. The team's line is one of the top units in the league and will continue to provide quality blocking for Mariota and the backs all season, provided that the linemen can stay healthy. Speaking of Mariota, he had an impressive performance against a stout Seattle defense. Early on, Mariota was under pressure, but he was able to scramble away from sacks and make plays outside the pocket. He used his mobility to his advantage, and that helped to take away the effectiveness of the Seahawks' defensive line, which is their strongest part of the defensive unit. Mariota was very accurate per usual, and he was able to spread the ball around and find the open man. Overall, Mariota went 20-of-32 for 225 yards and two touchdowns, and he helped the Titans to control the game. Mariota has a great grasp of the offense, and his ability to analyze defenses and find effective matchups will be a major weapon for the Titans. ",
            "4": "With Corey Davis out, Mariota focus on targeting Rishard Matthews (6-87, 1 TD) for a majority of the day. Matthews was solid for most of the game, but a good chunk of his yardage came on a 55-yard screen-pass touchdown. On the play, Matthews was able to follow his blockers and made a man miss to get the score. Matthews is a WR3 in fantasy, but he could put up WR2 numbers if Davis continues to miss time. Mariota's other touchdown went to Jonnu Smith (1-24), who went uncovered on a play where he slipped out of the backfield as a fullback. Eric Decker (4-49) was impactful in the first half, while Delanie Walker (4-31) had a decent day. Both are capable of more, but since Mariota likes to spread the ball around, their productions can fluctuate. ",
            "5": "For the Seahawks, their offense actually looked very good during the contest. They were led by a strong passing attack that saw Russell Wilson post his best stat line of the season. Wilson ended up going 29-of-49 for 373 yards and a whopping four touchdowns. The stat line is a bit deceiving, as some of his yardage came with his team down by multiple scores late. But still, it was significantly better than the initial two starts for Wilson. Wilson finally had decent protection from his offensive line and wasn't forced to throw the ball away too much. He was sacked once during the contest, and that was a major improvement for Seattle. Throughout the game, when Wilson had time, he was able to find the open receiver wherever they were on the field. Wilson's accuracy and ball placement were superb, and he definitely is not the one to blame for the team's loss. ",
            "6": "Wilson's top receivers on Sunday were Doug Baldwin (10-105, 1 TD) and Jimmy Graham (7-72). Baldwin saw 15 targets and was able to make a lot of plays throughout the day. He was able to catch a touchdown and had some nice catches on the sideline as well. When Wilson has enough time in the pocket, Baldwin can be a WR1. Meanwhile, Graham showed no signs of the ankle injury that had bothered him leading up to the matchup. Hopefully, he will be able to build on this solid performance. Wilson's other touchdowns went to Luke Willson (3-53), who came on strong in the fourth quarter; running back Chris Carson (2-18); and Paul Richardson (2-30). ",
            "7": "In the running game, Carson continued to impress. He led the Seahawks with 34 yards on 11 carries, but he also did have a receiving touchdown - as mentioned before. Carson was able to catch the pass and accelerate quickly before getting into the end zone. On the ground, he was tough and used his mix of physicality and athleticism to gain yardage against the Titans' defense. Elsewhere in the backfield, C.J. Prosise saw four carries for nine yards, but he had a big impact as a receiver. He made three catches and totaled 65 yards during the affair. Prosise is a very quick back, so he and Carson seem to be a good tandem. Thomas Rawls and Eddie Lacy appear to be out of the rotation. ",
            "8": "Seattle's defense was not a strength on Sunday afternoon. The team's defensive line was effectively neutralized by the Titans' strong offensive line, and that is a bad sign for the Seahawks. If the Seahawks can't win in the trenches on either side of the ball, they are going to be hard pressed to make the postseason, let alone, be a contender. Also, Richard Sherman was out of control for the Seahawks during this game. He committed three penalties on one play and was lucky not to get ejected for a late hit to the head on Mariota. Sherman needs to keep his emotions in check if he wants his team to succeed. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "Five of the six teams that could be considered as the best squad in the NFL were road favorites this week. The Steelers, Broncos and Raiders all lost outright. The Falcons were inches away from falling to the Lions. The Chiefs, meanwhile, were the most convincing of the five, as they were able to defeat the Chargers with a dominating defensive performance. Kansas City picked off Philip Rivers three times, and it nearly had a fourth interception that was overturned by replay review. Rivers underthrew the ball on his first interception. He forced his second pick into double coverage, and it allowed the Chiefs to score a quick touchdown. Rivers' next pick occurred because he stared down his receiver. Rivers, who has poor pass protection, struggled in the backfield once again. The Chargers really need to improve their blocking, as Rivers never had a chance. He could've been more careful with the football, but I don't know how much more differently this game could've gone for the undermanned Chargers. Rivers was held to 20-of-40 passing for 237 yards and the three interceptions. Some of his yardage came on the final drive when the Chiefs moved to a prevent defense because they were up a pair of touchdowns with just two minutes remaining. ",
            "2": "The other primary storyline concerning this game was the poor tackling by the Chargers. They allowed the Chiefs to pick up chunks of yardage, and they're lucky that they weren't trailing by 20-plus points throughout the afternoon. Kansas City couldn't get out of its own way, as the team was constantly flagged for careless penalties. Most of this occurred on offense, but Marcus Peters was guilty for an unsportsmanlike infraction right before halftime that set up a Chargers' field goal. However, the missed tackling was more prevalent. Kareem Hunt rushed for 172 yards and a touchdown on 17 carries because of this. A 69-yard score came near the end of the game, but he had multiple bursts of eight and 10 yards throughout the contest because the Chiefs couldn't wrap him up. ",
            "3": "Alex Smith misfired on just five occasions, going 16-of-21 for 155 yards and two touchdowns. Smith actually saw lots of pressure from the edge, as Melvin Ingram recorded three sacks. Joey Bosa chipped in with a half sack as well. ",
            "4": "Tyreek Hill (5-77) and Albert Wilson (3-18) caught Smith's touchdowns, as Hill's came via a horrible defensive scheme where he was somehow matched up on a linebacker. Hill seemed to suffer an injury late in the game when a deep shot sailed out of bounds, but the announcers speculated that it might just be cramps. Meanwhile, Travis Kelce had just one reception for a single yard. He saw just one target. ",
            "5": "Before moving back to the Chargers, I need to mention a stupid decision by Andy Reid. For some reason, Reid called for a fake punt on a fourth-and-14 in his own territory in the second half. His defense was dominating, so to put them in a bad position was foolish. However, the stop unit forced a punt. ",
            "6": "Melvin Gordon, who gained 79 yards and a touchdown on 17 carries, played sparingly in the second half after getting knocked out with a knee injury. Gordon was bothered by his knee in practice, so this didn't come out of nowhere. The Chargers struggled enough to move the chains with Gordon, so they had no chance of doing so without him. ",
            "7": "Travis Benjamin led the Chargers in receiving with five grabs for 105 yards, most of which actually occurred in meaningful action. Keenan Allen (5-61) was next in the box score. Meanwhile, Antonio Gates (2-30) dropped a pass on a third down, while Hunter Henry wasn't even targeted, which was perplexing. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Redskins came into this game as home underdogs, but they were confident that they could push the Raiders around, with defensive coordinator Greg Manusky declaring that they would punch them in the mouth. That's exactly what they did. They dominated Oakland on both sides of the trenches, as the Raiders couldn't do anything. In fact, Oakland would've been completely shut out had the Redskins not committed two turnovers. ",
            "2": "This Raider squad looked like the Raiders of old, and by that I mean the 2003-14 version that wasn't competitive whatsoever. They made numerous mistakes throughout the evening, as they didn't know what hit them. Derek Carr opened the game with an interception, as he allowed the ball to hang up in the air forever. The Redskins were able to take advantage of this with a touchdown, beating Oakland with a horrible blitz, as Kirk Cousins hit a wide-open Chris Thompson. Carr was sacked twice on the second drive, then Marshawn Lynch was stuffed on a third-and-2. Following that was a possession that saw Michael Crabtree and Amari Cooper drop passes, with the instances sandwiching a holding penalty that negated a first down. Prior to halftime, Carr was intercepted on a horrible throw into double coverage, setting up a Vernon Davis touchdown. Things didn't get better after intermission. Carr, who was frequently surprised by bad Rodney Hudson snaps, was sacked twice on the opening possession of the second half. The Raiders were able to score off of a muffed punt and a fumble, but that was it. The Raiders looked like they thought they could just show up and win, but they were humbled by this result. Perhaps this will serve as a needed wake-up call, as Oakland is certainly better than this. ",
            "3": "Carr finished just 19-of-31 for 118 yards, one touchdown and two interceptions. His score went to Jared Cook (4-43), who was the only Raider who accumulated more than a dozen receiving yards before the final drive of the game! Carr's primary wideouts, Cooper and Crabtree, caught one ball each for six and seven yards, respectively. Crabtree left the game with a chest injury. ",
            "4": "Lynch struggled, mustering only 18 yards on six carries. He had just one tough run for a gain of five, and that was it. As mentioned, he was stuffed on a big third-and-2 play. ",
            "5": "The Redskins, meanwhile, did a great job of moving the chains, but weren't exactly tested. The Raiders might have the worst defense in the NFL, and it showed in this contest, as Cousins went 25-of-30 for 365 yards and three touchdowns. He also had a first-down run, but that was negated by a Trent Williams hold. ",
            "6": "Cousins' primary target was Thompson, who caught six of his seven targets for a ridiculous 150 yards and a touchdown. He also carried the ball eight times for 38 rushing yards. Involving him more on offense than Samaje Perine (19-49) in something the Redskins must do in the future if Robert Kelley misses more action. Actually, Washington's best pure runner this evening was Mack Brown, who gained 27 yards on six attempts. Brown is a talented player who should be given a chance to be the starter. ",
            "7": "Aside from Thompson, Cousins' touchdowns went to Vernon Davis (5-58) and Josh Doctson (1-52). Doctson made a ridiculous catch over David Amerson, though he did nothing else. Elsewhere, Jamison Crowder hauled in all six of his targets for 52 yards, but he muffed a punt. Terrelle Pryor continued to show bad chemistry with Cousins, snatching only two of his four targets for 19 yards. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Cardinals had a chance to establish complete control of this game, as they dominated time of possession. Carson Palmer went 5-of-5 for 78 yards on the opening drive, finishing the possession with a touchdown. They were able to force the Cowboys into a three-and-out, and Palmer capped off the next drive with yet another score. This, however, did not stand because of a Jared Veldheer holding penalty. This would be the first of many mistakes the Cardinals would make throughout the evening to ruin their chances of improving to 2-1. Following Veldheer's hold of DeMarcus Lawrence, who absolutely dominated the matchup, Phil Dawson inexplicably whiffed on a 36-yard field goal. A bit later, Frostee Rucker was able to allow the Cowboys to continue a drive by punching Zack Martin the face. Following some sacks, including one where center A.Q. Shipley was pathetically beaten by Maliek Collins, the Cardinals punted to give the Cowboys a short field, allowing Dallas to score on a Dak Prescott zone-read run. Palmer took more sacks after that, as Arizona's pathetic front couldn't block a three-man pass rush. On one occasion, the Cardinals had a horrible blocking scheme where they had Jermaine Gresham blocking Lawrence, and the defensive end took advantage. Gresham dropped a pass on the same drive. The Cowboys were eventually up, 21-14, when the Cardinals easily could've held a lead had they not shot themselves in the foot repeatedly. They didn't stop doing so, as Bruce Arians threw a challenge flag on a painfully obvious J.J. Nelson drop, which had the two announcers groaning about how horrible of a coaching decision it was. Palmer then proceeded to overthrow a wide-open Nelson for a touchdown. The promising possession concluded with a Brittan Golden drop on third down. There was also some questionable decision-making late in the game when Arians passed on a field goal on fourth down despite being down 11 points, but it didn't really matter at that point. ",
            "2": "Palmer finished 29-of-48 for 325 yards and two touchdowns. In a vacuum, Palmer played well. Aside from the miss to Nelson, he was precise on most of his throws. The problem was the insane pressure he faced. He was sacked six times, meaning he's been brought down on 11 occasions in the past two weeks. Part of the problem has been Veldheer, who used to be a talented left tackle. He was moved to right tackle in a blatantly idiotic move this season, and he has struggled as a result. The decision made no sense, especially considering that the new left tackle, D.J. Humphries, has been out of the lineup. Lawrence took advantage of this, registering three sacks. He's going to be given a massive contract shortly, thanks in part to this performance. Lawrence is the NFL's sack leader with 6.5. ",
            "3": "Larry Fitzgerald had a huge performance, as no one in Dallas' secondary could cover him. He logged a whooping 13 catches for 149 yards and a touchdown. His best reception occurred when he ripped the ball away from Orlando Scandrick while falling down. The Cowboys challenged the ruling, but replay review showed that he came up with the reception. Elsewhere in the receiving corps, Jaron Brown (2-27) caught Palmer's other touchdown. Nelson, meanwhile, was close to having a solid fantasy outing, but couldn't come up with any of his three targets. ",
            "4": "With no David Johnson and poor blocking, the Cardinals couldn't run the ball at all. Chris Johnson mustered only 17 yards on 12 carries, while Andre Ellington tallied 22 yards on five attempts. He was also a factor in the passing game, snatching five balls for 59 receiving yards. ",
            "5": "If Dallas' stat line looks underwhelming, it's because the team barely had the ball. The Cardinals won the time of possession, 36:15-23:45. Still, Prescott had a dominant fantasy outing, as he scored three touchdowns (two passing, one rushing). He misfired on just five occasions, going 13-of-18 for 183 yards and two touchdowns. He launched two bombs to Brice Butler, completing them for 53 and 37 yards. The 37-yarder was nearly yet another touchdown, but he was barely touched while his knee was on the ground. ",
            "6": "Ezekiel Elliott didn't have much running room. Save for a 30-yard carry, he didn't do much. He gained 80 yards and a touchdown on 22 attempts, but take out his longest run, and his line was just 21-50. Elliott doesn't have the same blocking he enjoyed last year, and unless that changes, the Cowboys won't be able to have much offensive success this year. ",
            "7": "Speaking of lacking offensive success, Dez Bryant had just two catches for 12 yards. He at least was able to help his fantasy owners by scoring a touchdown, but he didn't have many opportunities against Patrick Peterson. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}