{
    "year": "2017",
    "week": "11",
    "Game 1": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "40"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "The Steelers entered this game with a 7-2 record, but were a major disappointment in their first nine games. At least, their offense was. The scoring unit was averaging just 20.8 points per game, down from 24.4 the year before. Ben Roethlisberger, who pondered retirement prior to the season, had missed so many downfield throws all year, while the offense as a whole frequently bogged down in the red zone. However, if this result is any indication, the Steelers have awakened and are in prime position to make a Super Bowl run. The Steeler offense we saw in this game wasn't even close to the team we watched in the first 10 weeks of the season. They posted 40 points and were every bit as dominant as that sum indicates. There were some drops, but they were otherwise firing on all cylinders versus Tennessee. And that includes Ben Roethlisberger, who was tremendous. Roethlisberger was so much better in this contest, going 30-of-45 for 299 yards and four touchdowns. His stat line would've been better had his teammates not dropped five passes. Roethlisberger was up to his old tricks, connecting on a 10-yard pass while being wrapped up for a potential sack. He saw some pressure early, but his offensive line got its act together and kept him clean in the second half, when Roethlisberger was especially lethal. Roethlisberger's numbers following intermission were terrific; he was 20-of-23 for 183 yards and three scores after halftime. ",
            "2": "Antonio Brown was a monster in this game. The Titans had no answer for him, as he caught 10 of his 13 targets for 144 yards and a whopping three touchdowns. One of his scores was ridiculous; Brown snatched the ball with one hand and pinned it to his helmet as he was falling out of bounds. Jesse James (5-21), playing for an injured Vance McDonald, caught Roethlisberger's fourth touchdown. Meanwhile, JuJu Smith-Schuster (4-47) and Martavis Bryant (2-30) dropped passes, but made key plays beyond what the stat sheet indicates. Smith-Schuster drew a pass-interference flag to set up an eventual touchdown, while Bryant pounced on a Brown fumble right before halftime to keep a scoring drive alive. ",
            "3": "Le'Veon Bell fantasy owners have to be frustrated. They saw their elite running back score, but the play was correctly overturned by replay review. Bell still eclipsed 100 net yards, rushing for 46 (12 carries) and receiving 57 (9 catches). He dropped a pass in the second quarter. ",
            "4": "The Titans, meanwhile, weren't as bad as this score indicates. They trailed 16-14 in the third quarter when things began falling apart. Delanie Walker dropped a touchdown, while a field goal was blocked by T.J. Watt earlier in the evening. Marcus Mariota began pressing, and this led to a pair of late interceptions, one of which led to a score. Mariota finished 22-of-33 for 306 yards, one touchdown and four interceptions. He also scrambled for a score. Two of the picks weren't really his fault, as he was trying to make something happen late in the game. However, his initial pair of interceptions were terrible. The first occurred on Tennessee's opening scoring drive, which was a pass that was floated way too high. The second took place because Mariota stared down his receiver, allowing the defender to jump the route. Both picks set up Pittsburgh field goals. ",
            "5": "The Titans wasted a ton of downs running the ball with DeMarco Murray. The veteran back was very sluggish, mustering just 10 yards on eight carries. He also dropped a pass. Derrick Henry was more effective, gaining 32 yards on seven attempts. The Titans need to move forward with Henry as their starting running back, though Murray should still be involved as a receiver out of the backfield. ",
            "6": "Two Titans had more than 40 receiving yards. Rishard Matthews caught five balls for 113 yards and a touchdown, which was a 75-yard reception on the opening play of the second half. Meanwhile, Walker (6-92) had a solid outing except for his dropped score. Elsewhere, Corey Davis had a very impressive 10-yard reception in which he tapped his toes down along the sideline before falling out of bounds. However, he didn't do much else, catching three balls for 27 yards. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Lions needed to win this game to keep pace in the NFC wild-card race, but with an impending Thanksgiving game in four days, they showed up flat in the early going. They were down 17-7 in the second quarter, as they had some poor tackling efforts. Matthew Stafford's strip-sack didn't help matters. However, Stafford was able to bounce back with a terrific performance to lead Detroit to victory. Stafford appeared to be injured when he took a big hit in the second quarter. He limped around, but that apparently didn't bother him, as he hit a 40-yard pass to Kenny Golladay on the same drive. Stafford tore up the Bears after that, taking advantage of a Chicago squad missing the heart, soul and brains of its defense in Danny Trevathan. The Bears did well against Stafford in the opening quarter, but he was unstoppable after that. Stafford finished 21-of-31 for 299 yards and two touchdowns. He had a great drive in the fourth quarter to move the team into Matt Prater field-goal range, with the key play being a 26-yard completion to Eric Ebron, who needed to do something like that to make up for all of the mistakes he's made over the years. That includes earlier in this contest, as Stafford spent some time yelling at Ebron on the sidelines following a miscommunication in the opening half. ",
            "2": "Ebron's 26-yard completion gave him a respectable stat line of 4-49. He was fourth on the receiving list, trailing Marvin Jones (4-85), who scored a touchdown, T.J. Jones (4-55) and Golladay (2-52). Golden Tate was a disappointment despite the Bears missing slot corner Bryce Callahan, catching only three balls for 32 yards. ",
            "3": "Despite Trevathan's absence, the Lions couldn't run the ball effectively. Ameer Abdullah mustered only 22 yards on 11 carries, though he was able to score a receiving touchdown. ",
            "4": "The turning point for the Bears, who, as mentioned, were up 17-7, was one sequence where their offensive line betrayed them. Kyle Long committed a personal-foul penalty to negate a 15-yard play, and then a botched snap between Mitchell Trubisky and the center was returned for a touchdown. This sparked the Lions, while the Bears mustered just seven points after that. Trubisky made some very poor throws in the second half. Prior to the final drive of the afternoon, Trubisky had just four completions following intermission. There was one drive in which Chicago took over with great field position, but went three-and-out because of a pair of horrible Trubisky throws. However, Trubisky was able to lead Chicago into field-goal range with an impressive final possession. Connor Barth was set up with a 46-yard field goal to send the game into overtime, but he was way wide right. The kick was so bad that the FOX announcer shouted, Holy Moses! Trubisky finished 18-of-30 for 179 yards and a touchdown. It was an above-average performance, as he slowed down following a hot start. However, he was able to put his team in position to tie, and he also threatened Detroit's defense with his legs, scrambling six times for 53 rushing yards. He inexplicably picked up a fourth-and-13 on the final possession with a run past the first-down marker. ",
            "5": "Trubisky's sole score went to rookie tight end Adam Shaheen (4-41). Shaheen trailed only Dontrelle Inman (3-43) on the receiving list. ",
            "6": "Jordan Howard had a 50-yard burst in the opening half, allowing him to eclipse the century mark. He gained 125 yards and a score on 15 carries. Tarik Cohen (9-44) vultured a touchdown away from Howard in the second half. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Dolphins have been extremely sluggish defensively the past several weeks, but it was the offense's turn to struggle mightily in this contest. The team opened up with a 69-yard Damien Williams run, but an interception crushed the team. It wasn't Jay Cutler's fault, as DeVante Parker fell down in the end zone. This would be a trend for the Dolphins throughout the early stages of the afternoon, as Cutler tossed three picks in the opening half. The second one was definitely his fault, as he foolishly threw the ball across his body. The third was on Parker again, as he had the ball bounce off his hands. These interceptions, as well as a crushing penalty on Jermon Bushrod to negate a 48-yard reception by Jarvis Landry, allowed the Buccaneers to operate on short fields. They took advantage, notching 20 points in the opening half. They were able to reach the end zone twice, marking the first time they scored a touchdown in an opening half in five games! Tampa Bay maintained a 20-3 lead, but the Dolphins engineered a comeback with Matt Moore, who was tremendous in replacing Cutler, who was concussed. Moore actually tied the game at 20, but the Buccaneers were able to move into field-goal range on the final possession of the game to secure the victory. ",
            "2": "Cutler should probably be removed as Miami's starting quarterback, at least for the next game. The Dolphins were so lethargic with Cutler, who went 6-of-12 for 83 yards, one touchdown and the three picks. Moore was so much better (17-of-28, 282 yards, one touchdown), and his numbers could've been even better because he was robbed of a touchdown when Julius Thomas was called for offensive pass interference. The call was completely bogus, as the FOX announcers pointed out. ",
            "3": "The Dolphins should also think about removing DeVante Parker from the starting unit. Parker was awful in this contest, as he was responsible for two interceptions. Kenny Stills was much better, catching seven of his eight targets for a whopping 180 yards and a touchdown. Jarvis Landry (6-95) also had a score, and he drew a pass-interference flag in the end zone. Meanwhile, Parker (4-26) never really did anything positive. The Dolphins have been disgruntled with Parker's work ethic, so this type of performance is not surprising in the slightest. ",
            "4": "Miami's running game had a nice pick-up with Williams' aforementioned 69-yard gain, but Williams didn't do anything else; he finished with 78 yards on 10 carries. Kenyan Drake mustered only four yards on seven attempts, though he had a 6-yard scamper where he displayed some impressive cuts. The problem is Miami's offensive line, which is a train wreck. ",
            "5": "The Buccaneers couldn't run the ball very well either. Doug Martin was restricted to just 38 yards on 19 carries, and most of his yardage came on one 13-yard burst. Martin has been a major disappointment since returning to the lineup, and Tampa could move on from him. I have the Buccaneers selecting a running back in the second round of my 2018 NFL Mock Draft. ",
            "6": "Ryan Fitzpatrick didn't do much in this game prior to the final drive. He basically feasted on the short fields that Cutler and Parker provided for him. However, he did a great job of moving Tampa into field-goal range to win at the very end. Fitzpatrick went 22-of-37 for 275 yards and two touchdowns. ",
            "7": "Mike Evans led the Buccaneers in receiving with five grabs for 92 yards. However, it was still a disappointing performance because Evans dropped a touchdown. DeSean Jackson (2-28) found the end zone shortly afterward, aided by the fact that the Buccaneers had a fresh set of downs after another dirty hit by Kiko Alonso on a quarterback. ",
            "8": "Fitzpatrick's other touchdown went to O.J. Howard (3-52), who was second on the Buccaneers in receiving. Cameron Brate was once again a disappointment (1 catch, 12 yards), as he simply doesn't have any chemistry with Fitzpatrick. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "This game was billed as a potential playoff matchup, but it turned out to be a completely one-sided affair. The Rams went up 7-0 early in the opening quarter, but were outscored 24-0 the rest of the way, and it would've been even worse had the Vikings not missed two field goals. Minnesota outgained Los Angeles, 451-254, averaging 1.7 more yards per play. Case Keenum was tremendous once again, and unlike last week, he didn't make any mistakes at the very end of the game. Keenum went 27-of-38 for 280 yards and a touchdown. He made just a couple of poor passes, including one where he threw behind Jerick McKinnon on a third-and-8. However, Keenum made up for it with way more positive plays, including one pass where he lofted a ball in perfectly to Adam Thielen for a gain of 25 yards. Keenum finished 27-of-38 for 280 yards and a touchdown. He was especially lethal in the second half, going 14-of-20 for 189 yards and a score following intermission. ",
            "2": "Thielen continued to dominate. He caught six passes for 123 yards and a touchdown. He made one mistake where he dropped the ball at the 1-yard line, but the Rams had no answer for him otherwise. Stefon Diggs (4-32), meanwhile, had a disappointing performance, while Kyle Rudolph (5-58) drew a defensive penalty on the Rams to move the chains. ",
            "3": "The Vikings were able to run the ball effectively in the second half. Latavius Murray was bottled up early on, but broke free for a 34-yard burst following intermission. Murray tallied 95 yards and two touchdowns on 15 carries. He and McKinnon were just one carry apart, but Murray outgained his teammate by a wide margin; McKinnon was limited to 48 yards. ",
            "4": "The Rams, meanwhile, had their highest-scoring offense limited to no points outside of the opening drive, which was quite the feat for a Minnesota defense missing a starting safety. The Vikings made sure to completely bottle up Todd Gurley, as they limited the star running back to just 37 yards on 15 carries. Gurley didn't do anything in the passing game either, as he caught three balls for 19 receiving yards. He at least helped his fantasy owners with a touchdown. ",
            "5": "Another big factor for the Vikings' domination was all of the mistakes the Rams made in the passing game. For instance, an early Sammy Watkins offensive pass interference disrupted a drive. Cooper Kupp, meanwhile, fumbled the ball at the Minnesota 1-yard line in the second quarter. Late in the afternoon, Kupp dropped a ball on third down. The Rams are a young team, and their inexperience really showed in this contest. Goff finished 23-of-37 for 225 yards. He had a few impressive throws against a terrific defense, so he's way down in the pecking order for people responsible for this ugly loss. Goff didn't turn the ball over, which is a plus. ",
            "6": "Robert Woods continues to be Goff's favorite receiver. Woods caught eight of his 11 targets for 81 yards, while Kupp (6-64), despite his mistakes, was right behind him. Watkins was a disappointment once again, catching just three balls for 36 yards to go along with the aforementioned offensive pass interference. Watkins will need to step up if Woods is out; Woods suffered a shoulder injury late in this contest, but reports indicate it's not very serious. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "7"
        },
        "comments": {
            "amount": "6",
            "1": "Don't be fooled by the final score of this game. The Jaguars may have won, 19-7, but they were up just 10-7 in the fourth quarter before a late field goal and a defensive touchdown made the result a 12-point win by Jacksonville. The defensive score came in the final seconds when DeShone Kizer was strip-sacked, giving Jacksonville the undeserved cover. If you had the Browns, you can't even call this a bad beat because they've done stuff like this almost every single week. The Jaguars, meanwhile, have improved to 7-3. They might be the worst team with seven victories heading into Thanksgiving weekend in recent memory. Their defense is great, but Blake Bortles and the offensive line nearly blew this game against a dreadful 0-9 opponent. Cleveland dominated the trenches on the defensive side of the ball, and that's why the Jaguars were limited to just 284 net yards, with only 78 coming in the second half. Bortles finished 17-of-30 for only 154 yards and a touchdown. He also had two fumbles, losing one on a Myles Garrett strip-sack when Jacksonville was in field-goal range. Bortles settled mostly for checkdowns, which is why he was able to avoid interceptions in this windy, snowy game. ",
            "2": "Leonard Fournette entered the game questionable, but he had a solid showing against a quality run defense, gaining 111 yards on 28 carries. ",
            "3": "Marqise Lee once again paced the Jaguars with five catches for 45 receiving yards. Rookie Dede Westbrook, making his pro debut, hauled in three balls for 35 yards, but he made some mistakes. He dropped a pass in the second quarter and then fumbled on the very next play. Fortunately for Westbrook, his team retained possession because the Browns couldn't recover the ball before it trickled out of bounds. ",
            "4": "As for the Browns, Kizer took a big step backward from last week. He had a decent performance versus the Lions, but he managed to complete only half of his passes in this affair, going 16-of-32 for 179 yards, one touchdown and two interceptions. He was actually picked on his very first pass attempt, and he had the aforementioned lost fumble on the strip-sack at the end. Kizer had a couple of nice throws - he ripped a ball to Duke Johnson for a touchdown in the opening half - but accuracy problems plagued him throughout the afternoon. On one drive, he overthrew an open Corey Coleman, then heaved a poor screen pass. And if that wasn't enough, a dump-off attempt was also off the mark. The Browns are drafting a quarterback come April, and after Josh Rosen's performance against USC, it could easily be him. Check out the 2018 NFL Draft Quarterback Prospect Rankings for more. ",
            "5": "Kizer, sadly, led the Browns in rushing with five scrambles for 22 yards. Isaiah Crowell found no running room versus Jacksonville's elite defense, as he was restricted to just 18 yards on 11 carries. ",
            "6": "Coleman's return to the field was a successful one. He caught six balls for 80 yards. He dropped a pass, but he would've posted a better stat line had Kizer not been guilty of the aforementioned overthrow. Duke Johnson (4-56) was the only other Cleveland player with more than 15 receiving yards. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "The Packers, with Brett Hundley as their starter, have had a habit of opening the game impressively, only to make crushing mistakes. That was the case in this contest, with Hundley engineering an great initial drive. He took his team into the red zone, doing his best Aaron Rodgers impression to draw the Ravens offside. However, the Packers came away with no points because Hundley tossed a stupid interception into double coverage in the end zone. Hundley looked good at times on the next two possessions as well, but those drives also ended in turnovers. Hundley threw an interception up for grabs because he was under pressure. After that, backup running back Devante Mays lost a fumble. The Packers were guilty of three turnovers on their first three drives. The Packers continued to shoot themselves in the foot, ruining their chances to pull the upset. A quality opponent would've taken advantage of that and put the game away, but Baltimore's pedestrian offense couldn't do anything about it. The Ravens were only able to go into halftime with a 6-0 lead, as they averaged only 3.8 yards per play. The offensive line was a mess heading into this contest, so that wasn't a surprise. On one drive, the Ravens had a botched snap and a sack. On another, Flacco was picked off on a forced throw to Danny Woodhead. Baltimore generated just 106 yards of offense prior to intermission. Flacco, however, rebounded with a strong second-half effort, taking advantage of Clay Matthews' absence (groin). He found Ben Watson for a big gain, then lofted a beautiful touchdown pass to Mike Wallace, who came up with a one-handed reception despite some great coverage by Damarious Randall. This put Baltimore up 13-0, which put the game out of reach for the struggling Packers. ",
            "2": "Flacco misfired on just six passes, going 22-of-28 for 183 yards, one touchdown and the aforementioned interception. Flacco didn't take too many chances, but it's not like he needed to. With a lead throughout the afternoon, Flacco never had to press, which was a good thing considering that he was missing left tackle Ronnie Stanley. ",
            "3": "Wallace led the Ravens with 56 receiving yards on four catches with a touchdown. Jeremy Maclin (4-34) was next on the list. Baltimore's receiving numbers were more suppressed than usual because of the flow of the game. ",
            "4": "The Ravens struggled to run the ball, with Alex Collins mustering just 49 yards on 20 carries. He was at least able to score a touchdown. Woodhead, meanwhile, did all of his damage as a receiver, catching five balls for 21 yards. ",
            "5": "As for the Packers, Hundley killed his team by taking big sacks and failing to anticipate throws. His passes were late, and he made too many mistakes. He finished 21-of-36 for 239 yards, three picks and a lost fumble. He took a major step backward this week, as he no longer had the luxury of battling a defense missing its star linebacker. ",
            "6": "Despite Hundley's struggles, Davante Adams had another strong performance, catching eight balls for 126 yards. It's clear that Adams is the only receiver Hundley trusts, as Jordy Nelson (2-24) hasn't done anything of note since Aaron Rodgers' injury. ",
            "7": "Jamaal Williams, starting at running back for the Packers, was held to 57 yards on 18 carries. He also caught four balls for 38 receiving yards. He converted an early fourth-and-1, but then was stuffed on another fourth-down try. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Texans",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "21"
        },
        "comments": {
            "amount": "6",
            "1": "The Texans celebrated Andre Johnson during halftime of this game, making him the first player to ever be enshrined in their Ring of Honor. That was certain to be the highlight for the Texans, as this was a matchup between Tom Savage and Blaine Gabbert. However, Savage and his teammates made enough surprisingly spectacular plays to post 31 points on the scoreboard, as Houston came away with a double-digit victory. Things didn't look good in the early going, as a potential Savage interception was dropped by Tyrann Mathieu. Savage was also strip-sacked, setting up an Arizona touchdown. And if that wasn't bad enough, Savage was picked off, as a pass of his deflected off Deone Bucannon's hands and into Patrick Peterson's, leading to another Cardinal trip to the end zone. It seemed like the Texans made up their mind to have Savage throw DeAndre Hopkins' way in the second half. Peterson blanketed Hopkins prior to intermission, but Hopkins had two big plays early in the third quarter, beating Peterson on a touchdown. On an ensuing drive, Savage converted a third-and-8 while falling down. He found Stephen Anderson, which moved the Texans into the red zone. Savage finished 22-of-32 for 230 yards, two touchdowns and an interception. Of his yardage total, 136 came in the second half. He was much better this week, though he was battling a lethargic Arizona team. ",
            "2": "Hopkins finished with four catches for 76 yards and a touchdown, and he came up inches short of another score. He and Bruce Ellington (6-63) were the only Texans with more than 22 receiving yards. ",
            "3": "Lamar Miller was held to 61 yards on 22 carries, though he caught a touchdown, catching four balls for 22 receiving yards. D'Onta Foreman was much more impressive; he outgained Miller, 65-61, despite being given just 10 carries. He also scored twice, but suffered an injury on his second touchdown run. It turned out to be a torn Achilles, so Foreman is out for the rest of the season, unfortunately. There's a chance Foreman won't be ready for training camp. ",
            "4": "As for the Cardinals, Blaine Gabbert did some nice things, especially in the opening half. He was 11-of-14 for 120 yards and two touchdowns prior to intermission. To be fair, Gabbert was set up on a couple of short fields because of Savage's turnovers. Gabbert didn't have as much success following the break; he was 11-of-20 for 137 yards, one touchdown and two picks in the second half. Gabbert's final numbers were 22-of-34 for 257 yards, three scores and a pair of interceptions. ",
            "5": "Larry Fitzgerald led the Cardinals with nine catches for 91 yards and a touchdown. Gabbert's other two scores went to tight end Ricky Seals-Jones, who came out of nowhere to haul in three balls for 54 yards and the pair of touchdowns. Seals-Jones is an undrafted rookie free agent who played receiver in college. He has some potential, though I wouldn't expect too many big performances the rest of the year. ",
            "6": "Adrian Peterson didn't do much, as he was limited to just 26 yards on 14 carries. He was stuffed on a key fourth-and-1 when the Cardinals were down only three points late in the game. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Giants",
            "Points": "12"
        },
        "Team 2": {
            "Name": "Chiefs",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: If you needed evidence to see if the NFL is either completely unpredictable or absolutely rigged, look no further than this game. Andy Reid was coming off a bye, but not only did he fail to cover, he didn't even beat a Giants team that was blown out by the 49ers! ",
            "2": "The Chiefs were coming off their bye week, so losing in overtime to the 1-8 Giants was pathetic. Clearly, Kansas City's offense isn't the same unit that was ripping defenses in the first five weeks of the season. The offensive line has not controlled the point of attack, Alex Smith has reverted to his 2016 form, and Kareem Hunt looks like he has hit the rookie wall. The 6-4 Chiefs have to turn things around quickly to have any hopes of competing with the Steelers and Patriots in January. With the meaningless win, the 2-8 Giants could end up hurting their draft positioning, but as of right now, they remain in the third slot behind the Browns and 49ers. ",
            "3": "With both offenses struggling, there were a few trick plays tried in this game. Giants converted a fake punt in the first half to pick up a first down near midfield. New York went to another gadget play near the end zone with Shane Vereen throwing a pass on a halfback option, but the ball was picked off by Kansas City safety Daniel Sorensen. The Chiefs gave it right back when they tried a shovel pass to Travis Kelce, which was deflected up in the air and then caught by Giants defensive tackle Snacks Harrison for an interception. That put New York at the Kansas City's 26. A pass interference on Marcus Peters in the end zone moved it to the 1-yard line and New York scored with Orleans Darkwa. The Chiefs drove across midfield, and Alex Smith converted a fourth-and-5 with his legs to get the first down. Smith then hit Kelce for 21 yards to get inside the 15, but the drive stalled. A field goal cut the Giants lead to 6-3 at halftime. At the end of the third quarter, Tyreek Hill (7-68) made a leaping 38-yard catch over Janoris Jenkins to get the Chiefs into New York territory. Once again, the drive stalled, and Kansas City tied the game at six with another field goal. Midway through the fourth quarter, the Chiefs tried a trick play with Kelce throwing a deep ball for Demarcus Robinson, but the pass was easily intercepted by Landon Collins. Kansas City's defense bailed out the offense and got the ball back, but the Chiefs were put in a tough situation again as Smith overthrew Robinson and Jenkins intercepted the pass. Jenkins then returned the pick to the Chiefs' 23-yard line with just over two minutes remaining. New York hit a 26-yard field goal to go up 9-6 with 1:38 left. The Chiefs got into field-goal range with a 32-yard completion to Kelce that put them inside the New York 35-yard line. Smith threw some short passes and ran for a first down to get inside the 15, but shots at the end zone went incomplete, so Kansas City tied the game at nine to force overtime. The Chiefs had a drive going in overtime, but ended up punting again. With less than two minutes remaining in the extra period, Roger Lewis (3-55) made an incredible catch on fourth down while sliding on the ground for 34 yards. That got the Giants to the Kansas City 2-yard line, and soon Aldrick Rosas drilled the 23-yard field goal for the win. ",
            "4": "Smith was 27-of-40 for 230 yards with two interceptions. Hunt ran for 73 yards on 18 carries. ",
            "5": "Kelce led the Chiefs in receiving with eight catches for 109 yards. Surprisingly against Kelce, the Giants' defense ended their streak of 10 straight games of giving up a touchdown to a tight end. ",
            "6": "Eli Manning was 19-of-35 for 205 yards with zero touchdowns and zero interceptions. Darkwa had 74 yards on 20 carries with a touchdown. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Saints",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: You have to feel bad for the Redskins. They played a tremendous game and did all they could to keep their season alive. Alas, their season is over at 4-6, as even winning out wouldn't even guarantee them a playoff spot. ",
            "2": "The Redskins have to be ashamed of their effort in the fourth quarter. After having the advantage for much of the game, including a 15-point lead late in the contest, the Redskins just blew it. They let the Saints complete wide-open passes and march down the field easily to score the last 18 points and win in overtime. The Saints were able to win on Sunday, largely thanks to the efforts of Drew Brees. The veteran quarterback was the catalyst for the Saints down the stretch. He sparked the comeback with his terrific passes and his ability to quickly command the offense. Throughout the fourth quarter, Brees threw accurate passes to his receivers and was constantly able to find wide-open receivers. The Redskins blew a lot of coverages late in the contest, and Brees was able to expose every single mistake made. He was perfect in the fourth quarter and led two very quick scoring drives to make up the 15-point deficit. By the end of the day, Brees' state line looked like this: He went 29-of-41 for 385 yards, two touchdowns and one pick, which came on the team's first drive. Brees was nearly flawless and clearly is still one of the top quarterbacks in the NFL. ",
            "3": "Brees' top targets on Sunday were predictably Michael Thomas (6-91) and Alvin Kamara (6-75, 1 TD). Thomas saw a team-high 11 targets and was able to find space against Washington's secondary. On one nice catch, Thomas caught a short pass and proceeded to spin away from the defenders and push ahead for an extra six yards. As for Kamara, he did a lot of damage as a receiver and was able to catch what turned out to be the tying touchdown pass. Kamara was heavily targeted by Brees out of the backfield during the 2-minute drill in the first half. Kamara's versatility makes him a huge threat, and he can be trusted as a high-end RB2. . Brees' other favorite targets were tight end Coby Fleener (5-90) and Ted Ginn Jr. (6-86). ",
            "4": "On the ground, the Saints saw a huge performance from Mark Ingram. The veteran running back was able to gash the beat-up Washington defense for most of the day. He finished with just 11 carries, due to the fact that the Saints were trailing most of the afternoon, but he put up a whopping 134 yards and a touchdown. In overtime, he had two massive gains on toss plays to set up the Wil Lutz game-winner, and he also ripped off a very nice 36-yard touchdown that saw him follow his blockers through a massive hole in the Redskins' front. Ingram is an RB1 for the rest of the year, though the timeshare with Kamara, who got 42 yards on eight carries, could frustrate some owners. ",
            "5": "As for the Redskins, this loss was humiliating. They had a huge lead with just half of the fourth quarter to play. They blew it, and now they are extremely unlikely to make the playoffs. It's hard to blame Kirk Cousins for the overall struggles of the team. He was one of the more consistent players for Washington, and he was able to help the Redskins consistently move the ball. Much like the Washington defense, New Orleans' stop unit had trouble allowing receivers to break open at times. There were a few throws that Cousins made to wide-open members of his receiving corps, and he was right on the money for all of them. Cousins did well to scan the field and find the best player to throw to. If anything, this performance strengthened Cousins' case as a franchise quarterback, though his inability to lead a game-winning drive was a bit concerning. That said, in overtime, Cousins had two passes dropped and was sacked for a big loss on second down. The sack may have been his fault, but both of the drops were catchable plays. Overall, Cousins finished 22-of-32 for 322 yards and three touchdowns. However, his stat line should have been even better, given that his receivers made some critical drops throughout the day. ",
            "6": "Cousins finally appears to have a receiving corps he is comfortable with. He had three top targets during Sunday's contest. They were Josh Doctson (4-81), Vernon Davis (3-67) and Jamison Crowder (7-72). Doctson had a coming-out party in the first half, as he looked like the explosive play-maker who the Redskins believe they had drafted in the first round. Doctson had a nice, long catch early on and generally did well to find space. He is worth a speculative add as a potential FLEX play late in the year. As for Davis, he has taken over as the top tight end for the Redskins. He has great receiving ability and is a reliable target. He did have one brutal drop on the first play of overtime, but other than that, he was generally solid. Davis appears to be a TE1 as long as Jordan Reed is out. Elsewhere, Crowder was solid across the middle of the field while Cousins' touchdowns went to Ryan Grant (3-59), Chris Thompson (1-16) and Jeremy Sprinkle (1-7). ",
            "7": "Speaking of Thompson, the Redskins suffered a crushing blow when he went down with an injury. According to reports, he has a broken fibula and will be out for the season. He was a sparkplug for the offense and will be missed. The good news for the team is that Samaje Perine looked like a capable lead back, gaining 117 yards and a touchdown on 23 carries. Perine is a good combo back and is definitely worth adding in fantasy. He could become an RB2 due to the volume of touches he will get with Thompson out. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "54"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: What's worse, Sean McDermott's decision-making regarding his quarterbacks, or my handicapping? It's a tough call, really, and there was a confluence of the two in this utterly miserable game. ",
            "2": "Buffalo entered this game in the playoff race at 5-4, so the decision to bench Tyrod Taylor was difficult to understand. With Nate Peterman at quarterback, the Bills were routed by halftime, as he threw four interceptions during the first 18 minutes of game time and five picks across the first half. Not all of them were his fault, as one was deflected, and he was hit as he threw on some others, but the Bills could have used Taylor's mobility against the Chargers' pass rush. With this win, the Chargers are clinging to slim playoff hopes at 4-6, but the loss last week to the Jaguars was painful, as the Chargers would be 5-5 had they been able to run out the clock after two late Blake Bortles interceptions. Thus, Los Angeles has to have this game be the start of a winning streak to make the playoffs. ",
            "3": "New Bills wide receiver Kelvin Benjamin (1-20) went down with a right knee injury at the start of the first quarter and was carted into the locker room. On the next play, the Bills had a pass get deflected up in the air after it bounced off the hands of Patrick DiMarco, and it was intercepted by Korey Toomer, who raced down the field for a 59-yard pick-six. Peterman threw a true interception on the next position, sailing a ball down the middle of the field after being pressured. That led to a pick for Casey Hayward, but the Chargers missed a makable field goal. Buffalo took advantage with LeSean McCoy breaking off a 37-yard run. On the next play, he got loose down the sideline for a 27-yard touchdown run to tie the game at seven. The Chargers responded with a field goal to take a 10-7 lead. Promptly, Peterman threw his third interception of the first quarter when he was hit as he threw, and the ball floated to Tre Boston. In the second quarter, the Chargers were able to extend their lead as Philip Rivers connected with Keenan Allen for a 21-yard touchdown. Peterman soon threw his fourth interception on a poorly located pass, and Hayward made the diving catch. Allen then caught a 2-yard touchdown pass to put up Los Angeles 24-7. The Chargers added a field goal before Melvin Gordon took off on a 10-yard touchdown run. Peterman was pressured again and threw his fifth interception of the first half. In the third quarter, the Chargers added a field goal, and Taylor replaced Peterman. McCoy ripped off some yards, and the Bills turned it into a 50-yard field goal. At the end of the third quarter, Joey Bosa beat the right tackle to get a strip-sack. Melvin Ingram scooped up loose ball and ran it 38 yards for a touchdown. Taylor led a touchdown drive, throwing a corner route to McCoy for a 12-yard touchdown. ",
            "4": "Rivers completed 20-of-32 passes for 251 yards and two touchdowns. Allen has 12 receptions for 159 yards and two scores. ",
            "5": "Gordon totaled 80 yards on 20 carries with a touchdown. ",
            "6": "Taylor was 15-of-25 for 158 yards and a touchdown. Peterman was 6-of-14 for 66 yards with five interceptions. ",
            "7": "McCoy was the lone bright spot for the Bills, totaling 114 yards and a touchdown on 13 carries. He also had a 12-yard touchdown catch. ",
            "8": "The Chargers' defense got an excellent game from their pass-rushing tandem of Ingram and Bosa. They hit Peterman as he threw on a few of his interceptions, helping to cause some fo those turnovers; not to mention the Bosa strip-sack that Ingram returned for a score. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: It's unbelievable that the Broncos outgained the Bengals legitimately by 150 yards, yet still found a way to lose. The better team doesn't always win, and this was definitely a case of that happening. ",
            "2": "This was the most competitive of the games in the 4 p.m. slate, but it wasn't exactly an exciting one. The matchup was advertised as one that would eliminate a team from playoff contention. While neither team looks to be postseason-bound, the Bengals were able to win and gain the distinction of still having life in the race. Andy Dalton had an efficient performance on Sunday afternoon. Despite the fact that the Bengals only had the ball for 25 minutes, Dalton was able to orchestrate some solid downfield drives that allowed the Bengals to build an early lead. Granted, he was gifted field position inside the Denver 5-yard line in the first quarter, but he did convert that into a touchdown. Dalton's downfield accuracy in this contest was very good. On a couple of plays, Dalton was able to hit receivers who were open for touchdowns. On one play, Alex Erickson broke away from Bradley Roby and ended up being wide open. Dalton threw a perfect pass to Erickson that got the Bengals their second touchdown. Later, Dalton would find A.J. Green, who had a man beaten, for another downfield touchdown that saw him loft the ball perfectly to Green and hit him in stride. It was a very nice throw and really helped to seal the deal for the team. Overall, Dalton finished 15-of-25 for 154 yards and three touchdowns. He was able to do everything needed of him to help the Bengals win. It was an encouraging performance for the veteran quarterback, and the Bengals need to hope that it carries over to the upcoming weeks. ",
            "3": "Dalton spent a majority of the day targeting A.J. Green, which should come as no surprise. Green caught four passes for 50 yards and had the aforementioned touchdown. He did all this while battling a stellar Denver secondary. Green is a matchup-proof WR1, and while he has had a rough outing or two this year, he should be trusted every week. Elsewhere in the receiving corps, Erickson (2-42, 1 TD) looked solid, while Tyler Kroft (2-12) caught Dalton's first touchdown of the day. Brandon LaFell (3-37) also was productive. ",
            "4": "The run game was a bit harder for the Bengals to get going. Joe Mixon saw a career-high 20 carries, but only was able to generate 49 yards against the tough Broncos front. Mixon is a workhorse back moving forward, but it's just a shame that his blocking isn't better. ",
            "5": "For the Broncos, this loss continues the team's downward spiral. Until they find a legitimate quarterback, they won't make the playoffs. Brock Osweiler doesn't qualify as that. Osweiler had an up-and-down performance in his third start this year. In the early going, it looked like the Broncos were going to have to bench him. He started the game poorly, throwing numerous inaccurate passes, including a terrible interception in the end zone. Osweiler threw the ball straight to Dre' Kirkpatrick, who would have run 102 yards into the end zone untouched had he not inexplicably dropped the ball just before the goal line. However, after the half, Osweiler's performance greatly improved. He still had trouble with downfield passes, often overthrowing his receivers due to a lack of touch on his passes, but his short and medium accuracy was there. Osweiler was able to keep the Broncos competitive thanks to his improved accuracy. In particular, Osweiler's touchdown pass to Demaryius Thomas in the fourth quarter was a great throw. Osweiler finally was able to launch a nice touch pass with perfect accuracy and ball location that Thomas went up to catch in the end zone. That score brought the Broncos to within three, but they couldn't pull off the win. Overall, Osweiler finished 23-of-42 for 254 yards, one touchdown and one interception. It was a decent performance for him, but it's clear that he is a backup at the NFL level. He simply doesn't have the pocket awareness or consistent downfield accuracy to be a strong starter. The Broncos will likely look to add some competition to their quarterback room in the offseason. Perhaps they will consider one of the first-round quarterbacks in the 2018 NFL Draft. ",
            "6": "Osweiler's top receivers this week were the aforementioned Thomas (5-64, 1 TD) and Emmanuel Sanders (2-16). Thomas was quiet for most of the contest, but he exploded in the fourth quarter and was a key factor on the Broncos' final touchdown drive. As long as the Broncos lack a quality starting quarterback, Thomas is no more than a WR2 at best. Meanwhile, Sanders saw eight targets, but he wasn't able to do much with them, totaling only the 16 yards. He should bounce back in the near future. Elsewhere, Austin Traylor (4-36) was a surprise contributor at tight end. He had some good catches, but he isn't worth adding in any fantasy format yet. ",
            "7": "On the ground, the Broncos have definitely shifted to a committee look. At the start of the season, C.J. Anderson functioned as the lead back while Jamaal Charles was the change-of-pace guy. That has now changed. On Sunday, Anderson split carries with Devontae Booker, who served as the co-leader of the backfield and primary passing back. Booker out-touched Anderson 19-to-15, and he saw more action late in the contest after Anderson fumbled. Overall, Booker finished with 14 carries for 44 yards and five catches for 54 yards. He can be added if you're looking for running back depth, or as a handcuff to Anderson, who got 13 carries for 37 yards and a touchdown. ",
            "8": "Denver's defense continued to be the main strength for the team. Prior to the fourth quarter, the team had done a good job of preventing the Bengals' offense from moving. But by the end, the Broncos' defense was worn out and didn't get enough offensive support. The unit will keep the Broncos in games, but until the offense gets better, they won't be a contender at all. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "8"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: If the Patriots' stadium lease ever runs out in Foxboro, they should consider relocating to Mexico. It was insane how many New England fans were in the stands. ",
            "2": "In the high-elevation of Azteca Stadium in Mexico City, Tom Brady completed his first 12 passes on his way to completely carving the Raiders secondary into nice, thin strips of pre-Thanksgiving morsels that the Patriots went on to gobble up whenever they needed a boost. From the get-go, this game never felt like it was competitive. Dion Lewis started the scoring after Brady completed eight passes to take his team into scoring position and then hit Lewis in the flat, where he then juked a defender and barreled over the goal line for a 15-yard touchdown to start the rout. Lewis led the team in rushing, as he carried the ball 10 times for 60 yards, and he also added four receptions on four targets for 28-yard and that early touchdown. His receiving work is new and could have been a byproduct of Rex Burkhead fumbling on that first drive, even though the Patriots recovered. It does likely push Lewis' importance in this offense up and Burkhead's back down a bit. On their next drive, Derek Carr was intercepted on a deep pass that bounced off Johnny Holton's shoulder pad. They were looking to keep up with the Patriots, and it ended up costing them, as they never had the feel of an offense that was comfortable. This was partly on the Patriots defense, but also because they got down quick and turned the ball over just as quickly. Two drives later, Brady hit Brandin Cooks for the first of his two big gainers for the day, with a 52-yard bomb. Brady then picked the Raiders apart, as he finished the drive with his arm, connecting on a short touchdown to Danny Amendola. At that point, it was 14-0, and the Raiders knew they had to score or be trounced. Oakland got the ball back, and on 2nd-and-10, Marshawn Lynch busted off a 25-yard run, then Jalen Richard touched the ball on the next four plays for 19 yards. Lynch then went back to work for 11 yards on two carries. Then, at the Patriots' 15-yard line, Derek Carr hit Seth Roberts for 12-yards, but he fumbled and the Patriots recovered. The Raiders had bullied their way into the red zone with the run game and then, pfft. That fumble was a back-breaker, and there really was no way the Raiders were going to be able to keep up with the Patriots offense down 14-0. ",
            "3": "Lynch ended up carrying the ball 11 times for 67 yards, which probably makes sense, as the Raiders were down big and would need the passing game to come from behind, but in retrospect, keeping their offense on the field might have been valuable to the defense that was getting picked apart. But I'm grasping at straws here, because they just didn't have the personnel to stop Brady. ",
            "4": "Brady was unstoppable in the first half, completing 20-of-24 passes for 201 yards and two touchdowns. The Raiders came into this game allowing the best completion percentage to opposing quarterbacks, and this performance will only help push them into the upper echelons of pass defense futility. Going into halftime Brady and company went 48 yards in 33 seconds to set up a mammoth 62-yard field goal for Steven Gostkowski, who nailed it in the high elevation. It likely would have been good from 70 yards. Of course, Brady wasn't done, as he took the ball on the first drive after halftime and hit Brandin Cooks for a 64-yard touchdown in stride. If you weren't sure if the last nail had been driven into the coffin, well, that was it. ",
            "5": "The Raiders didn't muster much after that until the fourth quarter. Trailing 30-0, they went on a meandering five minutes and 20 seconds drive that ended in a 9-yard touchdown to Amari Cooper. The Raider receivers, including Cooper, were not good this week, which hurt Carr and the offense overall on a day when they had to be perfect. Carr wasn't great, but he was better than his numbers. ",
            "6": "The Raiders will try to improve on their 4-6 record next week, as Oakland hosts the 3-7 Denver Broncos as they try to stay in the wild-card hunt. The 8-2 Patriots host the 4-6 Dolphins for what should be an embarrassing loss for Miami. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "Despite this lopsided score, this game was highly in doubt entering the third quarter. The Cowboys actually led at halftime, 9-7, but they couldn't stop the onslaught of Philadelphia's offense following intermission. The Eagles made some mistakes in the early going. They committed three drops in the opening half, and Carson Wentz was nearly intercepted when David Irving batted his pass. Jake Elliott even missed a 34-yard field goal and then proceeded to be concussed, prompting Doug Pederson to tell NBC that he would have to go for it on fourth down when in Dallas territory. This would've been a big deal in a close game, but Philadelphia exploded in the second half. The team stopped making mistakes, and Wentz shredded the Sean Lee-less Dallas defense to pieces. Wentz misfired on just two occasions following halftime, throwing both of his touchdowns after the break. Wentz finished 14-of-27 for 168 yards and two touchdowns. It wasn't the best fantasy line, but keep in mind that Wentz was just 7-of-18 for 80 yards in the opening half. As mentioned, he endured several drops. He wasn't blameless, as he was off the mark on some throws, but his second-half stat line - 7-of-9, 88 yards, two touchdowns - aptly described how prolific he was late in the game. ",
            "2": "Wentz's touchdowns went to Alshon Jeffery (4-67) and Torrey Smith (3-28). Jeffery was the only Eagle with more than 30 receiving yards. It was surprising to see Zach Ertz fail to do anything of note - two catches, eight yards with one drop - until the NBC announcers noted that the talented tight end was dealing with a hamstring problem. This injury kept him out of the Denver game in Week 9, but it was shocking that he didn't heal up during the bye. ",
            "3": "Jay Ajayi broke free for a 70-yard run in the second half, and he would've scored a touchdown had the Cowboys not chased him down just shy of the goal line. Ajayi finished with 91 yards on seven attempts. LeGarrette Blount (13-57) ran well, too. Corey Clement (6-50) found the end zone. ",
            "4": "As great was Wentz was in the second half, Philadelphia's defense was even more dominant. The Eagles pitched a shutout after halftime, as they limited Dallas to just 110 net yards in the second half, which includes some garbage-time yardage. They put tons of pressure on Dak Prescott, as it was once again apparent how much Dallas missed Tyron Smith. The Cowboys gave their left tackle some help this time, but not nearly enough. On one occasion, rookie Derek Barnett dashed right by Byron Bell to hit Prescott's arm, dislodging the ball in the process. The fumble was returned for a touchdown, though the game was already decided by then. Prescott finished with a horrible stat line, going 18-of-31 for only 145 yards, three interceptions and a lost fumble. Two picks occurred in meaningful action; the first wasn't Prescott's fault, as the ball deflected off Terrance Williams. The second was a poor decision, as Prescott heaved the ball into double coverage. Prescott was off the mark on a number of his other throws, overshooting Cole Beasley on a crucial third down early in the second half. ",
            "5": "Dez Bryant was the only Cowboy with more than 35 receiving yards; he caught eight of his 14 targets for 63 yards. Williams (4-35) was responsible for the aforementioned interception. He desperately needs to be upgraded, but I've been saying that for years now. It's puzzling why the Cowboys are content with having only one potent receiver. Here are the 2018 NFL Draft Wide Receiver Prospect Rankings. ",
            "6": "Despite the liabilities on the offensive line, Alfred Morris gained 91 yards on 17 carries. He would've eclipsed the century mark had the Cowboys been able to run the ball more in the second half. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "31"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks had a chance to engineer a terrific comeback. Down 34-23 with four minutes remaining, Russell Wilson quickly drove down the field to score a touchdown. Following an Atlanta three-and-out, Seattle moved into field goal range to have Blair Walsh attempt a 52-yard kick. Walsh predictably choked under pressure, as his meek try was about five yards too short. The thing is, it never should've came down to that. The Seahawks made numerous mistakes throughout the night, which would explain why they lost to the Falcons despite outgaining them by 81 yards and averaging more yards per play than Atlanta. It began early with a Russell Wilson interception, followed by a fumble returned for a touchdown, and it ended late with Wilson tossing a couple of short passes over the middle of the field with no timeouts, which allowed way too much time to drain off the clock. Wilson was guilty of this versus the Redskins a couple of weeks ago, and it appears as though he has learned nothing since. Despite Wilson's blunders, Pete Carroll was the person who really screwed this game up for Seattle. It began right before halftime when Carroll tried a fake field goal, eschewing a chip-shot field goal. Carroll needed the three points at the end, and the fake had no chance. It made no sense anyway; even if the Seahawks picked up the first down, they wouldn't have had time to attempt a shot at the end zone. Carroll later cost his team a timeout by challenging an obvious Doug Baldwin incompletion. Again, this is a timeout he could have used at the end to get Walsh closer. Carroll also made a terrible mistake not to go for it on a fourth-and-1 in the fourth quarter. Granted, he was at his own 20-yard line, but with the way his defense was playing, giving the ball back to the Falcons would've given Atlanta some points and an opportunity to kill time off the clock, and that's exactly what happened. The Falcons drained five minutes and kicked a field goal to make it a two-possession game. ",
            "2": "Having said all of that, it's hard not to compliment Matt Ryan for his performance in this contest. Ryan mounted a tremendous comeback in a regular-season battle against Seattle last year, and he has been lethal against them since. The Seahawks stood no chance of stopping Ryan, who went 19-of-27 for 195 yards and two touchdowns. The overall stats don't look great, but they don't show that Ryan and his receivers helped draw multiple pass-interference flags on the Seahawks. Ryan was especially clutch on third downs, converting 9-of-14 tries, including a 29-yard bomb to Julio Jones in the fourth quarter to help set up a score. ",
            "3": "Speaking of Jones, he caught five passes for a team-leading 71 yards. He dropped a pass, but made some terrific catches, including one where he skied over two Seattle defenders to make the reception along the sideline. The ESPN announcing crew mentioned that Jones still isn't 100 percent. Elsewhere in the receiving corps, Mohamed Sanu and tight end Levine Toilolo caught Ryan's touchdowns. Sanu (3-34) drew two pass-interference flags, so he had a better night than the stats indicate. ",
            "4": "The Falcons struggled to run the ball against a great ground defense. Tevin Coleman, starting for the injured Devonta Freeman, mustered only 43 yards on 20 carries, but he was able to find the end zone to aid his fantasy owners. ",
            "5": "The Seahawks, meanwhile, suffered yet another injury to their secondary when Shaq Griffin was concussed on the opening possession. This forced Byron Maxwell into the lineup, making things even easier for Ryan. As for his counterpart, Wilson went 26-of-42 for 258 yards, two touchdowns, an interception and the aforementioned lost fumble. The two early turnovers were crushing, as it forced the Seahawks into comeback mode the entire game. Wilson rebounded and was terrific the rest of the evening, at least prior to the final drive. Wilson, as usual, led his team in rushing. He sprinted 86 yards on seven scrambles. He also found the end zone once on the ground on a fourth-down conversion. Wilson was a wizard as a runner - especially on a third-and-12 conversion - but as usual, he was under heavy pressure despite Duane Brown's presence. ",
            "6": "Jimmy Graham (7-58) and Baldwin (2-40) both caught touchdowns. However, both had crucial drops as well. Graham had a potential second touchdown sail right through his hands on a second-quarter pass, while Baldwin dropped a ball on third down in the final frame when the Seahawks were driving to potentially tie the game. Tyler Lockett, meanwhile, caught four passes for 37 yards. More importantly, he had a number of long kickoff returns to give the Seahawks great field position throughout the opening half. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}