{
    "year": "2017",
    "week": "17",
    "Game 1": {
        "Team 1": {
            "Name": "Lions",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "11"
        },
        "comments": {
            "amount": "7",
            "1": "There were rumors heading into this game that this would be Jim Caldwell's last with the Lions. They didn't look like they were going to play hard for Caldwell in the early going, as they made numerous, careless blunders. The Lions were victimized by a surprise onside kick to start the game, which the Packers recovered. Green Bay kicked a field goal shortly afterward, though not on that same drive. Matthew Stafford then underthrew Kenny Golladay deep on the initial drive. The Lions, down 3-0, looked like they would either lose or barely squeak by, but they got their act together in the second quarter and dominated that game the rest of the way. It started when Stafford hit Marvin Jones with a 56-yard bomb to set up a field goal. The Packers then muffed a punt on their own 14, and Stafford found Jones two plays later to give Detroit a lead that it wouldn't relinquish. Thanks to another score in the second quarter, the Lions took a 20-3 lead into halftime. ",
            "2": "Stafford finished 20-of-29 for 323 yards and three touchdowns. He also caught a two-point conversion on a trick play at the end of the game. Stafford had a slow start, but torched Green Bay's porous secondary mercilessly in the final three quarters. Stafford was a near-perfect 7-of-8 for 145 yards and a score following intermission. Green Bay will need to address its secondary this offseason, and I have them taking a cornerback in the second round of my . ",
            "3": "Stafford's three touchdowns were thrown to his top three receivers: Tate (7-104), Jones (4-81) and Golladay (2-80). Tate also threw the aforementioned two-point conversion to Stafford, while Jones drew a defensive holding penalty near the goal line. ",
            "4": "The Lions once again struggled to run the ball, as Tion Green was the team's leading rusher with 21 yards on nine carries. Ameer Abdullah (8-18) scored late in the game. ",
            "5": "As for the Packers, their fans will be hoping that they never see Brett Hundley again. Hundley was a mess once again, giving Green Bay no chance to win. Remember the onside kick to begin the game? Hundley threw an interception on that drive, though that wasn't his fault. Jamaal Williams had the ball bounce off his hands, and into the arms of Jarrad Davis, who was beaten badly on the play. However, Hundley was to blame on several other poor plays. He lost a fumble in the red zone on a read-option, and then nearly took a safety on a grounding penalty. He followed that up by throwing a second pick. He looked like he was trying to toss the ball out of bounds, but Darius Slay made a terrific, tiptoe catch along the sideline. Hundley finished 14-of-24 for 172 yards, one touchdown and two picks. Most of that came in garbage time; Hundley was just 5-of-13 for 67 yards and an interception by halftime. ",
            "6": "With Davante Adams and Jordy Nelson out, Trevor Davis was the leading receiver with three grabs for 56 yards. Randall Cobb (4-45) scored a late touchdown. ",
            "7": "Jamaal Williams, responsible for Hundley's first interception, had a decent showing otherwise with 82 yards on 22 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "6"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "0"
        },
        "comments": {
            "amount": "5",
            "1": "Doug Pederson wanted to have Nick Foles play three or four drives after struggling so much on Christmas night. The reps undoubtedly would be valuable for Foles, or at least that was the thought process heading into this game. If anything, this performance may have damaged Foles' confidence even more. Playing about a quarter, Foles was just 4-of-11 for 39 yards and an interception, an ugly underthrow on a roll-out. He wasn't effective at all, and at this rate, it's going to take a miracle for the Eagles to beat anyone in the playoffs. ",
            "2": "There are going to be chants for the Eagles to start Nate Sudfeld, and he played better than Foles, though really it could've been by default. Sudfeld went 19-of-23 for 134 yards, completing lots of checkdowns. He also showed some nifty scrambling ability, picking up a 22-yard rush. It may seem crazy to start Sudfeld over Foles, but Pederson may just have to do it because Foles has been so terrible, and it appears as though he has lost his confidence. ",
            "3": "Philadelphia's primary play-makers were on the field for about a quarter - Zach Ertz led the way with two catches for 24 yards - so let's just move on to the Cowboys, who struggled mightily offensively. Dak Prescott was pitiful against the Eagles' backups, as he had just 61 passing yards by halftime. He did better following the break, but still made some poor passes, including a putrid overthrow of an open Terrance Williams for a potential touchdown in the third quarter. Prescott, continuing to miss Tyron Smith, went 17-of-30 for 179 yards and a touchdown. He made the key play of the game, converting a first down on a third-and-22 deep in his own territory in the third quarter, but this performance still has to be disconcerting for Dallas. Prescott needs better weapons, and here are the . ",
            "4": "Speaking of the wideouts, Dez Bryant had just three receptions for 24 yards, as it's clear that he's no longer a No. 1 option. Brice Butler needed more targets, as he hauled in both of them for 50 yards and the sole touchdown. ",
            "5": "Ezekiel Elliott broke the century mark, gaining 103 yards on 27 carries. He also caught three passes for 38 receiving yards. Elliott was stuffed on a fourth-and-1 early in the game, and it looked like he had a chance to score at the end, but he ran backward to keep the clock moving. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The final score may show that the Bears registered 10 points, but Minnesota's defense limited the Chicago offense to just three, as the Bears got into the end zone via a punt return by Bryce Callahan. The Viking stop unit was as dominant as ever, including some late goal-line stands to preserve the near-shutout. Offensively, Minnesota had a decent showing against a strong Chicago defense. Case Keenum misfired on just eight occasions, going 21-of-29 for 189 yards and a touchdown. This doesn't include a deep pass interference flag that Keenum and Adam Thielen helped draw on the Bears. ",
            "2": "As you might as expect, Stefon Diggs and Thielen were the two leaders for the Vikings in the stat sheet. Diggs caught all six of his targets for 65 yards and a touchdown, while Theilen also snatched six passes for 61 yards. It's a shame that he couldn't catch a pass on the aforementioned pass-interference play, or he would've eclipsed 100 receiving yards for those who used him in FanDuel. ",
            "3": "Latavius Murray had some tough runs to run out the clock at the end of the game. This helped take him over the century mark, as he finished with 111 yards on 20 carries. He also scored twice. ",
            "4": "The final passing stats for the Bears may seem just OK, but keep in mind that in the first three quarters, the Bears ran 27 plays, and yet none occurred beyond their own 33-yard line. Minnesota's defense was that prolific. The Vikings allowed some yards in the fourth quarter to help the Bears' stats, but they kept Chicago out of the end zone. Mitchell Trubisky went 20-of-36 for 178 yards. He didn't turn the ball over officially, though he took a safety when he was guilty of an intentional grounding in his own end zone while under heavy pressure. Trubisky had just 54 yards in the opening half. ",
            "5": "Thanks to garbage time, Dontrelle Inman was able to rack up 94 receiving yards on five catches. The next players on the stat sheet were Jay Bellamy (1-30) and Kendall Wright (5-29). I have the Bears picking Calvin Ridley in my to help in this area. ",
            "6": "Jordan Howard has put together some good performances this year, but this was not one of them. There was no room to do anything against Minnesota's defense, especially with three offensive linemen out. Howard was limited to nine rushing yards on as many carries. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Colts won this game, but they may have lost in the long run. By prevailing, they missed an opportunity to claim the No. 2 pick in the 2018 NFL Draft because the Giants won as well. The other big news regarding this result was Frank Gore's milestone. Gore eclipsed 14,000 rushing yards for his career on a run in the second half. Unfortunately, he suffered an injury on the play. Still, he's just 100 rushing yards shy of Curtis Martin for fourth all time, so he'll pass Martin if he plays another season. Gore finished with an even 100 rushing yards on 24 carries. He was great in the second half, picking up 88 of those yards following the break. However, Marlon Mack (7-28) vultured a touchdown in the second half. ",
            "2": "Jacoby Brissett struggled early. He had an open T.Y. Hilton on a third down when Johnathan Joseph fell down, but Brissett overthrew him. Brissett then took a 10-yard sack to disrupt a promising drive because he held on to the ball too long. However, he completed a 22-yard pass to make up for it, setting up an eventual touchdown. Brissett finished 15-of-25 for 114 yards and a touchdown. ",
            "3": "Hilton, by the way, should've been ejected along with Joseph. Both players threw several punches at each other, but neither was kicked out of the game for some reason. Hilton was limited to three grabs for only 14 yards. Jack Doyle (4-38) snatched Brissett's sole touchdown. ",
            "4": "As for the Texans, there's not much to say, as they picked up just 29 net yards in the second half. Yes, just 29 net yards! T.J. Yates had poor protection, as expected. Houston needs to bolster its blocking this offseason. Here are the . <br. <br=> Yates went 14-of-24 for 137 yards and an interception. He played well in the opening half - his best play was a 32-yard connection to undrafted rookie Chris Thompson, who made a DeAndre Hopkins-like sideline catch - but struggled following the break. He was just 4-of-9 for 25 yards in the second half. ",
            "5": "Thompson led the Texans in receiving with three grabs for 54 yards. Alfred Blue, who had four catches for 36 receiving yards, was the only other Texan with more than 20 receiving yards because Will Fuller (2-17) left the game in the opening half with an injury. ",
            "6": "Speaking of Blue, he was limited to 39 yards on 18 carries, though he scored Houston's sole offensive touchdown. Lamar Miller (8-37) saw far less work. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "28"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "24"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The Steelers may have sat their starters, but Corey Coleman sat his hands. Nice first-round pick, Sashi Brown! ",
            "2": "The Cleveland Browns made history as they finished with an 0-16 record for the 2017 season. The Steelers rested their offensive starters with Landry Jones getting the start at quarterback, but rookie wide receiver JuJu Smith-Schuster almost beat the Browns on his own, while Cleveland's clutch mistakes and turnovers led them to another loss in a winnable game. ",
            "3": "On the opening drive of the game, the Steelers ran the ball down the field with two runs by Stevan Ridley totaling around 30 yards, before a reverse to Darrius Heyward-Bey that caught the Browns by surprise for a 29-yard touchdown. Sacks by Tyson Alualu and Sean Davis set up Pittsburgh with good field position, but Landry Jones threw an awful pass into a crowd of defenders, and Jabrill Peppers intercepted the pass for Cleveland. The Steelers got the ball back and got moving with a 34-yard completion to Smith-Schuster and a 21-yard run by Ridley. The drive stalled for a field goal, but the Browns jumped offside to give Pittsburgh a first-and-goal. However, the Steelers were stuffed on fourth-and-goal. Pittsburgh got another three-and-out with good field position and quickly added to its lead with a 20-yard touchdown to Smith-Schuster. Cleveland answered with DeShone Kizer hitting a 54-yard bomb to Josh Gordon to the Steelers' 2-yard line. It was a beautiful pass from Kizer. Duke Johnson finished the drive with a touchdown plunge to cut the Steelers lead to 14-7. Pittsburgh then moved the ball with some moderate gains that were aided by penalties on Joe Schobert and a questionable roughing-the-passer on Myles Garrett. Ridley scored from a few yards out to put the Steelers back up by 14. Cleveland immediately reduced the lead to seven as Kizer hit Rashard Higgins (3-68-2) on the run, and Higgins exploded down the field for a 56-yard touchdown. The Steelers responded with Smith-Schuster making a phenomenal 46-yard catch, and Martavis Bryant adding 15 yards, but then Jones was stripped sacked by Garrett, and fellow Brown Caleb Brantley caught the fumble in air. That held Pittsburgh's lead at 21-14 at halftime. To start the third quarter, the Browns drove down the field and tied the game with a short touchdown pass to Higgins. The Steelers immediately retook the lead, as Smith-Schuster returned the kickoff for a 96-yard touchdown. Kizer continued to move the ball, using his legs to run for over 30 yards, with completions to Corey Coleman (1-18) and Gordon. A 51-yard field goal from Zane Gonzalez was good to cut the Steelers' lead to 28-24. Early in the fourth quarter, Cleveland got into Pittsburgh territory on a swing pass to Duke Johnson, but downfield, William Gay stripped Johnson of the ball and the Steelers recovered. After that, another Browns drive ended with Kizer getting hit as he threw, by Artie Burns, and Sean Davis made a diving interception for Pittsburgh. The Browns had one more opportunity, and Kizer moved them inside the Steelers' 30-yard line. On fourth-and-2, Kizer was almost sacked as a crowd of players bumped into him, but he escaped the scrum to find Coleman wide open about 15 yards downfield along the sideline at Pittsburgh's 10-yard line. The pass went right through Coleman's hands and hit him in the face mask before falling incomplete to clinch the 0-16 season for the Browns. It was somewhat fitting the first draft pick of Sashi Brown and Hue Jackson was the player who made the mistake to lead to the winless season. ",
            "4": "Smith-Schuster was the star of this game with 143 yards on nine receptions with a touchdown and the kickoff return for a touchdown. Landry Jones was 23-of-27 for 239 yards with a touchdown and an interception. ",
            "5": "Ridley totaled 80 yards on 17 carries and a touchdown. ",
            "6": "Kizer was 16-of-30 for 314 yards with two touchdowns and an interception. He also ran for 61 yards on six carries. ",
            "7": "Gordon led the Browns through the air with 115 yards on four receptions. Isaiah Crowell had 21 yards on 15 carries. ",
            "8": "Both teams had issues on the offensive line. Cleveland allowed backup Tyson Alualu to have two sacks. T.J. Watt, Vince Williams, Sean Davis and L.J. Fort also had sacks for Pittsburgh. Garrett, Brantley and Carl Nassib recorded sacks for Cleveland. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The Bills sent the Bengals a thank-you present for beating the Ravens. Perhaps the Giants should do the same for the Colts, as they were able to keep the No. 2 pick in the 2018 NFL Draft because Indianapolis beat Houston. ",
            "2": "The Giants were supposed to come into this contest completely out of sorts. They just brought in a new general manager and were going to be without two of their three top offensive tackles, most of their talented players in the secondary, and almost all of their receiving weapons. Despite all of this, they beat the Redskins. Eli Manning had a solid day early on for the Giants, but he regressed as the afternoon went along. Manning made a brilliant touchdown pass to Hunter Sharp in the opening quarter. After a turnover by the Redskins, Manning threw a strike to Sharp on a route over the middle and hit him perfectly in stride in a tight window. Sharp beat the man in coverage, Kendall Fuller, and he made the catch to put the G-men up 12-0 at the time. As time went along, Manning became a victim of drops by his receivers, but he also had trouble getting the ball downfield. This wasn't entirely his fault, given the complete lack of talent that he was surrounded with. By the end of the day, Manning's numbers looked pretty bad. He went just 10-of-28 for 132 yards, the aforementioned touchdown, and an interception. All things considered, this wasn't bad, especially considering that his receivers dropped at least seven passes during the game. The interception was more of a good play by Preston Smith than a negative on Manning's side; Smith was able to tip a screen pass to himself. Realistically, Manning looked like a below-average starter with a declining skill set, and it looks like he should be a backup moving forward. ",
            "3": "Manning's pedestrian offensive production meant that only one receiver could have an above-average performance. That ended up being tight end Rhett Ellison. Ellison caught five passes for 63 yards and was generally able to find space against Washington's linebacker corps. Ellison has really come on to close the season, so perhaps he could develop into a solid No. 2 tight end for the Giants. The other notable receivers for the Giants were Sharp (3-29, 1 TD) and Travis Rudolph (1-29). Neither impressed much, and they don't look like anything more than fringe roster depth. ",
            "4": "From the beginning, the team was able to generate push against the Redskins' front. On the second play from scrimmage, Orleans Darkwa escaped three tacklers and went the distance for a 75-yard touchdown that gave the Giants a lead they never relinquished. Darkwa did well to gain yards on every carry, and he finished the day with a career-high 154 yards on 20 carries. He could be a low-end starter or a strong backup for the team next year. In addition to Darkwa's solid play, rookie Wayne Gallman looked good, getting 89 yards on 15 carries. Gallman had a nice 22-yard burst to pick up a first down on second-and-long, and he will have a chance to become a starter. He has athletic upside, so keep an eye on him and whether or not he's a starter in 2018. ",
            "5": "For the Redskins, this game was wildly disappointing. They were supposed to crush the Giants, but instead they came up well short and put forth one of their worst efforts of the year. Kirk Cousins was absolutely dreadful against the Giants. One would think that given that he was supposed to hit free agency in the offseason, he would try to put an exclamation point on the season to generate more buzz. Instead, he did the exact opposite. Cousins started the afternoon off with very poor accuracy. He telegraphed his throws and was often staring down his receivers before releasing the ball. That led him to throw three interceptions, two of which went to Kelvin Sheppard. Cousins never really set his feet because of pressure and too often came up short on his downfield passes. That's what led to the interception that went to Ross Cockrell. Cousins finished 20-of-37 for 158 yards and the three picks. He looked like a deer in the headlights, and while his supporting cast is banged up, he deserves a lot of blame for the loss. He's supposed to be a team leader who can carry his team to victory. Instead, he put forth his worst performance of the season against the worst opponent he faced this year. ",
            "6": "Cousins spent most of the day targeting three receivers. They were Kapri Bibbs (8-53), Josh Doctson (4-37) and Jamison Crowder (3-25). Bibbs was the most efficient, catching passes out of the backfield and finding success on screen passes. The free-agent-to-be has done enough to earn a roster spot on some NFL team after being signed off the street just a few weeks ago. As for Doctson and Crowder, both saw a lot of targets, 17 combined, but they were actually blanketed in coverage for most of the day. Cousins couldn't do much to throw them open, so the duo wasn't able to do much. Doctson did have a nice catch on the sideline that saw him tap his toes to get a first down, so that's a good sign as he looks to improve heading into 2018. ",
            "7": "In the running game, Bibbs was utilized heavily, and he looked pretty good. He saw 12 carries for 47 yards to go along with his 53 receiving yards, and that allowed him to have a 100-yard performance. Bibbs took over for Samaje Perine, who only had three yards on two carries before he went down with an ankle injury. Perine limped off the field and appeared to be in pain. ",
            "8": "This outcome spoke to a larger issue with the Redskins. Though the team is likely going to keep Jay Gruden, it's clear that he is a poor motivator. Yes, the team had 20 players on injured reserve this season, but they have come out flat in so many key games. The Redskins should really look hard at him and decide if he's the answer. If he stays on, expect his seat to stay very hot during the 2018 season. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> It was cool that the Jets got to see what they had with Christian Hackenberg. They definitely got a good look on how he was walking on the sideline, and how he stood by the heater a few times. They learned so much from that. ",
            "2": "The Patriots needed to beat the Jets in Foxborough to keep their No. 1 seed and home field throughout the playoffs. They played all of their healthy starters, which included lead running back Dion Lewis, who led the way with both a receiving and rushing touchdown as New England won 26-6. Tom Brady has not been his usual self of late, with four touchdown passes to five interceptions over his previous four games coming into today's finale. He did manage to throw two touchdowns to no interceptions in Week 17. However, he continued to have some accuracy issues, as he completed less than 50 percent of his passes, 18-of-37, for just 190 yards at 5.14 yards per attempt, which was his worst total of the season. Brady did face some obstacles this week though, as his receivers had drops, and despite Rob Gronkowski playing much of the game, Brady didn't target him once. Gronkowski was facing bracket coverage, but that doesn't stop Brady from at least giving him a chance to make plays, so the coaching staff might have put a bug in Brady's ear not to put Gronkowski in harm's way. Or it was just an anomaly, but either way, Brady needs his All-Pro tight end to be his No. 1 target to make New England's offense click. ",
            "3": "The Jets, with Bryce Petty at quarterback, couldn't do much of anything. That was even truer on third downs, where they converted zero of 12 attempts. With the Patriots up 21-3 at halftime, it seemed inevitable that we would see Christian Hackenberg at least get a few series in, but coach Todd Bowles decided to keep Petty in the game. It is fair to question why Hackenberg is even on the team if he can't get a little work in a meaningless Week 17 game. ",
            "4": "The running game was the catalyst for the Patriots win, and with Rex Burkhead, James White and Mike Gillislee all out, it was up to Lewis, and he showed up much like last week, totaling 133 yards and two touchdowns on a career-high 32 touches. They will get most of their running backs healthy before the playoffs start, but Lewis is coming into the tournament hot and will likely be a big part of their chances to repeat as champions. ",
            "5": "Brandin Cooks led the Patriots in receiving yards, as he caught an inefficient 5-of-11 targets for 79 yards and a touchdown. But Lewis led the team in receptions, as he caught 6-of-7 targets for 40 yards and one of his touchdowns. As you can see, the deep passing game was not working well for Brady and company, but New England was able to keep drives going with the run and short passing. ",
            "6": "Newly acquired from the Pittsburgh Steelers, James Harrison quickly contributed with five tackles, two sacks, a forced fumble and a good stop on third down. He played more than he had played all season in Pittsburgh, so he's likely happy about his change of scenery and could help shore up some defensive holes. ",
            "7": "Now, New England waits two weeks before facing the lowest seed that comes out of the wild-card round. The Patriots will again be the odds-on favorite to win the Super Bowl, and they'll need to be beaten at home to keep them from going to their eighth in the past 16 seasons. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> What was up with Vance Joseph not going for two in lieu of tying the game at 24? Why did he want to go to overtime? Did he want to torture everyone at the game, including the media? ",
            "2": "This was the Leigh Steinburg bowl, as he had two of his recent first-round picks going head-to-head with Paxton Lynch for the Broncos facing off versus Pat Mahomes, who was making his first NFL start for the Chiefs. Mahomes outplayed Lynch, and the Chiefs pulled out a last-second win over Denver. ",
            "3": "Mahomes threw a perfect strike in a tight window to his tight end Demetrius Harris (3-73) for a 51-yard gain on the first drive of the game. Kareem Hunt ran up the middle for a 35-yard touchdown run, which was the only carry of the afternoon for him. On the next possession, Mahomes had an overthrow intercepted by Darian Stewart. Lynch got Denver moving with a 19-yard completion to Demaryius Thomas, and that ended up producing a field goal for Denver. The Broncos took the lead as Lynch led them on a drive down the field, and then a screen pass to DeAngelo Henderson going for a 30-yard touchdown. Mahomes responded with some good completions using Albert Wilson a few times to move the chains. To finish the drive, fullback Anthony Sherman had a short touchdown run. Lynch moved the ball down the field in the final seconds of the half, but he threw a bad pass into a crowd of defenders and had it intercepted by Terrance Smith. Kansas City took a 14-10 lead into the locker room. In the third quarter, Mahomes made a lot of excellent throws to lead the Chiefs down the field for a field goal drive. Chris Jones then strip-sacked Lynch, and Ramik Wilson scooped up the fumble to return it for a touchdown. That put the Chiefs up 24-10 entering the fourth quarter. Lynch drove Denver close to the end zone midway through the fourth quarter, but then made an ugly mistake. He stared down his receiver and threw late across the field for the end zone. Terrance Mitchell jumped the route and picked off the pass. However, the next play saw the Chiefs give possession right back as third-string quarterback Tyler Bray came into the game. He and Anthony Sherman promptly fumbled a handoff. Denver's Zaire Anderson scooped up the ball and returned it 38 yards for a touchdown to cut the Chiefs lead to 24-17. After a punt, Lynch moved the Broncos into Kansas City territory with a 25-yard completion to Devontae Booker. Lynch tied the game at 24 with a short touchdown pass to Thomas. Mahomes came back into the game to get some experience of executing late in the fourth quarter. He was gifted a first down by the Broncos jumping offside after a third-down incompletion. He then connected with Demarcus Robinson for 25 yards, and a couple completions Albert Wilson for about 25. That led to Harrison Butker hitting a 30-yard field goal on the final play of the game for the Chiefs win. ",
            "4": "Mahomes completed 22-of-35 passes for 284 yards with zero touchdowns and one interception. Overall, he played well in his first NFL start. Lynch, meanwhile, completed 21-of-31 passes for 254 yards with two touchdowns and two interceptions. He played well enough to question why he didn't get more of a look this season instead of wasting more games on Brock Osweiler and Trevor Siemian. ",
            "5": "Thomas had six receptions for 57 yards and a touchdown. C.J. Anderson ran for 61 yards on 18 carries. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Jack Del Rio has already been fired. Check out the here. ",
            "2": "After losing their first four games of the season, it didn't look like the Chargers would be in the hunt for a playoff spot come Week 17, but they went on a strong run, winning eight of their last 11 games on their way to this Week 17 matchup with the Raiders. They needed a win and help, but in the end, that help never arrived. So, despite a convincing win, and a nice run after their slow start, the Chargers will get to go on vacation instead of playing next weekend. The displaced Los Angeles Chargers needed the Jacksonville Jaguars to beat the Tennessee Titans and then either Dolphins to beat the Bills or the Ravens to beat the Bengals. The Jaguars, despite Blake Bortles and Leonard Fournette playing the whole game, couldn't pull out a win against Tennessee, but neither could the Ravens or the Dolphins. ",
            "3": "Despite the end results, Philip Rivers was masterful, as he completed 28-of-37 passes for 387 yards and three touchdowns, finishing with a 135.8 QB Rating. The Raiders' defensive backfield had no answer, as he threw touchdowns of 56 yards to Tyrell Williams, six yards to Keenan Allen, and 62 yards to Travis Benjamin. ",
            "4": "The Raiders didn't have much trouble running the ball, as Marshawn Lynch rushed 19 times for 101 yards, but with their defense getting scorched, they had to rely on the passing game working if they wanted to catch up. But despite an early 87-yard touchdown reception by Amari Cooper to tie up the game in the second quarter, Derek Carr could get little else going, as he finished the day completing 19-of-28 passes for 243 yards, one touchdown, one interception and one lost fumble. ",
            "5": "Raider fans did make their mark on this game, as they filled StubHub Center, making yet another home game for the Chargers more like a road game. But after getting beat down easily by the home team, Oakland backers will likely be remembered more for throwing beer bottles at celebrating Charger players than showing support for their team. ",
            "6": "Keenan Allen finished with nine receptions for 133 yards, a touchdown reception and a touchdown off a fumble recovery. After missing large chunks of the last two seasons to injury, Allen should be right up there with Jared Goff and others for Comeback Player of the Year, after catching 101 passes for 1,393 yards and six touchdowns. ",
            "7": "The only bright spot for the Raiders was Lynch hitting 10,000 rushing yards in his career. After coming out of retirement to play for his hometown team, he was rested more than I thought he would be, but he put up good numbers and ran like the Lynch of old all season. It will be interesting to see what his plans are for the future, especially now that word is out the Jack Del Rio has been fired and Jon Gruden his likely successor. ",
            "8": "Both of these teams will need to answer some questions as the move into next year, but the Raiders have more holes to fill and seem further away from their goal of the playoffs and a Super Bowl than they were last season. The Chargers have all the pieces to go deep in the playoffs, so it was disappointing that they couldn't squeak in, but with their core offense and defense, they should get off to a better start next season and likely be a playoff contender. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "49ers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "13"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> Can anyone believe the books opened the Rams at -4? What the hell were they thinking? ",
            "2": "Jimmy Garoppolo has done what some thought to be impossible just a couple months ago. He stayed undefeated in his career as a starting quarterback, leading the 49ers to a 5-0 record in his first five starts in San Francisco. He already had two wins as a starter in New England. Garoppolo once again was a catalyst for the 49ers. He continued to show poise in the pocket, great ball placement and vision, and excellent ability to throw touch passes. On numerous occasions, he was able to drop the ball perfectly into his receivers' hands and they were able to deliver big gains. There was one particularly nice touchdown that saw him loft a pass outside to Marquise Goodwin after he motioned out of the backfield, which allowed him to run untouched into the end zone. At the same time, Garoppolo did, for the first time, show a weakness. His accuracy on downfield throws wasn't terrific. Both of the interceptions saw him target a receiver downfield and miss. On both occasions, Kevin Peterson was able to pick the pass off. These passes were just a bit too high, and it's clear that this is Garoppolo's biggest area for improvement. If he can fix it, he will be a truly elite quarterback. Garoppolo finished 20-of-33 for 292 yards, two touchdowns and two interceptions. With a full offseason in Kyle Shanahan's scheme, it should be very fun to see what heights the young, undefeated passer can carry his team to. ",
            "3": "Garoppolo's favorite target on Sunday was George Kittle (4-100). The rookie tight end had a couple of huge catches, including a reception that saw him grab a short pass, run up the field through two defenders, break a third tackle, and then get out of bounds. Kittle looks like an athletic, versatile weapon, and he is definitely a sleeper at the tight end position in fantasy next year. ",
            "4": "Goodwin (2-28, 1 TD) was the recipient of the Garoppolo's first touchdown. Unfortunately, he came out of the game at the 2-minute warning after taking a massive hit from Blake Countess. Goodwin had to be carted off, and it looked like he might have suffered a concussion. He will have the whole offseason to recover, but here's hoping for a speedy one. Other notable receivers include Trent Taylor (2-29) and Aldrick Robinson, who caught Garoppolo's second touchdown. ",
            "5": "The 49ers ended up splitting carries between Matt Breida and Carlos Hyde, which ended up being a great success. Breida saw many carries early on, and he demonstrated great lateral agility and was able to gain the edge on the Rams many times. He finished with 72 yards on 12 carries and added a 32-yard reception. He has potential as a lead back moving forward. For Hyde, he was used a lot as well, getting 15 carries for 90 yards. However, the big difference between the two was that Hyde saw more action in the red zone, and he was able to pound the rock in for two touchdowns. On one instance, he was able to use his strength to push the pile and get a score. That said, he had a fumble late in fourth quarter, but it was inconsequential, given san Francisco's 21-point lead. Hyde is going to get paid in free agency, and it will be interesting to see if the 49ers try to retain him. ",
            "6": "Sheldon Day had a pretty big game. Seeing extended run, Day racked up two tackles for loss and a sack. The Jaguars had to release him due to roster constraints, but it looks like the 49ers will benefit from that. Day has starter upside, so expect the team to find a way to use him more next season. ",
            "7": "As for the Rams, the team made the decision to sit their starters in this contest. With Jared Goff out, Sean Mannion drew his first start at the NFL level, and he performed better than was expected. Though he started the game poorly, and at one point was averaging a woeful 1.1 yards per attempt, Mannion was able to bounce back just before the half. Mannion was able to use his strong arm to push the ball downfield, and he threw a huge 50-yard catch that set up a field goal for the Rams. The throw was his best of the day, as it was well-placed and allowed his receiver to catch it with room to get his feet in bounds. In the second half, his ball placement greatly improved, after being off for the first two quarters, and that allowed the Rams to move the ball a bit more. However, he was victimized by drops from his receivers, though that also could have been a function of him throwing the ball too hard. At the end of the day, Mannion went 20-of-34 for 169 yards. He looks like a strong-armed backup who can't really move well in the pocket. Still, his performance should do enough to convince the Rams to keep him on board, despite the major loss. ",
            "8": "With most of the top receivers out, Mannion spread the ball around a lot. The leading receiver was Mike Thomas (3-75). He was the recipient of the 50-yard catch at the end of the half, though there are some questions about whether or not it was an actual catch. The other receiver of note was rookie tight end Gerald Everett. He had a tough day that saw him drop a couple of catchable balls and fumble on a dump-off pass. Later, Everett committed a running into the kicker penalty that gave the 49ers a first down. He finished with three catches for 16 yards. Everett is an athletic player, but he has a ways to go before he can be counted on as a big part of the passing offense. ",
            "9": "Malcolm Brown saw most of the ground work with Todd Gurley out. Brown had a couple of nice bursts, including a 20-yard that saw him break a tackle, but he was stuffed quite a few times too. That was due to his blocking. By the end of the day, he had 14 carries for 54 yards. Lance Dunbar also was mixed in, and he had a really nice touchdown run late in the game. He cut back on a run to the left and found a huge hole into the middle of the field. He finished with 21 scrimmage yards on seven touches. Dunbar could mix into the rotation as a versatile option in the event that the Rams run two-back sets in the postseason. ",
            "10": "One positive about playing young players for the Rams is that they may have unearthed a great one in their secondary. Kevin Peterson, a former practice squader, had two picks and a whopping five passes defensed on Sunday. His instincts are great, and the Rams may have to find a way to use him in the future. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "Blair Walsh is one lucky man. Had the Falcons lost to the Panthers, he would've been utterly crucified for missing a 48-yard field goal at the end of this game. As it turns out, Seattle never had a chance to make the playoffs with Atlanta prevailing, and Walsh's whiff actually helped Seattle earn a better draft choice. The Seahawks will need to find a new kicker this offseason, but the greater priority is the offensive line (here are the .) Thanks to poor blocking, the Seahawks couldn't run the ball throughout or get anything going at all until the second half. In fact, Seattle mustered only 24 net yards in the entire opening half, averaging a truly pathetic 1.3 yards per play. Russell Wilson engineered some scoring drives following intermission, but he needed just one more to win this game, and Walsh failed to deliver. Wilson finished 18-of-29 for 221 yards and two touchdowns. He was just 4-of-8 for 36 yards in the opening half, but improved his play greatly as the game went on. In fact, he could've posted better stats had Luke Willson not dropped a potential deep touchdown. ",
            "2": "Doug Baldwin caught both of Wilson's scores, one of which was a pretty catch in which he tapped both feet inbounds while crossing the goal line, just as he was falling out of bounds. He caught four passes for 90 yards otherwise. He was the only Seahawk with more than 50 receiving yards, with Jimmy Graham (3-45) next on the stat sheet. ",
            "3": "Seattle's leading rusher after the half was Thomas Rawls with a whopping six yards. That changed in the second half, as Mike Davis returned from a temporary injury. Davis finished with 48 yards on 10 carries, though most of that came on a 33-yard burst. Davis was stuffed on an early fourth-and-1. ",
            "4": "There was a complete role reversal in the second half. The Seahawks struggled to move the ball prior to intermission, but got going after halftime. The converse occurred for Arizona. Drew Stanton completed just 2-of-11 passes following the break. Stanton finished 15-of-34 for only 145 yards, one touchdown and an interception. With his struggles, only one Cardinal accumulated more than 25 receiving yards. That predictably was Larry Fitzgerald, who hauled in eight balls for 55 yards, and he also drew a deep pass-interference flag. ",
            "5": "There was bad news for Jermaine Gresham, who tore his Achilles. He's likely to miss 2018 because the injury occurred so late in the year. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Falcons thought they had to win to reach the playoffs. They couldn't rely on the Seahawks losing to the Cardinals, even though that's what happened, but it was nice to see Atlanta step up in a must-win against rival Carolina. Atlanta's defense was the deciding factor in this contest, as its defensive front put a ton of pressure on Cam Newton. Grady Jarrett, in particular, was dominant in the trenches. Meanwhile, the Falcons did enough offensively to not lose this game, as their unit committed far fewer turnovers than Carolina's. ",
            "2": "Matt Ryan went 28-of-45 for 317 yards and a touchdown. He could've posted much better numbers, but his receivers let him down with several drops. Julio Jones dropped a pass in the early game, though he took a fierce hit. Ryan then lost a touchdown to Mohamed Sanu that was wiped out by replay review. Sanu also dropped what seemed like a crucial third-down conversion. That said, Ryan was guilty of a blunder himself when he hit Austin Hooper with a pass just prior to halftime. Atlanta didn't have any timeouts, so even though the team was in Matt Bryant field-goal range, it ran out of time and went into the locker room dejected. ",
            "3": "Jones bounced back from the tough hit to finish with five catches for 80 yards. Sanu, meanwhile, hauled in seven of his 11 targets for 71 yards. Again, Sanu barely missed out on a touchdown. He also was stuffed once on a third-and-1 option run by Luke Kuechly, who diagnosed the play perfectly. ",
            "4": "Devonta Freeman actually had more receiving yards than both Jones and Sanu, catching nine passes for 85 yards and a touchdown. Freeman struggled on the ground, however, though this was to be expected, as Carolina is tough versus the run. Both Freeman and Tevin Coleman rushed for 23 yards on 11 carries. ",
            "5": "Moving on to the Panthers, Cam Newton had an awful game. Pressure, as mentioned, was a key factor. Newton actually began the game 0-of-9, and his first completion was a 3-yard loss to Christian McCaffrey. Newton finished 14-of-34 for 180 yards, one touchdown and three interceptions. All three of his picks were his fault. Newton and the rest of the offense had no sense of urgency, as the FOX announcing crew pointed out. Newton also had multiple communication issues with Greg Olsen. This sort of effort was inexplicable. It's like the Panthers didn't think they should've played this game, and perhaps that should've been the case. ",
            "6": "There was a scary moment early in this game when Olsen was slow to get up following a third-down catch. The FOX announcers mentioned that the Carolina coaching staff was scared of Olsen's leg injuries on this sort of turf. Because the Panthers loss, they'll have the same fears in New Orleans next week. Olsen hauled in just one of his nine targets for 10 yards. Devin Funchess (2-48) caught Newton's sole touchdown. ",
            "7": "Newton led the Panthers in rushing with 59 yards on 11 scrambles. McCaffrey (6-14) struggled to find room, while Jonathan Stewart sat out. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Ravens",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "The mission for the Ravens was simple. All they had to do was win, and they'd clinch playoff berth. Their opponent was a divisional foe they shut out in the season opener, but perhaps that gave Baltimore a false sense of confidence. The Ravens didn't look like they were trying very hard, while the Bengals played with much more effort. Baltimore's offense couldn't do anything in the first half because of horrible drops. The team had a whopping five drops in the first 20 minutes, and a sixth one occurred a few minutes later. It was a disgraceful showing that put the Ravens into a 17-3 hole. Baltimore actually managed to climb out of that hole and take the lead late in the game. Up 27-24, the highly regarded defense had to stop Andy Dalton on a fourth-and-long situation. Dalton, however, found Tyler Boyd for a 49-yard touchdown in between multiple defenders. And just like that, the Ravens were eliminated from the playoffs. ",
            "2": "Quarterbacks often take the blame for losses, but Joe Flacco was not responsible for this inexplicable defeat. As mentioned, the Ravens dropped half-a-dozen passes in the first half alone. Flacco finished 25-of-47 for 203 yards, two touchdowns and an interception that was also the result of a drop. His numbers could've been so much better if his teammates just did their job. ",
            "3": "Flacco's top targets were Mike Wallace (5-40) and Ben Watson (7-61). Wallace, who caught one of Flacco's two touchdowns, made a great sideline catch in the second half between two defenders, but the play was overturned by replay review. Watson, meanwhile, was guilty of one of the many drops. He caught the final pass of the game on a fourth-and-long, but couldn't quite get the first-down marker. Chris Moore hauled in Flacco's other score, doing so after an 88-yard kickoff return. However, he suffered a concussion in the second half. He was also responsible for a drop that turned into a Cincinnati pick-six. ",
            "4": "Alex Collins was guilty of a horrible drop as well - the pass was a short toss, and the gaffe prompted heavy boos - but he made up for it with some tough running against a Cincinnati defense missing Vontaze Burfict. Collins gained 78 yards and a touchdown on 20 carries. He converted a crucial fourth-and-3 with a touchdown in the middle of the fourth quarter in which he reversed field after appearing as though he'd be stuffed for a loss. ",
            "5": "Moving on to the Bengals, Dalton finished 23-of-44 for 222 yards and three touchdowns. He had some ups and downs in this game, but came up very clutch on the aforementioned fourth-down conversion. He appeared to throw a game-ending interception a bit before that, but that was nullified by a defensive penalty. Dalton needs better protection, so here are the . ",
            "6": "A.J. Green saw 10 targets, but caught just two of them for 17 yards. The stats were disappointing for those who used him in FanDuel, but not shown in the stat sheet is that a Green pass-interference flag set up a touchdown to Tyler Kroft. Green also appeared to catch a 24-yard pass in the first half, but replay review showed that he had just one foot inbounds. ",
            "7": "Speaking of Kroft, he caught six of his eight targets for 53 yards and two scores. Boyd (5-91) also scored, as mentioned. ",
            "8": "Joe Mixon started after missing numerous games, and he made up for his absence, rushing for 96 yards on 18 carries. He had a big mistake, however, which was a lost fumble in the second quarter. Giovani Bernard (10-52) was a factor in the passing game, catching six passes, but for only 18 receiving yards. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Bills",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Bills are in the playoffs! As you may have heard, they owned the greatest postseason drought in North America, as the last time they were in the playoffs was back in 1999 when the team couldn't decide who to start between Rob Johnson and Doug Flutie. Their long absence is now over, so enjoy it, Buffalo fans. This was nearly a Pyrrhic victory, however, as LeSean McCoy suffered an injury in the third quarter. It looked bad - his knee bent backward on a run - but he was diagnosed with a sprained ankle, so he could play next week at Jacksonville. McCoy didn't do much on the ground, gaining just 10 yards on 11 carries, but he made a great play on an 18-yard reception when he knocked over a defender with a killer juke. Though McCoy posted pedestrian numbers through just a bit more than two quarters, he'll be needed against Jacksonville's tough defense. McCoy's replacements, after all, are people named Marcus Murphy and Mike Tolbert. Murphy was the better of the two, outgaining Tolbert, 41-39, as both received seven carries each. Meanwhile, long-time Buffalo nose tackle Kyle Williams scored on a 1-yard plunge. ",
            "2": "Tyrod Taylor had a solid performance against a disinterested Miami defense, going 19-of-27 for 204 yards and a touchdown. He also picked up 35 rushing yards on six scrambles. The Dolphins whiffed on numerous tackles in this contest. ",
            "3": "Charles Clay was the only Buffalo player with more than 27 receiving yards, catching six of his eight targets for 64 yards. This was predictable, as the Miami linebackers can't cover (here are the .) Kelvin Benjamin (2-27) was next, while Deonte Thompson (2-23) drew a pass interference to set up Williams' run. ",
            "4": "As for the Dolphins, Jay Cutler played just one drive to meet some sort of contract clause. He threw two passes, completing only one of them for six yards. The Dolphins wanted to see David Fales in action, and they learned that they have a checkdown specialist on their roster. Fales' final numbers look solid - 29-of-42, 265 yards, one touchdown, one interception - but most of that occurred in garbage time. He was just 7-of-11 for only 40 yards in the opening half, but led a couple of touchdown drives after Buffalo established a 22-3 lead. The Dolphins apparently knew that they didn't have much of a chance with Fales playing, so there was an alarming lack of effort from them in this game. This was apparent in the many missed tackles, and it also showed when they committed 14 penalties, eight of which occurred in the first 19 minutes of the game. By comparison, Buffalo was guilty of just six infractions the entire evening. ",
            "5": "Kenyan Drake (14-75) and Jarvis Landry (9-92, TD) led the Dolphins in rushing and receiving, respectively. I'm grouping them together because both were ejected for starting a fight late in the game. ",
            "6": "Excluding Landry, DeVante Parker was the only Dolphin with more than 34 receiving yards, as he caught six passes for 64 yards. It was a mediocre finish to his highly disappointing season. Hopefully Parker's New Year's Resolution is to try harder in 2018. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "The Saints are very fortunate that the Panthers lost to the Falcons; otherwise, they would be opening the playoffs on the road rather than in the Superdome as a result of this loss. New Orleans had no answer for Jameis Winston, unless, of course, Winston was giving the ball away. Winston, wildly erratic as always, threw three interceptions, and he almost tossed two picks on the opening drive, a sequence that concluded with a Peyton Barber touchdown run. Winston was lucky to avoid mistakes there, but he hurt his team with an interception a bit later when he threw the ball later over the middle. Winston then had a second pick on a late, underthrown pass just prior to halftime. Winston's third pick occurred in the third quarter when he foolishly tossed a pass into quadruple coverage. Despite all of these mistakes, the Buccaneers were down just one point at the very end of the game. The Saints had Winston pinned with a fourth down deep in his own territory, but he converted the first down. Beginning with that pass, Winston was 6-of-8 for 95 yards on the final offensive possession of the game to give Tampa Bay the upset victory. Winston finished 28-of-51 for 363 yards, two touchdowns (one passing, one rushing) and three picks. Many are going to once again tout the Buccaneers as a sleeper next year, but Winston needs to clean up the blunders. His team also has to stop being sluggish in some games. Unfortunately, the Buccaneers have not fired inept head coach Dirk Koetter, so these sort of mental errors will almost certainly occur once again in 2018. ",
            "2": "Meanwhile, the Saints had trouble getting possessions because the Buccaneers were a ridiculous 13-of-18 on third down. That, as well as an Alvin Kamara kickoff return, would explain why the Saints' stats were so suppressed. Kamara, for instance, led the Saints with just 44 rushing yards and a touchdown on nine attempts, while Mark Ingram (13-35) barely did anything. Kamara was also a big-time contributor in the passing attack, as expected; he caught six balls for 84 receiving yards. Kamara's best offensive play was a 40-yard reception that he made with a defender literally on top of him. ",
            "3": "Drew Brees misfired on just eight attempts, going 22-of-30 for 248 yards and a touchdown. He did enough to win, but the defense's ineptitude as well as two special-teams gaffes did his team in. One was a lost fumble on a punt return that the Buccaneers turned into a touchdown, while the other was a fake field goal that failed. It was a curious decision; if the Saints wanted to go for it, why not just use their regular offense, given all the talent they have on that side of the ball? ",
            "4": "The Buccaneers struggled to cover Michael Thomas, who caught six passes for 94 yards. Tampa needs more help in the secondary, so here are the . ",
            "5": "Going back to the Buccaneers, two players eclipsed the century mark in receiving yardage, but neither was Mike Evans. Promising rookie Chris Godwin led the way with seven catches for 111 yards and a touchdown, while Adam Humphries (7-102) posted similar stats on one fewer target, 12-11. Evans' numbers weren't as great - five catches, 55 yards - and that had to do with a slight hamstring injury he suffered early in the game. ",
            "6": "Barber led the Buccaneers in rushing, picking up 71 yards and the aforementioned touchdown on 17 carries. Doug Martin was barely a factor, losing three yards on as many attempts. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Titans",
            "Points": "15"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "I called Doug Marrone's decision to play Blake Bortles and the rest of the starters the worst coaching decision of the 21st century, and that turned out to be the case. Not only did the Jaguars fail to win, but Bortles got banged up in this game, limping off the field in the second quarter after getting hit low. Despite the apparent injury, Marrone foolishly kept Bortles in the game the entire way. It's unclear how much the possible injury affected his play, but Bortles was atrocious in the second half. He completed just 4-of-15 passes for only 43 yards and two picks following intermission. It was truest form of football stupidity. Bortles finished 15-of-34 for 158 yards and two interceptions. Even if Bortles isn't hurt, his confidence is at least shattered because he was atrocious for most of the evening. He was in a great groove against horrible defenses several weeks ago, but he has regressed rapidly the past two weeks. ",
            "2": "Leonard Fournette was Jacksonville's only source of offense throughout this contest. Fournette finished with 69 rushing yards on 19 carries, and he also led the team in receiving with four catches for 67 yards. The Jaguars are very fortunate that he didn't get hurt as well. ",
            "3": "Aside from Fournette, the Jaguars' leading receiver was Allen Hurns, who caught three balls for 38 yards. Keelan Cole (4-33) was right behind him, but lost a fumble in his own territory. Dede Westbrook, meanwhile, was a major disappointment. Westbrook saw a team-high nine targets, but caught only one pass for nine yards, as many of Bortles' passes were off the mark. Westbrook wasn't blameless, however, as he had a drop on an early third-and-12 in which he showed a major case of alligator arms. He then dropped what should've been a touchdown reception in the third quarter. ",
            "4": "As for the victors, the Titans did very little offensively. Sixty-six of their 232 net yards came on a 66-yard screen pass, in which Derrick Henry scored. The Titans also converted just 3-of-16 third downs. They are poorly coached, as they should have more offensive success than this, even against Jacksonville's elite defense. Tennessee at least didn't make any mistakes - save for one. The Titans, up 15-3, were trying to salt this game away when Marcus Mariota and Henry crashed into each other on an attempted handoff. The result was a fumble, which Yannick Ngakoue returned for a touchdown. ",
            "5": "Mariota didn't post the best numbers - 12-of-21, 134 yards, one touchdown - and almost half of his passing yardage came on the aforementioned 66-yard screen pass. However, he did his best work as a runner, picking up 60 rushing yards on 10 scrambles. This was apparent late in the game when he secured some first downs with his legs, including one play in which he juked Calais Campbell out of his cleats. ",
            "6": "Henry, meanwhile, scored on the 66-yard screen, but struggled on the ground. He was limited to a mere 51 yards on 28 carries, thanks in part to a 12-yard loss that he took early in the game in which he was nearly guilty of a safety. Henry looked like he was running in quicksand in this game. ",
            "7": "Remarkably, Henry was the only Titan with more than 20 receiving yards. Delanie Walker (3-19), Eric Decker (3-18), Rishard Matthews (1-7) and Corey Davis (0 catches) were all shut down by Jacksonville's elite back seven. <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> </br.>"
        }
    },
    "numberOfGames": "16"
}