{
    "year": "2017",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "Playing games on three days of rest is bad enough as it is, but the Colts were doing so following a grueling battle in a blizzard that went deep into overtime. They came out of the tunnel with lots of energy, leading for most of the opening half, but they wilted down following intermission, scoring just three points after the break. While this wasn't surprising, Brock Osweiler's performance certainly was. Osweiler took over for Trevor Siemian in the first half after Siemian injured his hand. Siemian banged it while hitting the turf, and he had to be carted into the locker room for some reason. Siemian wasn't heard from again, but the Broncos wouldn't have re-inserted him into the lineup even if he were cleared to play. Osweiler was that good. He ran in a touchdown in the second quarter, and his best plays occurred after halftime. Osweiler made several brilliant throws, including a terrific 54-yard pass to tight end Jeff Heuerman to give the Broncos a nine-point lead, thanks to a two-point conversion that should've never counted. Osweiler finished 12-of-17 for 194 yards and three touchdowns (two passing, one rushing). He made just one poor throw where he was almost intercepted on a deep shot to Emmanuel Sanders, but two Indianapolis defenders collided with each other. Osweiler was excellent otherwise, and he may have won himself an opportunity to start next week. This might be false hope, however, given how horrible Indianapolis' secondary is. The Colts are missing numerous starters in the secondary and are playing guys who wouldn't even be on other NFL rosters, so sudden Osweiler fanatics need to remain skeptical. Siemian, by the way, went 5-of-9 for 67 yards and a horrible interception thrown into double coverage. I have the Broncos beginning anew at quarterback in my , selecting Baker Mayfield. ",
            "2": "Indianapolis' fatigue was obvious when the team couldn't bring down C.J. Anderson in the second half. Anderson gashed the Colts for 158 yards on 30 carries, with most of his yardage coming after halftime. Anderson didn't even have 50 yards by intermission! Indianapolis simply looked too exhausted to deal with Anderson, and also Devontae Booker (11-39), who drew a ridiculous penalty from the Colts on a third-and-21. An Indianapolis player gave Denver a free first down because of a face mask on a short run on such a long down-and-distance situation. ",
            "3": "Despite Osweiler's great performance, neither Demaryius Thomas (5-69) nor Emmanuel Sanders (7-68) caught touchdowns. The recipients were Cody Latimer (3-60) and Heuerman, who scored on his sole reception. Thomas drew a defensive hold on a fourth-down try, while Sanders dropped a pass on the first play of the evening, but made up for it with a great 26-yard reception on a back-shoulder play. ",
            "4": "As for the Colts, they couldn't run the ball very well with Frank Gore, who mustered only 31 yards on 10 carries. Gore was a monster on Sunday, but with three days of rest, Gore couldn't really do much, and it didn't seem like Indianapolis didn't want that to be the case, as indicated by Marlon Mack's six carries, which he turned into 14 yards. I have Indianapolis selecting Gore's replacement, Saquon Barkley, in my mock. ",
            "5": "Jacoby Brissett, meanwhile, went 17-of-30 for only 158 yards. He also rushed for a touchdown. Brissett did well early, going 7-of-11 for 82 yards in the opening half, but barely completed half of his passes following intermission. Denver's defense, which was sleepy early, seemed to feed off Osweiler's inexplicable energy. ",
            "6": "Indianapolis' leading receiver was Jack Doyle, who caught seven passes for 47 yards. T.Y. Hilton was next with five grabs for 41 yards. Hilton got hurt in the second quarter when he collided with Aqib Talib. He remained in the game, but caught only one ball following halftime. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Lions",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Lions needed to win to keep their slim playoff hopes alive, and they took care of business against a Chicago team that self-destructed with penalties, turnovers and horrible coaching. There might have been some concern about Matthew Stafford's throwing hand coming into the game, but he quelled those worries with the best play of the afternoon. The Lions seemed destined to punt when they had a third-and-18 in their own territory. They had produced nothing but a couple of field goals up until that point, but Stafford launched the ball downfield to make something happen. Marvin Jones did just that, making a leaping catch over Eddie Jackson for a 58-yard reception. This set up a touchdown to T.J. Jones after the Bears wasted a timeout, giving the Lions an insurmountable 13-3 lead. Stafford started slowly, overthrowing Eric Ebron in the end zone, but he was mostly excellent after that. He finished 25-of-33 for 237 yards and two touchdowns despite missing two starting offensive linemen. He was especially strong in the second half, misfiring on just three of his 12 passes following halftime. However, Stafford's last pass was thrown away, and he was driven into the ground following the hit. He grabbed his shoulder while walking off the field, so there will once again be concern with his health. ",
            "2": "Marvin Jones, who caught the aforementioned 58-yard bomb, naturally led the team in receiving with three catches for 85 yards. He was the only Lion with more than 33 receiving yards. Eric Ebron (5-33) snatched a touchdown, while Golden Tate (3-33) crushed his fantasy owners. ",
            "3": "Ameer Abdullah was active, but he barely played. He touched the ball four times, catching three passes for 12 yards and rushing once for eight yards. Theo Riddick (8-49) lost a fumble right before halftime to set up a Chicago field goal. Tion Green (10-35) was ineffective. ",
            "4": "The Bears, as mentioned, made a lot of mistakes. They were penalized frequently - they had 13 infractions compared to Detroit's eight - and several of the yellow flags negated big plays, including a great kickoff return by Tarik Cohen. Even worse, Chicago was coached extremely poorly. John Fox passed on a fourth-and-1 near midfield in the second quarter, opting to punt for a net of 20 or so yards. Fox and his staff also failed to take advantage of Darius Slay's injury. Detroit's Pro Bowl cornerback left the field for a drive or two, yet Chicago didn't have Mitchell Trubisky attack his replacement at all. It was an inexcusable lack of in-game adjustment. Fox and offensive coordinator Dowell Loggains, instead, opted for lots of runs and checkdowns, as Fox continued to coach as if it were 1995. Fox needs to be fired in a few weeks, and Chicago needs to bring in a brilliant offensive mind to allow Trubisky to progress. Trubisky finished 31-of-46 for 314 yards, one touchdown and three interceptions. The yardage total looks nice, but Trubisky did not play well. Slay, who intercepted Trubisky twice, said it himself: He stared down a lot of things. Trubisky's accuracy was very inconsistent as well. His first pick was floated over his receiver's head. The second was a poor forced throw into double coverage in the end zone. The third was way behind his target. Trubisky also threw behind a receiver on a key third down. He made a couple of great throws as well, but he really needs to be coached up. Loggains is atrocious and needs to be replaced. ",
            "5": "Kendall Wright (7-81) and Jay Bellamy (5-70) both posted solid, but deceptive numbers. Most of their yardage occurred in garbage time. Wright dropped a third-down pass to move the chains in the opening quarter, though he's lucky he dropped the ball because it could've been ruled a fumble. Dontrelle Inman has vanished for some reason. Chicago needs a dominant receiver, and I have them selecting Calvin Ridley in my . ",
            "6": "Jordan Howard generated pedestrian numbers, gaining 37 yards on 10 carries to go along with four catches for 26 receiving yards. Howard had a reception of about 20 yards wiped out by penalty. Cohen, meanwhile, touched the ball only five times for some reason, as Loggains doesn't seem to understand that explosive players can score touchdowns. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Chargers were billed as the hottest team in the NFL heading into this battle for first place in the AFC West. The Chiefs, meanwhile, have seen their season derailed following a 5-0 start. Sixty-five percent of the experts on NFL Pick Watch expected San Angeles to prevail, but that's why they play the games. Quite simply, the Chiefs beat up their divisional counterparts. They pounded the ball right down the Chargers' throats with Kareem Hunt, who looked like the same running back who was once considered a lock for Offensive Rookie of the Year earlier in the season. The Chargers losing talented linebacker Denzel Perryman hurt, as his absence allowed Hunt to dominate in the second half. Hunt finished with monstrous stat line. He rushed for 155 yards on 24 carries, and he caught seven of his nine targets for 51 receiving yards. He found the end zone twice, and nearly had a third score, but replay review showed that the ball scraped the ground. This is the Hunt we thought we'd see all year, but the Chiefs struggled to create plays for him in the middle of the season. That has apparently changed, though it's not a given things will remain that way. Andy Reid has shown that he'll abandon the run in a big game, plus the Chargers just gave up late in the evening, allowing Hunt to burst for some big gains. I can't emphasize enough how important the Perryman injury was; Hunt had just 40 rushing yards in the opening half, and 115 after the break when Perryman was long gone. ",
            "2": "Alex Smith was terrific yet again. We got to see the good Alex, the one who takes aggressive shots downfield. He did this when he launched a bomb in Tyreek Hill's direction in the second quarter. Hill burned Pro Bowl cornerback Casey Hayward for a 64-yard touchdown. Smith misfired on just seven occasions, and some of those were drops. He finished 23-of-30 for 231 yards and two touchdowns. As mentioned, Smith nearly had a third touchdown on the play where Hunt nearly caught a pass. ",
            "3": "Hill led the Chiefs in receiving with five grabs for 88 yards and a touchdown. Travis Kelce didn't have a big game, but he caught six balls for 46 yards. The only target he didn't catch was a drop. ",
            "4": "Meanwhile, the Chargers are now in desperation mode. They need to win out and have several things go their way. It's unlikely that they'll win the AFC West because the Chiefs have swept the season series, but they can still sneak in as a wild card. In fact, if the Bills and Ravens both lose Sunday, they'll be tied for the sixth seed. If the Chargers are to make it as a wild card, they need to do much better offensively. Scoring 13 points against a pedestrian defense isn't going to cut it, and neither is giving the ball away four times. Philip Rivers had three interceptions, but only one was his fault. The first was lobbed into double coverage, but Tyrell Williams turned the wrong way and got lost on the route. The second was a bad overthrow on a fourth-down attempt, though poor protection affected the throw. The third occurred because Travis Benjamin, one of the least-intelligent players in the NFL, ran the wrong route. Rivers yelled at Williams and Benjamin after the picks, and rightfully so. The Chargers need better talent around Rivers, who finished 20-of-36 for 227 yards, one touchdown and the three picks. Mike Williams should be more productive next year to replace Benjamin and Tyrell Williams, but upgrades on the offensive line are needed. I have San Angeles selecting tackle Mike McGlinchey in my . ",
            "5": "Rivers' only capable wide receiver is Keenan Allen, but his numbers were limited. He caught only five passes for 54 yards, though he drew a pass-interference flag on Darrelle Revis. Adding injury to insult, Allen was carted into the locker room with a back injury at the end of the game. Elsewhere, Hunter Henry (3-28) did even less, while Antonio Gates caught Rivers' sole score. ",
            "6": "Melvin Gordon was the Chargers' best stat producer by far, rushing for 78 yards and a touchdown on 19 carries, and also catching six balls for 91 receiving yards. Meanwhile, Austin Ekeler once again made another mistake, losing a fumble at the beginning of the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bills",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The Bills need to beat the Patriots next week to have a chance at the playoffs, but they had to get past a Miami team that defeated the Patriots on Monday night. That didn't turn out to be that difficult, as Buffalo's defense dominated Cutler, who made numerous mistakes throughout the afternoon. Buffalo picked off Cutler three times. The first was a lazy pass off his back foot, overthrown by a mile. His second was another ball that sailed way over his target's head on a fourth down. The third came after an onside kick in the final minute, but Cutler overthrew yet another pass to end all hope for the Dolphins. It was typical Cutler, mailing in a bad game after a terrific showing on a national stage. ",
            "2": "Meanwhile, the Bills were able to score on the Dolphins, which Tom Brady could not do Monday night. LeSean McCoy didn't have a huge rushing performance like he had in the snow against the Colts, but he showed some heart by scoring a touchdown on the same drive in which he got hurt. McCoy got banged up on the carry in which he eclipsed 10,000 rushing yards in his career, but he found the end zone eventually. McCoy would end up scoring again in the opening half, so even though he didn't eclipse 100 total yards - 20 carries, 50 yards; four catches, 46 receiving yards - his two touchdowns rewarded those who started in him fantasy. ",
            "3": "Tyrod Taylor played well, going 17-of-29 for 224 yards and a touchdown. He was key as a scrambler, picking up 42 yards and a second score on six scrambles. The Dolphins had no answer for Taylor, who could've posted much better had the Bills not taken their foot off the gas with a big lead in the second half. By halftime, Taylor misfired on just six occasions, going 12-of-18 for 165 yards and a touchdown. ",
            "4": "The only Buffalo player with more receiving yards than McCoy happened to be Charles Clay, who caught five balls for 68 yards. Kelvin Benjamin, who came into the game questionable, wasn't much of a factor with two receptions for 20 yards. He missed some time in the opening half. ",
            "5": "Going back to the Dolphins, Cutler's final numbers were deceptive; he finished 28-of-49 for 274 yards and three interceptions, but he was much worse than that. He picked up some late yardage because of some half-hearted checkdowns. Entering the fourth quarter, Cutler was 17-of-29 for 127 yards and two picks. He was inaccurate on non-short passes all afternoon, and that was apparent early when he overshot Kenny Stills for a potential touchdown. ",
            "6": "Kenyan Drake scored a late touchdown to aid his fantasy owners. A better performance was expected against a poor Buffalo rush defense, but given that the Dolphins were trailing throughout this game, Drake was given just 16 carries, which he turned into 78 yards. ",
            "7": "Jarvis Landry came to play in this game, as he made several impressive catches. He finished with 10 receptions for 99 yards. DeVante Parker, meanwhile, wasn't completely useless for once, snatching six balls for 89 yards. However, most of that came on a 36-yard reception; Tre'Davious White shut down Parker otherwise. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "29"
        },
        "comments": {
            "amount": "7",
            "1": "With Carson Wentz out for the season, the quarterbacking situation was the obvious concern for the Eagles moving forward. Oddly enough, Nick Foles, along with some great special-teams plays, happened to be what saved the Eagles from losing this game. Philadelphia's defense was appalling in this contest. Battling Eli Manning, who has poor blocking and barely any receiving threats, the Eagles surrendered 504 net yards of offense. Philadelphia simply couldn't get off the field on most drives, as the Giants converted 10-of-18 third-down opportunities. And it's not like talent is the issue; Philadelphia had mismatches all over the place on this side of the ball. It just seemed as though the effort wasn't there. The Eagles missed lots of tackles and were drawn offside on numerous occasions. There were also some untimely penalties; for instance, Eli Manning was sacked on a third down in the red zone on the opening drive, but the play was negated by a defensive hold. The Giants would end up scoring shortly afterward. The Giants actually held a 20-7 lead in this contest, but that's when Eli Manning and New York's special teams self-destructed. Manning was on fire, yet forced a horrible interception, which Ronald Darby took back to the red zone. Manning was nearly picked again after that on an overthrown pass into the end zone. Meanwhile, the Giants had two kicks blocked: a punt that led to a touchdown that gave the Eagles a lead, and a field goal that would've allowed the Giants to kick again at the end of the game to win by a single point. ",
            "2": "Meanwhile, Nick Foles was very effective. Foles went 24-of-38 for 237 yards and four touchdowns, and he was every bit as good as those numbers indicate. However, it's worth noting that aside from a strong, opening drive, the Eagles didn't really get going offensively until star Giants safety Landon Collins was knocked out with an injury. This wasn't a surprise, as Collins played despite being listed as doubtful entering the contest, but his absence still made the Giants' defense much worse. It showed late in the game, as Foles posted decent numbers in the second half; he was 14-of-21 for 152 yards and a touchdown following intermission. ",
            "3": "Foles' four touchdowns all went to different players: Nelson Agholor (7-59), Zach Ertz (6-56), Alshon Jeffery (4-49) and Trey Burton (2-15). Agholor had a great game, especially when considering that he was hurt early in the afternoon. Agholor was sidelined with some sort of hand injury, but eventually reentered the game to lead the Eagles in receiving. Agholor's touchdown was a thing of beauty, as he caught the ball over a defender in the end zone. ",
            "4": "The Eagles struggled to run the ball against a stout New York ground defense. Jay Ajayi handled most of the workload, gaining 49 yards on 12 carries, most of which came on a 22-yard burst in the second half. Curiously, Ajayi was on the sideline on a key fourth-and-1 play in the second quarter. The Eagles went for it at the New York 44-yard line, and LeGarrette Blount (7-21) was stuffed in the backfield. ",
            "5": "Going back to the Giants, Manning finished with some spectacular numbers. He went 37-of-57 for 434 yards, three touchdowns and the aforementioned interceptions. Manning's numbers could've been even better had his pedestrian receivers not dropped numerous passes. He looked great, and he'll understandably draw lots of interest this offseason if he waves his no-trade clause. Meanwhile, the Giants will be selecting a quarterback in the draft; I have them taking Lamar Jackson in my . ",
            "6": "Sterling Shepard is the Giants' sole, remaining, viable receiver, and it's not a surprise that he led the team in receiving. He caught 11 balls for 139 yards and a touchdown. Tavarres King, meanwhile, caught two touchdowns on his only two receptions of the game. Evan Engram, meanwhile, hauled in eight balls for 87 yards. Engram thought he was interfered with during the final moments of the game when a pass went his direction in the end zone. The officials refrained from throwing their flags, and were probably right in not penalizing Philadelphia. ",
            "7": "The Giants struggled to run the ball again, with Wayne Gallman leading the way with 39 yards on eight carries. Orleans Darkwa did less on more carries (9-7), but was able to find the end zone. Here are the . <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Saints",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "The Saints may have won by 12, but they were in danger of losing this game. This was a one-possession affair in the fourth quarter, as New Orleans held a 17-13 lead for what seemed like forever. The Saints were stuck on 17 points because of stupid mistakes and replay reviews, especially in the second half. New Orleans receiver Brandon Coleman was responsible for a pair of mistakes. He had TWO lost fumbles in the red zone in the second half, one of which was inside the Jets' 10-yard line. This took at least six points off the board for the Saints, as did an Alvin Kamara drop on third down. Drew Brees, meanwhile, gave the Jets a free field goal with an interception deep in his own territory in the 2-minute drill. As for the bad luck, Michael Thomas had two touchdowns nullified by replay review. It was clear his foot was barely on the white chalk on one play, while the officials ruled him down shy of the goal line on the second overturn. Elsewhere, Mark Ingram appeared to score on a 64-yard reception, but the refrees ruled him out of bounds at the 10-yard line. ",
            "2": "Despite the blunders and misfortune, the Saints still scored 31 points, as Brees, aside from his pick, played well for most of the afternoon. He was a bit off of on some of his passes, but still misfired on just 10 occasions, going 26-of-36 for 285 yards, two touchdowns and the aforementioned interception. Fantasy owners who started Brees have to be pissed after they had two more scores overturned by replay review. ",
            "3": "Michael Thomas led the Saints with nine grabs for 93 yards and a touchdown. If it weren't for replay, however, Thomas would've finished with 11 catches for about 115 yards and THREE touchdowns! ",
            "4": "Both Saints running backs posted solid numbers once again despite the Jets starting two nose tackles in their defensive line to emphasize stopping the rush. Ingram gained 74 yards and two touchdowns, one of which was a 50-yard burst at the very end of the game. He also caught five balls for 77 receiving yards, though he did drop a pass and had a third touchdown wiped out because the officials said he stepped out of bounds. Kamara, meanwhile, gained 44 yards on 12 attempts, but did most of his work in the receiving game, catching six passes for 45 yards and a touchdown. Like Ingram, he also was guilty of a drop. ",
            "5": "As for the Jets, Bryce Petty didn't embarrass himself, but he failed to complete half of his passes. He finished 19-of-39 for 179 yards, one touchdown and two interceptions. Both picks occurred late in the afternoon, so it's not like Petty gave this game away when his team still had a chance. However, he's just not talented enough to be a starter in this league. ",
            "6": "Robby Anderson was not the same without Josh McCown. He was thrown to 12 times, but he and Petty didn't connect very often, as Anderson caught five balls for 40 yards. He led all Jets receivers in yardage. Anderson is a good player, but New York will need to find another wideout this offseason. Here are the . ",
            "7": "The Jets had one drive in this game where they ran effectively on almost every single play. They were down 10-0 at that point, so they deserve credit for trying hard and sticking with their game plan. Bilal Powell led the team with 44 yards and a touchdown, thanks to a Vonn Bell whiffed tackle, on 13 carries. Matt Forte (7-24) and Eli McGuire (4-24) were next on the stat sheet. McGuire also caught three passes for 48 receiving yards and a touchdown. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "24"
        },
        "comments": {
            "amount": "7",
            "1": "All eyes were on Aaron Rodgers, whom many predicted would quarterback the Packers into the playoffs by running the table. Rodgers, however, was very inconsistent in his first game back from injury. Rodgers opened the game with a quick slant to Davante Adams, but his next two throws were off the mark, with his third-down attempt being way behind Randall Cobb. Rodgers then was guilty of an overthrow while under pressure, but then led the Packers to a pair of touchdowns to take a 14-10 lead into halftime, but his second half started poorly with an underthrown interception when he had an open Cobb deep downfield. He followed that up with another interception in Jordy Nelson's direction. Nelson beat cornerback James Bradberry, but Rodgers underthrew the pass. Rodgers converted some fourth downs after that. He scrambled on a fourth-and-1, and he completed a ball to Cobb on a fourth-and-5. However, Rodgers underthrew Geronimo Allison on a third-and-4 in the red zone, and he later took a sack from Julius Peppers on a play that appeared to clinch the victory for the Panthers. Rodgers, however, would end up throwing a late touchdown to Richard Rodgers with 2:40 remaining. The Packers had no timeouts remaining, so they had to attempt an onside kick. They actually recovered, and Rodgers completed a pass to Allison inside the Carolina 30-yard line, but Allison lost a fumble. Carolina recovered the ball and was able to kneel down to run out the clock. Rodgers finished 26-of-45 for 290 yards, three touchdowns and three interceptions. He also moved around pretty well, scrambling six times for 43 rushing yards. Rodgers had a very mixed performance. He made some nice throws, but he couldn't complete other passes he usually would've made in his sleep. It appeared as though all of his arm strength wasn't there. Rodgers will be healthier next week, but it remains to be seen if the Packers will even start him; they're now 7-7, and they're effectively out of the playoff mix. ",
            "2": "Cobb was thrilled to see Rodgers return, as he broke free from his slump to catch seven passes for 84 yards and a touchdown. Adams also found the end zone, snatching five passes for 57 yards, but was knocked out with a concussion on a dirty hit by Thomas Davis. Jordy Nelson, however, continued to struggle statistically. He caught three passes for 28 yards, but the poor stat line wasn't his fault. As mentioned earlier, Nelson was open deep downfield for a big gain and potential touchdown, but Rodgers underthrew him. ",
            "3": "The Packers didn't get a good performance out of Jamaal Williams. He mustered only 30 yards on 10 carries. The Packers did themselves a disservice by not getting Aaron Jones involved more. Jones is the better of the two running backs, and he outproduced Williams on seven fewer attempts, gaining 47 yards. Jones was so good earlier in the year prior to getting hurt, so it's unclear why the Packers haven't been starting him over Williams now that he's healthy again. ",
            "4": "Speaking of talented players getting healthy, Greg Olsen is officially back. He hobbled on and off the field last week, but put together a dominant performance in this contest. He caught nine passes for 116 yards and a touchdown, as he was somehow wide open on the play. One of his receptions was a one-handed catch. ",
            "5": "Cam Newton torched the Packers with ease in this game. With Green Bay blowing countless coverages, Newton shredded the defense, going 20-of-31 for 242 yards and four touchdowns. He also scrambled a whopping 14 times for 58 yards. Newton was nearly picked on a third-and-9 in the opening half, but that was one of the very few mistakes he made during the afternoon. The Packers once again were abysmal against the pass. They need yet another new cornerback, so here are the . ",
            "6": "Despite Newton's great day, Devin Funchess didn't do much. He caught one pass for 19 yards. He dropped a touchdown after a fierce hit and he grabbed his shoulder in pain. However, he turned out to be OK because he tried to sneak into the huddle on the next play, but was disallowed from doing so because he had to sit out a play. Elsewhere in the Carolina receiving corps, someone named Damiere Byrd caught two touchdowns on three receptions for 25 yards. One of his scores shouldn't have counted. He bobbled the ball and landed out of bounds, but some incompetent officiating ruled that he scored upon replay review. There's seriously no point in having replays if the officials can't correctly rule an obvious play after watching video. ",
            "7": "Christian McCaffrey also scored, doing so aerially. He caught six passes for 73 receiving yards and a touchdown. The big development is that McCaffrey handled more carries than Jonathan Stewart, and he was far more productive. McCaffrey's 12 carries went for 63 yards, while Stewart's 11 attempts turned into just 27 yards. It would be great if the Panthers continued this trend, as McCaffrey is a much better player than Stewart is right now. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "Another week, and another lead the Browns squandered. This wasn't as atrocious as the blown 21-7 advantage in the fourth quarter against Brett Hundley last week, but nevertheless, the Browns have dropped to 0-14, and they'll need to win at Chicago or Pittsburgh to avoid the second 0-16 season ever. The Browns were up 7-3 at one point, but that's when the Browns began capsizing once again. Duke Johnson lost a fumble in Baltimore territory, down 10-7, and the Ravens capitalized with a quick touchdown to take a double-digit lead. It was a 17-10 margin early in the third quarter, but DeShone Kizer, who was intercepted earlier in the afternoon on a horrible overthrow, didn't sense the blind-side pressure when he stood in his own end zone for an eternity. He was naturally strip-sacked, and Baltimore scored a defensive touchdown. Kizer was later stuffed on a fourth-down sneak, and he followed that up with an interception in the red zone, an atrocious pass he made while drifting backward. Kizer finished 20-of-37 for only 146 yards and two interceptions. The Browns will be using one of their first-round picks on a quarterback unless they trade for someone. I have them selecting Josh Rosen in my . ",
            "2": "Moving on to a real team that will make the playoffs, the Ravens continued to hold the sixth spot. They'll make the playoffs if they win out, and they'll have a great opportunity to do so because their two remaining games are both at home against the Colts and Bengals. The defense did most of the work in this game, but Joe Flacco played well, going 26-of-42 for 288 yards and a touchdown. He was nearly picked in the end zone during the early stages of the game, but rebounded as the game progressed. Flacco had 179 yards by halftime, so if the Ravens weren't way ahead, he could've eclipsed the 300-yard barrier. ",
            "3": "Jeremy Maclin was knocked out with a leg injury on the opening drive, so Mike Wallace and Ben Watson were the only Ravens with more than 33 receiving yards. Wallace caught six balls for 89 yards, while Watson snatched all four of his targets for 74 yards and a touchdown. ",
            "4": "Alex Collins was a huge disappointment, mustering just 19 yards on 12 carries. He was given opportunities at the goal line, but was stuffed twice. Buck Allen was much more effective, gaining 70 yards on 13 attempts, though most of that occurred late in the game. ",
            "5": "To finish off the Browns' numbers, Josh Gordon was a disappointment despite leading the team with five catches for 47 yards. Corey Coleman, meanwhile, caught only one pass for 16 yards. ",
            "6": "Isaiah Crowell didn't get much of an opportunity to run the ball, tallying 72 yards on five carries, with most of his production coming on a 59-yard burst on Cleveland's only touchdown drive of the afternoon. Duke Johnson, meanwhile, scored a rushing touchdown, with 23 yards on seven attempts. Johnson was also a big factor as a receiver with five catches for 40 receiving yards. However, he made the aforementioned mistake in the second quarter, losing a fumble to set up a Flacco touchdown. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "7"
        },
        "comments": {
            "amount": "5",
            "1": "The Jaguars didn't have Leonard Fournette available, but they probably could've missed all three of their running backs and won easily. They absolutely dominated the Texans on both sides of the ball, as Houston was a complete no-show in this divisional rematch. Blake Bortles torched Houston's secondary, with no-names like Jaydon Mickens and Keelan Cole, dissecting an anemic and lethargic Texan team that surrendered 31 points in the opening half. The Jaguars went three-and-out on their opening possession when they were pinned deep in their own territory, but they were unstoppable after that. Jacksonville accumulated 289 net yards of offense prior to intermission without its best player, while the Texans, toward the end of the opening quarter, had more penalties (3) than net yards (0). Bortles finished 21-of-29 for 326 yards and three touchdowns. Houston's secondary, which was atrocious, didn't show much interest in tackling or covering. The Texans also committed a ridiculous number of penalties, getting whistled for a whopping 14 infractions. ",
            "2": "The aforementioned Mickens and Cole led the Jaguars in receiving, as Dede Westbrook (2-21) was a disappointment statistically despite drawing two key defensive penalties, while Marqise Lee (0 catches) suffered an injury in the opening quarter. Cole caught seven passes for an amazing 186 yards and a touchdown, while Mickens (4-61) found the end zone twice. Mickens made a terrific, finger-tip grab for a big gain prior to intermission. ",
            "3": "With Fournette out, Chris Ivory handled most of the workload, but didn't do anything with it. He mustered just 42 yards on 17 carries, while Corey Grant was more effective with 69 yards and a touchdown on 10 attempts. T.J. Yeldon was given just seven carries, which he turned into 27 yards, though he served as the third-down back, catching four balls for 25 receiving yards. ",
            "4": "There's nothing positive to say about Houston's offense, save for DeAndre Hopkins catching four balls for 80 yards and a touchdown. Hopkins did nothing in the opening half, but burned Jalen Ramsey for a deep score following intermission. Ramsey was so disappointed with himself upon Hopkins scoring that he remained on the ground for about half a minute, and then yelled at random people on the sideline. <br. (5-44).= 12-of-31= 128= <br= a= also= an= and= atrocious= back= backfield= because= block= by= chance= chance.= couldn't= foot.= for= front.= fuller= fumble= had= he= his= hopkins= horrible.= houston's= in= interception,= jacksonville's= launched= less= line= more= most= no= of= off= offense= offensive= on= one= only= other= own= passing= receiving= recovered= seconds= simply= snaps.= so= swarmed= t.j.= team,= texans= than= the= three= touchdown= tremendous= two= was= went= which= who= will= with= yards,= yards.= yates= yates,= yes,=> ",
            "5": "Lamar Miller couldn't get any blocking either. He managed just 32 yards on nine carries. He had just two attempts after halftime with the game so out of hand. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> It looks like the sharps were on to something when they pounded the Vikings on Sunday morning. I liked Minnesota as well because Vontaze Burfict was out, but I don't know why I didn't pull the trigger. ",
            "2": "The Vikings were in a position to clinch the NFC North, and they rolled Cincinnati from start to finish; this game was never even close. News broke before the game that Marvin Lewis would not be returning as head coach of the Bengals next season. Cincinnati's players responded by mailing in a performance and looking completely disinterested. ",
            "3": "The second play of the game saw Minnesota move the ball with Latavius Murray getting a 28-yard gain after being left uncovered. That set the tone for the afternoon, as the Bengals forget to cover running backs in the pass game all day. A 21-yard completion to Adam Thielen (3-30) set up a short touchdown run for Murray. The Vikings then expanded their lead to 14 as Eric Kendricks dropped into a short zone and read Andy Dalton's eyes to pick off the pass. Dalton threw an awful ball into a crowd of defenders. Kendricks returned the pick for a 31-yard touchdown. Another Vikings drive was moving before it stalled as Geno Atkins recorded his second sack of the game, but Kai Forbath hit a 53-yard field goal to put Minnesota up 17-0 at the end of the first quarter. Jerick McKinnon was then left wide open on a checkdown, and from there, he darted downfield for a 41-yard gain. That set up Keenum to hit Stefon Diggs (5-30-1) on a post route for a 20-yard touchdown pass. Minnesota took a 24-0 lead into halftime. Midway through the third quarter, McKinnon got wide open for a 29-yard reception, which set up a short field goal for Forbath. Cincinnati's offense finally got moving with a 45-yard completion to Brandon LaFell (2-53), but after crossing midfield for the first time all day, the Bengals' drive stalled out. Minnesota responded by moving the ball down the field and finished the drive with a short touchdown toss to Kyle Rudolph (2-17-1). With the Vikings up 34-0 in the fourth quarter, Teddy Bridgewater entered the game for Minnesota. This was his first game action since the gruesome knee injury sustained in August 2016. Bridgewater was indecisive in the pocket on his first passing play. He threw late and high in the middle of the field with too hard of a fastball to McKinnon. The ball was deflected into the air and intercepted by Bengals safety Shawn Williams. A few plays later, Gio Bernard (14-30-1) darted into the end zone with his first rushing touchdown of the season. Bridgewater's other pass attempt was dropped by Michael Floyd. ",
            "4": "Keenum was 20-of-23 for 236 yards with two touchdowns. ",
            "5": "Murray led the Vikings on the ground with 76 yards on 20 carries and a score. McKinnon was the leading receiver with seven catches for 114 yards. ",
            "6": "Dalton was 11-of-22 for 113 yards with two interceptions before getting pulled in the fourth quarter. He had no chance as the Minnesota defense dominated the Cincinnati offensive line. ",
            "7": "A.J. Green was held to two receptions for 30 yards. Xavier Rhodes, Terence Newman and the Vikings' secondary did a fantastic job in coverage on Green. Minnesota's front seven dominated the Cincinnati offensive line, with Brian Robison recording two sacks and Danielle Hunter had a sack as well. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "15"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> I can't believe Larry Fitzgerald dropped that pass at the end. Blaine Gabbert nearly gave me a heart attack, and I had only two units on this game. That's how you know you're a degenerate gambler! ",
            "2": "This was a very weird game. The Cardinals absolutely dominated the time of possession battle, holding the ball for over 36 minutes. The Redskins' offense couldn't get going at all. But at the end of the day, the Redskins were still able to emerge victorious. This was all thanks to the terrific effort of their defense. The Washington stop unit had one of its best performances of the 2017 campaign. Early on, the team was able to generate a great pass rush against Blaine Gabbert. Anthony Lanier helped to lead the charge, as he notched two sacks and was able to break up three passes at the line of scrimmage. It was a terrific performance from him and Preston Smith, who had a sack and a pick, and the duo deserve recognition for helping Washington win this game. On the offensive side of the ball, things didn't go as smoothly for the Redskins. Their offensive line had a tough time without Trent Williams. While Ty Nsekhe was able to contain Chandler Jones early, the league's best pass-rusher was able to get into the backfield a lot in the second half. Still, that didn't stop Kirk Cousins from having a solid performance. Cousins' numbers may not look like anything too special. He went 18-of-26 for 196 yards and two scores, but he was very efficient during this contest. Cousins started the game off on the right foot as the Redskins forced a turnover that set him up on the 5-yard line. He threw a perfect pass to Jamison Crowder to start the scoring. As the game went on, Cousins was able to throw timely, accurate passes that allowed his team to move the ball down the field. One of Cousins' best plays came when he was scrambling to his right and had to make a read to find an open receiver. He scanned the field and lofted a quick pass to Vernon Davis back over the middle to get the first down. It's amazing that Cousins was able to see Davis, and that vision should give Cousins another asset in case he hits the open market this offseason. ",
            "3": "Cousins' top receivers on Sunday were Jamison Crowder (5-55, 1 TD) and Kapri Bibbs (4-47, 1 TD). Crowder did a good job of creating open space by coming across the field to beat Arizona's defensive backs. He avoided making mistakes, and that allowed him to be a quality option for the team. It seems like he's the kind of guy who needs to see success early in order to have a solid performance. Meanwhile, Bibbs, who had just been added from the practice squad earlier in the week, had a nice touchdown off a screen pass. It looks like he will earn a role as a pass-catching back, but he can't be trusted in fantasy. ",
            "4": "Samaje Perine had a tough day on the ground. While he improved in the second half, the stingy Arizona defense was able to give Perine's line a lot of trouble. He finished the game with 37 yards on 15 carries, and he is a matchup play only right now. ",
            "5": "For the Cardinals, this loss knocked them out of the playoffs officially and also proved that they desperately need a quarterback moving forward. Blaine Gabbert is not going to get the job done for them. Gabbert had held up pretty well as the starter for the past month. However, Sunday was his worst performance of the season, by far. The Redskins were able to get a lot of pressure on Gabbert early, and that clearly rattled him. As the afternoon went along, Gabbert looked jumpy in the pocket and often was high on his throws. This was a result of him trying to get rid of the ball too quickly. Gabbert finished just 16-of-41 for 189 yards and a pick. He did almost led the Cardinals on a game-winning drive on their final offensive possession, but he couldn't do enough to push the ball downfield. At best, Gabbert is a solid backup. The Cardinals need to look for a new quarterback in the draft come April, as they need to find Carson Palmer's successor and an upgrade at the position. Here are Charlie's . ",
            "6": "Larry Fitzgerald (5-60) continued to have a solid performance in his 14th season. Fitzgerald continues to get open via his excellent route-running skills. He had one particularly nice route on the final drive of the day where he faked inside in front of Kendall Fuller and then proceeded to break outside for an easy catch. Fitzgerald still has gas left in the tank, so he can be relied on moving forward. Gabbert's poor play meant that the other Cardinals receiving options had mediocre days. Ricky Seals-Jones (2-11) had a disappointing outing against a Washington defense that doesn't play well against tight ends. J.J. Nelson (1-46) had a big catch, but the team really didn't have a quality No. 2 option. ",
            "7": "Even though Gabbert threw 41 passes, the Cardinals were still able to get 34 carries. That was because they ran so many more offensive plays than the Redskins. The leading rusher for Arizona was Kerwynn Williams, who totaled 61 yards on 17 carries. He had a couple of nice runs early in the game, but the Redskins were able to limit him down the stretch. Elijhaa Penny also saw 10 carries, for a total of 45 yards. Neither should be a lead back, but both have upside as change-of-pace guys moving forward. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Rams",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "7"
        },
        "comments": {
            "amount": "9",
            "1": "<i> EDITOR'S NOTE: </i> I'd like to personally thank the Rams' defense/Seahawks' offense for single-handedly helping me win one of my fantasy semi-finals. Amazing. Perhaps this game will convince the Seahawks that they finally need to upgrade their offensive line and also fire Darrell Bevell. ",
            "2": "At the beginning of this season, nobody thought the Rams would be a Super Bowl contender, but that is exactly what they are after this statement game of domination against Seattle. Rams coaches of Sean McVay, Wade Phillips and Greg Olson have done an amazing job of turning around what was one of the worst teams in the league a year ago. With this win, the Rams are poised to win their first NFC West title since 2003. Los Angeles dominated Seattle at the point of attack on both sides of the ball. Todd Gurley ran over the Seahawks' defense, and the defensive line was completely ineffective against the Rams' blocking front. Early in the season, Seattle's offensive line was a huge liability, and that was visible in this contest as Los Angeles racked up seven sacks. The Seahawks traded a second- and third-round pick for Duane Brown, and while he has helped them in previous games, he was dominated by the Rams, giving up multiple sacks, being called multiple times for holding, and allowing consistent pressure. This loss could end up costing Seattle a playoff spot as the team will need to win its final two games and get help in order to make the postseason. ",
            "3": "Los Angeles dominated the field position game with great defense, clutch turnovers, and tremendous special teams play to set up short fields for its offense. On the first third down of the game, Lamarcus Joyner made a textbook tackle of Seattle's Tanner McEvoy to force a fumble that linebacker Alec Ogletree recovered. The Seahawks' defense gave up some yards, but held strong to force a field goal. Quickly though, an Aaron Donald sack pushed Seattle back to punting from its end zone. The Rams turned the short field into points with a completion to Woods and Gurley taking off on a 15-yard run. A dropped pass by Cooper Kupp killed the drive, and Los Angeles settled for another field goal. The Rams' defense continued to own the Seahawks' offensive line, with Duane Brown getting flagged for two holds and giving up a sack. Another punt from the end zone was returned 53 yards by Pharoh Cooper to the 1-yard line, and the next play saw Gurley walk into the end zone to put up Los Angeles 13-0. The Rams moved into Seattle territory on their next possession, but on fourth-and-short, Jared Goff rolled out before having a pass tipped and intercepted by Michael Wilhoite. It was actually a dumb play by Wilhoite to catch the pass as he was just about to fall out of bounds, and that cost the Seahawks yardage, pushing them back to their own 13-yard line as opposed to being around the 25. Once again, the Rams forced Seattle to punt from its end zone, and Cooper returned that punt 26 yards to set up the Rams at the Seattle 36. After some gains, a 15-yard reception to Kupp moved the ball to the 1-yard line. Gurley then darted into end zone to put up the Rams 20-0. Los Angeles' Robert Quinn then beat Brown around the corner to pressure Wilson, who dropped the ball with a recovery by the Rams at the Seattle 39. Goff soon hit Tyler Higbee for 12 yards. A run by Gurley set up a short touchdown toss from Goff to Robert Woods for a 27-0 lead. In the final two minutes of the first half, Cooper added 20-yard punt return. Gurley then took a third-and-20 carry untouched for a 57-yard touchdown. The Rams were up 34-0 at the half, as Gurley had three touchdowns and 144 yards after only 16 carries. Russell Wilson was held to 76 yards on 7-of-14 passes. To start the third quarter, Aaron Donald beat Seattle's Luke Joeckel for a sack, and on the next play, Brown was beaten by Quinn for another sack. Midway through the third quarter, the Rams rolled down the field before scoring on a check-down pass to Gurley, who was left completely uncovered, from 14 yards out. Greg Zuerlein missed the extra point, but Los Angeles was up 40-0 by then. Seattle finally scored late in the third quarter when Luke Willson got wide open for a 26-yard touchdown. In the fourth quarter, Wilson committed an intentional ground penalty in the end zone for a safety. That ended the scoring in this blowout. ",
            "4": "Gurley left the game in the third quarter for his own protection given the Rams lead. He totaled 152 yards on 21 carries with three rushing touchdowns. He had three receptions for 28 yards and a touchdown receiving as well. With their injuries at linebacker and safety, the Seahawks were completely incapable of defending Gurley. However, their defensive line stunk, with the Rams' blocking dominated them. ",
            "5": "With Gurley destroying Seattle, Goff had an easy game, completing 14-of-21 passes for 120 yards and two touchdowns with an interception. The Rams pulled Goff midway through the second half and inserted Sean Mannion. ",
            "6": "Robert Woods led the Rams in receiving with six receptions for 45 yards and a score. ",
            "7": "Wilson completed 14-of-30 passes for 142 yards and a touchdown. He also led Seattle in rushing with 39 yards on five carries. ",
            "8": "J.D. McKissic (5-39 rushing, 3-38 receiving) led the Seattle backs in yardage and had the most yards through the air. Paul Richardson (2-18) and Tyler Lockett (2-8) were non-factors. Jimmy Graham had one reception for a loss of a yard. ",
            "9": "Defensively, the Rams saw Aaron Donald collect three sacks from his complete domination Luke Joeckel and Ethan Pocic. Robert Quinn also owned Seahawks left tackle Duane Brown, beating him for multiple sacks and drawing some holds. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> Holy hell. I've been very unlucky with so many picks this year, including two this week, but this New England win and cover was absolutely ridiculous. ",
            "2": "Just when the Steelers looked like they'd finally get the Patriots monkey off their back, they once again took the loss in a big game to the duo of Tom Brady and Rob Gronkowski, or as they should be known, the Steelers Killers. Both teams came into this game needing to win to help their respective playoff seeding, but the Patriots were coming off a bad loss in Miami and probably needed the win more, but the Steelers, who have overworked their running back, could have clinched the No. 1 seed with a win and been able to rest their stars to get ready for the playoffs. ",
            "3": "The Steelers looked like they were in trouble early when they gave up a 43-yard completion to Brandin Cooks, which led to a Rex Burkhead one-yard touchdown run. Then to compound the bad news early on, the Steelers lost Antonio Brown to a calf injury. Brown came into this game on an official tear and was even in consideration for MVP, which has only happened once for a wide receiver, the great Jerry Rice. The loss of Brown was certainly a blow to Pittsburgh, but the team persevered on the backs of Le'Veon Bell and Ben Roethlisberger to take the lead back and keep it until the waning minutes of the game. ",
            "4": "Tom Brady didn't put up the numbers he is used to when facing the Steelers, but he knew who to look for when he needed a big gain, which was the same player who has beaten the Steelers over and over again, Rob Gronkowski. With the Steelers up 24-19, Brady and Gronkowski connected on three straight passes for 26, 26 and 17 yards to put them on the Pittsburgh 8-yard line with a minute to go in the game. From there, Dion Lewis barreled into the end zone and then, without fail, Brady hit Gronkowski again for the two-point conversion, giving his team a 27-24 lead, which would become crucial to the crazy ending of this game. Gronkowski ended the day catching 9-of-13 targets for 168 yards and his two-point conversion. His zero touchdowns were actually an anomaly when it comes to his previous games against the Steelers, where he had caught eight scores in five games during the regular season. ",
            "5": "Thankfully for the Steelers, Gronkowski doesn't play defense, and they had the ball with 56 seconds to get into field goal range to tie it or score a touchdown to take the lead. Those chances went way up on the very first play when Roethlisberger hit JuJu Smith-Schuster on a shallow crossing route that he took for 69 yards to New England's 10-yard line with 34 ticks left on the clock. At this point the Steelers had the time, even with no timeouts left, to go for the touchdown, which they needed to win due to Gronkowski's two-point conversion. On their next play, Roethlisberger hit Jesse James at the goal line. James made the catch and had his knee down, but with nobody touching him, he reached the ball over the plane for the game-winning touchdown, or what was thought to be a game-winning touchdown. As James hit the ground with the ball in the end zone, it moved. After an extremely long review process, the touchdown was overturned. There will be plenty of sports radio debate on the validity of the call, but the Steelers were still in good shape to at least tie the game, that is, until Roethlisberger got a little too cute. Roethlisberger hit Eli Rogers on a crossing route, but Rogers was tackled in bounds, which pushed the Steelers to run up to spike the ball and stop the clock, but instead, Roethlisberger did his worst Dan Marino impression and fake spiked it before trying to force the ball to Rogers on a slant. The ball was tipped, however, and then intercepted by Duron Harmon to end the game. ",
            "6": "The win for New England gives them the No. 1 seed back with their 11-3 record, as the win over Pittsburgh is the tiebreaker, giving the Steelers the No. 2 seed with their 11-3 record. The Steelers will now head to Houston for a much-easier matchup, but they will be without Brown, who is reportedly suffering from a calf muscle tear. Thankfully for the Steelers, that initial prognosis is actually a good one for his availability in the playoffs. The Patriots will head back home to take on the Bills, who currently are in the wild card, but will, of course, have a tough time taking out New England in Foxborough. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "49ers",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "<i> EDITOR'S NOTE: </i> I have to say that I appreciated Jimmy Garoppolo taking a deep shot at the end of the game to potentially cover the spread. The 49ers didn't quite get there, but I'm glad they at least took a chance. ",
            "2": "If there was any doubt that the 49ers were underrated and the Titans were overrated, that was put to rest on Sunday afternoon. The 49ers were able to notch their fourth win in five games, and they can thank Jimmy Garoppolo for the last few. Since becoming the starter for the 49ers, Garoppolo has been terrific. He's an undefeated 3-0 as a starter with San Francisco, and against the Titans, he put on a clinic. Garoppolo led his team on multiple go-ahead drives late in the game and proved to be a clutch passer on the final possession. With about a minute remaining in regulation, Garoppolo and the 49ers were able to drive the ball down the field and get into field-goal range for a 45-yard kick by Robbie Gould. Garoppolo put the team in position to nail the winning kick by throwing a perfect strike over the middle to George Kittle for 24 yards and then followed it up with another laser to Marquise Goodwin to put the field goal within reach. The drive was a microcosm of what Garoppolo was able to accomplish on Sunday. Overall, Garoppolo finished the day 31-of-43 for 381 yards and a touchdown. He threw beautiful, accurate passes that often hit his receivers in stride. His ability to read the field is amazing considering his lack of experience as a starter. Garoppolo threw perfect spirals and just has the mechanics that you look for in a franchise quarterback. His one area for improvement is his ability in the red zone. He needs to help the team score more touchdowns instead of settling for field goals. ",
            "3": "Because of Garoppolo's excellent performance, the 49ers saw several receivers do well on Sunday. Garoppolo likes to spread the ball around, much like his former mentor Tom Brady. Goodwin (10-114) was Garoppolo's top target for yet another week. Goodwin is an explosive athlete and is really coming along as a receiver as well. He should continue to produce with Garoppolo in the lineup and can be trusted as a low-end WR2 in the final two weeks of the season. Elsewhere, undrafted rookie Kendrick Bourne (4-85) had a huge catch to set up a field goal for the team. Tight end Garrett Celek (3-63, 1 TD) caught Garoppolo's score, and he also hauled in a long pass over the middle of the field when he broke away from coverage. Garoppolo did well to find him, and that was just one of the many solid reads that Garoppolo made during this game. ",
            "4": "Things didn't run as smoothly for the 49ers on the ground. Carlos Hyde only managed a meager 25 yards on 16 carries. He was frequently stopped at or before the line of scrimmage, and it's clear that the 49ers will need to invest in some offensive line help moving forward. Here are the . ",
            "5": "This was a massive disappointment for the Titans. While the 49ers were expected to challenge them, the Titans desperately needed a win to keep pace in the AFC playoff race. Instead, they lost and are now on the outside looking in. Marcus Mariota had a pretty solid day for his team. He was coming into the game after being banged up in previous weeks, so it was tough to know what to expect from him. But in this game, Mariota was his usual, accurate self, and he didn't appear to be hampered by his troublesome knee. Mariota did a good job of methodically moving the ball down the field. He was accurate on short-to-intermediate passes, and he worked well in the red zone as usual. His touchdown pass to Rishard Matthews was a nice play that saw Mariota find the open man behind the linebackers and throw a dart right into his receiver's hands. It was a perfect pass, much like most of Mariota's throws in the red zone. The one discouraging thing from this contest was the lack of trust the Titans put in Mariota on the final drive. Facing a third-and-short in field goal range, the team elected to run the ball with just a minute left and didn't get the line to gain. Had they passed, they would have had a better chance to expose a porous San Francisco secondary. Granted, they wanted to get the 49ers to use a timeout, but they made the mistake of not keeping the ball in the hands of their best player. Mike Mularky will likely be questioned about that in the coming week. Mariota finished 23-of-33 for 241 yards and two scores. He is a very solid quarterback, but he needs to make some more explosive plays if he wants to carry his team to the postseason. ",
            "6": "Mariota spent most of his day targeting Rishard Matthews (6-95, 1 TD) and Eric Decker (5-63). Matthews made some nice catches on the sideline and showed good athletic ability in finding open space against the San Francisco defense. Decker used his big body to get physical with the men in coverage and outmuscle them for the ball. This duo appears to be a strong one, and it will only get better as rookie Corey Davis (3-28) gets mixed in as the third receiver. Delanie Walker (5-37) caught Mariota's other touchdown. This one saw Mariota scramble right and then throw back across his body to Walker in the back of the end zone. It was a perfect strike, as it was in a location that only Walker could get it while keeping him from stepping out of the back of the end zone. ",
            "7": "Normally, the Titans are known for having a solid run game. That never materialized against San Francisco. The Titans inexplicably decided to give DeMarco Murray a lion's share of the workload. He saw 18 carries, but only managed 59 yards. Derrick Henry (7 carries, 19 yards) didn't fare much better, but he wasn't given extended runs until later in the second half. The coaching staff has to put more trust into Henry as he clearly has the most potential as a lead back right now. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "17"
        },
        "comments": {
            "amount": "8",
            "1": "We've seen the horrible touchback rule screw some teams over this year, and the Raiders were the latest victims. They were in position to tie, as Derek Carr scrambled for a first down inside the 5-yard line. He had greater aspirations, as he desired a touchdown. He reached for the pylon, but the ball came loose and trickled out of bounds through the back of the end zone. The play was ruled a touchback, and Dallas was rewarded possession and a 20-17 victory. The rule is a very stupid one, as it makes no sense for the opposing team to get the ball, as they are rewarded for doing nothing. Perhaps the ruling will be changed during the offseason, but that won't do anything for the Raiders, who have effectively been eliminated from the playoffs. The Cowboys, meanwhile, remain alive at 8-6. ",
            "2": "The Cowboys were very fortunate to come away with a victory, as they didn't play particularly well. They committed two turnovers and made lots of other mistakes. They began with a Dak Prescott interception on what appeared to be a miscommunication with Dez Bryant. Prescott then was lucky to have a potential pick that was dropped. Prescott's second interception looked like a pick-six by Sean Smith, but the cornerback was ruled down when replay review showed that Cole Beasley barely tapped him when he was on the ground. Prescott, however, made a crucial play when he was able to sneak for a fourth down. The measurement was so close that the official had to use a folded-up piece of paper to determine that Dallas moved the sticks. This ultimately led to the game-winning field goal, so the measurement will spark some controversy. The paper was inserted the wrong way, but the greater question is why it's 2017, and yet there is no chip in the football yet to determine its location on the football field. The NFL makes billions of dollars, so you'd have to think the league would be able to make something like this possible. ",
            "3": "Prescott finished 18-of-27 for 212 yards and two interceptions, though he did better on the ground with six scrambles for 32 rushing yards and a touchdown on the ground. Those weren't horrible numbers, but remember that Oakland has one of the league's worst secondaries. Prescott was expected to do much better, but he struggled. ",
            "4": "Luckily for Dallas, Ezekiel Elliott returns next week. Alfred Morris was just OK, gaining 61 yards on 16 carries. Morris is obviously less talented than Elliott, but the biggest difference is their ability in short yardage. Elliott is the master of converting those situations, while Morris was stuffed on three occasions in this game; twice at the goal line, and once on a third-and-1. Having Elliott back will be crucial, but the Cowboys could be missing Tyron Smith. The Pro Bowl left tackle had his ankle rolled up in the third quarter and had to leave the game. Dallas has struggled mightily without Smith. ",
            "5": "Dez Bryant led the Cowboys with 59 receiving yards on two catches. He also drew a pass-interference flag in the end zone. However, Bryant was partly responsible for an interception, and he also was guilty of a drop. Jason Witten (4-47) was the only other Cowboy with more than 31 receiving yards. Dallas desperately needs another wideout. Here are the . ",
            "6": "Going back to the Raiders, Carr finished 21-of-38 for only 171 yards and two touchdowns. He also scrambled four times for 47 rushing yards. Carr performed better than he did last week, but only by default. He tossed too many checkdowns and cost his team at the end of the game. He had some accuracy issues on several occasions, including a pass thrown behind Michael Crabtree on third down. However, it should be noted that Carr should've thrown a third touchdown, but Jared Cook was flagged for offensive pass interference. ",
            "7": "Crabtree saw a whopping 17 targets, converting seven of them for 39 yards. He also drew a long pass-interference flag. Fortunately for his fantasy owners, he scored twice. Cook (2-17) had a touchdown nullified, and he also dropped a pass. ",
            "8": "Marshawn Lynch ran well, but didn't get an ideal amount of opportunities because the Raiders trailed for most of the game. He gained 76 yards on 16 carries. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "21"
        },
        "comments": {
            "amount": "7",
            "1": "If we learned one thing Monday night, it's that the Falcons are not a very good team. They had all the breaks in this game. The Buccaneers entered missing their two best defensive players, Gerald McCoy and Lavonte David, and also starting cornerback Vernon Hargreaves. Tampa also lost several other players throughout the contest to injury, namely DeSean Jackson, O.J. Howard and starting guard J.R. Sweezy. The Buccaneers were guilty of several poor tackling efforts, and they had 10 men on the field on one crucial third down. They also lost a fumble by Peyton Barber inside the Atlanta 5-yard line. The Falcons, meanwhile, had a potential, crucial fumble of their own when Devonta Freeman coughed up the ball, but they were lucky to recover. Despite getting ALL the luck in this divisional contest, the Falcons were still a Tampa 54-yard field goal away from getting this game sent to overtime. This was a horrible performance by the Falcons, who just aren't very good. They drop too many passes, and Matt Ryan is way off on numerous passes. He was very accurate last year, and his team had the second-fewest drops in the NFL in 2016, but Ryan now misses receivers constantly, while his team has more than double the amount of drops they had last year. They're extremely fortunate to be 9-5 right now, but they could easily lose to a pair of superior teams in the next two weeks, the Saints and Panthers. ",
            "2": "Ryan finished 17-of-31 for 212 yards and a touchdown. Ryan's numbers could've been much better, but he threw a pass too late to ruin a score to Julio Jones at the end of the opening half. He then didn't see a wide-open Levine Toilolo for a wide-open touchdown. Ryan followed that up by throwing wide of a way open Mohamed Sanu, and then he whiffed on a third-down throw to Justin Hardy in the red zone. I don't know what happened to Ryan, but Steve Sarkisian can't be blamed for his declining accuracy and awareness. ",
            "3": "Jones should've been able to find the end zone at least once, but he and Ryan couldn't hook up very often. Ryan threw to him eight times, yet Jones came away with only three receptions for 54 yards. Hardy (2-33) scored the touchdown, while Sanu (2-23) barely did anything. ",
            "4": "Freeman actually led the Buccaneers in receiving with five grabs for 68 receiving yards. He was also a force on the ground with 126 yards and a touchdown on 22 carries. He single-handedly kept the Falcons from getting upset at Tampa. Without his great running, the Buccaneers surely would've won because Ryan and his receivers were struggling. That said, he was guilty of the aforementioned fumble and a drop of what would've been a reception of 40 or so. ",
            "5": "As mentioned, the Buccaneers suffered numerous injuries on offense in this contest. Yet, that didn't stop Jameis Winston from going 27-of-35 for 299 yards and three touchdowns. This was Winston's best game of the season, and he nearly had a game-tying drive at the end of regulation, but his kicker whiffed on a long kick. His numbers could've been even better, but Brate dropped a pass, while Mike Evans had two long catches, including one touchdown, negated by his own offensive pass interferences. The calls were legitimate, however. ",
            "6": "Speaking of Evans, he was still able to have a strong fantasy performance with five catches for 79 yards and a touchdown. However, his night could've been even better. It's also worth noting that Evans didn't appear to show much effort in the early going, refusing to dive for a potential reception, which Jon Gruden chided him for. Elsewhere in the Buccaneer receiving corps, Brate was next on the stat sheet with four receptions for 49 yards. Adam Humphries (5-43) and Howard (1-30) caught Winston's other touchdowns. ",
            "7": "Doug Martin was a healthy scratch, so Barber handled the entire workload. He didn't have many opportunities because his team was constantly trailing, but he ran well, gaining 53 yards on 13 carries. He picked up a third-and-1 with a tough run. However, he was guilty of the aforementioned fumble. Barber is better than Martin right now, but Tampa needs a new back. I have them selecting one in the second round of my . <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> </br.>"
        }
    },
    "numberOfGames": "16"
}