{
    "year": "2017",
    "week": "16",
    "Game 1": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Ravens knew they'd make the playoffs if they were to beat the Colts and Bengals in their final two games of the regular season. Indianapolis came into this contest with just three victories, but did not roll over. In fact, the Colts had a chance to tie the game at the end of regulation, but Baltimore's defense stood tall after a blocked punt, securing its ninth victory of the season. It seems like the Ravens should feel good about winning, but this game was disconcerting for their potential January success. That's because Joe Flacco played poorly. The numbers don't indicate that - he went 29-of-38 for 237 yards and two touchdowns - but the stats don't tell the whole story. Flacco should've been able to help the Ravens score more than just 23 points against one of the worst defenses in the NFL, but he made several mistakes. He whiffed on an open receiver in the red zone, missed Alex Collins in the flat, and took a horrible, 17-yard sack. Granted, the conditions were rainy and windy, but Flacco should've been able to be more productive against an atrocious secondary missing top cornerback Rashaan Melvin. ",
            "2": "With Flacco struggling, no receiver really stood out. Mike Wallace led the way with four catches for 60 yards, while Ben Watson had five grabs for 40 yards. Watson fantasy owners - i.e. me - were robbed when Maxx Williams vultured a touchdown in the second half. ",
            "3": "The Colts have a solid run defense because of Johnathan Hankins, so that would explain why Alex Collins was limited to just 51 yards on 18 carries. Danny Woodhead, meanwhile, contributed in the passing game, catching five balls for 33 receiving yards. ",
            "4": "As for the Colts, Jacoby Brissett had his own struggles. He didn't turn the ball over, but easily could have. On one drive in the fourth quarter, he missed on a wide-open target and was nearly intercepted. He kept the drive alive with a scramble on fourth down, but he had an overthrown pass that was dropped by Eric Weddle, who was disappointed in himself for botching such an easy chance at a pick. Brissett finished 16-of-33 for 215 yards and a touchdown. He made some nice throws, and three of his incompletions were dropped, but he had some accuracy issues at times. Brissett had more pass protection than he's used to, and that helped the Colts hang around in this game. ",
            "5": "T.Y. Hilton took advantage of Jimmy Smith's absence, catching six passes for 100 yards. He dropped a pass, but made up for it with a great sideline grab. Jack Doyle (5-41) was next on the receiving list. ",
            "6": "Frank Gore ran well against a stout ground defense, pushing forward for 68 yards on 17 carries. Next week could be his final game as a starter - I have the Colts taking Saquon Barkley in my - and he'll eventually find his way into the Hall of Fame despite the hate Rich Eisen received on Twitter for saying so. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "0"
        },
        "comments": {
            "amount": "6",
            "1": "The NBC telecast mentioned that the Vikings hadn't achieved a shutout since 1993, which is just astonishing. Oddly enough, they pitched two shutouts that season, with the most recent one being a 13-0 result. Coincidentally, that was the exact score of this game before a late Green Bay penalty gave the Vikings a short field goal to make the final score 16-0. Minnesota's defense was outstanding, limiting the Packers to just 12 first downs, 4-of-15 third-down conversions, and just 3.7 yards per play. Harrison Smith was a beast, intercepting two passes, making numerous big plays, and leaving many wondering how the hell the top safety in the league wasn't voted in the Pro Bowl. The offense, however, wasn't nearly as potent as expected, considering all of the injuries the Packers had heading into this game. Green Bay was missing both of its edge rushers, Clay Matthews and Nick Perry, as well as its top outside cornerback, Damarious Randall (here are the .) The Packers, already woeful defensively, seemed incredibly outmatched. And yet, the Vikings, like the Packers, were just 4-of-15 on third down. In fact, they lost the time-of-possession battle by seven minutes, and they were only slightly better in yards per play (3.9). Case Keenum just wasn't very good. He barely completed half of his passes, going 14-of-25 for 139 yards and a touchdown, and he was every bit as mediocre as those numbers indicate. Keenum missed several downfield passes, including a wide-open Adam Thielen for a long score. He also tossed two potential interceptions; one was dropped, while the defender didn't see the other. There were a couple of Minnesota drops, but Keenum took a big step backward. Keenum's best play was when he danced around the pocket on a third-and-13 to find tight end/long snapper David Morgan for a 23-yard completion. However, Keenum converted just three other third downs. If he plays this way against a playoff team, he won't win in January. ",
            "2": "Stefon Diggs was the only Viking with more than 26 receiving yards. He caught five passes for 60 yards and a touchdown, and he also drew two pass-interference flags. His best play was a great back-shoulder catch while being tackled. Meanwhile, Thielen's numbers were lackluster; he got his hands on just two balls for 24 yards. He should've posted better numbers, but Keenum missed him a couple of times. ",
            "3": "Latavius Murray struggled to find running room, thanks in part to a pair of injuries to the offensive line. Guard Nick Easton went down early, and he had to be helped off the field. Left tackle Riley Reiff also left the game, getting knocked out in the fourth quarter. Murray mustered 69 yards on 21 carries, while Jerick McKinnon (7-42) was much more effective. ",
            "4": "The Packers, meanwhile, have just one more game before this nightmare season comes to an end. Brett Hundley was poor once again in relief of Aaron Rodgers. Constantly lofting helpless floaters downfield, Hundley failed to connect on half of his passes, going 17-of-40 for only 130 yards and two interceptions. There were some drops that hurt for sure, but Hundley showed poor accuracy and decision-making once again. He also telegraphed both of his picks, one of which occurred in the red zone. The only thing Hundley did well was scramble for two big gains. He picked up 48 rushing yards on five runs. ",
            "5": "With Davante Adams out, Jordy Nelson had to step up. Nelson, however, dropped two possible completions of 10 and 25 yards, suffering an injury on the second instance. He left the game and never returned. As a result, Lance Kendricks and someone named Michael Clark tied for the team lead with 36 receiving yards. Randall Cobb (4-22) barely did anything of significance. ",
            "6": "Jamaal Williams continued to be the lead back over Aaron Jones, which still seems like a mistake. Williams gained 58 yards on 15 carries, while Jones picked up 13 yards on only three attempts. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "7"
        },
        "comments": {
            "amount": "7",
            "1": "The Chargers tried their best to blow this game in typical Charger fashion. They somehow posted just 14 points against a pedestrian defensive team, which should've been bad enough to lose in the sort of way they suffered a defeat at Cleveland in Week 16 last year. Fortunately for them, they were playing the worst current starting quarterback in the NFL. It's amazing how close the Chargers were to losing this contest. Philip Rivers was nearly picked at the beginning of the second quarter, but Jamal Adams just barely missed the ball. Later, new kicker Nick Rose whiffed on a 47-yard field goal to set up the Jets in great field position. New York scored on a 57-yard Bilal Powell run to tie the game, but the Chargers were able to engineer their lone scoring drive in the second half to take the lead and win the game. ",
            "2": "Rivers finished 22-of-40 for 290 yards and a touchdown. The Jets mostly won at the line of scrimmage, thanks in part to left tackle Russell Okung being out. However, San Angeles lucked out a bit when Leonard Williams suffered a back injury at the beginning of the third quarter. The Chargers were much more successful offensively once Williams was knocked out. ",
            "3": "Rivers didn't have Hunter Henry at his disposal because of a lacerated kidney. Antonio Gates started instead and rewarded those who used him in their fantasy lineups. Gates caught six passes for 81 yards and a touchdown. Keenan Allen, meanwhile, had a poor statistical game, catching just five of his 10 targets for 63 yards. It's worth noting that Allen snatched an interception on a Hail Mary at the end of the first half, though this doesn't count in regular-scoring fantasy leagues. ",
            "4": "Melvin Gordon gained 81 yards on 19 carries. He also scored the decisive touchdown. He had more room to run in the second half once Williams left the field. ",
            "5": "As for the Jets, Bryce Petty had a rough afternoon. His inaccuracy was apparent throughout whenever he didn't settle for checkdowns. For instance, he missed a wide-open Austin Seferian Jenkins for what would've been a huge gain in the first quarter. Petty finished 15-of-28 for 119 yards and an interception, which was Allen's Hail Mary interception. The Jets might as well allow Christian Hackenberg to start next week because it's obvious that Petty is not an NFL-caliber player (not even as a backup). Here are the for New York fans to peruse. ",
            "6": "Petty has been detrimental to Robby Anderson's fantasy football success. Anderson, who routinely posted WR1 numbers with Josh McCown, was limited to five catches for 51 yards. He had a chance for a game-tying touchdown at the very end, but Petty's pass was inaccurate. Jermaine Kearse (5-42) and Seferian-Jenkins (4-21) were the only other Jets with double-digit receiving yards. ",
            "7": "Powell handled the majority of the workload, and it's about time, because he's the best running back the Jets have, and it's not even close. Powell tallied 145 yards and a touchdown on 19 carries, including his 57-yard touchdown in which he bobbled the ball while handling the pitch. Matt Forte (8-19) lost a fumble near the red zone. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Rams",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "I'm beginning to think that if it wasn't for Tom Brady, Todd Gurley would be the runaway MVP candidate. Sure, he's obviously not a quarterback, but he has been incredibly dominant this season, and that was very apparent in this victory. Gurley eclipsed 100 yards in both rushing and receiving. He gashed the Titans on the ground with 118 yards on just 22 attempts, and he caught 10 of his 13 targets for 158 receiving yards and a pair of touchdowns. Gurley was amazing, with so many highlight-reel plays. He hurdled a defender on an early 19-yard reception, and then he took a screen and blew by everyone for an 80-yard touchdown. It was perfect call to counter a blitz, but Gurley turned what should've been a decent gain into a long touchdown. Later in the game, Gurley converted on a fourth-and-1, though Tennessee fans would argue that the play shouldn't have happened because a false start should have been called. The conversion set up a touchdown pass. Gurley's success isn't a surprise at all. Two-and-a-half years ago, we reported that one NFL team that tried to trade up for Gurley but failed considered him to be the next Jim Brown. Gurley is sure to be the consensus No. 1 fantasy player next summer, and he definitely needs to receive some MVP votes. ",
            "2": "As for Jared Goff, he threw four touchdowns. He played extremely well, though that was expected because Tennessee was missing two of its top three cornerbacks. Goff's his sole blemish was a strip-sack, though that wasn't even his fault because he literally had zero time in the pocket because Jurrell Casey blew through the line of scrimmage right away. It turned into a scoop-and-score for Tennessee. Goff actually should've posted better numbers than his 22-of-38, 301-yard, four-touchdown performance. There were some drops, including one by Cooper Kupp on a third down. ",
            "3": "Speaking of Kupp, he drew a defensive pass interference flag, making up for his drop. Even better, he snatched an amazing touchdown reception in which he knee hit the ground just as he was falling out of bounds. Kupp finished right behind Gurley on the receiving list with four catches for 65 yards. Robert Woods (3-33) was a disappointment in the fantasy championship, while Sammy Watkins actually contributed, catching a touchdown in the second half. He predictably did little else, hauling in three grabs for 30 yards. ",
            "4": "If there's one concern for the Rams, it's the kicking game. Greg Zuerlein is out for the year, and his replacement, Sam Ficken, whiffed on an extra point and a 35-yard field goal. Perhaps Einhorn is available to replace Ficken. ",
            "5": "Marcus Mariota, meanwhile, nearly came away with this victory despite beginning the game very poorly. He set up the Rams with a quick touchdown with an interception, as he stared down his receiver all the way, failing to see the underneath defender. Alec Ogletree also caused some trouble for Mariota, tipping away passes on a couple of third downs in the opening half. Mariota rallied after halftime, going 13-of-24 for 187 yards in the second half, which was much better than his first-half figures (9-of-15, 88 yards, INT). He moved the chains well, but failed to do so on the final drive. He needed a touchdown instead of a field goal because of a missed Ryan Succop 45-yard field goal in the third quarter. Also, DeMarco Murray's injury didn't help. I've been clamoring for Derrick Henry to handle the workload rather than Murray, but there's little doubt that Murray is better as a receiver right now. ",
            "6": "Speaking of Murray and Henry, the former once again was given more carries, which doesn't make any sense. Murray gained 48 yards on 15 attempts, while Henry managed 25 yards on eight attempts. The Titans need to improve their blocking, and I have them taking a center in my . ",
            "7": "The silver lining for the Titans is that Corey Davis finally had a breakout game. He led the team in receiving with six catches for 91 yards. Eric Decker (6-73) wasn't too far behind him. However, Rishard Matthews (2-48) and Delanie Walker (3-33) disappointed their fantasy owners on championship weekend. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "22"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "19"
        },
        "comments": {
            "amount": "7",
            "1": "Things looked bleak for the Panthers for most of the afternoon. Cam Newton suffered an injury in the opening half, and though he was able to walk off on his own, he still missed some time. Derek Anderson had to play, which didn't bode well for Carolina's chances. Newton was able to return to the game in the third quarter, but threw an interception right away. The pick wasn't his fault - Kwon Alexander ripped the ball out of Brenton Bersin's hands - but it still helped the Buccaneers hold a lead for most of the second half. This changed when Newton was able to engineer his first game-winning drive in two years. Chris Baker's offside penalty on a fourth-and-3 helped. Two plays later, Newton fumbled the snap, but was able to pick up the ball and plow into the end zone for the decisive score, keeping Carolina alive for the NFC South title and a potential No. 2 seed, which would occur with a win and losses by New Orleans and Minnesota next week. ",
            "2": "Newton didn't post the best fantasy stats in this game because he missed some time with an injury. Tampa's defense also played better than it has performed recently because Gerald McCoy and Lavonte David returned from injury. Newton finished 16-of-25 for 180 yards and an interception, but did most of his damage on the ground; he scrambled 14 times for 52 rushing yards and the game-winning touchdown. ",
            "3": "The Panthers gave more carries to Christian McCaffrey once again, which is great news. McCaffrey was given nine carries, which he turned into 39 yards. Jonathan Stewart, meanwhile, had 19 yards on seven attempts. McCaffrey oddly didn't do much as a receiver, catching just two of his four targets for 19 yards. ",
            "4": "With Newton struggling to pass the ball, Bersin was Carolina's leading receiver with three catches for 45 yards. Both Greg Olsen (3-27) and Devin Funchess (3-11) disappointed their fantasy owners. ",
            "5": "Carolina may have won this game, but the Buccaneers were the more dominant team on paper. Tampa had way more net yards (392-255) and averaged 2.6 more yards per play, 6.9-4.3. They were up for most of the afternoon, but as they've done all year, they shot themselves in the foot with careless mistakes. It began right away when Jameis Winston was strip-sacked on the opening drive. He held the ball for an eternity and then lost it, setting up a Carolina field goal. After that, Mike Evans was guilty of offensive pass interference, and Winston then botched a snap in the red zone again. And if things weren't bad enough, Tampa allowed a kickoff return touchdown, which is something that rarely happens anymore because of the new kickoff rules. All of this occurred in the opening half. The Buccaneers were cleaner following intermission for a while, but that changed when Patrick Murray was wide right on a 51-yard field goal to give Carolina some great field position. Baker was then guilty of the aforementioned offsides, and after that, Winston was strip-sacked on the final possession. Winston actually had to be pushed off the field following a personal-foul penalty because he yelled at the officials, claiming that he recovered the ball. Excluding the blunders, Winston had a great game, going 21-of-27 for 367 yards and a touchdown. This showed off Winston's great potential. However, all of the fumbles and mistakes need to be cleaned up next year. Perhaps that'll happen once the Buccaneers hire a real coach. ",
            "6": "Evans overcame the offensive pass interference to catch six passes for 107 yards. Rookie Chris Godwin was next on the receiving list with three grabs for 98 yards. Cameron Brate (3-13) drew a pass-interference flag in the end zone. ",
            "7": "Doug Martin was active again, but he didn't do much. He was limited to just seven yards on six carries, while Peyton Barber took his 13 attempts and transformed them into 51 yards. I have Tampa selecting a running back in the second round of my . <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Saints",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Falcons",
            "Points": "13"
        },
        "comments": {
            "amount": "7",
            "1": "The writing was on the wall for the Falcons. They've looked terrible at times this year, losing at home to the Bills and Dolphins, and struggling to put away the Buccaneers on Monday Night Football last week. They managed to beat the Saints before that, but New Orleans lost Alvin Kamara on the opening drive. Predictably, the rematch was much different, with the Saints dominating their blood rival to get them one step closer to winning the NFC South. They can do that by beating the Buccaneers next week. The Saints, meanwhile, didn't have the most dominating performance. They struggled to maintain possessions, converting just 3-of-13 third downs. There were some pass-protection issues, especially with left tackle Terron Armstead leaving the game with injury. However, they were able to hit enough big plays to put them over the top. ",
            "2": "Drew Brees didn't post the most glamorous stats, throwing for 239 yards, one touchdown and an interception, which came on a tipped pass in the third quarter. However, he completed three-quarters of his passes, going 21-of-28. He also eclipsed 70,000 passing yards for his career, becoming only the third player to do that (Peyton Manning, Brett Favre). Brees will pass Manning and Favre next year, assuming there are no injuries; Manning and Favre accumulated 71,940 and 71,838 career passing yards, respectively. ",
            "3": "Kamara's return to the lineup was huge, as he's the centerpiece of New Orleans' offense. He's such a potent threat, catching seven passes for 58 receiving yards in this game. He was limited on the ground - 12 carries, 32 yards - but he also had a long kickoff return to spark a scoring drive. Mark Ingram was more successful as a rusher - 13 carries, 44 yards - and he also scored a touchdown. ",
            "4": "Michael Thomas was hindered by a hamstring injury, which might explain why he caught just four passes for 66 yards. Still, he was second on New Orleans' receiving list, right behind Ted Ginn (4-75), who scored on a 54-yard bomb. ",
            "5": "Going back to the Falcons, they also struggled to maintain drives. They were even worse on third downs, going 2-of-13. They also took five sacks, as New Orleans' defensive front dominated in the trenches. The line also hurt the running game, negating a 26-yard rush in the opening quarter. Matt Ryan, who has definitely not been himself this year, didn't have much of a chance in this game because of the pressure. He finished with respectable numbers - 22-of-36, 288 yards, one touchdown, one interception - but most of that came in garbage time. Ryan didn't even hit the 100-yard barrier until the third quarter. Oh, and by the way, I'm sure you've all seen Ryan's interception by now, but if you somehow haven't, check it out. The ball actually landed on Marshon Lattimore's buttocks, and Lattimore was able to reach behind him and grab the ball. Five years ago, we had Butt Fumble. This week, we had Butt Interception. ",
            "6": "Speaking of Lattimore, he and Julio Jones had some wins in this game. Lattimore caught the pick, but Jones was still able to catch seven passes for 149 yards. He nearly caught a touchdown, but was inches shy of the goal line. The Falcons actually challenged to determined if he scored, but replay review correctly showed that he was shy. ",
            "7": "Devonta Freeman had a disappointing performance on fantasy-championship weekend. It looked like he would have a great performance in the early going when he broke free for a 26-yard burst, but the play was called back for a hold that really had nothing to do with the play. Freeman later had a lost fumble when he ran into Alex Mack, and then had a touchdown reception vultured by Tevin Coleman, who had just 12 yards on six carries. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "The Bills weren't guaranteed to make the playoffs by winning out, but they surely couldn't afford to lose this game. They fought the Patriots very hard, even appearing to take the lead just before halftime. However, some missed opportunities and a horrible call, coupled with New England's dominant second-half performance, turned a nail-biter into a blowout. The referenced horrible call occurred on what appeared to be a Kelvin Benjamin touchdown late in the second quarter. The catch was ruled a score, but replay review somehow overturned the call even though it was pretty evident that Benjamin was able to get both feet inbounds. Jim Nantz and Tony Romo both agreed it was a touchdown, but an atrocious replay system somehow came to the conclusion that it shouldn't have counted. This touchdown would've allowed the Bills to have the lead going into the third quarter. Instead, the game was tied at 13, and Buffalo scored just three points the rest of the way. ",
            "2": "The difference between the two quarterbacks was extremely apparent; Tom Brady dominated after halftime, while Tyrod Taylor struggled mightily. Brady finished 21-of-28 for 224 yards, two touchdowns and an interception, which was a pick-six where safety Jordan Poyer made a great read on the play to give Buffalo a 10-3 lead. It was Brady's fifth-consecutive game with an interception, which is the first time that has occurred in 15 years. And just when there might have been concern that Brady would finally begin regressing, he absolutely destroyed the Bills in the second half. How good was he? Well, he didn't throw a single incompletion! Following intermission, Brady was 9-of-9 for 105 yards and a touchdown. Not included in those numbers were a couple of drawn pass-interference flags, including one by Rob Gronkowski in the end zone. ",
            "3": "Speaking of Gronkowski, the Bills didn't exactly get revenge for his hit on Tre'Davious White. Gronkowski tortured them, and it was apparent that he would have a huge game when he made a ridiculous, one-handed back-shoulder catch for a 17-yard touchdown in the opening half. Gronkowski finished with five grabs for 67 yards and the score, and that doesn't include the aforementioned end-zone interference flag. ",
            "4": "Gronkowski was actually the only Patriot with more than 30 receiving yards. Danny Amendola (3-28) was next on the stat sheet. Brandin Cooks posted meager numbers as well - two catches, 19 yards - but like Gronkowski, he drew a significant pass-interference flag deep downfield. ",
            "5": "With Rex Burkhead out, Dion Lewis handled most of the workload. Proving that he's the best running back on New England's roster, Lewis gashed the Bills for 129 yards and a touchdown on 24 carries. Meanwhile, Mike Gillislee, seeing his first action in about two months, also found the end zone, gaining 28 yards on six attempts. ",
            "6": "Going back to the Bills, Taylor, as mentioned, had a rough second half. He started strong, going 12-of-22 for 153 yards in the opening half. He also should've thrown the aforementioned touchdown to Benjamin. However, he was 9-of-16 for 127 yards following the break. Not shown in the stats is that Taylor did some very stupid things in the pocket. For instance, on one red-zone play, he drifted back 10 yards and threw a pass that went two yards forward, so a first-and-10 turned into a second-and-18. On another occasion, he inexplicably took a 15-yard sack. On a third play, he drifted back 10 yards in the pocket on a fourth-and-2 and took a sack. Taylor finished 21-of-38 for 281 yards. He didn't perform poorly, but he struggled at times, and he certainly doesn't look like the long-term answer for the Bills. Here are the . ",
            "7": "Benjamin was robbed of a great fantasy performance, but he had to settle for a 5-70 line. His best play that counted was a 35-yard grab over a New England defender. Charles Clay (4-37) dropped a touchdown. ",
            "8": "LeSean McCoy didn't find the end zone, but still had a big game. He rushed for 71 yards on 17 carries and caught five balls for 76 receiving yards, which includes a 39-yard pass to move Buffalo into the red zone in the third quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "The Lions had to win their final two games to have a chance at reaching the playoffs, but they laid a giant, stinky egg in Cincinnati, losing to a team that hasn't been able to score more than seven points in each of the previous two games. Detroit simply couldn't get anything going offensively, achieving just 15 first downs in this contest, compared to 28 by the Bengals. It seemed like they would have a better chance to do something when Vontaze Burfict, who returned from concussion, left the game with a shoulder injury, but the Lions barely mustered more yardage in the second half than they did prior to intermission. Still, Detroit had a chance to win this game, and perhaps the team would have if it wasn't for one controversial play. On a third-and-28 late in regulation, Matthew Stafford heaved up a pass for Golden Tate, who made a leaping grab to potentially move the chains. However, the ball was dislodged at the last second, and the pass was ruled incomplete. That's how I saw it at first glance, but the FOX announcers were irate that Jim Caldwell didn't challenge the call. They were convinced that Tate caught the pass. I'm not sure if the play would've been overturned, but Caldwell still should've thrown the red flag to make sure. ",
            "2": "Stafford barely completed half of his passes, going 19-of-35 for 203 yards, one touchdown and an interception, which was a forced pass while under pressure. This was an extremely poor performance on his part, and oddly enough, he was actually worse after Burfict left the game! Stafford was just 9-of-19 for 101 yards in the second half. The struggles can be attributed to poor offensive line play. Detroit entered the game missing three starting blockers, center Travis Swanson, guard T.J. Lang and right tackle Ricky Wagner. Their absences made all the difference, as the Bengals hounded Stafford all afternoon. Stafford took just two sacks, but that figure could've easily been a half-dozen. ",
            "3": "The Lions didn't have very many long pass plays. One was Eric Ebron's 33-yard touchdown. He led the team with five grabs for 83 yards and a score. The Lions won't be making the playoffs, but the slight silver lining is that Ebron has finally lived up to his potential. Elsewhere in the receiving corps, Marvin Jones was the only other Detroit player with more than 30 receiving yards, catching three passes for 50 yards. Tate (3-14) posted poor numbers. ",
            "4": "Detroit has to find a running game to take pressure off Stafford. I have the team taking a running back in the second round of my . As for this game, Tion Green led the Lions with 43 yards and an easy touchdown on seven carries. Ameer Abdullah (6-21) was also mixed in. ",
            "5": "The Bengals, meanwhile, got off to a poor start offensively. A.J. Green dropped a deep pass when the ball hit him right on the face mask. Joe Mixon then hurt his ankle midway through the first quarter. Andy Dalton followed that up with some poor throws; one was a horrible interception off his back foot, while the other was a whiff on Tyler Kroft on a downfield throw. The Lions actually had Cincinnati outgained as far as yards per play is concerned in the opening half. However, the Bengals cleaned their act up following intermission, outscoring Detroit 20-10 following the break. Andy Dalton, as mentioned, began slowly, but ultimately finished 27-of-41 for 238 yards, one touchdown and the aforementioned interception. Some of his early throws were extremely dubious, but he misfired on just four occasions in the second half. ",
            "6": "Mixon was in the game long enough to get three carries for 12 yards. The Bengals, however, have an excellent backup in Giovani Bernard, who dominated the Lions. He rushed for 116 yards and a touchdown on 23 carries, and he also caught seven passes for 52 receiving yards. ",
            "7": "Green was able to rebound from his early mishap. He dropped the deep pass, but ended up with a team-leading 81 receiving yards on six catches. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Dolphins",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Chiefs continued to extend their winning streak following their mid-season swoon, and in beating the Dolphins, they won the AFC West for the second year in a row for the first time ever. It's hard to believe, but that's something Kansas City had never done before. Alex Smith had been on fire entering this contest, and he continued to perform on a high level. Smith went 25-of-39 for 304 yards and a touchdown, and his numbers would've been better if it weren't for two plays. On one, Albert Wilson dropped a deep touchdown in the opening half. The second, meanwhile, saw Tyreek Hill catch a touchdown. The officials reviewed the play and overturned it with no explanation. The CBS announcers were completely befuddled by this, and so was I. It would've been nice to hear official Brad Allen tell everyone why it wasn't a touchdown. The replay system is obviously broken and needs to be repaired. Either way, the Chiefs cruised to an easy victory. Smith didn't make many mistakes, though he missed a backup tight end for a potential touchdown. His best play was a scramble to move the chains on a third down. He escaped two potential sacks somehow and scampered down the field for a first down. ",
            "2": "Kareem Hunt continued his resurgence as well. He had triple-digit net yards, gaining 91 yards and a touchdown on 29 carries, and he also caught four passes for 15 receiving yards. He was stuffed on a fourth-and-1 in the red zone, but that was his only lowlight of the afternoon. ",
            "3": "Hill led the Chiefs with six catches for 109 yards. He should've scored the aforementioned touchdown, but still had a good performance. Smith's sole score went to Travis Kelce (4-47), who nearly caught another touchdown with a one-handed grab. ",
            "4": "On the other end of the spectrum, the Dolphins are leaking oil to close out the year. This is not a surprise, considering who their quarterback is. Jay Cutler completed just half of his passes, going 19-of-38 for 286 yards and a touchdown. The passing yards may look impressive, but don't be fooled. Most of that came on a 65-yard touchdown which was a short pass to Jakeem Grant. The Chiefs made some abysmal tackling attempts on Grant, who broke free and scored. The Dolphins didn't have much else going on offensively, and that was apparent at the start of the game when Jarvis Landry lost a fumble on the opening drive. ",
            "5": "Speaking of Landry, he caught five passes for 51 yards, which was a disappointing end to his fantasy season. DeVante Parker (5-63) posted better numbers, but played worse, as he and Cutler weren't on the same page on a couple of snaps. Parker has been dogging it in practice, so it's curious as to why he's still playing. Kenny Stills (4-54) also lost a fumble. ",
            "6": "With Damien Williams out, Kenyan Drake handled the entire workload. Unfortunately for Drake, the Dolphins trailed throughout, so he was limited to just 13 carries for 57 yards. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Bears",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The sharps lost once again with the Browns. You'd think these people would have learned their lesson by now, but apparently not. ",
            "2": "The big news from this game was the Cleveland Browns clinched the No. 1 overall pick in the 2018 NFL Draft with a road loss to the Bears. This season, the 0-15 Browns have been on a tour of playing quarterbacks who they had passed on. Carson Wentz and Deshaun Watson destroyed Cleveland earlier this year, and while Mitchell Trubisky didn't blow out the Browns, he added his name to the list of showing Cleveland what could have been with a promising young quarterback. The Browns are one loss away from 0-16, but the silver lining is they are on track to have two picks among the top five selections of the 2018 NFL Draft. The Bears hurt their draft slot with their fifth win of the season, but getting wins is helpful for the young team to build some positive momentum with Trubisky as its franchise quarterback. If only Chicago was in the AFC North instead of the NFC North, because the Bears have now swept all four AFC North teams with wins over Pittsburgh, Baltimore, Cincinnati and now Cleveland. ",
            "3": "For the majority of this game, the defenses played well and forced punts. Late in the first quarter, the Bears got moving with a play-action bootleg for 23 yards to Dion Sims. Trubisky took off on a run to move the chains, with a run from Tarik Cohen setting up a short touchdown run for Jordan Howard. The Browns blocked the extra point. Cleveland put a drive together late in the second quarter, but DeShone Kizer made a bad decision, throwing downfield to a well-covered receiver. The ball sailed on Kizer, allowing Kyle Fuller to intercept it in the end zone. The Browns were able to get the ball back, and Kizer hit Ricardo Louis on the run for a 35-yard gain. That set up Zane Gonzalez, who was good on a 49-yard field goal in the final seconds to cut Chicago's lead to 6-3 at halftime. On one of the first plays of the third quarter, Myles Garrett made a very athletic play to peel off his blocker and make an interception on a tipped pass. Garrett broke a tackle and rumbled into the end zone for a pick-six. However, Garrett's score was nullified because Carl Nassib had lined up offsides. It was a play that epitomized the Browns in 2017. A few plays later, Chicago took advantage with a 40-yard screen pass to Benny Cunningham. Promptly, Howard scored his second touchdown on a 16-yard run. The Bears got the ball back, and Trubisky used a screen to Cunningham for 22 yards, completions to Kendall Wright for 20, and Tarik Cohen for 13 yards. Trubisky capped the drive by running for a touchdown from four yards out to give the Bears a commanding 20-3 lead. In the final seconds of the third quarter, the Browns drove down the field. Kizer made a nice play to find Rashard Higgins with a completion of 17 yards, but in front of the end zone, Danny Trevathan stripped the ball away from Higgins, and Prince Amukamara recovered the fumble in the end zone for a touchback. In the fourth quarter, Kizer threw a desperation pass on fourth-and-11 while being tackled, and the ball was intercepted by Bryce Callahan. That play clinched the win for Chicago. ",
            "4": "Trubisky was 14-of-23 for 193 yards with a rushing touchdown. He played an efficient game with good decisions and protected the football. ",
            "5": "Howard ran for 44 yards on 22 carries with two touchdowns. Cunnningham led the Bears in receiving with two receptions for 62 yards. ",
            "6": "Kizer was 18-of-36 for 182 yards and two interceptions. Duke Johnson led the Browns in receiving with seven receptions for 81 yards. Josh Gordon had two catches for 19 yards and had a painful drop. ",
            "7": "Isaiah Crowell had 44 yards on 12 carries. ",
            "8": "The Bears' defense was excellent. They received terrific performances from Nick Kwiatkoski, Akiem Hicks, Sam Acho and Kyle Fuller. Cleveland's defense played well for a lot of the game. Myles Garrett, Larry Ogunjobi and James Burgess recorded sacks. <div class=dfpAdSlots> "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "11"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> I have the Broncos drafting Baker Mayfield in my . Then again, maybe Denver will go after the quarterback who beat them in this very game. ",
            "2": "Early on, it looked like this was going be a defensive struggle, as both stop units were playing at a high level. As the day went on, however, the Redskins' offense started to produce, and that allowed them to pull away from the Broncos. Despite the win, Kirk Cousins didn't have his best game. Though his stat line looks very solid, Cousins had a lot of trouble dealing with Denver's tough secondary in the early going. At one point in the first quarter, he had only gone 1-of-8 for six yards. He just wasn't able to find his receivers, and that kept him from getting into a rhythm early. Cousins was also guilty of some bad decisions in this contest. Notably, he had a terrible interception that saw him throw into double coverage in the end zone. Cousins was looking for Josh Doctson, but Cousins forced the pass and ended up essentially taking points off the board in what was then a 10-3 game. It's a mistake that a franchise quarterback should never make. As the contest went along though, things got a bit better for Cousins, but it wasn't entirely his doing. In the second half, the Redskins notched a couple of wide-open touchdowns thanks to busted coverage. These allowed Cousins to rack up 83 easy yards and two very easy scores. That inflated his overall stat line. Cousins finished 19-of-37 for 299 passing yards, three touchdowns and the aforementioned interception. Despite the solid looking stat line, he has to improve in the future if he wants to beat better competition. ",
            "3": "In terms of the receiving game, the Redskins got strong performances out of Ryan Grant (4-85) and Jamison Crowder (4-47, 1 TD). Grant was the first receiver who was able to find space against the Broncos' defense. He did well to work over the middle of the field and made some clutch receptions. Grant has done enough to earn a role in the offense, provided that the Redskins re-sign him in free agency. As for Crowder, he had a beautiful touchdown that saw him run a perfect route across the middle of the field to break an early 3-3 tie. Crowder can be an elite slot receiver, provided that he has enough help on the outside to avoid double coverage. Elsewhere, Josh Doctson (2-61, 1 TD) and Vernon Davis (2-42, 1 TD) had Cousins' other touchdown catches. For the most part, Doctson was a disappointment, as he dropped a touchdown catch on a perfect throw into a tight window by Cousins. Doctson has had a lot of drops and needs to work on his hands moving forward. ",
            "4": "Samaje Perine led the way with 53 yards on 17 carries. He got better as the game went along, and he did well against Denver's strong run defense. Kapri Bibbs also contributed 54 scrimmage yards, and he should have a chance to earn a roster spot with the team next season. ",
            "5": "Defensively, Ryan Kerrigan continued to have a great season. He notched two sacks while absolutely manhandling the Broncos' offensive tackles. Garett Bolles and Donald Stephenson never stood a chance against Kerrigan. ",
            "6": "This game also demonstrated how badly the Broncos need a franchise quarterback. Though they were beaten on both sides of the ball, they might have had a chance with better quarterback play and better protection. Brock Osweiler was efficient, at best, on Sunday. At worst, he put together a pedestrian performance. Osweiler went 22-of-38 for 193 yards and a pick. Some of his yardage came in garbage time, and it's just clear that he isn't a starting quarterback. Osweiler started the game well and was able to efficiently lead a field goal drive. But after that, the wheels fell off. He was constantly under pressure and couldn't do enough to escape the pocket. He doesn't throw well on the run, plus his footwork is poor. Numerous times, Osweiler was forced to throw on the move, sailing his throws wide of or high to his targets. He couldn't get the ball downfield either, and he had to throw checkdowns a lot. Osweiler can be a backup, but the Broncos need to find a new starter in the 2018 NFL Draft in the worst way. ",
            "7": "Because of Osweiler's struggles and the absence of Emmanuel Sanders, the Broncos saw very little production out of their receiving corps. Demaryius Thomas (4-52) led the way and had two big catches on the team's scoring drive in the first quarter. After that, the Redskins did well to neutralize him. Aside from Thomas, only two passes were caught by players at the receiver position, including an 8-yard strike to Isaiah McKenzie that saw the clock run out in the first half. The Broncos were in field-goal range at the time, so it cost them points. ",
            "8": "Because of the lack of production from the receivers, the Broncos had to rely on their running backs to do a lot. C.J. Anderson turned in a strong performance on the ground, totaling 16 carries and 88 yards and recording a garbage-time touchdown late in the fourth quarter. In addition to this, he caught a team-leading seven passes for 45 yards. Anderson has been great in the last month of the season, so there's a chance that he could hold onto the lead-back spot for next season. Devontae Booker also had a nice game. He spelled Anderson quite a bit and caught five passes as well. By the end of the day, Booker had 71 scrimmage yards, and it looks like he can be an effective change-of-pace back for the team. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "49ers",
            "Points": "44"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "33"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> Even though the Jaguars lost by 11, they caught so many lucky breaks in this game. From the dropped Blake Bortles interception, to the blocked field goal returned for two, to the deflected touchdown, to Jimmy Garoppolo's interception nearly bouncing on the ground, Jacksonville was very fortunate not to get completely embarrassed. ",
            "2": "If you watched this game and had no idea of these two teams records, you would think that the 49ers were the playoff team, as they outplayed Jacksonville thoroughly. The Jaguars came out flat, while the improving 49ers out-executed a Jacksonville team that routinely hurt their cause with undisciplined penalties and turnovers. Jimmy Garoppolo was excellent once again, extending his record to 6-0 as a starter in the NFL, and this game only further illustrates that the 49ers are headed in the right direction. It wasn't all bad for Jacksonville on Sunday. With the Titans' loss to the Rams earlier in the day, the Jaguars clinched the AFC South division title even though they lost in ugly fashion on the road. The Jaguars couldn't run the ball; Blake Bortles lived up to Jadeveon Clowney's description of him; and the defense struggled to keep Garoppolo from moving the ball. If Bortles and the Jaguars play like this in the playoffs, they are going to be quickly eliminated. ",
            "3": "On the opening drive of the game, San Francisco moved down the field for a touchdown, and that set the tone for the game. Garoppolo surgically picked apart Jacksonville, including a completion to Marquise Goodwin (3-37) as he beat Jalen Ramsey for a gain of 24 yards. A few plays later, Garoppolo dived into the end zone on a short sneak for the score. San Francisco quickly got the ball back and moved the chains before settling for a short field goal from Robbie Gould. The Jaguars' offense was struggling, and Bortles was living dangerously in the first quarter. He had an easy interception dropped and came close to some other picks as Bortles was inaccurate with overthrows. In the second quarter, Bortles had a tipped pass that was intercepted by Dontae Johnson and returned for a 50-yard touchdown. The Jaguars blocked the extra point, and Aaron Colvin returned the block for a two-point conversion to cut San Francisco's lead to 16-2. The Jaguars took the game over in the second quarter. Their offense got moving with a pass interference on Johnson that gave the Jaguars 23 yards. A 19-yard completion to Dede Westbrook (4-74) soon set up a short touchdown run for Leonard Fournette. Garoppolo quickly responded by hitting Kyle Juszczyk on a wheel route for 44 yards. The 49ers moved close to the end zone, but a tipped pass was picked off by Barry Church. The Jaguars then moved down the field in the 2-minute hurry-up offense. With 10 seconds remaining, Fournette dropped a pass in the end zone, although teammate Jaelen Strong (3-38-1) caught the deflection for a touchdown. That tied the game at 16 at the half. In the third quarter, the Jaguars got in position to take the lead with a 32-yard completion to Keelan Cole. That set up a 45-yard field goal for Josh Lambo. Yannick Ngakoue picked up his 12th sack of the season to get the ball back for Jacksonville. However, the 49ers came through with a big play, as K'Waun Williams made a phenomenal interception to set up San Francisco near the Jacksonville 25. A few plays later, Garoppolo threw a bullet into a small window to tight end George Kittle for a touchdown to go up 23-19. The 49ers' next drive was aided by big penalties on Myles Jack, Ngakoue, and Dante Fowler, but they should have lost a Matt Breida fumble. A quick whistle saved them on a questionable forward progress call by the officials. Garoppolo scrambled before a side-arm toss found Trent Taylor (3-19-1) for a short touchdown. Promptly, Bortles lobbed a horribly located pass to Akhello Witherspoon for an interception. That set up the 49ers in the Jacksonville red zone. Carlos Hyde (11-54-1) finished the drive with a short touchdown run to put up San Francisco 36-19. Midway through the fourth quarter, Elijah Lee scooped up and returned a T.J. Yeldon fumble for an 18-yard touchdown, but a horrible call by the officials ruled it incomplete and not a fumble. The Jaguars took advantage with a drive that ended with Yeldon getting a short touchdown run. Jacksonville got a two-point conversion and then recovered an onside kick. A few completions moved the ball within range, and Bortles found James O'Shaughnessy open in the middle of the field for an 11-yard score. However, Josh Lambo missed an extra point and the Jaguars didn't recover a second onside kick. While running the clock out, Matt Breida took off on a 30-yard touchdown run to clinch the victory for San Francisco. ",
            "4": "Garoppolo was 21-of-30 for 242 yards with two touchdowns and one interception, plus rushed for score. ",
            "5": "Breida led the 49ers with 74 yards on 11 carries and a score. Juszczyk was San Francisco's leading receiver with five receptions for 76 yards. ",
            "6": "Bortles was 32-of-50 for 382 yards with two touchdowns and three interceptions. ",
            "7": "Fournette totaled 48 yards on 18 carries with a touchdown. ",
            "8": "Cole led the Jaguars in receiving with 108 yards on six receptions. <div class=dfpAdSlots> "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "12"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> Did the Cowboys know they had Ezekiel Elliott returning from suspension? You'd think so, but their offensive coordinator may not have known, given his decision not to run the ball with Elliott at the goal line. ",
            "2": "When Dallas got the whole gang back for Christmas, there was much hope for an offensive resurgence, but Ezekiel Elliott wasn't enough to elevate the offense as Dak Prescott threw two interceptions. One pick turned into a 30-yard touchdown return by Justin Coleman that put the Seahawks on top for good in the third quarter. Prescott continued his struggles, but losing Tyron Smith once again, who came out after the first series, and some costly drops by his receivers were of no help. A couple of those drops were on Dez Bryant, as he continues to look like he's lost a step. He lost his ability to hold onto the ball, as he dropped the first pass of the game, lost a fumble that set up a Seattle touchdown, and had a ball deflect off his hands for an interception. It has been a fairly quick downward spiral for the 29-year-old receiver, but not overly surprising, as he's dealt with lower leg and foot injuries during much of his career. ",
            "3": "The Seahawks and Russell Wilson weren't much better offensively, as they had just two passing yards at the half after a mammoth 22-yard sack by Demarcus Lawrence, while Wilson finished with a season-low 93 yards passing, but did find Doug Baldwin and Jimmy Graham for two touchdowns. Both teams came into this game with high stakes, as both the Falcons and Lions lost, giving each team an opening to pursue their playoff dreams. Unfortunately, neither looked like a playoff team in this game. ",
            "4": "Elliott's return did seem to be a boon to the Dallas offense, as he had 75 yards rushing in the first half, but there were some odd play-calling snafus, especially when the Cowboys got a first-and-goal from the 3-yard line down nine points midway through the fourth quarter, yet didn't run the ball once. It's been apparent that Elliott is a key component in this offense and that Prescott had regressed of late, so not giving Elliott a try from there seems ill-advised. Seattle's defense also needs some credit for keeping the Cowboys out of the end zone all game. Down multiple defensive players, including Richard Sherman and Kam Chancellor, the Seahawks' defense ended up winning this game. One of the biggest plays was Byron Maxwell, who punched the ball out of Bryant's hands, setting up a touchdown before halftime. Coleman's pick-six was on Prescott, who sailed a pass over Elliott's head, but Coleman capitalized and found the end zone. Both plays were huge for a team that had trouble moving the ball and were game-changers. ",
            "5": "The Cowboys' brass - i.e. Jerry Jones - can't be feeling great with Prescott's season. After looking unstoppable early in the year, the loss of Smith and Elliott absolutely pushed Prescott into the tank. Last year, when Prescott won Rookie of the Year, he totaled just four interceptions, while this season he had four interceptions returned for touchdowns and 12 total. He's shown how well he can play with a full complement of good players around him, but he'll have to step up when things get rough like they did this season. ",
            "6": "The Cowboys are now eliminated from the playoffs, while Seattle still has hope. The Seahawks play at home against the Arizona Cardinals next week, which is a good matchup despite their recent offensive horror show. But even if they win, they'll need some help from the Carolina Panthers, who will need to beat the Atlanta Falcons for Seattle to get in with a win. Carolina still has a chance at winning the NFC South with a win and a New Orleans Saints loss to the Tampa Bay Buccaneers, so the Panthers should be playing all out, which is good for Seattle. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "0"
        },
        "comments": {
            "amount": "8",
            "1": "<i> EDITOR'S NOTE: </i> The Giants can't run the ball in short yardage. Everyone knows this, from any die-hard fan, to the casual observer, to my dog. So, why did they do it repeatedly in this game!? How many zero-yard gains does it take to stop running with terrible backs on third-and-1 and fourth-and-1? ",
            "2": "This was a pretty bad game. The two teams combined for five turnovers and 16 penalties, and there was a lot of sloppy plays by both sides. In the end, the Cardinals were able to do enough on offense to beat the Giants, but they still didn't perform all that well. Drew Stanton had a mixed outing in his first game back as the starter. After losing his starting job to Blaine Gabbert, Stanton came back for this contest after the poor performance of Gabbert against the Redskins. Stanton showed flashes of solid play, but ultimately undermined his success with some critical mistakes. In terms of positives, Stanton was very accurate in the first half. He did well to find open receivers and seemed generally able to read the field well. On both of his touchdowns, Stanton hung in the pocket and found open receivers. The throws hit his targets perfectly in stride, and that allowed the Cardinals to build a big lead. On the negative side, Stanton did make some poor decisions on some of his passes. His first interception was easily picked off by Ross Cockrell, who actually grabbed both picks for the Giants. The throw saw Stanton stare down Larry Fitzgerald and fire into double coverage, where Cockrell was able to make a play on the ball. It was a play that a starting quarterback wouldn't make. Stanton finished 20-of-34 for 209 yards, two scores and two interceptions. He is a good backup quarterback, but the Cardinals can no longer expect him to fill in and have a chance at making the postseason. ",
            "3": "Larry Fitzgerald was an absolute monster on Sunday. He was targeted a whopping 15 times and caught nine balls for 119 yards and the touchdown. Fitzgerald became the oldest player in NFL history to record 100 catches and 1,000 yards in a single season, and he demonstrated that he still has great route-running ability. Fitzgerald should come back for the 2018 season as the future Hall of Famer can still succeed as a No. 1 receiver. Elsewhere in the receiving corps, the Cardinals didn't get much. John Brown (2-28) caught Stanton's other touchdown, and Jaron Brown (2-27) had a 21-yard catch. The team should look to find a more consistent second option across from Fitzgerald. ",
            "4": "Kerwynn Williams had a tough time getting space early, but he finished strong for the Cardinals. He got 51 yards on 16 carries, and he had a nice 21-yard scamper early in the second half to jumpstart his offense. Elijhaa Penny also looked pretty good in limited action, going for 24 yards on eight carries. ",
            "5": "On the defensive side of the ball, Antoine Bethea and Deone Bucannon had good days. Bethea picked off Manning twice, while Bucannon was all over the field making tackles. Bucannon also had a key strip-sack of Manning that Robert Nkemdiche returned for a touchdown. Arizona's defense was in top notch form and deserves a lot of credit for its effort. ",
            "6": "For the Giants, the most disappointing part of this loss is that it has minimal impact on the draft slot. With the Browns losing again and clinching the No. 1 spot in the 2018 NFL Draft, it looks like the Giants will soon be locked into the No. 2 pick. But one would imagine that the Giants would have liked that top spot for a guaranteed shot at Josh Rosen. Speaking of quarterbacks, Eli Manning was dreadful on Sunday. One week after putting up one of his best performances of the season, Manning reminded many of why former head coach Ben McAdoo decided to bench him. It's clear that Manning is regressing, and this game was a friendly reminder of that. Manning had a lot of trouble finding open receivers on Sunday, and when he had them, he had trouble hitting them. He floated a lot of his passes, and it seems that his arm strength is deteriorating. In addition to his issues with downfield passing, Manning's mechanics were far from perfect. On one of his interceptions, he threw off his back foot amid mild pressure. He should have just lofted it out of bounds instead of trying to force the issue. At the end of the day, Manning ended up going 27-of-45 for 263 yards and two interceptions, plus lost a fumble. He wasn't able to move the offense consistently, and it seems like his days as a starter might be numbered. The Giants need to bring in some real competition for him in what should be a quarterback-heavy draft class. ",
            "7": "One of Manning's top receivers, Evan Engram, was knocked out of the game with a rib injury after catching a single pass for 12 yards. Because of this, Manning had to heavily target Roger Lewis (4-40) and Sterling Shepard (5-45). Neither looked particularly good, but the team will benefit next season from having Odell Beckham Jr. back. The other leading receivers for the Giants were tight end Rhett Ellison (4-60) and running back Wayne Gallman (6-44). Ellison has played a big role in offense over the course of the past couple of weeks, so perhaps he will earn the No. 2 tight end role for the 2018 season. ",
            "8": "New York's running game couldn't get going at all thanks to the horrific play of the offensive line. Gallman saw 10 carries and got a meager 18 yards. He was much better as a receiver and did flash a lot of upside. Paul Perkins and Orleans Darkwa each totaled 10 yards, though Perkins did it in half as many carries as Darkwa did - three and six, respectively. Unfortunately, until the Giants upgrade their awful line, their running offense will continue to be an issue. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "If this score looks lopsided to you, it's not even indicative of how one-sided this contest was. The Steelers dominated from start to finish, and if they really wanted to, they probably could've won 49-0. Pittsburgh made a few mental errors to keep itself from beating Houston by even more than 28 points. For instance, the team stalled in the red zone on the opening drive, and then Le'Veon Bell dropped a pass. The Steelers also surrendered a touchdown drive in the fourth quarter when the game was out of reach. Ben Roethlisberger and the rest of the starters were pulled midway through the final frame. ",
            "2": "Houston's anemic secondary was no match for Roethlisberger despite Antonio Brown's absence. Roethlisberger didn't have a prolific fantasy stat line, but it was still good enough for those who started him, as he went 20-of-29 for 226 yards and two touchdowns. As mentioned, he was victimized by a drop. Brown being out didn't impact Roethlisberger's performance in this contest. ",
            "3": "With Brown out, Roethlisberger targeted Martavis Bryant early and JuJu Smith-Schuster late. Bryant, who caught three passes for 60 yards, made an impressive play on a third-and-12 where he muscled through some tackles to pick up a first down. Smith-Schuster, meanwhile, hauled in six passes for 75 yards and a touchdown. All but one of his receptions came in the second half. ",
            "4": "Le'Veon Bell didn't get the late-game work with this contest being so out of hand. He was given just 14 carries in an effort to preserve him, and yet he still picked up 69 rushing yards and a touchdown. He also chipped in with five catches for 28 receiving yards. He could've had a second score, but Roosevelt Nix vultured a touchdown with a short-yardage run at the goal line. ",
            "5": "While the Steelers won this game, the primary highlight was DeAndre Hopkins' ridiculous catch in the fourth quarter. Hopkins leapt over Joe Haden, tipped the ball to himself with one hand and caught the ball with the other hand while falling out of bounds, all while somehow tapping both of his feet inbounds. NBC play-by-play announcer Mike Tirico called it the catch of the year, and rightfully so. Hopkins didn't catch a single pass in the opening half because T.J. Yates was too incompetent to get the ball to him. Haden's excellent coverage didn't help matters. However, Hopkins finished with four grabs for 65 yards and his amazing touchdown. He also drew a pass-interference flag in the end zone. ",
            "6": "Speaking of Yates, his numbers were atrocious. He failed to complete half of his passes, going 7-of-16 for 83 yards, one touchdown and an interception, a curious pass on a fourth down at the goal line on a drive in which Houston ran so well. The thing is, Yates' meager numbers actually happened to be the byproduct of garbage time! In the opening half, Yates was a pathetic 2-of-8 for only EIGHT yards and a pick. Yes, he had just seven more yards than interceptions. Yates, at one point, left the game with a concussion, but missed only one full drive. Yates was awful, but didn't have a chance behind his poor offensive line. Here are the . ",
            "7": "The Texans, as mentioned, ran well against the Steelers, who have been reeling against ground attacks ever since losing Ryan Shazier. Alfred Blue was impressive, picking up 108 yards on 16 carries, 71 of which came in the opening half, so it's not like he accumulated his stats in garbage time. Lamar Miller (10-55) also looked good. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Eagles may have won this game to clinch the No. 1 seed in the NFC, but what transpired Monday night has to make everyone in Philadelphia realize that there is very little hope for a deep trip into the playoffs. In fact, it seems like it'll take a miracle for the Eagles to win a single game in the postseason. Carson Wentz has missed two games thus far, and the Eagles have barely beaten a horrible team on the road and a bad team with nothing to play for at home. Foles was atrocious, and unless he improves exponentially come January, the Eagles will be one-and-done. Foles completed just half of his passes, going 19-of-38 for only 163 yards, one touchdown and an interception. The numbers, which were horrible, don't even tell the whole story. Foles settled for mostly checkdowns, and when he varied from that plan, he was often penalized. He nearly had a pick-six in the opening half when Reggie Nelson read his eyes perfectly. On one red-zone sequence right before halftime, he missed Zach Ertz in the end zone and then threw away a pass when he could've ran for a first down. Things only got worse in the second half, as Foles was just 7-of-17 for only 44(!!) yards and an interception following the break. The pick was a poor throw to Ertz in the flat, and the ball tipped off the tight end's hands and into the arms of a Raider. Foles also had a horrible sequence in the red zone again; he overshot Ertz inside the 5-yard line, and then he threw behind Alshon Jeffery on the next play. The Eagles left a ton of points off the board, and most of that was Foles' fault. Had Wentz started, the Eagles easily would've scored into the 30s or perhaps the 40s against one of the worst defenses in the NFL. Foles only got to 13, with the final six being on a play I'll describe at the end of this write-up. ",
            "2": "Despite the poor quarterbacking, Ertz caught nine passes for 81 yards. He saw 14 targets - twice as much as any other Eagle. Foles is a checkdown machine, so it makes sense that he would throw to Ertz way more than anyone else. Elsewhere in the receiving corps, Nelson Agholor was the only other Eagle with more than 21 yards through the air. He caught four passes for 35 yards, but was guilty of a deep drop. Jeffery, meanwhile, didn't catch a single pass. ",
            "3": "Jay Ajayi handled most of the workload. He had some tough runs, gaining 52 yards on 14 carries. He lost a fumble at the end of a long run, but it seemed to me that the officials should've ruled that forward progress was stopped. ",
            "4": "The Raiders, meanwhile, could've laid an egg in this game after being eliminated from the playoffs the day before, but they fought hard, to their credit. It just wasn't enough, as the Raiders' banged-up offensive line couldn't hold up for Derek Carr, who struggled. Carr's completion percentage was only marginally better than Foles', as he went 15-of-29 for only 140 yards, one touchdown and two interceptions. Nearly half of his yards came on a 63-yard bomb to Amari Cooper in which Cooper beat cornerback Jalen Mills with a double move. Carr did little else, settling for checkdowns like Foles. Like Foles, Carr made numerous errant throws. He missed a wide-open Seth Roberts in the opening quarter. His first interception was thrown into heavy traffic. His second occurred because he had some fierce, blind-side pressure from Vinny Curry. He also had a pick that was dropped in between by Mills. ",
            "5": "Marshawn Lynch ran hard, nearly becoming the first running back to gain 100 yards against the Eagles all year. He finished with 95 yards on 25 attempts, but lost a fumble deep in Philadelphia territory. He's not expected to be around next season, however, so I have the Raiders picking a runner in the second round of my . ",
            "6": "Only one Raider accumulated more than 23 receiving yards. That, naturally, was Cooper, who finished with three grabs for 66 yards and a score. He had another long gain negated by a hold. Michael Crabtree didn't catch a single pass. ",
            "7": "I'd be remiss if I didn't mention what occurred on the final play of the game. The Raiders, down three, tried to run a Stanford Band-type play to score a desperate touchdown. But as with the Redskins-Chiefs game back in Week 4, it backfired, and the defense scored. The margin went from three to nine, which was significant because the opening line on this game was +9, and the spread in the Supercontest was +8.5. However, the closing line was +10, and this was important as well because Doug Pederson didn't attempt the extra point. Pederson shall forever be known as a friend to degenerate underdog bettors everywhere! <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "16"
}