{
    "year": "2017",
    "week": "05",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "7",
            "1": "It's a shame that kickers matter so much in the NFL. I suppose this game is called football, after all, but it's amazing how much of a difference kickers can make to determine the course of a game, or even a season. And the Buccaneers know that better than anyone. Tampa Bay has had major issues at kicker for years now. Robert Aguayo was cut, and the team appeared to have made an upgrade with Nick Folk, who converted a high percentage of his kicks with the Jets. Folk, however, struggled versus the Giants last week before drilling the game-winner, and his struggles continued Thursday night. He whiffed on all three of his field goal attempts. The first one wasn't on him, as it was from the mid-50s, but he then misfired from 49 and then 31. The latter kick was inexcusable. Had he converted the easy attempt, the Buccaneers may have won this game. It was a shame that the Buccaneers lost as a result of their kicker because their defense had a great game despite missing two starting linebackers and the top safety. Their pass rush was terrific, swarming Tom Brady and forcing him into his first interception of the year. Brady then lost a fumble in Tampa territory. The Buccaneers limited New England to just 19 points - three of which were the result of a failed onside kick to set up a Stephen Gostkowski field goal - but their kicker let them down. ",
            "2": "Meanwhile, New England's defense showed much improvement, as the team didn't blow nearly as many coverages as it did versus Carolina. That said, Jameis Winston deserves the most blame for this loss after Folk. Winston missed numerous receivers for potential big gains. He was just off on some of his throws. On one instance, he overthrew an open DeSean Jackson for a touchdown. On another, he had a potential interception thrown into double coverage that was dropped. Winston was excellent in the fourth quarter, nearly leading his team back from a 16-7 deficit, but time just ran out. Winston finished 26-of-46 for 334 yards and a touchdown. He didn't have a poor performance, but it was an underwhelming one. Winston's ball placement was erratic, and this is something that needs to improve if he wants to take the next step. ",
            "3": "Doug Martin provided the Buccaneers with a huge spark. Playing his first game of the season, Martin muscled his way for 74 yards on just 13 carries. He also scored a touchdown. He was a breath of life for a dead rushing attack. He should receive a larger workload going forward. ",
            "4": "Mike Evans didn't have a great stat line, catching five balls for only 49 yards. Jackson led the Buccaneers in receiving (5-106), while Cameron Brate (5-68) caught Winston's sole touchdown. Brate should've had a second score, but he dropped the ball in the end zone. ",
            "5": "As for the Patriots, it was odd to see Brady turn the ball over twice, especially against a defense missing two starters. Brady went 30-of-40 for 303 yards, one touchdown and an interception, which was an overthrow. Brady's pass protection was horrible, as Tony Romo frequently pointed out that Nate Solder is dealing with an injury. Robert Ayers dominated the line of scrimmage. ",
            "6": "Brady's sole score went to Chris Hogan, who caught eight of his 11 targets for 74 yards and a touchdown. Brandin Cooks (5-85), led the team in receiving, though he dropped a pass on third down. He, Hogan, Danny Amendola (8-77) and James White (7-57) were the only Patriots who registered more than 10 receiving yards. Dwayne Allen, meanwhile, didn't see a single target despite Rob Gronkowski's absence. ",
            "7": "Dion Lewis outgained Mike Gillislee, 53-53, though Gillislee had five more carries. Most of Lewis' output came on a 31-yard burst. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "The Eagles were in a tough scheduling spot, traveling back from the West Coast and having to play Thursday night after this game. However, there was just way too much of a talent disparity for Philadelphia to lose to Arizona. The Eagles led from start to finish in a blowout victory to improve to 4-1. Philadelphia was able to establish a quick 21-0 lead with the help of some big plays. Carson Wentz converted a pair of third-and-11s on passes to Zach Ertz and Alshon Jeffery, setting up a touchdown. Following a poor Arizona drive, Kenjon Barner took a punt deep into Cardinals' territory to set up another score. On Philadelphia's next possession, Torrey Smith finally didn't drop a deep pass, hauling in a 59-yard touchdown. The Eagles sputtered a bit after that through the end of the opening half, but they put the clamps on Arizona following intermission, outscoring them 13-0 in the second half. ",
            "2": "Wentz was excellent, going 21-of-30 for 304 yards, four touchdowns and an interception at the end of the first half, which was a deep shot into the end zone. Wentz did a good job of moving around in the pocket and buying time to set up deep throws. Unlike some game-managers in the NFL, Wentz doesn't settle for short passes on third-and-long opportunities. He pushes the issue, and is often successful in doing so. ",
            "3": "Wentz's four scores went to Nelson Agholor (4-93), Smith (3-70), Zach Ertz (6-61) and Trey Burton (2-16). Jeffery didn't join in the party, but a 16-yard reception of his helped set up a touchdown. He caught three balls for 31 yards, as Patrick Peterson dominated the matchup. ",
            "4": "LeGarrette Blount had some nice runs against Arizona, gaining 74 yards on 14 carries. His fantasy owners were pleased to see him score near the end of regulation, but a holding penalty nullified the touchdown. Corey Clement (7-17) and Barner (5-23) were also involved. ",
            "5": "The one dark cloud over this victory for the Eagles was that right tackle Lane Johnson suffered a concussion. This is huge because Philadelphia has to play Thursday night, so it's unlikely that he'll be ready to battle the Panthers and their terrific front seven. ",
            "6": "As for the Cardinals, it was another rough outing for the offensive line. Carson Palmer was sacked just twice, but the Eagles brought tons of pressure, forcing lots of bad throws and checkdowns. Palmer never really had a chance, as his stat line was a byproduct of garbage time; he went 28-of-44 for 291 yards and a touchdown, but had just 123 yards at the break on 11-of-19 passing. ",
            "7": "Larry Fitzgerald didn't find the end zone, but in hauling in six receptions for 51 yards, he had his 200th-consecutive game with at least one catch. That's the third-longest streak of all time, trailing only Jerry Rice and Tony Gonzalez. Fitzgerald was behind only J.J. Nelson (4-80) and Andre Ellington (9-65) on the stat sheet. John Brown (2-26) snatched Palmer's sole touchdown, but he also dropped a pass. ",
            "8": "The Cardinals' running game struggled once again, which was hardly a surprise. Chris Johnson mustered only 21 yards on nine carries, most of which came on one 9-yard burst. No other running back had positive yardage. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "The Dolphins embarrassed themselves against the Jets and Saints, but they were home for the first time all year to battle a Tennessee team missing its starting quarterback. And yet, the Dolphins barely scraped by, so I suppose it could be argued that they embarrassed themselves again. The Dolphins won by six, yet seven of those points came off a weird Matt Cassel fumble, where everyone but the guy who picked up the ball thought it was an incomplete pass. It certainly looked like a throw at first glance, but replay review correctly ruled that it was a lost fumble. Aside from a field goal, those were the only points the Dolphins scored in the first three quarters. The fact that they needed that to beat Cassel just shows how bad they are. The problem? Jay Cutler and the offensive line. The blocking is terrible for the Dolphins, as Laremy Tunsil is not comfortable at left tackle, while Mike Pouncey desperately needs hip surgery. Still, it doesn't help that Cutler has, as one analyst put it this week, morphed into Blaine Gabbert. The numbers say it all, as Cutler was 12-of-26 for only 92 yards, one touchdown and an interception. Cutler spent the majority of the opening half tossing third-down passes short of the line to gain. On one instance, he actually had time in the pocket - a rare instance - and yet he hurled a 6-yard pass on third-and-8. On another failed conversion, the CBS announcers pointed out that the Dolphins have their worst third-down conversion rate since 1991. The crowed had enough when Cutler threw his pick, which was a forced ball into tight coverage. The ball popped into the air as a result, and the Titans snatched it. He was booed heavily as he went off the field. Cutler, however, was able to put together a nice drive in the fourth quarter to take the lead, so perhaps that's a glimmer of hope. That, or it's delaying the inevitable, which is Cutler being benched for Matt Moore. If Cutler continues to be woeful like this, Adam Gase may have to make the move. ",
            "2": "To be fair to Cutler, he lost his favorite receiver, DeVante Parker, early in the game. Parker (one catch, six yards) hurt his ankle, and he was replaced by Jakeem Grant, who dropped a touchdown (though Adoree Jackson did a good job of breaking it up). Jarvis Landry (5-44, TD) was the only Dolphin, besides Jay Ajayi, to catch multiple passes, believe it or not. ",
            "3": "Without much running room, Ajayi struggled to get anything on the ground. He mustered only 77 yards on 25 carries to go with his two catches for two yards. He also lost a fumble deep in his own territory. Ajayi was able to explode last year when Miami's offensive line got healthy, but it doesn't appear that the blocking is going to improve anytime soon. ",
            "4": "The Titans, meanwhile, didn't have much of a chance with Cassel. Good teams often step up and play very hard with their backup quarterback, but Cassel is so terrible that the Titans couldn't prevail with him against a dreadful Miami squad. It's ridiculous that the Titans went into this season with Cassel as their reserve behind Marcus Mariota. Cassel completed 21-of-32 passes, but had just 141 yards and a touchdown. He also had the aforementioned fumble that was returned for a touchdown. Cassel was able to hit one big play, an apparent 59-yard score to Delanie Walker, but the reception was nullified because the officials said Walker pushed off the defender. Walker, as a result, had a dismal fantasy day, catching only three balls for 25 yards. He was near the top of the receiving chart, trailing only Eric Decker (4-34) and Rishard Matthews (3-34). ",
            "5": "Neither Tennessee running back did much either, as Miami stacked the line of scrimmage because it didn't respect Cassel's arm, and rightfully so. DeMarco Murray managed 58 yards on 14 carries, and he also lost a fumble near midfield. Derrick Henry (4-9) didn't have an opportunity to do much for some reason. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "26"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "23"
        },
        "comments": {
            "amount": "7",
            "1": "The Colts appeared as though they were going to win this game easily. They were up 23-9 in the fourth quarter before the 49ers made an inexplicable late charge. San Francisco had just middling success moving the chains all afternoon, yet the offense suddenly transformed into a unit that looked like the Joe Montana-led group from the 1980s. Brian Hoyer made ridiculous throws, helping his team get to overtime. However, the defense let him down, as the Colts were able to hit some big plays to set up the game-winning field goal on a day in which Peyton Manning's number was retired. Indianapolis is now 2-3. With a game coming up against the Titans in which Matt Cassel could start, the team could improve to 3-3. That's huge, as Andrew Luck could be back in a few weeks. If the Colts can tread water, they could give themselves a chance to reach the playoffs upon Luck's return. ",
            "2": "As for the current Colt quarterback, Jacoby Brissett finished 22-of-34 for 314 yards and an interception. The pick was brutal, as it occurred in overtime. Brissett launched a bomb to T.Y. Hilton to set up the team at the 8-yard line. On the next play, however, Brissett underthrew an open receiver in the end zone, giving the 49ers a chance. San Francisco appeared as though it might score when Walt Coleman flagged Indianapolis for an absolutely horrendous pass interference on third down, but the Colts were able to force a punt after that. Following a big Marlon Mack play, Adam Vinatieri hit the 11th overtime field goal of his career to win the game. It was his 539th career field goal, moving him into second place, all time. ",
            "3": "Speaking of Mack, he really put on a show, displaying his tremendous talent. Mack gained 91 yards and a touchdown on just nine carries. He nearly had a second score, but replay review ruled him down a yard shy of the goal line. The FOX announcers remarked that the Colts may have found their running back of the future, and I would agree with that opinion. Mack could end up getting a larger workload as the year progresses, especially when considering that Frank Gore (14-48) is clearly not the same player. Mack provides Indianapolis with some game-breaking ability out of the backfield. ",
            "4": "Hilton, meanwhile, had a huge performance. He caught seven balls for 177 yards. He had two long catches; one in overtime prior to the pick, and the other when the game was 16-9 to set up a touchdown. His only blemish was a drop. Gore (3-38) was next on the stat sheet. Donte Moncrief (3-32) struggled once again, and he'll continue to be worthless until Luck returns. ",
            "5": "As for the 49ers, Hoyer posted a terrific stat line, going 29-of-46 for 353 yards and two touchdowns. Much of this came in garbage time in the fourth quarter, but Hoyer was able to lead San Francisco back from down 23-9. Hoyer was nearly picked in the early going, as safety Matthias Farley almost came up with an acrobatic interception. ",
            "6": "I wrote earlier that San Francisco's late charge was inexplicable. A major reason I called it this was because Carlos Hyde barely played in the second half. Hyde's hip issue flared up, which would explain why he carried the ball just eight times for 11 yards. Matt Breida (10-49) had the better afternoon. ",
            "7": "It was a big revenge game for Pierre Garcon, who caught eight of his 11 targets for 94 yards. He was out-produced by Marquise Goodwin (5-116) and rookie tight end George Kittle (7-83, TD). Kittle has promise, so it was nice to see him step up like this. Kittle proved that he can be streamed versus poor defenses against tight ends, and that's the sort of matchup he has next week against the Redskins. Goodwin, on the other hand, had a fluky performance versus a poor group of cornerbacks. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Jets",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "14"
        },
        "comments": {
            "amount": "6",
            "1": "I'd say that the manner in which the Browns lost this game was bizarre, but losing and the Browns have been synonymous for so long that the way in which this defeat occurred seems almost natural. Cleveland should have prevailed in this contest, and the team probably could have done so by double digits, but yet it made numerous mistakes in the red zone. The Browns looked like they were going to take their first lead of the year when DeShone Kizer made a nice scramble on third down to get inside the 5-yard line. However, the Browns ran a stupid play, as Kizer lateraled to Isaiah Crowell, who dropped the ball. It was a fumble, and the Jets recovered. Kizer once again moved the chains deep into Jets territory, and he had an opportunity to hit a wide-open David Njoku in the end zone, but he didn't see him. Instead, Kizer forced a bad pass, allowing Marcus Maye to come away with an interception. Meanwhile, all of this was sandwiched in between two missed field goals by Zane Gonzalez, one of which was from 39 yards. The Browns eventually managed to establish his first lead. Kizer was benched in favor of Kevin Hogan, who was able to find Njoku in the end zone. Hogan then had the Browns deep in Jets territory once again, but Hue Jackson foolishly passed on the opportunity to tie the game at 10. Jackson not only wasted a timeout, but called a predictable play, ramming Crowell into the middle of the line of scrimmage. Crowell was stuffed, and the demoralized Browns surrendered a 97-yard drive to the Jets, showing very little effort because they knew the game was over. ",
            "2": "There are two pieces of big news concerning the Browns. The first is that Kizer was benched. He was terrible, going 8-of-17 for 87 yards and the aforementioned pick. The move to bench Kizer was the first correct thing Jackson has done all season, though he should've done this much earlier. Kizer has talent for sure, but he's just not seeing things correctly. He's making terrible reads, holding the ball too long, and misfiring on passes NFL quarterbacks should make. Hogan, meanwhile, was much better. He failed to complete just three passes, going 16-of-19 for 194 yards, two touchdowns and an interception. I wouldn't even put the pick on him, as it occurred when he was crunched by Demario Davis. The second piece of news is that Myles Garrett made his NFL debut. He was tremendous right away, logging two sacks. The Browns had immense issues getting to the quarterback in the first four weeks of the season, but that was not the case in this contest. Garrett's pressure forced Josh McCown to check down a lot, and that would explain why he was 23-of-30 for only 194 yards. He managed to throw for two touchdowns and a pick, but he didn't have the big performance that other quarterbacks have enjoyed versus Cleveland. Still, McCown was able to get his revenge on his former team. ",
            "3": "McCown's touchdowns went to Jermaine Kearse (4-38) and Austin Seferian-Jenkins (6-29). Seferian-Jenkins saw a whopping eight targets, three more than any other Jet player. ",
            "4": "Bilal Powell left the game early with a calf injury, which would explain why he had just five yards on two carries. Eli McGuire handled the workload in Powell's absence, but struggled, mustering only 20 yards on 11 attempts. ",
            "5": "Going back to the Browns, Njoku had a nice performance. I mentioned earlier that Kizer didn't see him wide open for a touchdown. Njoku compensated for it later when he made a one-handed catch in the end zone to give Cleveland its first lead of the season. Njoku made a great diving catch to put the Browns in Jets territory later in the second half. He caught three balls for 48 yards and the score. Duke Johnson (3-63) had a late touchdown, while Ricardo Louis (5-71) led the Browns in receiving. ",
            "6": "Crowell rushed for 60 yards on 16 carries, but this was another disappointing performance for him. He was stuffed on fourth down and was responsible for a fumble. "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "24"
        },
        "comments": {
            "amount": "4",
            "1": "I think we can confirm that Cam Newton is absolutely healthy now. That was not the case several weeks ago when the Saints obliterated the Panthers, but he certainly looks like he's in MVP form once again. With Newton playing at a high level, the Lions simply couldn't keep up with Carolina, resulting in a blowout. And yes, despite the 27-24 final score, this was a blowout. The Panthers led 27-10 in the fourth quarter. By the end of the third frame, the Lions had produced just 129 yards of offense, compared to Carolina's 336. Matthew Stafford, at that stage of the game, was just 12-of-20 for 99 yards. Stafford, as he is wont to do, made things interesting in the fourth quarter, and the Lions had a chance to force a punt and take back possession with a couple of minutes remaining. However, Newton came up with a clutch third-down conversion to Kelvin Benjamin to seal the victory. ,br&gt; Newton had an unbelievable performance, misfiring on just nine occasions. He finished 26-of-35 for 355 yards and three touchdowns. He could've posted even greater numbers had this not been so lopsided until the very end; Newton amassed 237 yards and two scores in the opening half alone! He also failed to generate a single rushing yard, but he had a nice scramble that was negated by a hold. ",
            "2": "Ed Dickson, playing for the injured Greg Olsen, nearly had half of Newton's yardage. He caught all five of his targets for 175 yards, thanks to a pair of deep completions. Remarkably, he didn't find the end zone, but Benjamin (4-58), Devin Funchess (7-53) and Christian McCaffrey (5-31) all managed to do so. Funchess, who just had his second-consecutive big-time output, finally seems like he's emerging as a viable NFL receiver. Funchess actually led the Panthers in targets with eight. McCaffrey, meanwhile, didn't do much on the ground, as almost all of his production came aerially. He mustered only seven yards on three carries. Jonathan Stewart (18-21) couldn't find any room on the ground either. ",
            "3": "Moving to the Lions, Stafford ended up with a solid stat line because of his usual fourth-quarter heroics. He finished 23-of-35 for 229 yards and a touchdown, meaning more than half of his final output came in the final frame alone. That said, he should've had better numbers earlier; he and Marvin Jones drew a deep pass interference, and Eric Ebron dropped a touchdown after that. This wasn't unexpected, however, as Ebron (1-6) has dropped everything in sight this year. How he's still on the roster is a complete mystery. As for Detroit pass-catchers who are actually good, Jones (6-54) led the team in receiving, while Golden Tate (5-48) wasn't too far behind. Stafford had to endure tons of pressure from Carolina's monstrous front seven, so he tossed several passes to Theo Riddick (4-45). ",
            "4": "Carolina's run defense was also terrific. Ameer Abdullah couldn't find anything outside of a 16-yard burst, as he managed only 31 yards on 10 carries. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "22"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: What a rough season for the Giants. I thought they'd regress, but not like this. And now it seems over with Odell Beckham Jr. gone. Now, the question remains: Do they pick Sam Darnold, Josh Rosen or Saquon Barkley? ",
            "2": "Last year, the Giants lost five games all season long. Through the first five weeks of the 2017 season though, they have five losses and suffered what could be a serious leg injury to star wideout Odell Beckham Jr. He was carted off the field in the fourth quarter and was very emotional. At this point, the Giants have to thinking of their status relative to the 2018 NFL Draft and potentially finding a franchise quarterback to replace the aging and declining Eli Manning. At 1-4, the Chargers can't be realistic that they can get back into the playoff race in perhaps the toughest division in the NFL, but the first win under head coach Anthony Lynn should help his status along with general manager Tom Telesco. ",
            "3": "The Giants scored first as the Chargers' offense was backed up in their own end zone. The center snapped the ball before Rivers was ready, and Rivers wisely pushed the loose ball out of the back of the end zone to give up a safety rather than a touchdown. After the safety, Manning blew a dream matchup that had Beckham burning a linebacker deep down the field wide open into the end zone, but Manning missed the throw. While Manning was misfiring, his team was having success running at the Chargers as Orleans Darkwa (8-69-1) was bursting through some huge holes, including a 23-yard touchdown run that put up New York 9-0 at the end of the first quarter. The Chargers got moving with a 22-yard pass to Tyrell Williams (1-22), aided by a 15-yard penalty on B.J. Goodson. After a few other short gains, Rivers threw a short touchdown pass to Melvin Gordon. New kicker Nick Novak cut the lead to 9-7. Late in the first half, Chargers receiver Travis Benjamin (2-18) got wide open in the end zone in busted coverage, but he had the pass bounce off his fingertips. Rivers moved inside the five, but the drive stalled as Los Angeles settled for a field goal and a 10-9 halftime lead. In the third quarter, Rivers drove into Giants territory, but then he didn't see Darian Thompson, and the New York safety cut in front of Keenan Allen in the end zone for an interception. The Giants took advantage with Manning lofting in a touchdown pass to Roger Lewis, who beat Casey Hayward for the 29-yard score. Rivers responded by leading the Chargers down the field, spreading the ball around on a 92-yard, 12-play drive. Once again, the Giants were burned by a tight end as Rivers made a tremendous throw off his back foot to lead Hunter Henry (3-42-1) past two safeties for a 25-yard touchdown pass. That gave the Chargers a 17-16 lead entering the fourth quarter. The lead didn't last long as Beckham got wide open after torching Hayward for a 48-yard touchdown. A two-point attempt failed, so New York had a 22-17 lead. Rivers led another drive deep into Giants territory, but Thompson came up big with a diving pass breakup to save a touchdown. Los Angeles cut the lead to 22-20 with just under five minutes remaining. Disaster than struck for New York as Beckham went down with an injury to his left leg and had to be carted off the field. That sucked the air out of the building, and on the next play, Melvin Ingram strip-sacked Manning. Ingram recovered the loose ball to set up Los Angeles at the Giants' 11-yard line. A few plays later, Rivers hit Gordon in the flat, and Gordon darted into the end zone to give the Chargers a 27-22 lead. Manning had one more chance, but after getting to midfield, a tipped pass was picked off by Tre Boston to clinch the victory for Los Angeles. ",
            "4": "Manning completed 21-of-36 for 225 yards with two touchdowns and one interception. Manning was under constant duress as the Giants' offensive line was terrible in pass protection. Ingram and Joey Bosa each had two sacks and a forced fumble. ",
            "5": "Beckham took five receptions for 97 yards and a score, but he broke his ankle. The Giants' receiving corps was absolutely decimated by injury in this game with Sterling Shepard (ankle), Brandon Marshall (ankle) and Dwayne Harris (foot) all going out prior to Beckham getting injured. ",
            "6": "Wayne Gallman ran for 57 yards on 11 carries. He had more carries than Darkwa, but Darkwa outgained him. ",
            "7": "Rivers completed 21-of-44 passes for 258 yards with three touchdowns and one interception. Allen led the Chargers in receiving with four reception for 67 yards. ",
            "8": "Gordon ran for 105 yards on 20 carries with six receptions for 58 yards and two touchdowns. Gordon was excellent, and he dominated New York's vulnerable linebackers. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "16"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: It felt like this game could've gone either way. Still though, it's amazing that the Bills couldn't do anything without Charles Clay. I never thought I'd write something like that. ",
            "2": "Much was made of the fact that the Bills were a 3-1 team coming into this contest. While they were the leaders of the AFC East, it was widely expected that they would regress at some point. On Sunday, that happened on the offensive side of the ball. For most of the matchup against the Bengals, Buffalo's offense was unable to get anything going. Tyrod Taylor is to be blamed for this. The third-year starter did not look good at all in Cincinnati, and it's clear that the Bills will need an upgrade over him if they want to be a legitimate contender. Taylor spent most of the day throwing from the pocket, and he just didn't look comfortable in there. Taylor held the ball for far too long, and as a result, he was sacked six times. The worst part was that Taylor continued to hold onto the ball despite being sacked. He didn't make the necessary adjustment to get the ball out quicker and give the Bills' offense a chance to win. When Taylor was able to get the ball out, his passes were erratic. This game was played in torrential rain at times, so perhaps that bothered him. But Taylor was inconsistent with his accuracy. He consistently overshot receivers downfield and underthrew his checkdowns. It wasn't all bad for Taylor, who had a beautiful touchdown pass to Brandon Tate that saw him throw a touch pass perfectly over the Bengals' linebacker and into Tate's arms. Overall, Taylor finished 20-of-37 with 166 yards, one touchdowns and one interception. It was a poor stat line and definitely was indicative of his performance. He needs to improve if the Bills want to challenge for a playoff spot. ",
            "3": "Because of Taylor's struggles, the Bills were limited to mostly checkdowns and middle-of-the-field options. Taylor heavily targeted his tight ends, and Nick O'Leary (5-54) led the team in receiving yardage. O'Leary did well replacing Charles Clay (2-31), who left with an injury. Still, O'Leary is best suited as a backup and has no value in fantasy. Elsewhere, LeSean McCoy (6-26) led the Bills in catches and targets with six and nine respectively. Buffalo's wide receivers were basically non-factors, as Tate led them with two catches for 25 yards and the aforementioned touchdown. Rookie Zay Jones (1-9) didn't make an impact either. None of the Bills' receivers are worth owning in a standard league. ",
            "4": "In the running game, McCoy predictably led the way, receiving 19 carries for 63 yards. Early on, McCoy showed his excellent lateral agility, which has been a strength of his for most of his career. However, McCoy's blocking wasn't particularly good with Cordy Glenn out, and that could continue to be a problem for the Bills if Glenn doesn't come back. On another note, McCoy did almost lose a fumble as a result of carrying the ball too far from his body. That is another tendency of his, so it's quite possible he will lose another fumble in the future. ",
            "5": "For the winning side, the Bengals looked much better than they did at the start of the season. The changes that they have made on the offensive side of the ball have been apparent since they promoted Bill Lazor to offensive coordinator. Notably, Andy Dalton has thrived in his system. This week, Dalton had a very strong performance. He ended up going 22-of-36 for 328 yards, one touchdown and two interceptions. However, he was even better than the numbers indicated. Dalton was sharp and accurate for a majority of the contest. He established this early on when he targeted A.J. Green. Dalton demonstrated nice touch on his passes and also was extremely accurate. While his ball placement wasn't always perfect and he tended to throw a bit on the higher side, he for the most part was able to put his receivers in position to make catches. Dalton did well on the touchdown pass to hit Green in stride after he torched rookie Tre'Davious White on a go route. As for the picks, neither was Dalton's fault. Both actually bounced off the hands of Green, who uncharacteristically knocked them into the air. Dalton could have thrown the first a little lower, but both were absolutely balls that Green should have caught. ",
            "6": "Speaking of Green, he was far and away the leading receiver for the Bengals. He totaled 189 yards and the touchdown on just seven catches. He saw a team-leading 13 targets and had a huge day. However, it should have been better. Not only did Green cause both picks, but he fumbled at the end of a long catch after taking a big hit from a Bills player. Green is still one of the best receivers in the NFL, but don't let the stat line fool you. This was not his best performance. Meanwhile, Dalton's other top targets were Brandon LaFell (5-32) and Tyler Kroft (4-38). The Bengals have a lot of good receiving weapons, but they will be in much better shape once Tyler Eifert returns from his back injury. He will give them a true No. 2 target. ",
            "7": "In the ground game, the Bengals finally decided to give Joe Mixon a chance to carry the load. He didn't disappoint. Mixon totaled 51 yards on 15 carries and scored a touchdown. The touchdown was a nice run that saw him break to the outside on a smooth cut and get to the pylon for an easy, 5-yard score. Mixon showed patience and good vision, and he looks like a lead back. He did get stuffed at the line a fair amount, but that was more due to the blocking than due to his running. Mixon should phase Jeremy Hill (4 carries, 16 yards) out of the offense for the most part, while Giovani Bernard will be the third-down back. ",
            "8": ""
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: Is it sad that the Jaguars nearly had as many points (30) as Blake Bortles had yards (95)? The Jaguars have had three impressive victories, but Bortles has been poor in two of those games and just mediocre in the other. ",
            "2": "If you are a Steeler fan, you sure don't want your team to be favored by a touchdown, because that means an upset is coming. This week, it was against the Jacksonville Jaguars, who were seven-point underdogs heading into Pittsburgh, but came out on top with a 30-9 win. The Jaguars came into this game with arguably the best secondary in the league, and there will be fewer people arguing that fact coming out of this game. They did help Ben Roethlisberger set a personal record, but one he would have rather not set, as he threw a career-high five interceptions, two of which were returned for touchdowns. I could probably stop here and you'd have a good idea of how this game went. But we shall trudge on, just like Roethlisberger when he tossed that fifth interception that floated into a leaping Tashaun Gipson's hands at the goal line to end the Steelers' last chance to find a touchdown. ",
            "3": "This is the first time Roethlisberger has thrown no touchdowns and four or more interceptions in his career. After the game Roethlisberger said, maybe I don't have it anymore, in what could have been sarcasm, but with his thoughts of retirement this past offseason, you have to wonder if he's feeling his age right now. ",
            "4": "It's tough to give much credit to Jacksonville's offense in this game, as Blake Bortles completed 8-of-14 passes for 95 yards and an interception, and Leonard Fournette, whose overall line of 28/181/2 looks like he ran over Pittsburgh's defense all day, but 90 of those yards and a touchdown came on a clock-killing play in which his coach was yelling at him to fall down! Before that, Fournette had rushed 27 times for 91 yards and a touchdown, giving him 3.37 yards per carry. It was still a great game from Fournette, as he has to run against stacked boxes due to Bortles' ineptitude, but I think we can give the game ball to the Jaguar's secondary in this one. ",
            "5": "This appeared to be a Le'Veon Bell type of game, as the Jaguars have been beaten on the ground over and over this season, whereas their pass defense has been superb. Instead, the Steelers attacked them through the air much more often than an outside observer like myself would consider healthy. Bell did see 25 touches, but 10 of those were receptions for 46 yards. Those will be useful for your PPR league, but 4.6 yards per reception isn't getting you far. ",
            "6": "Antonio Brown led the team with an amazing 19 targets, 10 of which he caught for 157 yards. That made the stat line look nice, but there were nine missed opportunities, two of which were tipped and returned for touchdowns in the third quarter. The third quarter also had the Steelers ahead 9-7 before those two pick-sixes occurred. ",
            "7": "The Steelers have always gone as Roethlisberger goes, and now he's playing some of his worst football. They will need to take a look at limiting him, as a more conservative approach would have likely won this game. They will head to Kansas City next week, which, with the way they look right now, doesn't feel like a place they can win. The Jaguars, on the other hand, have now beaten the Texans, Ravens and Steelers rather easily, with great defensive play and strong running by their rookie running back. It looks as though it still is possible to hide your quarterback and win games in today's NFL, and Jacksonville will keep trying to do just that next week at home against the Rams. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "EDITOR'S NOTE: Considering how many players the Raiders had injured prior to kickoff - Derek Carr, David Amerson, Gareon Conley, Gabe Jackson - I said I wish I could switch my pick, but it was too late. I feel like it's impossible to take this loss seriously for Oakland. ",
            "2": "",
            "3": "After having two terrible offensive performances, Baltimore's offense came alive behind the big arm of Joe Flacco, connecting with the deep speed of Mike Wallace to lead to a road victory. The Ravens' offensive line played much better than it had in recent weeks, and the Raiders' offense was unable to keep up because Derek Carr was sidelined by his back injury. Later this season, this could be a very significant win for the Ravens to get a tiebreaker over Oakland because this is a conference victory. Conversely, the Raiders have to hope they can get Carr back soon, as it will be very hard for them to win without him. Oakland's defense is just not good enough to carry the team to wins. ",
            "4": "On the first drive of the game, Flacco aired out a bomb to Wallace for a 52-yard completion. The Ravens got into the end zone a few plays later on a jet sweep run by wideout Vince Mayle for a 2-yard score. Baltimore quickly added to its lead as Jared Cook (3-25) fumbled the ball away. Jimmy Smith scooped up the loose ball and returned it 45 yards for a touchdown. Ninety seconds into the game, the Ravens were up 14-0. Oakland answered with a field goal drive led by Jalen Richard (9-37). Baltimore then quickly moved the ball into Raiders' territory with a nice run by Alex Collins (12-55) and two lucky completions to Jeremy Maclin (6-43). Javorius Buck Allen (21-73-1) finished off the drive with a one-yard touchdown run. E.J. Manuel made a great play in the second quarter to climb the pocket and then toss a 41-yard touchdown to Michael Crabtree (6-82-1). That cut Baltimore's lead to 21-10. Flacco answered with Wallace burning Sean Smith and Reggie Nelson for 54 yards to set up a Justin Tucker field goal. The Ravens took a 24-10 lead into halftime. The Raiders cut the lead to 24-17 late in the third quarter as Manuel used Crabtree to move the ball downfield. The drive ended with Marshawn Lynch slamming the ball into the end zone. Baltimore responded as Breshad Perriman (2-15) made a clutch, diving catch, and then Flacco hit Wallace for 28 yards. That set up another field goal to make it 27-17 early in the fourth quarter. The Ravens ran the ball well to get one more field goal and ice the game away. ",
            "5": "Flacco was 19-of-26 for 222 yards. He played much better than he has in recent weeks. Wallace had three receptions for 133 yards, but all three were huge plays to produce points and momentum for Baltimore. ",
            "6": "Manuel completed 13-of-26 for 159 yards with a touchdown. He had a couple of nice plays, but illustrated why he is a backup in the NFL. Meanwhile, Amari Cooper's slump continued as he had only one catch for eight yards. ",
            "7": "Baltimore's defense played well, with Terrell Suggs having a really good game. Eric Weddle (7 tackles) and Tony Jefferson (4 tackles, 1 sack), and the Ravens' cornerbacks played really well to keep Manuel from finding many open receivers. Conversely, the Raiders' defense failed to record a sack against Baltimore's vulnerable offensive line. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "10"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: Like the Buccaneers, the Rams were a young team that buckled at home versus a perennial Super Bowl contender. But like the Buccaneers, the Rams were close to winning. They may have gotten there had it not been for some crucial errors. ",
            "2": "This is a victory that should frighten the Seahawks. While they were able to win the contest, they nearly blew the game late in the fourth quarter. They nearly let Jared Goff orchestrate a game-winning drive, and they got lucky that the Rams couldn't convert late; Seattle escaped with the win. On the final drive, the Rams got the ball deep in their own territory with just over a minute left and no timeouts. Needing a touchdown to win, they immediately started attacking the Seahawks vertically. Goff was able to complete a couple of big passes to get the Rams into scoring range. The first was a long vertical route to Tyler Higbee. He got between the two safeties, and Goff put up a perfect ball to gain a lot of yardage. The second big play went over the middle to Robert Woods. On the penultimate play for the Rams, they were on the 20 and took a shot at the end zone. Cooper Kupp was streaking to the end zone and had gotten open. Somehow, the Seahawks had missed him in coverage. Goff threw a bullet to Kupp that hit him in the hands. Kupp had to dive for the pass, and it would have been an incredible catch. Kupp couldn't secure it, however, and the Rams couldn't punch the ball in. That essentially ended the game. Despite the positive final drive, Goff had his share of struggles against the Seahawks, and they were prevalent in the fourth quarter. Before the final drive, Goff made a few bad mistakes. He threw an awful interception that can only be described as a dying quail. It fluttered over the middle of the field and wobbled like crazy before Earl Thomas came away with it. Later in the quarter, Goff would hold onto the ball too long and get strip sacked from behind. He had trouble feeling the strong Seattle rush, and that cost him a bit. Overall, Goff went 22-of-47 for 288 yards and two picks. This was not an entirely negative performance for Goff. He had his share of nice throws that were accurate and well-thrown. And of course, he had a chance to get the Rams a win late. Goff is still a work in progress, so there will be more games like this for him as he battles tough defenses. ",
            "3": "Goff's top targets were Tyler Higbee (4-98), Cooper Kupp (3-44) and Robert Woods (5-66). Goff tends to prefer to throw to good route runners, which explains why these three were his top targets. Sammy Watkins saw four targets, but didn't log a reception. Consider trying to trade Watkins in fantasy for another underachiever with upside, perhaps Amari Cooper. ",
            "4": "Todd Gurley had been terrific for the Rams, but Sunday was easily his worst of the season. Facing a tough run defense, Gurley was only able to total 43 yards on 14 carries. He also had a key fumble near the goal line as he tried to stretch to the pylon. It resulted in a touchback for the Seahawks, but it was mostly bad luck, not a bad play. Elsewhere, Tavon Austin mixed into the backfield rotation a bit more this week. Austin had 27 yards and a touchdown on six carries. He looked like a good potential passing back and change-of-pace guy. Working him into the offense in this fashion would make a lot of sense for the Rams, as Austin is an explosive play-maker. ",
            "5": "For the Seahawks, this was another bad win. They frankly have not been impressing to start the season, and they are nowhere close to being a Super Bowl contender. A lot of this can be blamed on the offense. The Seattle scoring attack has numerous problems. For one, the team's offensive line is terrible. The unit can't block anyone and that will continue to hurt the Seahawks. They also have virtually no running game. Losing Chris Carson really hurt them, and they were not able to get any push against the Rams in this contest. Eddie Lacy led the way for the Seahawks' ground attack, but he was largely a disappointment. He saw nine carries and got 19 yards. Seattle mixed in Thomas Rawls and J.D. McKissic, but neither was particularly effective. Rawls matched Lacy's production, while McKissic caught three balls for 36 yards, but couldn't generate anything on the ground. The team needs to hope that C.J. Prosise comes back soon, as he could give the team a boost. ",
            "6": "In the passing game, Russell Wilson had a mediocre performance. Wilson had a lot of trouble staying upright behind the line, and he was sacked three times. Wilson did well to scramble away from some others, but he is getting hit far too much. That needs to change. When Wilson had time, he was fairly accurate, and had a couple of nice drives. One of his best throws came on his touchdown to Jimmy Graham. In the red zone, Wilson spotted Graham with one-on-one coverage and lofted a pass to him. The pass was perfectly thrown in a place where Graham could elevate and get it. Wilson ended up going 24-for-37 with 198 yards, one touchdown and one pick. The interception was not entirely his fault, as John Johnson undercut the route and nearly returned it for a touchdown. Wilson has room for improvement, but he needs to get some help from his offensive line to reach his full potential. ",
            "7": "Jimmy Graham (6-37, 1 TD) was the leading receiver for the Seahawks during the contest. Doug Baldwin (4-37) and Paul Richardson (3-35) were not far behind. Wilson likes to spread the ball around, but most weeks, Graham will be a TE1 and Baldwin will be a WR2 or WR3. Both have touchdown potential and are definitely Wilson's favorite targets. ",
            "8": "On the defensive side of the ball, Frank Clark continues to improve week in and week out. Clark had a big sack on Goff this game and was consistently putting pressure on the opposing quarterback. Clark should only get better, and the Seahawks have to be happy with his performance. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Packers",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "31"
        },
        "comments": {
            "amount": "7",
            "1": "Aaron Rodgers is incredible. There's nothing else that needs to be said. The Packers were down by three, thanks to a pair of missed extra points, but they had about 70 seconds remaining in regulation with one timeout. The FOX announcers talked about Rodgers potentially just getting into field goal range. He did that, but it was clear that he wanted more when he escaped the pocket and scrambled for 18 yards on a third down. Rodgers then found Davante Adams in the end zone a couple of plays later. He went 75 yards in about a minute, and he did this despite not having Jordy Nelson available, as his top wideout was sidelined on that drive with some sort of injury. Rodgers didn't have the prettiest stat line, as he went 19-of-29 for 221 yards and three touchdowns to go along with four scrambles for 32 rushing yards. However, he obviously played much better than those numbers indicate. He had some issues in the first half, as he took three sacks, but he caught fire following intermission. He could've posted better numbers, but the Cowboys sucked the life out of the fourth quarter by going on a 9-minute drive that culminated with a Dak Prescott touchdown that seemed like it might give Dallas the victory. And it probably would have if the Packers didn't have the best current quarterback on the planet commanding their offense. ",
            "2": "The Packers' victory was terrific, and the cherry on top is that they may have found a legitimate running back. Ty Montgomery is a solid player, but he's not a natural at the position. Rookie Aaron Jones definitely is, and he had a stellar performance in his first career start. Jones burst for 125 yards and a touchdown on just 19 carries. He had a key run on the team's final drive; he picked up a big gain and also managed to step out of bounds. ",
            "3": "Nelson was hampered with an injury, but he was still able to help his fantasy owners with a touchdown, catching two balls for 24 yards. He should've snatched a two-point conversion in the fourth quarter; he was wide open, but Rodgers sailed the ball over his head. Meanwhile, Adams' decisive score wasn't his only one. He caught seven balls for 66 yards and found the end zone twice. This was amazing, considering the brutal hit he took from Danny Trevathan on Thursday night. Elsewhere in the receiving corps, Randall Cobb had just four grabs for 29 yards. Martellus Bennett (3-53) made a couple of important catches to set up a pair of scores. ",
            "4": "The Cowboys, meanwhile, had great performances from all four of their stars. Dak Prescott went 25-of-36 for 251 yards, three touchdowns and an interception. He also had a fourth score on the ground, as he scrambled four times for 37 rushing yards. The pick, which was taken back for six, wasn't his fault, as it bounced off Terrance Williams' hands. Why Williams is still the No. 2 receiver, I have no idea. Dallas fans keep telling me Williams is good and shouldn't be upgraded, but I don't see it. He seems terrible to me, and he really ended up costing the Cowboys a victory. ",
            "5": "Ezekiel Elliott was a monster. He pushed forward for 116 yards on 29 carries, growing stronger as the afternoon progressed. He converted fourth-and-1 twice, though the second one came with some controversy. Elliott appeared to be stuffed, but replay review showed that he extended his arm past the first-down marker. Still, considering he wasn't down, he should have been ruled short because he pulled the ball back and then hit the ground. It was a confusing sequence, and it gave the Cowboys a touchdown, but the Packers won in the end, so it doesn't really matter. ",
            "6": "The other two stars, Dez Bryant and Jason Witten, both had strong showings. Witten snatched a team-high eight balls for 61 yards. Bryant, meanwhile, hauled in five passes for 52 yards and a touchdown. He also drew a questionable unnecessary roughness penalty in the end zone to help set up a touchdown to Cole Beasley (4-23), who scored twice. ",
            "7": "The Cowboys may have lost this game, but the silver lining is that David Irving looked terrific coming off his suspension. Dallas' defense will be much better as a whole when Sean Lee returns. Lee was greatly missed in this contest, and I'm sure Rodgers may not have been able to scramble for 18 yards had Lee been on the field. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "34"
        },
        "comments": {
            "amount": "7",
            "1": "The Texans came into this game hyped up to prove that they can defeat a perennial playoff contender. They nearly beat the Patriots on the road and then crushed the Titans, but slaying the Chiefs on a national stage would let the world know that they were for real. Unfortunately for Houston, the team never had a chance to do this, as the game was lost on the very first drive. When Whitney Mercilus and J.J. Watt suffered injuries, it was over. Mercilus' chest malady was bad enough, but the life was sucked out of the stadium when Watt suffered a knee injury. Watt had to be carted into the locker room and was eventually taken to the hospital. He was diagnosed with a fracture in his knee, though it's unclear how severe something like that is. What we do know is that Watt couldn't put any sort of pressure on his leg, so he will certainly miss several games. Hopefully he's not out for the year because he was enjoying a terrific season. Watt is the heart and soul of the team, and the Texans looked lost without him. They just couldn't get off the field, as their defense surrendered 35 points (seven more came on a punt return touchdown). The offense struggled early, but got moving eventually. That didn't even matter because the Chiefs converted third down after third down, as Houston had no push up front with Watt and Mercilus out of the lineup. ",
            "2": "Alex Smith was absolutely lethal, going 29-of-37 for 324 yards and three touchdowns. Smith, who had been brutal on third-and-long situations prior to this year because of his tendency to check down, has reversed that trend this year. Smith has become so much more aggressive, and that allowed the Chiefs to convert their first six third downs of this contest, none of which were short-yardage situations. One was even a third-and-14, while another was a third-and-11. Later, in the second half, Smith launched a bomb to Tyreek Hill for a 38-yard gain on third-and-long. Hill somehow tapped both feet inbounds before stepping out of play. ",
            "3": "The one dark cloud over the Chiefs' victory was a trio of injuries they suffered. Travis Kelce (8-98), who had a huge first half, suffered a concussion at the end of the second quarter. Justin Houston left the game late with a calf. Chris Conley (3-46) was carted into the locker room after he recovered an onside kick in the fourth quarter. Hill was sandwiched in between Kelce and Conley on the stat sheet, catching four passes for 68 yards. ",
            "4": "Kareem Hunt struggled to get anything on the ground in the early going. He mustered only 25 yards on 14 carries in the opening half. As the game went on, however, Hunt wore down Houston's skeleton-crew defense. He even eclipsed the century mark, pummeling forward for 107 yards on 29 attempts. It was a strong performance, though Charcandrick West vultured two touchdowns. ",
            "5": "The Texans, meanwhile, couldn't generate successful drives until the second half. Deshaun Watson saw tons of pressure from Houston's pass rush, and he completed only four passes prior to intermission. Watson torched the Chiefs in garbage time, and he actually made things interesting, trimming the margin to 26-20. However, the Chiefs quickly scored with ease, feeling no resistance from a Mercilus- and Watt-less defense, and following a very confusing decision by Bill O'Brien to punt on fourth-and-short with 7:30 remaining, Hill returned a punt to the house to seal the victory. O'Brien's call to punt was mind-boggling. Watson was on fire, and the defense couldn't stop anything, yet he punted on fourth-and-short? Why? Still, Watson finished with some very impressive numbers, going 16-of-31 for 261 yards and five touchdowns. He also scrambled thrice for 31 rushing yards. Watson had a bit of setback this week, though it wasn't all his fault because of his poor blocking. The Texans really need Duane Brown to end his silly holdout. ",
            "6": "Only two Texans caught touchdowns even though Watson had five. Three went to DeAndre Hopkins, though he didn't have a very efficient day, hauling in just four of his 12 targets for 52 yards. Will Fuller (2-57) snatched the other two. ",
            "7": "The Texans made the mistake of not running the ball very much right away. They had success doing so once they tried to establish the rush, as Lamar Miller gained 74 yards on 15 carries. D'Onta Foreman (4-34) also looked good, save for one play in which he lost a fumble, setting up a Kansas City field goal. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "Mitchell Trubisky made his first career start against the Vikings. He was aware that he was going to have to battle a tough defense, but little did he know that he'd have to deal with the officials and incompetent coaching as well. Trubisky did some impressive things in the early going. He converted a third-and-6 on the opening series with a sideline throw to Kendall Wright. He then fired a strike to Wright to move into Minnesota territory. Following a dropped pass, Trubisky made a great throw to move the team inside the 5-yard line, but the play was negated by a questionable Cody Whitehair hold. It was John Fox's turn to ruin a Trubisky drive after that. Fox had a bizarre sequence where he used a timeout on a fourth-and-short over midfield. It appeared as though he planned to go for it, but he then put the punting team on the field, effectively wasting the timeout. He then changed his mind and called the offense to make the snap, and they did, but it was too late. Fox's indecisiveness caused a delay-of-game penalty. It was inexcusable for such a veteran coach to make a mistake like this. It was almost as if Fox were coaching his first game ever. The Bears need to dispose of Fox at the first opportunity, perhaps during the bye week. Like Jeff Fisher with Jared Goff, Fox is only going to hold back Trubisky with his ineptitude. The Bears need to find a quarterback guru in the mold of Sean McVay to work with Trubisky. Following a safety, the Bears scored to go up 9-0, but the Jordan Howard touchdown run was negated by yet another hold, this one even worse than the initial hold. Jerome Boger's crew then followed that up with an abysmal offensive pass interference flag on Tre McBride on a Trubisky downfield shot. There was barely any contact, and any of it was purely incidental, so there was no reason to throw a flag. It was ridiculous, and even the ESPN broadcasters criticized Boger and his team, a group that's infamous for whistling lots of penalties. Boger, along with Walt Coleman, should not be officiating anymore. Trubisky looked good up until that point, but that's when he started making mistakes. He was strip-sacked by Everson Griffen to set up a Minnesota field goal. He missed some passes and fired across his body after that, but was able to engineer a touchdown drive in the fourth quarter, culminating with a toss to Zach Miller. Trubisky was a bit lucky on the play, as safety Andrew Sendejo was inches away from an interception. Instead, Sendejo tipped it right to Miller for Trubisky's first career touchdown. Trubisky had a chance to win the game with 2:30 remaining. He took the field on his own 10-yard line, but on his first snap, he rolled out and locked in on his receiver. He fired the ball, but safety Harrison Smith jumped the route to snatch the interception. That set up the Vikings for the game-winning field goal, which came via the help of another bogus penalty, this time a hold on Leonard Floyd. The final stat line looked like this: 12-of-25 for 128 yards, one touchdown, one interception and a lost fumble. He also scrambled thrice for 22 rushing yards. I thought Trubisky had a B+ performance until the abysmal pick. Still, it was a fine debut for the second-overall pick, who had to fight through a bad supporting cast, poor coaching and even worse officiating. ",
            "2": "The Vikings were able to prevail to improve to 3-2. It was quite the adventurous game for them, as they couldn't muster any sort of offense in the opening half, averaging a laughable 1.9 yards per play. The problem was Sam Bradford, who could barely move. Bradford was just 5-of-11 for 36 yards prior to getting pulled in favor of Case Keenum. Bradford nearly threw a pick and was also responsible for a safety when he held the ball for an eternity in his own end zone. Keenum was much better. He misfired just four times, going 17-of-21 for 140 yards and a touchdown. His mobility was key, as he was able to elude defenders in the pocket. He also had a huge 22-yard scramble on a third-and-long. Keenum should remain Minnesota's starter until Teddy Bridgewater returns because Bradford clearly can't get healthy. ",
            "3": "Bradford wasn't the only player in the backfield who was benched. Latavius Murray started, but was predictably ineffective, plodding for 31 yards on 12 carries. The Vikings replaced him with Jerick McKinnon, who ended up out-touching Murray, 22-14. McKinnon gained 95 yards and a touchdown on 16 carries, and he also caught six balls for 51 receiving yards. He's the top waiver-wire option this week. ",
            "4": "Keenum's touchdown went to Kyle Rudolph (6-45), who led the team with nine targets. Adam Thielen was next with eight, and he made five grabs for 34 yards. Stefon Diggs barely did anything - one catch, four yards - because he battled a groin issue throughout the evening. This is something that could linger, especially on a short week. ",
            "5": "As for the Bears' skill-position players, Wright sadly led the Bears in receiving with four catches for 46 yards, while Miller was right behind him (3-39). Miller paced the team in targets with seven. ",
            "6": "Howard did a nice job of running the ball, tallying 76 yards on 19 carries. As mentioned, he had a long touchdown called back by a ticky-tack penalty. Tarik Cohen was a disappointment once again, as he managed just 13 yards on six attempts. It's only a matter of time before he breaks out again. ",
            "7": "It's worth noting that the Bears scored one of their two touchdowns on a fake punt. Pat O'Donnell tossed the most nonchalant pass of all time to Benny Cunningham, which caught the Vikings off guard. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "14"
}