{
    "year": "2017",
    "week": "01",
    "Game 1": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "27"
        },
        "comments": {
            "amount": "8",
            "1": "This was an absolutely crazy game. The Patriots looked like they were going to run away with a blowout, as they were up 7-0 and appeared to score a touchdown, though it was called back because the ball barely hit the ground on a near-Rob Gronkowski reception. Nevertheless, New England was up 10, and it didn't seem like the Chiefs would keep it close. In the end, one team won by 15, and its quarterback threw for 368 yards and four touchdowns - and it wasn't the Patriots and Tom Brady! Kansas City generated 537 yards of offense, most of which came on big chunk plays. We're used to the Chiefs dinking and dunking, but they were explosive in their season debut. Kareem Hunt and Tyreek Hill were both terrific, but something that needs to be discussed is how bad New England's defense was. I believe that to be the greatest factor. The Patriots simply didn't show up on that side of the ball. They had absolutely no pass rush for most of the evening, which wasn't a surprise because Derek Rivers suffered a season-ending injury several weeks ago. Meanwhile, Dont'a Hightower was knocked out with a knee, and the Patriots had no substitute for him. The Chiefs were unstoppable once Hightower left the field, and that's something New England will have to get used to if the star linebacker misses lots of action. The Patriots have absolutely nothing behind Hightower, save for some special-teams players who shouldn't be on the field on first, second or third down. That said, I don't want to take away anything from the Chiefs. They wouldn't have been as explosive had Hightower remained on the field the entire time, but they had a great game plan, and their offensive line opened up huge holes for their new running back. All Hunt did, by the way, was set a record for most yards from scrimmage for a running back making his NFL debut. Hunt dashed for 148 yards and a touchdown on just 17 carries, and he also caught all five of his targets for 98 receiving yards and two more scores. What's crazy is that Hunt had a 10-yard gain called back because of an unnecessary hold, so his night could've been even better. Amazingly, Hunt started poorly, fumbling on his first attempt after not doing that at all in his Toledo career. Hunt, however, shook it off and put his talents on display in front of a national audience. ",
            "2": "Smith, as mentioned, had a ridiculous stat line of 28-of-35, 368 yards and four touchdowns. What's crazy is that Travis Kelce had just 40 of those yards (five catches), as the Patriots made sure to smother him with double teams. Smith, instead, took some shots downfield, connecting on deep passes to Hill and Hunt for 75 and 78 yards, respectively. He deserves great praise for an amazing game, as does Hill (7 catches, 133 yards), though he left the game late with an injury as well. That said, no one should get carried away with what happened tonight instead of overreacting like some people on TV (Tedy Bruschi called the offense limitless.) Smith had no sort of pass rush to deal with, and the Chiefs outscored the Patriots, 21-10, following Hightower's injury. New England's entire defensive game plan went to hell without Hightower. ",
            "3": "I haven't discussed the other major injury yet, and it cast a dark cloud over Kansas City's victory. Eric Berry suffered a non-contact injury to his Achilles in the second half, and he couldn't put any pressure on his leg. He had to be carted into the locker room, and it doesn't look good for him. I gave the Chiefs a high <a href=/disastergrades.php>Disaster Grade</a> for what Andy Reid called a torn Achilles after the game. It's such a shame, as Berry worked so hard to come back from his life-threatening condition a few years ago. Berry, who was instrumental in locking down Gronkowski, will sorely be missed. If there's a silver lining, however, it's that the injury occurred so early in the year that Berry could be 100 percent by the 2018 opener. ",
            "4": "Speaking of Gronkowski, he caught just two of his six targets for 33 yards. As mentioned, he nearly scored a touchdown, but he couldn't get open versus Berry. I would buy low on Gronkowski for this reason. Perhaps his fantasy owner will panic, allowing you to obtain him for value. ",
            "5": "The Patriots suffered an injury on offense as well. Danny Amendola - not Chris Hogan - was being used as Julian Edelman's replacement, as he caught six balls for 100 yards. His one blemish was a dropped pass on third down. Amendola, however, was concussed. He has 10 days to clear concussion protocol, but it's a reminder of how utterly fragile Amendola is. I think the Patriots are going to regret not keeping preseason stud Austin Carr, as he could slot right in for Amendola. Perhaps Hogan will do that; Hogan snared just one of his five targets for only eight yards. ",
            "6": "I haven't gotten to Brady yet. His stat line was very uncharacteristic, as he went 16-of-36 for 267 yards. A chunk of that came on a 54-yard reception to Brandin Cooks, so if you take that away, Brady was just 15-of-35 for 213 yards. He tossed some ugly wobblers in this game, though he was on point with some of his other attempts. It was a very mixed performance, and it should've been better because he had great protection for most of the evening. That changed late when Justin Houston, who was terrific throughout, began dominating Marcus Cannon. However, Brady had time to exploit Kansas City's defense for the most part, as Cannon did a good job on Houston in the early going. ",
            "7": "As for Cooks, he didn't have the best statistical debut, catching only three balls for 88 yards. Cooks, however, drew a deep pass interference to set up the Patriots at the Kansas City 1-yard line, which Mike Gillislee converted. ",
            "8": "Speaking of Gillislee, he scored thrice, as he was the exclusive goal-line back. Gillislee gained just 45 yards on 15 carries, and he was stuffed on two fourth-and-1 attempts, but his fantasy owners can't complain about the three touchdowns. Rex Burkhead, meanwhile, gained 15 yards on just three attempts. He caught only one of his three targets for eight receiving yards. <div class=dfpAdSlots> "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Bills",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "12"
        },
        "comments": {
            "amount": "7",
            "1": "The Bills may have won this game by just nine points, but this result could've been far more lopsided. Buffalo nearly doubled up the Jets in yardage and averaged nearly two more yards per play. The Bills tried to give away this victory with numerous mistakes, but they survived against what I called the worst team I've ever graded prior to a season. Buffalo was able to get big chunks of yardage all afternoon, including the opening drive. However, the possession concluded with an interception, which occurred because Charles Clay had the ball tip off his hands. The Bills should've retained possession because the interceptor, Juston Burris, fumbled the ball, but the officials ruled him down by contact for some reason. This wouldn't be the only time Clay would screw up. He dropped numerous passes and fumbled as well. Throw in a missed 46-yard field goal, and the Bills blew lots of opportunities to score early, which allowed the Jets to hang around. The game effectively ended for New York, however, when Jordan Poyer made an incredible play to wrestle the ball away from Robby Anderson, who looked like he made an incredible catch. The Jets then waved the white flag on the next possession, punting on fourth-and-short despite being down two possessions with about four minutes remaining. It was one of several curious decisions Todd Bowles made this afternoon. ",
            "2": "Tyrod Taylor finished 16-of-28 for 224 yards, two touchdowns and an interception, which, as discussed, wasn't his fault. Taylor also did some work on the ground, dashing for 38 yards on eight scrambles. Taylor was awful in the preseason, but he had a nice performance in his 2017 debut. Before anyone gets too excited, however, Taylor threw against the worst team I've ever covered, so I wouldn't expect him to maintain this level of production. ",
            "3": "LeSean McCoy had a scare in this game when he hurt his hand on a run down to the 1-yard line. He left the game, allowing Mike Tolbert to vulture a touchdown. McCoy returned on the next drive, so everything is OK. McCoy looked great, gaining 110 yards on 22 carries and also catching five balls for 49 receiving yards. McCoy was as outstanding as those numbers indicate, and he even juked Jamal Adams out of his cleats in the early going on a 21-yard catch-and-run play. ",
            "4": "Despite his blunders, Clay had a nice stat line, registering four catches for 53 yards and a touchdown. He trailed only Jordan Matthews (2-61), who did most of his work on one 47-yard reception. The big catch (47 yards) was a nice play by Taylor, as he escaped some pressure and kept his eyes downfield. Meanwhile, Zay Jones converted only one of his four targets for 21 yards. He was a big disappointment. ",
            "5": "Moving on to the Jets, Josh McCown finished with a nice completion percentage (26-of-39), but only because he dinked and dunked on almost every throw. He didn't have much of a choice because of poor protection, but I'd still describe him as Sam Bradford on crack. His 39 attempts went for 187 yards, which gave him a YPA of 4.79. To put that in perspective, McCoy averaged more yards per carry than McCown did per throw! McCown tossed two interceptions, but neither was really his fault. The first, which I discussed already, was a great play by Poyer. The second was a desperation heave in the final minutes. ",
            "6": "I mentioned some questionable decisions made by Bowles. I'd say not involving Bilal Powell very much was one. Powell saw just three carries in the opening half, and he wasn't on the field for most of the first quarter, as Matt Forte drew the start for some reason. Forte (6-16) predictably was out-produced by Powell (7-22). It's obvious that Powell is the best player the Jets have on offense, so it makes absolutely no sense for him to be losing touches to Forte. ",
            "7": "Thanks to McCown's pedestrian passing, only one Jet accumulated more than 34 yards. That was newly acquired Jermaine Kearse, who caught seven balls for 59 yards. McCown otherwise spread the ball around, with Anderson (4-22) seeing the next-most targets with eight. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Lions",
            "Points": "35"
        },
        "Team 2": {
            "Name": "Cardinals",
            "Points": "23"
        },
        "comments": {
            "amount": "9",
            "1": "Both teams tried their hardest to lose this game. The best I can describe it was a comedy of errors where one team tried to upstage the other to see who could make the worst mistakes. The Cardinals ultimately prevailed in that regard, but that just meant that they lost their season opener. Arizona began the mess when Carson Palmer threw an interception. Someone screwed up on the play because there was no receiver in the area. Two plays later, Matthew Stafford was pick-sixed. It wasn't really Stafford's fault, as Josh Bynes hit Golden Tate legally, allowing Justin Bethel to snatch an easy interception. The Lions then botched a punt attempt, where the punter ran the ball to Arizona's 13-yard line, getting hurt in the process. The Cardinals couldn't convert on two series, as they were given a second because of a Detroit leaping penalty. Palmer tried to help the Lions after that with a near-interception, but Haloti Ngata dropped the ball. Not to be outdone, Palmer launched a pick because he couldn't step into his throw. The Lions tried to screw themselves from taking advantage of it with a hold, but they managed to score a touchdown. Of course, they messed up the extra point. To conclude the opening half, Palmer was nearly intercepted again, but the ball hit the ground. Phil Dawson made sure Arizona would hurt itself by hitting the left upright on a 32-yard field goal. The Lions had a cleaner second half despite some Kenny Golladay drops. The Cardinals, on the other hand, continued to kill themselves. J.J. Nelson dropped a deep touchdown, then a score to Jermaine Gresham was wiped out by a hold. David Johsnon then lost a fumble and got hurt in the process. And if that wasn't enough, Palmer was pick-sixed to end Arizona's chances. ",
            "2": "This was an ugly loss for the Cardinals, but the silver lining is that the X-rays on David Johnson's wrist came back negative. Johnson struggled as a runner, gaining 23 yards on 11 carries, though he did catch six passes for 68 receiving yards. His fantasy owners missed out on a touchdown because Kerwynn Williams (5-10) vultured one after Johnson left the game. However, they have to be thankful that Johnson might be able to play next week. ",
            "3": "As for Palmer, his final numbers were 27-of-48 for 269 yards, one touchdown and three interceptions. He could've been picked on a couple more occasions, so this was an ugly start to his 2017 campaign, especially considering the sort of defense he was playing. The Lions are projected to have one of the worst stop units in the NFL, so if Palmer struggled against them, what's going to happen against tougher defenses? ",
            "4": "Larry Fitzgerald saw 13 targets, but could reel in only six of them for 74 yards. Nelson (5-43) scored a garbage-time touchdown. John Brown trailed only Fitzgerald in targets (9), but could only convert four of them for 32 yards. ",
            "5": "Adding injury to insult and injury for the Cardinals, they lost tackle D.J. Humphries, who was carted into the locker room in the early going. This was a huge loss, as Arizona struggled to block without him. His replacement, John Wetzel, looked like he didn't belong in the NFL. ",
            "6": "While the Cardinals can't feel optimistic about their offense, Haason Reddick at least looked great. He made numerous great plays, and he always seemed to be in the correct place at the right time. Fellow rookie linebacker Jarrad Davis did well overall for Detroit, but was guilty of a couple of dumb penalties. ",
            "7": "Stafford deserves a ton of credit for keeping the Lions in the game. He rebounded from the early pick-six and some drops to finish the afternoon on a torrid pace. His final numbers were 29-of-41 for 292 yards, four touchdowns and an interception, but in the second half, he was 12-of-16 for 180 yards and three scores. It's nice that he was able to pick up where he left off last year prior to injuring his finger. ",
            "8": "Reports said before the game that Patrick Peterson would cover Golden Tate, but Tate was still able to catch 10 passes for 107 yards. Marvin Jones, who actually saw Peterson's coverage, managed just two receptions for 37 yards, but he was able to score to salvage his fantasy day. However, the story of the game was Golladay, who was the third receiver on most snaps. He made some errors early by dropping the ball on a couple of instances. However, he had a terrific fourth quarter. He scored twice, with one touchdown being an incredible, diving catch. Golladay hauled in four balls for 69 yards and two touchdowns. He's very talented, and he's worth picking up in fantasy leagues if he's available. ",
            "9": "The Lions didn't have much luck running the ball, as Ameer Abdullah mustered only 30 yards on 15 carries. Theo Riddick did all of his work as a receiver, logging six receptions for 27 yards and a touchdown. <div class=dfpAdSlots> "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The Raiders looked aloof in the preseason, but they certainly were way more focused in their regular-season debut. Despite being field-goal underdogs against a team that didn't make the playoffs last year, Oakland dominated this contest from start to finish. Derek Carr misfired on just 10 throws, going 22-of-32 for 262 yards and two touchdowns. His numbers would've been better had it not been for some drops. He was given a short field on his initial drive because of a failed Tennessee onside kick attempt, and he ultimately found Amari Cooper in the end zone. Agent Cooper muscled in for six, as Adoree Jackson whiffed on a tackle. Jackson also helped set up Oakland's next scoring drive with a 24-yard defensive pass interference on Michael Crabtree. Jackson came back to break up a touchdown fired in Cooper's direction, but the Raiders should've scored. Cooper dropped a touchdown later on the drive. Tennessee tried to make improvements to its defense this offseason, but it appears to not have worked. It's still way too early in the season to make final judgments, but the early returns are not looking good. ",
            "2": "Conversely, Marshawn Lynch had a strong debut. The numbers don't pop out - he gained 76 yards on 18 carries - but he had some powerful runs. On one occasion, he appeared to be stopped on short yardage, but he muscled through the defender to pick up the first down. ",
            "3": "Cooper may have scored the first touchdown, but he converted on just five of his 13 targets. He logged 62 yards, but should've scored on two other occasions if it weren't for a couple of drops. Crabtree led the Raiders in receiving with six grabs for 83 yards, one of which was a great, diving catch that he made as he was getting hit. Seth Roberts reeled in Carr's other touchdown. ",
            "4": "Sebastian Janikowski missed his first game since 2001, but the Raiders did just fine without him. Some guy named Giorgio Tavecchio blasted a 52-yard field goal in this contest. ",
            "5": "As for the Titans' offense, Marcus Mariota went 25-of-41 for 256 yards to go along with three scrambles, 26 rush yards and a score on the ground. His interception-less streak in the red zone nearly ended when he threw the ball up for grabs, but the pass fell incomplete. That, as well as a dropped interception late in the game, were just about the only things that went right for Mariota as a passer throughout the afternoon. The performance was very discouraging, given the issues the Raiders have in their linebacking corps and secondary. ",
            "6": "Another big surprise was that the Titans couldn't run the ball at all. DeMarco Murray tallied 44 yards on 12 carries, but 21 yards came on one burst. Derrick Henry managed 25 yards on six tries. The Titans are supposed to have one of the top offensive lines in the NFL, but no one told that to third-round rookie defensive tackle Eddie Vanderdoes, who dominated the trenches. ",
            "7": "I expected Delanie Walker to have a big game because of Oakland's poor linebacking corps, and that turned out to be the case. He caught a team-high seven balls for 76 yards. Rishard Matthews (5-71) was not too far behind him. However, the biggest surprise was that Corey Davis paced the Titans with 10 targets, snatching six of them for 69 yards. Davis was injured throughout training camp, so it was impressive that he was so productive right away. Eric Decker, conversely, made just three grabs for 10 yards, though he did see eight targets. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "This wasn't exactly the start the Falcons were looking for. Though they led for most of the afternoon, they nearly lost at the very end. They were up six, and Mike Glennon put together a great drive to march his team into the red zone. However, thanks to a Jordan Howard drop, Brooks Reed was able to record a game-ending sack to give the Falcons their first victory of the season. It was discouraging to see the Falcons post just 23 points against a Chicago defense missing its top cornerback. That said, Atlanta began its 2016 campaign sluggishly as well, losing to Tampa Bay at home. The Falcons at least won this contest, though they needed some late-game fortune to do so. ",
            "2": "Matt Ryan finished 21-of-30 for 321 yards and a touchdown, though the numbers are a bit deceiving because his score, an 88-yarder, was a deep shot to Austin Hooper, who was wide open on a busted coverage. Ryan, who was 20-of-29 for 233 yards otherwise, didn't get the sort of pass protection he was used to receiving last year. Akiem Hicks, who signed a new contract Saturday, dominated the trenches. Plus, it didn't help that Atlanta players slipped on numerous occasions. The field was a mess, which is inexcusable for an NFL season opener. ",
            "3": "The Bears' front seven made sure the Falcons wouldn't run the ball very well. They did their job, limiting Devonta Freeman to just 37 yards on 12 carries, though he scored once. Tevin Coleman (8-16) didn't fare much better. As a result of this, Ryan was constantly in third-and-long situations. ",
            "4": "Thanks to two long receptions of 88 and 40 yards, Hooper led the Falcons with 128 receiving yards with a touchdown. He nearly doubled up Julio Jones, who made four grabs for 66 yards. It was extremely disappointing to see Jones fail to take advantage of an extremely favorable matchup. Mohamed Sanu (6-47) continued to post mediocre numbers. ",
            "5": "The Bears may have lost this game, but a silver lining is that a new star may have been a born. Tarik Cohen, whom I praised in my preseason recaps for his dazzling jukes and running ability, made some terrific plays in his professional debut. He didn't see as many carries as Jordan Howard (13-52, TD), but he outgained him, dashing for 66 yards on five tries, featuring a 46-yard, field-reserving run. Cohen also caught eight of his 12 (TWELVE!!!) targets for 47 yards and a touchdown. He ran circles around Atlanta defenders, who had issues tackling him. He also made a crazy, one-handed diving reception in the second half. Cohen is a freak, and the Bears will almost certainly find ways to get him involved on offense. Cohen isn't built to be an every-down ball-carrier - he's only 5-6, 179 - but he'll be a big-time fantasy producer, especially in PPR formats. ",
            "6": "Cohen, with his 47 receiving yards, led the Bears in that category. Zach Miller (4-39) was next, then Kendall Wright (3-34). If you're looking for Kevin White, he was dead last with two grabs for six yards. At one point, the FOX color analyst said something along the lines of, Now is the time for Mike Glennon to go to Kevin White. I shook my head, as such a time should never exist. Alas, White suffered a fractured collarbone and will be out for the year. ",
            "7": "Mike Glennon went 26-of-40 for 213 yards and a touchdown. It wasn't a very impressive debut, but Glennon neither had adequate protection nor viable threats downfield. Plus, he should've thrown a second score at the very end, but Howard dropped the ball. It would probably be best for the Bears to move on to Mitchell Trubisky, though I wouldn't blame Glennon for this defeat. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "0"
        },
        "comments": {
            "amount": "7",
            "1": "As the only team to get shut out in Week 1, there's going to be a lot of discussion about what's wrong with the Bengals. I highlighted this repeatedly in the offseason, and it was a major reason I bet their 8.5 under wins in the <a href=/nflbettingprops2017.php>NFL Betting Props</a> for 2017. The primary reason why Cincinnati is really going to struggle this year is their horrible offensive line, and that was on display in this 20-0 blowout. The Bengals simply couldn't block the Ravens at all. They lost Andrew Whitworth and Kevin Zeitler this offseason, and they failed to replace them. They have two turnstile tackles, and only one of their blockers on the entire front is a viable starter. Andy Dalton will get blamed for the four-interception performance, but this is the first time in his career that he's playing behind a weak offensive line. Dalton has always benefited from great blocking, but that won't be the case anymore. Now, we'll see his mediocrity get exposed as a result. Dalton finished 16-of-31 for 170 yards and the four picks. He also lost a fumble in the red zone. Two of the interceptions were tipped. One was a horrible decision, while the fourth came in meaningless action late in the game. Dalon made some other horrendous throws, including a bad overthrow on a third down in the second quarter. Terrell Suggs terrorized Dalton. He sacked him twice, forced a fumble and had a deflection that led to one of Dalton's picks. ",
            "2": "The Bengals couldn't run the ball very well either, which wasn't a surprise. The Ravens have a fearsome front, but Cincinnati's line won't open up many running lanes for their backs. And speaking of the runners, Jeremy Hill, Joe Mixon and Giovani Bernard rotated on drives in that order. Hill had a nice burst of 12 to open the afternoon, but didn't do much after that. He finished with 26 yards on six attempts. He had a 17-yard gain nullified by a Jake Fisher hold. Mixon, meanwhile, was a colossal disappointment, tallying nine yards on eight attempts, and all but one of his yards came on one try. He also caught three passes for 15 receiving yards. Bernard was the most-productive player, registering 40 yards on seven carries, though 23 of his yards came on one carry. Bernard also had a 39-yard reception. This situation is a mess for fantasy football purposes. It's a legitimate three-headed time share, and the Bengals can't consistently open up lanes for any of the runners. ",
            "3": "A.J. Green caught five of his 10 targets for 74 yards. Save for Green and Bernard, no Bengal logged more than 24 receiving yards. ",
            "4": "The lone bright spot for the Bengals was their defense, namely Geno Atkins. The monstrous defensive tackle dominated the line of scrimmage, getting the best of Pro Bowl guard Marshal Yanda. ",
            "5": "As for the Ravens, they prevailed in this game, but there are two areas of major concern for them. The first is Joe Flacco, who didn't look comfortable throwing the ball at all. He couldn't go downfield, and the numbers showed it. Flacco went 9-of-17 for 121 yards, one touchdown and an interception. Keep in mind that nearly half of his yards (48) came on an intermediate toss to a wide-open Jeremy Maclin, who did the rest of the work, scoring on the play. Flacco did nothing otherwise; take away that play, and Flacco was 8-of-16 for 63 yards and a pick, which was a pass thrown way behind Terrance West. Things could've been worse for Flacco, as he was tested for a concussion after a fierce hit. Fortunately, he was able to return to the game. The second problem area for the Ravens was the injury to Danny Woodhead. The pass-catching running back was a big part of their opening drive, snatching three receptions for 33 yards. However, he suffered an injury at the conclusion of the first possession, and he didn't return. If Woodhead is out for a while, the Ravens should consider trading for either Matt Forte or Dion Lewis. ",
            "6": "With Woodhead gone, both West and Buck Allen saw a lot of work. West gained 80 yards and a touchdown on 19 tries, while Allen mustered 71 yards on 21 carries. ",
            "7": "Save for Woodhead and Maclin (2 catches, 56 yards, touchdown), no Raven caught more than one pass. In fact, Maclin, Woodhead and Nick Boyle (1-14) were the only players who logged double-digit receiving yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Jaguars",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "7"
        },
        "comments": {
            "amount": "11",
            "1": "<i> EDITOR'S NOTE: </i> That was horrible for Houston, but the silver lining is that the Texans can now just move forward with Deshaun Watson without any drama. I don't think the Texans' offense can function without a mobile quarterback, at least not until Duane Brown returns from his holdout. ",
            "2": "",
            "3": "This game was over by intermission. The first half of this game was sheer domination by Jacksonville from the beginning. Houston's offensive line was completely inept, as new Jaguar Calais Campbell had 3.5 sacks in the first half to set a franchise record for the most sacks in a single game (4). Jacksonville's Yannick Ngakoue had two sack-fumbles as well by halftime. Texans quarterback Tom Savage was awful, routinely holding onto the ball too long, and Houston's offensive line was putrid. Savage was lucky to have only two fumbles by halftime. Conversely, the suspect Jaguars' offensive line was superb, Leonard Fournette ran hard, and Blake Bortles managed the game well enough to win. ",
            "4": "On the first third down of the game, Allen Robinson made a catch of 17 yards to move the chains, but he came up limping after he was pushed out of bounds. Robinson went into the locker room and didn't return to action. A serious injury to Robinson could be devastating to Jacksonville, plus hurt his fantasy owners. Bortles had another chunk completion this time to Allen Hurns (3-42), and that set up a short field goal for Jacksonville. The Jaguars added a second field goal after using rookie Leonard Fournette to move the ball on the ground and through the air, with Chris Ivory (9-42) chipping in a 17-yard run. Then, Ngakoue strip-sacked Savage to set up the Jaguars around midfield. Jacksonville took advantage with the aid of some Texans penalties to move to the goal line. On fourth-and-goal, Fournette powered into the end zone. Houston moved into Jacksonville territory afterward, but Ngakoue forced another strip-sack that was scooped up by Dante Fowler and returned 53 yards for a touchdown. The Jaguars took a 19-0 lead into the half. Deshaun Watson took over at quarterback for the Texans in the second half and promptly moved the ball down the field. A penalty on the Jaguars took away an interception, and Watson made them pay by throwing a short touchdown pass to DeAndre Hopkins. Jacksonville answered by moving the ball down the field on the Houston defense as Bortles threw a short touchdown pass to fullback Tommy Bohanon. Watson moved the ball across midfield again before Fowler kicked the ball out of Watson's hand, and Ngakoue recovered the fumble. Late in the fourth quarter, Watson moved the ball inside the 10-yard line, but threw an interception to Tashaun Gipson to finish off Houston. ",
            "5": "Fournette ran for 100 yards on 26 carries and a touchdown in his NFL debut. He also caught three passes for 24 yards. ",
            "6": "Bortles had an easy game, completing 11-of-21 for 125 yards with a touchdown. ",
            "7": "Watson was 12-of-23 for 102 yards with one touchdown and an interception. Savage finished 7-of-13 for 62 yards. ",
            "8": "Lamar Miller ran for 65 yards on 17 carries, plus made two receptions for 31 yards. ",
            "9": "DeAndre Hopkins caught seven passes for 55 yards with a touchdown. ",
            "10": "The Jaguars' defense was incredible, totaling 10 sacks. Calais Campbell (four sacks, five quarterback hits), Yannick Ngakoue and Dante Fowler overwhelmed Houston's offensive line. The only thing that didn't really go well for the Jaguars was new cornerback A.J. Bouye getting called for three pass interference penalties in coverage on Hopkins during the game. ",
            "11": "The Texans' vaunted defense played poorly. J.J. Watt and Jadeveon Clowney each only had one tackle. <div class=dfpAdSlots> "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Eagles",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "17"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> The officiating in this game was atrocious. I still don't know how the refs ruled Kirk Cousins' obvious incomplete pass as a fumble at the very end. But as someone who has been screwed by countless horrendous calls throughout the years, I'll take it. ",
            "2": "The Eagles were far and away the better team in this contest. While the score remained close for a majority of the game, the Redskins were clearly outplayed in every aspect. It all started with the poor performance of their offensive leader, Kirk Cousins. After a rocky preseason, Cousins just looked off for most of the day. During the 2016 season, the Redskins quarterback struggled out of the gate and led the team to two losses. Many of the same issues were prevalent in this defeat. Cousins struggled mightily with his accuracy throughout the contest. He consistently overthrew his receivers, and that caused many of the team's problems throughout the day. One of his most egregious overthrows came in in the fourth quarter. With the Eagles leading 19-17, the Redskins were in the red zone and threatening to take the lead. Cousins threw a short pass that sailed over Jamison Crowder's head by a couple of yards and into a defender. The interception cost the Redskins points, and it really shifted the momentum back in favor of the Eagles. That said, it was not an entirely bad performance for Cousins. He did have nice ball placement on quite a few downfield throws, including a potential touchdown pass to Terrelle Pryor. Cousins threw a perfect ball with just the right amount of arm strength. The throw hit Pryor right in the hands, but he dropped it. The play would have been called back due to a penalty anyway. Cousins ended up going 23-for-40 with 240 yards, one touchdown and one interception. However, the stat line is a bit misleading, as Cousins was only able to put together a couple of good drives, at best. Additionally, he lost two fumbles on the day, but that was less of his fault. ",
            "3": "The Redskins' offensive line has continued to struggle after a poor preseason performance. Against the Eagles, the unit struggled to deal with the team's strong pass-rushers. Brandon Graham was able to abuse Morgan Moses during the contest, and Cousins was constantly under pressure. The Redskins have to fix their problems in pass protection if they want to succeed this season. ",
            "4": "Pryor was the most notable Washington receiver during the day. Pryor (6-66) made some nice catches, but he also had a couple of bad drops. One aforementioned one came on a play that was called back, but Pryor also dropped a wide-open catch for a first down. Pryor needs to continue to improve his catching ability. If he does, he will be a real weapon for the Redskins. The other top receivers for the Redskins, Josh Doctson and Jamison Crowder, disappointed. Doctson barely saw the field, and it looks like Ryan Grant (4-61) will take his spot as a starter. Meanwhile, Crowder only caught three passes for 14 yards and wasn't able to get open much. He also fumbled a punt that led to Eagles points, so it was a forgettable day for him. If you can buy low on Crowder, now would be the time to do it. ",
            "5": "The running game was not a strength for the Redskins. Rob Kelley totaled 30 yards on 10 carries. He looked a bit sluggish and not quite the bruiser that he was last year. Cousins totaled the same number of rushing yards on just four scrambles. Chris Thompson was the best of the group, but he did most of his damage in the receiving department (4-52, 1 TD). ",
            "6": "Defensively, new Redskins start Zach Brown had a great performance. He recorded 12 tackles and nearly had a sack. He looks like a great fit in Greg Manusky's defense. Ryan Kerrigan and Preston Smith also combined for 1.5 sacks, and they look to be a strong starting duo for the team. ",
            "7": "For the Eagles, this was an encouraging performance. There has been a lot of hype around the team this offseason, and it looks like it was warranted. Carson Wentz and the offense were able to get going early on. On the second pass of the game, Wentz had a Fran Tarkenton-like scramble around the pocket to avoid multiple Redskins defenders before finding an open Nelson Agholor for a 58-yard touchdown. That one play was a microcosm of Wentz's performance on Sunday. Wentz's mobility allowed him to move around the pocket easily and find open receivers. Wentz was very accurate on most of his throws, and he was able to make clutch completions in third-and-long scenarios. His downfield accuracy was very good, and that should bode well for the Eagles moving forward. Wentz's one issue was that he overthrew Agholor on a few different occasions. On three passes, Agholor had to reach up to try to knock a ball down to himself, and each time, he was mostly wide open. One of Wentz's biggest mistakes came on a backward pass to Agholor that was too high. Agholor dropped it, and the Redskins recovered the fumble. Overall, Wentz went 26-for-39, totaling 307 yards, two touchdowns, and throwing an interception. This is an impressive stat line, and he is definitely improving with each game. Wentz will soon be a top-10 quarterback in the NFL. ",
            "8": "Wentz's favorite receiver was unsurprisingly tight end Zach Ertz. Last season, the two developed a strong rapport, and it carried over to this opener. Ertz caught all eight of his targets for 93 yards and had many key first-down catches. Ertz is a smooth route runner, and he is definitely a TE1 in fantasy this season. Wentz's other top receivers were Nelson Agholor (6-86, 1 TD) and Alshon Jeffery (3-38). Agholor was very impressive and tied for the team lead with eight targets. He would have done better had Wentz not overthrown him on a couple of occasions. Agholor looks fast, athletic and explosive. He is worth adding in all fantasy formats, as it appears that he and Wentz have developed a good relationship. Meanwhile, Jeffery had a mildly disappointing performance, but he was facing Josh Norman for a good chunk of game. Jeffery will bounce back, and will be a high-end WR2 in fantasy this season. ",
            "9": "The running game for the Eagles was dominated by LeGarrette Blount. He received 14 carries for 46 yards, plus caught a touchdown. Blount is merely a power back who can run over weaker opponents. He is not an explosive play-maker. He, Darren Sproles and Wendell Smallwood will continue to fight for carries, and I would expect Smallwood to get a chance to be the top back at some point this season. ",
            "10": "Defensively, Brandon Graham was a force on Philadelphia's defensive line, and he looked terrific. Graham totaled two sacks, and he will continue to be a major weapon. Elsewhere, the team's top cornerback Ronald Darby looked good before going down with an ankle injury. Darby was carted off midway through the first half. The Eagles cannot afford to lose him, as they are already thin at the position. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "21"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "18"
        },
        "comments": {
            "amount": "4",
            "1": "<i> EDITOR'S NOTE: </i> DeShone Kizer is off to a nice start in his career, at least as someone who is going to screw bettors with back-door touchdowns at the very end of games. Former Browns quarterback Seneca Wallace was the original back-door bandit, so perhaps Cleveland's coaching staff can develop Kizer into becoming Back-Door Bandit 2.0. That would be pretty cool for the Browns, who would finally have something to cheer for. On a more serious note, we'll see if Stephon Tuitt's injury is a major one. Losing him would be huge. ",
            "2": "The Steelers came into Cleveland favored by 8.5 points (closed at 10), but we know when the AFC North matches up, anything can happen. And once again, it almost did. The Steelers got out to a quick lead off a blocked punt recovered for a touchdown, but the Browns' young defense didn't let the game get away from them, as rookie DeShone Kizer ran in a touchdown from one yard out to tie up the game 7-7 going into the second quarter. He and the defense kept the game close throughout, but the young quarterback often held the ball too long, helping a swarming Pittsburgh defense to seven sacks and an interception. Ben Roethlisberger and the Steelers' offense couldn't get much going, as all-world running back Le'Veon Bell was barely used, especially in the first half, and when he was, there wasn't much room for him to run. It's hard to know for sure if Pittsburgh's coaching staff held him back due to his holdout, which lasted until just six days ago, but Cleveland's defense did not give up many holes up front, so the short practice time, the offensive line and the defense likely all contributed to the down game for Bell. There's no doubt though, that Bell will be more in-synch with the offense as he gets more practice reps under his belt. The Steelers' offense didn't really move the ball until Roethlisberger and Antonio Brown started working together late in the first half. Starting from their own 9-yard line, Roethlisberger keyed in on Antonio Brown, who caught three consecutive passes for 80 yards, setting up a 4-yard touchdown pass to Jesse James to give the Steelers a 14-7 lead heading into halftime. Kizer, at the very least, looked like someone who is able to win football games. He showed good escapability and poise while also being knocked down often. He does need to learn that getting out of bounds is something he should do rather than cutting it back inside so he can bypass RGIII's career. If Kizer can learn to throw the ball away and get out of bounds, he has enough ability to keep the Browns in game, like he did today. Cleveland's running game was not nearly as effective as coach Hue Jackson would have liked, as lead back Isaiah Crowell rushed 17 times for just 33 yards. The Steelers are a strong defense, but the Browns should be able to do more damage than that with a good offensive line and Crowell, who looked great when healthy last season. Duke Johnson didn't receive one rushing attempt and ended up catching just two passes as he worked often from the slot. The Browns may need to get him involved as a runner again. The second half didn't pick up that much for the Steelers offensively, but Brown continued his destruction of the Browns' defensive backs and ended up sealing the game with a 36-yard reception in traffic. It was his 11th target of the day, which also made it his 11th reception, which helped him to a whopping 182 yards. Amazingly, his 182 yards on Sunday are just his sixth-best yardage total in his career. The Steelers' second touchdown also came on a short pass from Roethlisberger, and this time it went to Jesse James, again! Sorry fantasy players, James really did rob many of you this week. After James' second touchdown, the Steelers had an 11-point lead late in the third quarter, which looked even bigger when Kizer was intercepted by T.J. Watt on fourth-and-2 on the next possession, but Kizer kept plugging away and managed to bring his team within three points via a three-yard touchdown pass to Corey Coleman, who took a big hit and held onto the ball. Thankfully for the Steelers, Antonio Brown plays for them, and his 38-yard reception on second-and-twelve from the Steelers' 18-yard-line pushed them over the top with a hard-fought win in Cleveland. ",
            "3": "The Steelers move on to host Minnesota next week, where they will face a tougher defense and will need their running game hitting on all cylinders. ",
            "4": "The Browns will head to Baltimore next week to take on yet another division rival and another tough defense. Kizer is going to get his trial by fire, and so far he seems up to the task. <div class=dfpAdSlots> "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Packers",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Seahawks",
            "Points": "9"
        },
        "comments": {
            "amount": "10",
            "1": "<i> EDITOR'S NOTE: </i> The Packers had a nice win, but they have to be concerned about some of the hits Aaron Rodgers was taking at the end of the game. Rodgers was limping around, so Green Bay needs Bryan Bulaga back from injury as soon as possible. ",
            "2": "This game got off to a weird start. Early on, there was a strange play where Seahawks rookie Nazair Jones intercepted a pass and returned it for a touchdown. On the play, there was an illegal block in the back, and Jeremy Lane got tangled up with a Packers player. Lane was ejected for throwing a punch, which nobody really seemed to see. Pete Carroll and the Seahawks were rightfully angry, as they lost one of their important corners for doing virtually nothing. That set the tone for the contest, which became a physical, defensive struggle. Russell Wilson had about as good a game as he possibly could have. His offensive line played very poorly for a majority of the contest, and the unit constantly allowed pressure on the quarterback. The Packers were only able to total three sacks, but part of that was due to Wilson's mobility. If you were to replace Wilson with a non-mobile quarterback, there may have been twice as many sacks. Despite the lack of protection, Wilson was able to make some great throws. In the 2-minute drill at the end of the second half, Wilson found Doug Baldwin down the right sideline on a perfect strike to kick the offense into gear. To that point, the Seahawks had only one first down, but that throw really snapped them out of their funk. Wilson later scrambled for a 29-yard gain on that same drive and worked the team into field goal range. It was a nice drive by the veteran, and one that only he would be able to orchestrate. In the second half, Wilson continued to show a strong arm and threw his receivers open on many occasions. Wilson also knew exactly where to throw the ball to let his receivers go and get it. On one throw in the fourth quarter, Wilson lofted a pass to Paul Richardson that hung up just long enough in the perfect place for the receiver to haul it in. Overall, Wilson ended up going 14-for-27 with 158 yards and a fumble. It wasn't the best stat line but again, it wasn't his fault. Seattle needs to get him some offensive line help, or it is not going to be able to compete in the postseason. ",
            "3": "The Seahawks got a pretty nice performance from their receivers in this contest. Doug Baldwin (4-63) and Paul Richardson (4-59) both looked good on the field. Baldwin was an efficient player as always and ran crisp routes for the team. However, he will be limited in fantasy because of the lack of time Wilson has in the pocket. For that reason, Baldwin is capped as a WR2 most weeks. Meanwhile, Richardson keeps improving with each game he plays. He is worth monitoring for now, but Wilson seems to like throwing to him. Jimmy Graham (3-8) saw seven targets, but really didn't do much. It was a disappointing performance for him, but he will bounce back soon. ",
            "4": "The most impressive member of Seattle's running back corps was rookie Chris Carson. The seventh-round pick out of Oklahoma State put together a very strong performance for the team. He ended up getting six carries for 39 yards and had a nice combination of burst and physicality. On one play in particular, Carson was able to run all the way to the left side and then reverse field all the way to the right to get three yards. He was only able to do this because of his great vision and his ability to make men miss. He is worth monitoring as potential running back depth, but once Thomas Rawls comes back, the backfield will be more crowded. Elsewhere, Eddie Lacy and C.J. Prosise were largely disappointing. Lacy looked very sluggish, and he shouldn't be trusted in fantasy. ",
            "5": "On defense, the Seahawks' defensive line looked very good. Sheldon Richardson, Frank Clark and Michael Bennett look like a fearsome trio, though Bennett was dealing with injury problems during the game. When they are all healthy, Seattle will be able to rack up a great deal of sacks in 2017. ",
            "6": "I don't usually note kickers, but it's nice to see Blair Walsh succeed in his Seattle debut. He went 3-for-3 on field goals, including a 41-yarder. If Walsh has his confidence back, he could be one of the better kickers in the NFL again. ",
            "7": "For the Packers, this was an overall solid performance, but their offensive line was an issue too. Without Bryan Bulaga and the departed T.J. Lang, the unit struggled immensely. Against Seattle's strong defensive line, second-year man Kyle Murphy had real issues at right tackle, and that caused Aaron Rodgers to be under pressure. Still, Rodgers did well enough to help the Packers win the contest. Rodgers, like Wilson, was able to use his mobility to his advantage, but it was in a different way. He moved around the pocket and was able to find open receivers frequently. Things really opened up for Rodgers in the second half. Rodgers continued to show why he is the best quarterback in the NFL, as his mix of arm strength, ball placement, and accuracy was on full display. Against a tough secondary, Rodgers was able to make plays and move the ball at will after halftime. One of his best throws came on a touchdown pass to Jordy Nelson. Rodgers threw the ball just over a Seahawks defender and placed the ball where only Nelson could catch it. He hit Nelson in stride and gave the Packers a lead that they would not relinquish. The 32-yard strike was the best throw of the day by either side. Overall, Rodgers finished 28-for-42 with 311 yards, one touchdown and one interception. He played very well, and has a real chance to improve against weaker competition. He is one of best quarterbacks in football, and could be the top overall quarterback in fantasy. ",
            "8": "Rodgers' favorite receivers on Sunday were Randall Cobb and Jordy Nelson. Cobb was able to produce a lot early in the game. He looked fully healthy for the first time in a couple seasons, and Rodgers threw to him a whopping 13 times. Cobb ended up catching nine balls for 85 yards, and he appears to be Rodgers' second receiver, which will make him a WR2 in fantasy. Meanwhile, Nelson (7-79, 1 TD) looked like his typical self and should be a weapon for the team. Davante Adams (3-47) was the third receiver, but he is probably going to take a back seat to the other two members of the receiving corps. ",
            "9": "Green Bay's running game saw Ty Montgomery featured as the top back. He couldn't get going early on, but in the second half, he looked strong. Montgomery saw 19 attempts for 54 yards and did get a touchdown on a goal-line carry. Montgomery will have issues against bigger opponents, but he will continue to be the only option for the Packers' backfield and his receiving ability (4-39) will make him a good fantasy play. ",
            "10": "Defensively, Mike Daniels was a monster for the Packers. He made plays basically every minute, and ended up with seven tackles and 1.5 sacks during the contest. He would have had more had Wilson not been able to escape the pocket frequently. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Rams",
            "Points": "47"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "9"
        },
        "comments": {
            "amount": "7",
            "1": "Not only did Jared Goff fail to win a single game in his rookie campaign; he also didn't cover a spread. According to metrics, no quarterback this decade was as awful as Goff was in 2016. In fact, no other quarterback was even close. With that in mind, the work that new head coach Sean McVay and quarterbacks coach Greg Olson have put into Goff is amazing. Goff looks like a totally new player. It helps that he has an improved offensive line, but Goff no longer has a deer-in-the-headlights look that he possessed so often last year. Goff still holds the ball too long in the pocket at times, and he has some mechanical issues that need to be worked out - he threw off his back foot on some occasions - but he looks light years better than he did in 2016. Goff finished 21-of-29 for 306 yards and a touchdown. The Rams kept Goff throwing until the very end because they wanted him to eclipse the 300-yard barrier. He managed to do so, and it was a nice moment for him. Granted, he played against what could be the worst defense in the NFL, but this initial victory is a nice building block. ",
            "2": "Goff's favorite target in training camp and the preseason was Cooper Kupp, so it was not a surprise to see the rookie wideout lead the team in receiving yardage. Kupp hauled in four balls for 76 yards and a touchdown. Kupp dropped a pass of about 20 yards, but he made up for it with a terrific reception that he snatched over Quincy Wilson, making a great adjustment. Sammy Watkins, meanwhile, reeled in all five of his targets for 58 yards. ",
            "3": "It was disappointing that Todd Gurley didn't find much running room. Despite the improvements to the offensive line and passing game, Gurley managed just 40 yards and a touchdown on 19 carries. However, he was better as a receiver, catching five balls for 56 yards. ",
            "4": "As for the Colts, there really isn't much to say about them. Their defense sucks, and their offense can't sustain drives without Andrew Luck and Ryan Kelly. Scott Tolzien didn't make it through the afternoon, finishing 9-of-18 for 128 yards and two interceptions. His first pick came on his initial pass attempt, and it was a pick-six that happened to be an underthrown floater. He was replaced at the very end by Jacoby Brissett, who doesn't know the offense yet because he's been on the roster for just eight days. Brissett aired out a 50-yard bomb to Donte Moncrief, but that's all he did. Still, he's way more talented than Tolzien, so the Colts will have to coach him up so that he's prepared for Week 2. ",
            "5": "Moncrief, with his one catch, was second on Indianapolis in receiving yards. He trailed only T.Y. Hilton (3-57). Jack Doyle (2-41) was the only other Colt who caught multiple passes. ",
            "6": "Frank Gore had just 10 carries because the game was so out of hand. He managed to gain 42 yards. Rookie Marlon Mack, meanwhile, registered 24 yards on just as many attempts. He also scored a touchdown, but should've had another. He appeared to reach the end zone in the first quarter, but Chuck Pagano didn't bother challenging for some reason even though the announcers thought it was obvious that he crossed the goal line. ",
            "7": "Even Adam Vinatieri struggled for the Colts. He doinked a short field goal off the left upright, and he also whiffed on an extra point. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "23"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "3"
        },
        "comments": {
            "amount": "7",
            "1": "The 49ers had some reason for optimism heading into this year. Not that they'd make the playoffs, but that they'd be more competitive than they were in 2016. That centered around Reuben Foster, who looked like he could become Defensive Rookie of the Year. Unfortunately for the 49ers, Foster suffered a leg injury in the first half and had to be carted into the locker room. He didn't return to action. With Ward out, the Panthers had some success moving the chains; this was a scoreless affair prior to the injury. Cam Newton definitely did not look like himself. His passes were all over the place, throwing high and wide on too many occasions. He was nearly picked in the opening quarter, but Foster dropped the ball. He was actually intercepted just prior to halftime, as Jaquiski Tartt made an acrobatic pick on an underthrown ball. This was a rare occurrence of Tartt making a positive play, as the backup safety, playing for Jimmie Ward, was beaten on numerous occasions. He also committed a dumb penalty. Tartt's incompetence allowed Newton to be functional, whereas better safety play would've crushed Carolina's offense. Newton, who went 14-of-25 for 171 yards, two touchdowns and a pick, definitely did not look like himself. On one sequence, he threw behind Christian McCaffrey, missed a wide-open Ed Dickson for a touchdown (the announcer responded by saying, mercy, mercy) and then overthrew Kelvin Benjamin. ",
            "2": "The Panthers gave Jonathan Stewart and McCaffrey the exact same amount of touches (20). Stewart gained 65 yards on 18 carries and also caught two balls for 17 yards and a touchdown. McCaffrey was predictably more involved as a receiver. His 13 carries went for 47 yards, but he hauled in five of his seven targets for 38 receiving yards. ",
            "3": "Thanks to Newton's struggles, only one Panther logged more than McCaffrey's 38 yards. That was Russell Shepard (2-53), who snatched one of Newton's two touchdowns. Benjamin saw five targets, but managed to grab just one pass for 25 yards. Newton's inaccuracy killed what should've been a good matchup. ",
            "4": "As bad as Carolina's offense was, San Francisco's was far worse. Kyle Shanahan, who had a horrendous debut, had Brian Hoyer throw the ball 35 times. Hoyer went 24-of-35 for 193 yards, an interception and a lost fumble. The pick was a result of Hoyer not seeing Luke Kuechly at all. Hoyer's poor performance wasn't all his fault, as his offensive line really struggled to pass protect. Also, Hoyer should've thrown a touchdown, but Marquise Goodwin dropped a deep reception. ",
            "5": "Amazingly, Carlos Hyde ran the ball only nine times, gaining 45 yards in the process. The game was never really out of hand for the 49ers until midway through the third quarter. Hyde also had six catches for 32 yards. ",
            "6": "Pierre Garcon was the only receiver who logged more than 32 yards, as he caught six balls for 81 yards. George Kittle had a nice debut, getting five receptions for 27 yards. ",
            "7": "I mentioned that Shanahan had a dubious start to his head-coaching career. He made two sketchy decisions in the second quarter, going for it twice on fourth-and-short near midfield. The 49ers failed both times. The second play was especially poor, as it was a slow-developing run by Kyle Juszczyk. Shanahan also failed to call timeout as the clock was running down on a fourth-and-1 in the second half. It was not a promising beginning for him in San Francisco. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cowboys",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "3"
        },
        "comments": {
            "amount": "8",
            "1": "Given how the point spread jumped prior to kickoff in the wake of Odell Beckham's announced absence, most people didn't expect the Giants to have much of a chance without their star receiver. That turned out to be the case, though I'm not sure Beckham's presence would've allowed New York to prevail. The Giants couldn't pass protect at all despite battling a Dallas defense missing its top defensive lineman. Eli Manning was constantly under siege, and many of his throws were inaccurate as a result. Beckham obviously would've helped, but the pressure was too much for the aging quarterback to handle. Manning finished 29-of-38 for 221 yards and an interception, but most of his yardage came in garbage time once the Cowboys took their foot off the gas. Manning had just 33 yards by halftime, and the Giants as a whole didn't achieve a first down until the 11:49 mark of the second quarter. Manning's pick wasn't really his fault, as his team was way down already and he just tried to make something happen. ",
            "2": "Brandon Marshall was the team's supposed No. 1 receiver with Beckham out, but he didn't catch a single pass until there were 13 seconds remaining in the game. Manning threw behind Marshall on a couple of occasions, but this type of output couldn't have been surprising. Marshall looked done last year, so I didn't understand all the hoopla surrounding his acquisition. That was one of the most overhyped things of the offseason. ",
            "3": "With Marshall struggling, Roger Lewis led the Giants in receiving (4-54), while Shane Vereen (9-51) was next. Evan Engram had four receptions for 44 yards in his NFL debut. His production should increase going forward. ",
            "4": "The Giants predictably couldn't run the ball, thanks again to their offensive line. Paul Perkins mustered only 16 yards on seven tries. ",
            "5": "Given that Ezekiel Elliott was on the field, the Cowboys were expected to have much more success rushing the ball. That, of course, turned out to be the case. Elliott struggled to find room early, but beginning in the second quarter, he began dominating the game. He carried defenders, as the Giants started looking defeated. Elliott ultimately finished with 104 yards on 24 carries to go along with five catches for 36 receiving yards. He should be able to post better numbers in the future, as Snacks Harrison won't be around to win a matchup against Travis Frederick. ",
            "6": "Dak Prescott didn't have the best debut. He went 24-of-39 for 268 yards and a touchdown, but he was off the mark more than he usually was last year. A reason for this is because he saw more pressure than he's been used to. It's difficult to say if this was because of the Giants' great pass rush or the departure of Ronald Leary, but I suppose we'll find out in the coming weeks. Prescott had some errant throws, especially in the opening half. He whiffed on three tries in the red zone when the Cowboy fans were chanting Zeeeke! and then he threw behind Jason Witten on one occasion. ",
            "7": "Dallas' leading receiver was neither Dez Bryant nor Witten. Terrance Williams hauled in six balls for 68 yards even though he missed some action with a minor injury. Bryant was bottled up by Janoris Jenkins, managing just two receptions on nine targets for 43 yards. Bryant drew a pass interference on Jenkins, but the call was pretty bogus. Witten (7-59) caught Prescott's sole touchdown. ",
            "8": "Cole Beasley registered three catches for 32 yards. He's worth mentioning because he may have made the catch of the year. Beasley caught a double-tipped pass by stretching his arm behind his head and pinning the ball behind the back of his jersey. If you somehow haven't seen it, make sure you look it up. It was ridiculous. <div class=dfpAdSlots> "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "19"
        },
        "comments": {
            "amount": "6",
            "1": "Drew Brees has generally enjoyed great protection over the years in New Orleans, and he has fully taken advantage of it. Conversely, Sam Bradford struggled last year because he was constantly under duress. The blocking conditions appear to have flipped, however, if this game is any indication. Brees' protection was very poor in this contest, mainly because he lost right tackle Zach Strief to an injury in the second quarter. Strief's absence was absolutely huge, as backup Senio Kelemete, the fourth tackle on the depth chart with Terron Armstead also out, struggled mightily against Danielle Hunter. Meanwhile, rookie left tackle Ryan Ramczyk wasn't horrible, but he had issues blocking Everson Griffen. Brees, as a result, was pressured frequently and couldn't go downfield very often. As for Bradford, he had all the time he could ever want on most of his drop-backs. It's unclear if this was because of New Orleans' atrocious defense, or if it's because of the new blockers, but Bradford's only issues up front came on the right side with Mike Remmers. Bradford, who spent most of his 2016 campaign checking down, took countless shots downfield, torching the Saints' beleaguered secondary. The end result of this was Bradford thoroughly outplaying Brees. Bradford finished 27-of-32 for 346 yards and three touchdowns, and two of his misfires were dropped. Yes, those were Bradford's real figures, and his YPA was greater than 10. He was incredible. Brees, meanwhile, was 27-of-37 for 291 yards and a touchdown, but those numbers were bogus, as most of them came in garbage time. Brees had just 71 yards at halftime, and he nearly threw an interception. He also really struggled in the red zone, mimicking how Bradford performed last year. ",
            "2": "The other storyline surrounding this game was Adrian Peterson's return to his old stomping grounds. Peterson opened the game with an angry carry, pushing defenders forward for nine yards. However, Peterson would be given just five more attempts after that, finishing with only 18 yards on six totes. Peterson was seldom used, and he gave Sean Payton plenty of angry looks on the sideline. At one point, Peterson and Payton had some sort of a shouting match. I'd say that this sort of dissension would hurt the Saints, but given the state of their offensive line, I'd say they're already in plenty of trouble. This team doesn't look like it's going to win six games this year. Peterson watched on as Dalvin Cook handled most of the workload for his former team. Cook was solid behind an improved offensive line, tallying 127 yards on 22 carries. He also caught three passes. His only blemish was a drop in the red zone that forced Minnesota into a field goal. It's still inexplicable that Cook fell to the second round of the 2017 NFL Draft, all because of poor metrics. I think metrics aren't important, but they shouldn't drop an incredibly skilled player an entire round, so perhaps this is a lesson to be learned. ",
            "3": "As for the Saints' other runners, rookie Alvin Kamara and Mark Ingram tied for the team lead with 11 touches. Both Kamara (7-18) and Ingram (6-17) struggled to run the ball, but they were much more successful as receivers. Ingram caught five balls for 54 receiving yards, though three of those receptions came on the final drive. Kamara (4 catches, 20 yards) looked like he best fit what the Saints are trying to do. ",
            "4": "Ingram ended up leading the Saints in receiving, as Michael Thomas (5-45) and Ted Ginn (4-53) posted mediocre numbers because of the pressure Brees dealt with. Conversely, Minnesota's top two receivers stuffed the stat sheet. Adam Thielen made nine grabs for 157 yards, while Stefon Diggs snared seven receptions for 93 yards and two touchdowns. Kyle Rudolph (3-26) secured Bradford's third touchdown. ",
            "5": "I thought Sean Payton had an awful performance. His play-calling was terribly predictable; his team ran the ball almost every single time Peterson was on the field. Payton also gave the Vikings a free touchdown right before halftime, calling two timeouts when it wasn't clear if Minnesota could convert a first down deep in its own territory. Payton also made very poor decisions in the red zone, whether it was running the ball too frequently or kicking a field goal late in the third quarter when a touchdown was needed. Payton was once known as one of the top coaches in the NFL, but it's fair to wonder if, as with Jeff Fisher, the game has passed him by. ",
            "6": "ESPN's pre-game show predictably worsened in the wake of Chris Berman's retirement. There's no reason for the <i>Monday Night Football</i> telecast to decline either. It started well, as Hank Williams returned to sing his iconic tune, but both announcers made plenty of mistakes. The bald play-by-play guy whose name I can never remember said it was fourth down when it was really second down. Jon Gruden then wondered if a face mask penalty would be five or 15 yards when the NFL had abolished the 5-yard face mask infraction years ago. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "One of these teams showed off a solid, multi-dimensional offense in this game that wasn't stopped very often, featuring a quarterback who made quick decisions and limited his mistakes. That was not the Chargers and Philip Rivers. The Broncos came into the season with a seemingly lackluster signal-caller and a very questionable offensive line. They would be tested against a Charger defense that was quite potent last year, but they passed with flying colors. In meaningful action, they averaged more than five yards per play and doubled up the Chargers in total yardage. Trevor Siemian made just one error - a near-pick-six by Casey Hayward - but he thrived otherwise. He did a great job of connecting on precise throws, all while beating the Chargers with his legs on numerous occasions. He even juked Joey Bosa on a touchdown run. Things fell apart a bit late for the Broncos. There was a fluky interception where a Charger broke up a screen, and the ball bounced off a player's foot. Siemian was then sacked twice to crush a field goal attempt. However, Siemian had a positive night overall, going 17-of-28 for 219 yards, two touchdowns and the weird interception. Siemian could've been picked another time, as mentioned, but he did a good job managing the offense. He drew Bosa offside on a touchdown throw, and he even hit Virgil Green for a 44-yard strike late in the fourth quarter to potentially set up a field goal when the Chargers expected the Broncos to chew up the clock. ",
            "2": "Meanwhile, Philip Rivers, the superior quarterback entering this contest, could do nothing until late in the game. Despite the Broncos losing numerous players to injury and offseason departures - not to mention Wade Phillips - Denver's defense completely stymied Rivers. The veteran finished 22-of-33 for 192 yards, three touchdowns and a pick. However, Rivers was just 12-of-18 for 89 yards, one touchdown and an interception at the 10:37 mark of the fourth quarter (i.e. before garbage time). He didn't have many opportunities because the Broncos controlled the clock, holding the ball for 29 of the first 49 minutes, as they converted eight of their first 13 third downs. Part of that reason was Rivers failing to move the chains, save for one drive in the opening quarter. ",
            "3": "C.J. Anderson gained 81 yards on 20 carries. It was shocking not to see him handling all of the late-game work. On their penultimate drive, the Broncos gave the ball to Jamaal Charles, who had the ball ripped out of his hands to set up a Charger touchdown. Charles tallied 40 yards on 10 tries. ",
            "4": "Neither Denver receiver posted acceptable fantasy numbers. Demaryius Thomas hauled in five passes for 67 yards, but had a bad drop. This caused Rex Ryan to remark that Thomas never drops the ball, which is simply untrue because Thomas did a lot of that last year. Emmanuel Sanders snatched three balls for 26 yards. Twenty came on one play where he impressively reversed field. ",
            "5": "As for the Chargers' skill-position players, Melvin Gordon didn't have much success on the ground outside of a 21-yard burst. He managed 54 yards on 18 carries, and he was stuffed for a huge loss on a fourth down. However, he made up for it with five catches for 25 receiving yards and a touchdown. ",
            "6": "Tyrell Williams led the Chargers in receiving yardage (5-54). Travis Benjamin (3-43) and Keenan Allen (5-35) both scored. Allen drew a long pass interference on Bradley Roby, but was a disappointment overall. He dropped two balls, including one on third down, and was flagged for taunting after he scored his touchdown. Allen was seen laughing on the sidelines afterward, as his defense started in bad field position as a result of his foolishness. ",
            "7": "Anthony Lynn made his head-coaching debut in this game, and it was quite the stinker. Lynn inexplicably challenged an Allen reception in the first half even though Allen told him the pass was incomplete. Later, Lynn wasted a timeout on a desperation fourth down in the final quarter. This allowed the Broncos to get set, and they read the predictable play beautifully. With the timeout, Lynn's staff came up with the brilliant idea to run Gordon up the middle. That failed horribly, as linebacker Todd Davis exploded into the backfield to stuff Gordon for a loss. All of this paled in comparison to the final drive, where Lynn had some of the worst clock management in NFL history. The Chargers wasted so much time and looked extremely confused. It was horrible, and it forced a rookie kicker into a long field goal, which was blocked. ",
            "8": "As bad as Lynn's night was, it wasn't nearly as horrible as Sergio Dipp's. If you somehow missed it, ESPN's budget cuts have forced someone named Sergio Dipp into a sideline reporter role. The result was, well, I'll let you watch: <iframe allowfullscreen= frameborder=0 height=315 src=https://www.youtube.com/embed/9F0f013sLIo width=560></iframe> <div class=dfpAdSlots> <div id=comments><span style=font-weight:bold; font-size:16pt;>LOADING COMMENTS...</span> "
        }
    },
    "numberOfGames": "15"
}