{
    "year": "2017",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Texans",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "Both of these teams have incredibly tough matchups next week (Texans at Patriots; Bengals at Packers), so a victory here was needed to avoid a sure 0-3 start. The Texans prevailed, while the Bengals became the first team in NFL history to play its first two games of the season at home without scoring a touchdown since the 1939 Philadelphia Eagles. It's no surprise that Cincinnati is struggling so much offensively. The team lost its two top offensive linemen, Andrew Whitworth and Kevin Zeitler, to free agency this offseason. As a result, they have what could be the worst blocking unit in the NFL. Andy Dalton didn't have many opportunities behind a horrific offensive line, so the Bengals had to adjust by making him release the ball much more quickly. This only helped marginally, as the Bengals accumulated 143 net yards in the second half. Dalton finished 20-of-35 for 224 yards. The numbers don't look terrible, but that adjective is exactly how I would describe the Bengal quarterback. Dalton was under duress quite a bit, but he had some chances to hit throws, and his inaccuracy killed him. Dalton had open receivers for big gains on a few occasions, but misfired very poorly. The awful line play is the primary culprit for Cincinnati, but Dalton is the clear No. 2 on the blame list. ",
            "2": "Deshaun Watson, meanwhile, had similar problems. Because of Duane Brown's holdout, Watson was pressured very frequently. Like Dalton, Watson didn't take advantage of the few opportunities he had, at least early in the game. Watson missed a wide-open Braxton Miller when Pacman Jones slipped in coverage, and then he had a pick-six that was dropped. Watson then held on to the ball too long on one occasion, and was absolutely flattened by Geno Atkins. I was wondering if Watkins had suffered a concussion, but he scampered for a brilliant 49-yard touchdown immediately afterward. It was a breath-taking play that had the announcers comparing it to Michael Jordon's athletic ability, referencing what Watson's college coach said of him. Watson's second half was nondescript until the penultimate offensive drive. Bill O'Brien suddenly had trust in Watson even though the Texans were pinned in their own territory. Rather than trying to run out the clock, O'Brien had Watson drop back to pass repeatedly, and it paid off big time. Watson had some clutch completions to DeAndre Hopkins, setting up a field goal to ice the victory. Watson was 4-of-6 for 31 yards with an 11-yard scramble on that possession, allowing Houston to kick a 42-yard field goal to go up four. Watson, who went 15-of-24 for 125 yards, led the team in rushing, gaining 67 yards and a touchdown on five scrambles. Lamar Miller (18-61) and D'Onta Foreman (12-40) struggled to find running room, so they'll also benefit whenever Brown returns to action. ",
            "3": "Despite being paired with a rookie quarterback who doesn't get protection, DeAndre Hopkins had a solid stat line, catching seven balls for 73 yards. Hopkins also drew two pass interference flags, meaning he has five in total through two games this season. ",
            "4": "The Texans came into this game with numerous injuries, and they added more to that list. They lost two cornerbacks, Johnathan Joseph and Kevin Johnson to shoulder and knee problems, respectively. This is the last thing Houston needed with an impending battle against the Patriots. ",
            "5": "The other stud receiver in this game, A.J. Green, hauled in five balls for 67 yards. Like Hopkins, he's suffering from the offensive line's poor play as well. The difference is that he's paired with a veteran signal-caller. Dalton really needs to step up because he's playing like crap. Elsewhere, Tyler Eifert also had a disappointing stat line with three grabs for 42 yards. Eifert appeared to score a touchdown, but he stepped out of bounds, so there was an illegal touching penalty. Eifert was knocked out of the game in the second half with some sort of injury. As for John Ross, he didn't catch a pass in his debut, and he also fumbled on his only touch. ",
            "6": "The silver lining for the Bengals is that Marvin Lewis finally appears to be transitioning toward Joe Mixon. The rookie runner seemed to get the majority of the workload toward the end of the game. He finished with the most carries on Cincinnati, as his nine attempts went for 36 yards. Mixon, who made J.J. Watt miss on an impressive 7-yard burst, was much better than Jeremy Hill (6-17) and Giovani Bernard (5-10), both of whom were stuffed on short-yardage opportunities, though Hill converted a try on the next play with an impressive leap. Bernard (2 catches, 16 rec. yards) dropped a pass. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "10"
        },
        "comments": {
            "amount": "7",
            "1": "The Ravens improved to 2-0 by defeating the Browns, but there's a dark cloud over the victory, which was the injury to Marshal Yanda. The All-Pro guard suffered an ankle injury and was ruled out very quickly. It was later revealed that Yanda has a fractured ankle, and he's out for the season. This is a devastating injury that will end any chance the Ravens had of making a deep playoff push. Yanda is one of the top linemen in the NFL, and he's irreplaceable. If there's a silver lining, it's that Joe Flacco was much better than he was last week. Flacco was 25-of-34 for 217 yards, two touchdowns and an interception. The pick wasn't even completely his fault, as he and Mike Wallace (1 catch, 7 yards) weren't on the same page on a downfield attempt. Flacco's only real mistake was taking an early sack to move out of field goal range. ",
            "2": "Flacco's top target was Ben Watson, who hauled in all eight balls thrown his way for 91 yards. Meanwhile, Flacco's scores went to Jeremy Maclin (4-31) and Buck Allen (5-35). Maclin hurt his shoulder after a 19-yard reception on the opening drive, but missed only one possession. ",
            "3": "Speaking of Buck Allen, he led the Ravens with 66 rushing yards on 14 carries. However, it was Alex Collins (7-42) who handled the late-game work, though he did fumble to give the Browns a chance to cover. Terrance West (8-22) struggled again, but scored. ",
            "4": "As for the Browns, DeShone Kizer had an epically horrid day. Kizer failed to complete half of his passes and was responsible for four turnovers. He also missed about two quarters with a migraine. Curiously, Kizer was inserted back into the game, and he was awful afterward. He was flagged for a delay-of-game penalty right away, then telegraphed an interception in the end zone. Kizer forced another pass that was picked off a bit later. Kizer ended up 15-of-31 for 182 yards, three picks and a lost fumble because he held the ball way too long in the pocket. There's going to be some question as to why Kizer was able to reenter the game. Kizer had a migraine, so weren't there concussion-related issues? It's not like this was a crucial game for the Browns, anyway. Why endanger Kizer? Besides, it's not like Kevin Hogan was much worse. Hogan was 5-of-11 for 118 yards, one touchdown and a ridiculous interception thrown into triple coverage that set up the Ravens with a touchdown just before halftime. ",
            "5": "Adding injury to insult, Corey Coleman, who caught just one pass for nine yards, reportedly broke his hand. His absence shouldn't keep the Browns from moving on from the lethargic Kenny Britt. The former Ram had as many receptions (1) as offensive pass interferences. He sucks, so it was nice that Rashard Higgins was the team's leading receiver with seven grabs for 95 yards. Rookie David Njoku (3-27) caught a touchdown. ",
            "6": "The catch of the day came from Duke Johnson, who had three grabs for 59 yards. A 34-yarder came on a one-handed reception on a pass thrown behind him. On the flip side, however, Kizer's sole interception pre-migraine/concussion came because Johnson had the ball pop out of his hands. ",
            "7": "Isaiah Crowell mustered 37 yards on 10 carries. Excluding a 17-yard burst in garbage time, Crowell had just nine attempts for 20 yards. He's been a huge disappointment considering the talent he happens to be running behind. "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "9"
        },
        "Team 2": {
            "Name": "Bills",
            "Points": "3"
        },
        "comments": {
            "amount": "6",
            "1": "The Panthers might be 2-0, but they definitely haven't been very impressive thus far. They've managed to beat the 49ers, who lost their best defensive player when the game was still scoreless, and then the Bills at home by only six points. There have been two problems with a third emerging issue: Cam Newton's accuracy and his pass protection, and now Greg Olsen's broken foot. Olsen hurt his foot on a non-contact injury and was seen on the sidelines on crutches and in a walking boot. Olsen could be out for a while, which is obviously disastrous, as he is Newton's trusted safety valve. Olsen caught only one pass for 10 yards. Meanwhile, Newton's throws were all over the place in the opener, and that was the case again in this contest. Newton was 20-of-32 for 228 yards. He managed to convert some first downs with his legs - five scrambles, 27 rushing yards - but the Panthers could've won by much more had Newton been more precise. For example, he had a wide-open Christian McCaffrey in the end zone for a short score, but floated the ball over his head. Perhaps the pass rush affected Newton more than his previous injury. Carolina still can't block, and that was apparent when the Bills racked up half-a-dozen sacks. The sixth appeared to injure Newton, who was down on the ground for a while. He walked gingerly off the field, but was able to return to the field. Newton is not going to last all 16 games if he keeps facing this sort of pressure. The important thing to note is that it could've even been worse for Carolina's offensive line, as Marcell Dareus and Kyle Williams were knocked out of the game at various points during the afternoon. ",
            "2": "Newton's top receiver was Kelvin Benjamin, who caught six passes for 77 yards. Benjamin nearly scored a touchdown on the opening drive, but safety Jordan Poyer hit him hard and dislodged the ball. Devin Funchess (4-68) will have to be a bigger factor if Olsen is out for a while. ",
            "3": "Christian McCaffrey will have to step up as well. McCaffrey caught four passes for 34 yards, but he also would've scored a touchdown had Newton not missed him in the flat. McCaffrey didn't do much as a runner, however (8-10), as Jonathan Stewart outgained him (15-40). ",
            "4": "The Panthers are 2-0 because of their defense, which absolutely dominated the trenches. The Bills couldn't block, as Tyrod Taylor had no time in the pocket, while LeSean McCoy couldn't find any running room. This was apparent throughout the afternoon, especially on two occasions. McCoy was given a carry on a fourth-and-1 in the third quarter, but was tackled in the backfield. Later, McCoy took a loss of seven and appeared to have hurt his wrist, though he reentered the game. McCoy, as a result, couldn't even average one yard per carry. His 12 attempts went for only nine yards, though he did help his PPR owners with six grabs for 34 receiving yards. ",
            "5": "Taylor, meanwhile, was 17-of-25 for 125 yards, but had just 15 yards prior to intermission. In fact, the Bills had only one first down in the opening half. Most of Buffalo's offense came via Taylor's legs, as he burst for 55 yards on eight scrambles. Still, Taylor had a chance late, as Sean McDermott eschewed a field goal on a fourth-and-11 on the Carolina 33 with 14 seconds remaining. Taylor lofted a deep pass to Zay Jones, but it was an inaccurate throw that fell incomplete. ",
            "6": "McCoy led the Bills in receiving yards, just outgaining Jordan Matthews (3-30). Jones once again barely did anything (2-18). None of these receivers are worth owning in 12-team leagues. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "13"
        },
        "comments": {
            "amount": "6",
            "1": "The Cardinals may have temporarily saved their season with an overtime victory against the Colts, but they're certainly in big trouble if their offensive line doesn't improve. Indianapolis, which shouldn't have any sort of pass rush to speak of, managed to dominate an Arizona front missing Mike Iupati and D.J. Humphries. The result was four sacks, many other pressures, and numerous inaccurate passes by Carson Palmer. It was apparent that Arizona wouldn't be able to score very much on the opening drive. Palmer was sacked by John Simon on the second play of the game and then hit on his third-down throw. Palmer was nearly picked on the second drive, then failed on a horrible fourth-and-1 fade. Later in the second quarter, Palmer was intercepted with a throw into double coverage. Palmer was able to take advantage of Indianapolis' poor defensive players late in the game to finish 19-of-36 for 332 yards, one touchdown and the aforementioned pick. The comeback from down 13-3 was nice, but Palmer struggled to beat the worst defense in the NFL - a unit that surrendered 300 yards to Jared Goff in Week 1. His accuracy was dreadful for most of the afternoon. ",
            "2": "The Colts were able to swarm Palmer because the Cardinals had no threats out of the backfield. With David Johnson out, Chris Johnson (11-44) and Kerwynn Williams (9-22) split the workload, though Johnson was given way more touches in the second half. ",
            "3": "Larry Fitzgerald was a big-time disappointment for his fantasy owners, as he caught just three passes for 21 yards despite Indianapolis missing its top corner. Arizona's most productive receivers were J.J. Nelson (5-120, TD) and Jaron Brown (4-73). ",
            "4": "As for the Colts, Jacoby Brissett was better than Scott Tolzien, but only by default. Brissett converted some third-down opportunities, but most of that happened to be his skill-position players doing most of the work. He also didn't throw an interception in regulation, which was nice. Unfortunately for Brissett, his first pass in overtime was intercepted by Tyrann Mathieu, which set up a short field goal for Phil Dawson. ",
            "5": "Brissett's favorite target appears to be Jack Doyle. The tight end snatched all eight of his targets for 79 yards. T.Y. Hilton (4-49) and Kamar Aiken (3-31) were next on the stat sheet, while Donte Moncrief (2-18) couldn't do much despite having eight balls thrown his way. Moncrief didn't appear to be trying very hard, frankly. ",
            "6": "Frank Gore didn't have much room to run, as he mustered only 46 yards on 14 carries, though he scored Indianapolis' only touchdown. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Titans",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "The Titans lost at home last week, while the Jaguars celebrated a blowout victory on the road. And yet, Tennessee was favored heading into this contest because it was apparent that it was the better team than Jacksonville. That turned out to be the case, as the Titans demolished their AFC South rival. The Tennessee offense struggled for half the afternoon, but the defense was dominant throughout. The front hounded Blake Bortles behind his poor offensive line. They strip-sacked him in the opening half, then intercepted him twice in meaningful action. Don't be fooled by Blake Bortles' final numbers - 20-of-34, 223 yards, one touchdown in addition to the two picks - as a chunk of that came in garbage time, which is the only point in the game in which he can play well. By the end of the third quarter, Bortles was just 11-of-23 for 89 yards and the two interceptions. The Titans sacked him only twice, but they swarmed the backfield and disrupted Jacksonville's offense when this game still was in question. ",
            "2": "Meanwhile, Tennessee's offense took a while to get going. Marcus Mariota was just 9-of-18 for 80 yards and an interception in the opening half, and he threw an interception right outside of the red zone, at the Jacksonville 24. The throw was inexplicable, as Mariota unnecessarily forced it into tight coverage. However, the scoring unit generated 256 yards in the second half (as opposed to 134 beforehand), and Mariota was 6-of-9 for 135 yards and a touchdown following the break. Overall, he was 15-of-27 for 215 yards, one score and the aforementioned pick to go along with six scrambles for 24 rush yards. ",
            "3": "DeMarco Murray didn't see much action in the second half, getting just two carries. He managed only 25 yards on nine attempts. Derrick Henry did all the damage late in the game, pounding for 92 yards and a touchdown on 14 attempts. His score came via a tremendous block by Ben Jones on Telvin Smith. Henry appears to be the better runner right now, so the Titans should continue to give him more opportunities. ",
            "4": "Delanie Walker led the Titans in receiving, catching all four of his targets for 61 yards. Rishard Matthews (3-43) was next, while Eric Decker (3-32) struggled again. Corey Davis, who caught only one pass for four yards, left the game with a hamstring injury. ",
            "5": "Going back to the Jaguars, Leonard Fournette scored a late touchdown to save his fantasy owners, as he did nothing otherwise. Fournette managed just 40 yards on 14 carries, as his offensive line couldn't open anything up for him against Tennessee's stout front. ",
            "6": "Allen Hurns racked up some serious garbage-time stats. He caught six passes for 82 yards and a touchdown. Don't expect this to continue unless the Jaguars are trailing by double digits; Hurns didn't even have a reception with two minutes remaining in the third quarter! "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "The Chiefs dominated the Patriots in the second half of the season opener, but they had an unexpected challenge on their hands with the Eagles coming into Arrowhead. Philadelphia went toe-to-toe with Kansas City, even leading in the third quarter. It seemed like the Eagles might be able to pull off the upset to make a huge statement, but they made too many mistakes, costing themselves a potential victory. The errors Philadelphia committed were prevalent throughout the afternoon. They began early when Torrey Smith dropped a couple of passes, one of which occurred in the end zone. Darren Sproles then fumbled a punt return, setting up a field goal for the Chiefs. Speaking of field goals, Jake Elliott missed a 30-yard kick. The worst mistake came late, when Carson Wentz threw a weird interception that deflected off a helmet. This set up the Chiefs with a short field, and they were able to score a quick touchdown to ice the game. ",
            "2": "Still, all the credit should go to the Chiefs, as they were able to produce 27 points against a fierce Philadelphia defense. The Eagles swarmed Alex Smith in the pocket, disrupting plenty of drives. However, Smith made the most of the opportunities he was given on occasion, going 21-of-28 for 251 yards and a touchdown. Smith's best play was when he inexplicably escaped a Vinny Curry sack to scramble for a first down. His four rushing attempts went for 21 yards. ",
            "3": "Smith's sole score went to Travis Kelce, who hauled in eight of his 10 targets for 103 yards and a touchdown. Kelce was amazing, seemingly hurdling every Philadelphia defender he could find throughout the afternoon. The numbers would've been surprising prior to the game, given that the Eagles defended tight ends so well last year and were able to shut down Jordan Reed in Week 1. However, the Eagles lost several defensive players throughout the afternoon, including Rodney McLeod. Elsewhere in Kansas City's receiving corps, Chris Conley and Tyreek Hill each caught four balls for 55 and 43 yards, respectively. ",
            "4": "Kansas City's big star, aside from Kelce, was Kareem Hunt once again. Hunt couldn't get anything going in the opening half - five carries, eight yards - but he finished with 81 yards and two touchdowns on just 13 attempts, thanks to a 53-yard burst. Hunt also snatched three receptions for 28 receiving yards. ",
            "5": "The dark cloud over this victory is Mitch Morse's injury. Morse hurt his foot in the second half, but it's unclear how severe it is. Losing Morse would be enormous going forward, but perhaps he won't be out for long. ",
            "6": "Going back to the Eagles, Wentz went 25-of-46 for 333 yards, two touchdowns and the aforementioned interception. Wentz played well for the most part, but Philadelphia's offense bogged down in Kansas City territory on numerous occasions. It didn't help Wentz that several of his passes were dropped, including one potential touchdown. ",
            "7": "Wentz led the Eagles in rushing with 55 yards on four scrambles. Darren Sproles (10-48) was next, followed by Wendell Smallwood (3-4). If you're wondering where LeGarrette Blount was, he wasn't given a single carry. He touched the ball once, catching a pass for zero yards. Blount isn't a good running back, but he does one thing very well. It's unclear why the Eagles aren't giving him any chances in short yardage. ",
            "8": "As with the Chiefs, Philadelphia's top gainer in the passing game was the tight end. Zach Ertz caught five balls for 97 yards, though 53 of those yards came on a very weird play in which the ball bounced out of Terrance Mitchell's hands. It didn't even look like Mitchell knew where the ball was. Elsewhere, Alshon Jeffery recorded seven catches for 92 yards and a touchdown. Torrey Smith overcame his early drops to catch four balls for 66 yards. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "36"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "20"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: Vegas took a big hit on this game even though there was a ton of sharp action on the host. However, the lesson, as always, is never to bet against the Patriots if Bill Belichick and Tom Brady are pissed off. ",
            "2": "This could easily have been the last time these two great quarterbacks play against each other with Tom Brady at 40 and Drew Brees at 38 years old. Then again, both future Hall of Famers are still playing so well that it is possible they will battle each other again in four years. The Patriots got themselves righted as Brady dominated the Saints' vulnerable defense. Brees moved the ball well at times, but New England's defense bounced back after the Week 1 disappointment, limiting the Saints enough. It was the fourth straight season that New Orleans has started 0-2, and the Saints' defense once again looks incapable of supporting the offense with just average play. ",
            "3": "The Patriots took the opening kickoff and marched down the field. Brady had a clutch third-and-long conversion to Rob Gronkowski before lofting in a pretty 19-yard touchdown to Rex Burkhead (3-41-1 receiving), who got past rookie linebacker Alex Anzalone. The Saints responded with a field goal drive led by some passing from Brees. Brady got New England on the move with a screen to Burkhead for 15 yards and then found Gronkowski, who got eventual separation from Anzalone. After hauling the pass in, Gronkowski broke a tackle and raced down the field for a 53-yard touchdown. Brady kept ripping the ball down the field using Gronkowski and Phillip Dorsett before lofting in an easy touchdown pass to Chris Hogan (5-78-1). New Orleans got moving with Alvin Kamara (3-51) making a leaping reception for 38 yards. Adrian Peterson then ran hard on two carries for a another first down before Brees found Brandon Coleman (4-82-1) open for a short touchdown pass. The Saints got the ball back, and a 42-yard pass to Coleman set up a field goal to cut New England's lead to 20-13. Brady responded with a drive using Gronkowski, Hogan and Brandin Cooks (2-37) to set up a short touchdown run for Mike Gillislee. New England tacked on a field goal drive to make it 30-13 at the half with Brady totaling 302 yards passing through two quarters. ",
            "4": "Brady dominated New Orleans' defense, completing 30-of-39 passes for 447 yards and three touchdowns. Gronkowski had six receptions for 116 yards and a touchdown. In the third quarter, however, he left the game with trainers as it looked like he injured his back, but it was said to be a groin injury. His durability has been problematic, so this was a bad omen for the Patriots and his fantasy owners. ",
            "5": "Mike Gillislee ran for 69 yards with one touchdown on 18 carries. ",
            "6": "Drew Brees completed 27-of-45 passes for 356 yards with two touchdowns and zero interceptions. ",
            "7": "Adrian Peterson (8-26) and Mark Ingram (8-52) were non-factors, as Ingram had 28 of his yards on the final play of the game. Sean Payton had a bad game plan, as he had no commitment to the run. New Orleans only hope against New England was to control the ball with a rushing attack to keep the Saints' vulnerable defense on the sideline and reduce the possessions for Brady and the Patriots. Instead, Payton quickly abandoned the run and aired the ball out. ",
            "8": "Michael Thomas led the Saints with five receptions for 89 yards. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "26"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "9"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: Does anyone understand what happened with Sam Bradford? Seriously, how does someone go from being completely healthy to missing a game out of nowhere? Only Bradford could do this. ",
            "2": "The Vikings came into this game riding high after carving up the New Orleans Saints in Week 1 behind the arm of Sam Bradford. Unfortunately, Bradford had been limited in practice with a left knee injury and ended up being unable to play. That left Case Keenum to take the helm, which was no doubt a downgrade. Keenum was unable to get much going in this game, especially since mistakes riddled his team throughout. All together, the Vikings committed 11 penalties for 131 yards. The penalty trouble showed itself early when Ben Roethlisberger and the Steelers tried to draw Minnesota off side on 4th-and-1 at their own 31-yard line. That never works until it does, and it did. Then a couple plays later, Xavier Rhodes was called for pass interference, setting up a 27-yard touchdown to Martavis Bryant. ",
            "3": "Antonio Brown was the receiver to draw that pass interference, but he was held in check for much of the game by Rhodes. Brown saw 11 targets, catching five for 62 yards; a thoroughly un-Brown-y stat line. That focus on Brown did help Bryant, who ended up with only four targets, but caught three for 91 yards and a touchdown. He also got a 51-yard pass interference call on his defender late in the game. ",
            "4": "For Bryant, this must have been a satisfying game, as he was suspended all last season and was held in check in Week 1 against the Browns. He no doubt adds a dimension to this Steelers' offense that they were missing last season. ",
            "5": "Minnesota rookie running back Dalvin Cook played well, but his offense was in no way helping to elevate his game. And for us fantasy footballers, Cook was robbed by the fullback C.J. Ham after getting called down at the 1-yard line following a 25-yard run. C.J. Ham. It is a good name for a fullback. I'll give him that. ",
            "6": "Le'Veon Bell was out of synch Week 1 in Cleveland, and this week, he was corralled by a strong Vikings defense. Bell might still be a little behind the eight-ball, but he looked like his elusive self on many runs, but the Vikings' front line played him well by not overcommitting and taking away screens. Bell ended up with a huge workload of 27 carries and four receptions, but only totaled 91 yards and no touchdowns. It's coming. ",
            "7": "The Vikings kept this game close throughout, but close for a team with a good quarterback, as it was, Keenum never felt like a threat to bring his team from behind, even after Minnesota scored to bring it within eight points with 10 minutes left in the third quarter. Keenum ended up averaging just 3.7 yards per pass attempt. The Vikings' defense, without the mistakes, is a force to be reckoned with. But the team very much needs Bradford to get back and healthy if it wants to contend against the upper echelon of the league. Minnesota has the personnel, but Bradford is the key. ",
            "8": "The Steelers' offense is not hitting on all cylinders, but they have been good enough to win their first two games against short-handed or inferior competition. Pittsburgh will need to get it going at some point, and there have been enough flashes to believe it will come around eventually. ",
            "9": "The Steelers travel to Chicago next week and should be set up to start the season 3-0 after Mike Glennon led the Bears off a cliff on Sunday in Tampa Bay. The Vikings will host the same Tampa Bay team that just smashed the Bears and will be waiting to hear word on Bradford's knee. "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Buccaneers",
            "Points": "29"
        },
        "Team 2": {
            "Name": "Bears",
            "Points": "7"
        },
        "comments": {
            "amount": "8",
            "1": "EDITOR'S NOTE: Given how many mistakes Mike Glennon had in this game, I can't believe John Fox didn't insert Mitchell Trubisky in the lineup. No, wait, I can believe it, because Fox is stubborn and doesn't want to play rookies. In fact, he had Mark Sanchez ahead of Trubisky until recently, so I don't have any faith in Fox using Glennon anytime soon. ",
            "2": "Much was made of this being Mike Glennon's return to Tampa Bay. The former Buccaneers quarterback was never given an opportunity to start for long because of the presence of Jameis Winston. On Sunday, Glennon didn't do much to prove his case as a starter. Glennon started off the day fine, completing his first six passes, but from there, things fell apart. Glennon threw a couple of ugly interceptions. For the first, he fired directly into double coverage and completely missed his receiver. On his second pick, he stared down his receiver, underthrew him, and happened to hit the corner, who was breaking on the route, right in the hands. The Buccaneers returned it for a pick-six. Overall, Glennon finished 31-for-45 with 301 yards and a touchdown. However, he had the two picks and racked up a lot of garbage-time stats, so the numbers are misleading. He stuck mostly to the short and intermediate passing game, but his accuracy simply wasn't there. Glennon shouldn't be the starter for long in Chicago, as Mitchell Trubisky offers more upside at this point in his career. It's unknown why John Fox didn't put Trubisky in late to give the rookie some action in the blowout. ",
            "3": "Of course, it didn't help Glennon's cause that he had practically nothing to work with in the receiving corps. Without Cameron Meredith and Kevin White, Glennon's top options were Kendall Wright (7-69) and Josh Bellamy (4-51). Both flashed the ability to function as a capable receiver at times, but neither should be more than a tertiary option for a successful team. Also, a good chunk of Chicago's yardage came during garbage time. Tight end Zach Miller (6-42) was largely a non-factor outside of garbage time. ",
            "4": "The Bears' run offense was better than the passing offense, but only by default. The real story of the game for the team was Tarik Cohen. The rookie had a fantastic performance in the first week of the NFL season, and he followed it up with a solid Week 2. Cohen didn't do much on the ground, seeing seven carries and totaling 13 yards, but he made an impact as a receiver. He had eight catches for 55 yards and looked like an elusive, Darren Sproles-esque play-maker. The only negative for Cohen was a fumble he had on a punt return. He fielded a punt that rolled to him near his own 10. He should have let it go, but picked it up and was stripped. Still, Cohen needs to get more snaps ahead of the disappointing Jordan Howard (nine carries, seven yards) and could be a FLEX play most weeks. ",
            "5": "The Bears suffered what seemed to be a lot of injuries in this contest, and it appears like that the team is going to have trouble on the offensive line. Kyle Long missed the game due to injury, and Josh Sitton came out late with a malady of his own. They are the two best linemen on the team, and the offense can ill afford to lose them. ",
            "6": "For the Buccaneers, this was an excellent way to start off their season. After missing Week 1 due to the effects of Hurricane Irma, the Bucs' offense looked like they hadn't missed a beat. Jameis Winston was sharp in his first start of the season. The third-year quarterback showed off his strong arm and was very accurate for a majority of the contest. He was under pressure at times due to the mediocre play of left tackle Donovan Smith, but overall, he looked good. Winston ended up going 18-for-30 with 204 yards and a touchdown. He played better than the numbers indicate and was able to make numerous nice throws. His best came on a touchdown to Mike Evans. After a turnover, the Bucs got the ball back, and Winston fired a strike to Evans on the right side of the end zone. Evans tapped his toes in and got the score for the team. The one area that Winston must improve is his deep accuracy. He missed a great deal of open downfield receivers. In one instance, he had Charles Sims for a touchdown but failed to connect with him. In other instances, DeSean Jackson was open. Winston will have time to improve on this, but it was a strong performance regardless. ",
            "7": "As mentioned, the lead receiver for the Buccaneers was Evans (7-93, 1 TD). Evans was able to gain separation from Chicago's poor secondary easily, and justified his first-round fantasy billing. He will continue to be a WR1 week in and week out, and he can be trusted in almost any matchup. Elsewhere, DeSean Jackson had a solid performance, but it could have been better. Jackson caught three passes for 39 yards, but saw seven targets in the game. Had Winston hit Jackson on some of the occasions when he was open, he could have had a superior line. Jackson is a boom-or-bust FLEX play, but can definitely be trusted against weaker secondaries. ",
            "8": "Tampa Bay's run game started the contest poorly, but Jacquizz Rodgers eventually got going. He led the attack, notching 19 carries for 67 yards and a touchdown. He had some nice bursts, but looks more like a solid backup than a lead back. He may not hold on to the starting job when Doug Martin is back. For the other running backs, Charles Sims barely saw action (two carries for two yards), while Peyton Barber saw more carries late in the contest finishing with 10 carries and 47 yards. It appears that Barber will surpass Sims on the depth chart, and Sims may not be long for the team. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Chargers",
            "Points": "17"
        },
        "comments": {
            "amount": "6",
            "1": "EDITOR'S NOTE: Nothing the Chargers do makes sense to me. Why were they settling for a field goal when their rookie kicker whiffed in the clutch last week and missed a try earlier in the afternoon? Why did they cut Josh Lambo for him, anyway? Why were they centering the ball without any timeouts? Why did they even move to Los Angeles in the first place when it was obvious no one would attend their games? ",
            "2": "Even though the Dolphins had to travel to the West Coast, they had two weeks to prepare for their season opener after Hurricane Irma rescheduled their game against the Buccaneers. The Chargers, meanwhile, were playing on a short week after a Monday night game against the Broncos that saw a special teams letdown cost Los Angeles a shot at overtime. As Yogi Berra said, It was deja vu all over again, as the Chargers had another heartbreaking loss; this time with Younghoe Koo missing a 44-yard field goal on the penultimate play of the game. Jay Cutler is 1-0 as Miami's starter, while Philip Rivers appears to be headed to another frustrating season with an 0-2 start. ",
            "3": "To get the scoring underway, Cutler led a drive to set up a short field goal for Cody Parkey. A nice punt return by Travis Benjamin set up Los Angeles to get a field goal early in the second quarter. Branden Oliver ripped off a 26-yard run, and then Rivers hit Keenan Allen up the seam for 24 yards to set up a first-and-goal. Melvin Gordon pounded the ball in to give the Chargers a 10-3 lead at the half. In the third quarter, Cutler and Jay Ajayi started moving the ball on the Chargers' defense. Cutler rolled out to hit Kenny Stills (2-37-1) for a 29-yard touchdown and tie the game at 10. Rivers promptly responded by connecting on a few completions, including a 21-yarder to Allen, a 10-yarder to Hunter Henry, and then a 7-yard touchdown to Antonio Gates (2-11-1). That set the NFL record for touchdown catches by a tight end with 112. Huge congratulations to Gates on making NFL history. Ajayi had some nifty runs to get the Dolphins in Los Angeles territory, and then DeVante Parker made a great leaping 31-yard reception to get inside the 10-yard line. Melvin Ingram used a speed rush to get by Laremy Tunsil for a sack to force a field gold for Miami. Cutler came back to make a money throw to Parker for a 31-yard gain inside Los Angeles' 25-yard line. Cutler then had a clutch third-down conversion to Jarvis Landry (13-78), and that set up another short field goal to cut the Chargers' lead to 17-16 with only seven minutes remaining. The Dolphins' defense and special teams gave Cutler the ball back near the 50-yard line with just over three minutes remaining. Ajayi ran the ball about 15 yards, and that set up Parkey, who was good on a 54-yard field goal to give the Dolphins a 19-17 lead. Rivers got the ball at his own 20 with a 61 seconds and two timeouts. Rivers proceeded to hit Allen and Henry (7-80) on two passes to get the ball to midfield in only 11 seconds. A 10-yard pass to Gordon and a penalty on Miami moved it to the 35. With 10 seconds left though, Koo missed a 44-yard field goal wide right. It was Koo's second miss of the game on a makeable field goal. ",
            "4": "Rivers was 31-of-39 for 331 yards with one touchdown. Overall, the Chargers' revamped offensive line played well as Miami had only one sack in the game. Rivers had a consistently clean pocket to pass from. ",
            "5": "Gordon had only nine carries for 13 yards and a touchdown, but he did have seven receptions for 65 yards. Allen led the Chargers in receiving with nine catches for 100 yards. ",
            "6": "Cutler was 24-of-33 for 230 yards with one touchdown, while Ajayi tallied 122 yards on 28 carries. Parker led the Dolphins in receiving with four receptions for 85 yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Redskins",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "20"
        },
        "comments": {
            "amount": "9",
            "1": "EDITOR'S NOTE: I initially thought the Rams might look past the Redskins because they were coming off a big win, and they had a Thursday night game coming up. Then, I figured they'd want to win this one for Sean McVay, who was going against his former team. So much for that. The Rams showed no heart in this sluggish loss. ",
            "2": "The Redskins were barely able to escape this contest with a win. Early on, it seemed like they were in control of this game, and at one point, they led 13-0. But they ended up letting the Rams come back and nearly blew an important opportunity. Kirk Cousins was, once again, not himself. Or maybe he was himself. It's hard to know. Sometimes, Cousins is absolutely on fire. Other times, he looks like a backup. Sunday, he was a game manager in the mold of Alex Smith. Cousins went 18-for-27 with 179 yards and a touchdown in the contest. He was about as effective as that stat line indicates. Cousins spent most of the game throwing the ball within 10 yards to his receivers. He didn't appear to be very confident in his downfield ability, and that showed. While Cousins was generally accurate, he was just decent overall and looked like an average- to below-average starter. His best throw came on his touchdown to Ryan Grant, but again, it wasn't special. Cousins needs to step up if he wants to land a record-breaking contract. ",
            "3": "Cousins' top receiving weapons in the contest suffered as a result of his choice to throw exclusively short to mid-range passes. Jordan Reed (6-48) led the team in catches and yardage, and he could have done better had he not missed part of the second half with an injury. The other top targets were Jamison Crowder (4-47) and Terrelle Pryor (2-31). Crowder was much better after his abysmal opener, but he still didn't get enough space to make explosive plays. He is a WR3, at best for now, until Cousins improves. Meanwhile, Pryor was a major disappointment as he had only one catch before the final drive. He had another brutal drop and doesn't have chemistry with Cousins. Pryor is not a guy who should be relied on in most formats. ",
            "4": "The real stars of the game on the Redskins' offense were Rob Kelley and Chris Thompson. The two running backs were the leaders of the offensive attack, and Kelley looked excellent in the first half. He totaled 78 yards on 12 carries before he went down with a rib injury that kept him out of the rest of the contest. That injury should be monitored, and the team needs to hope it isn't too serious. If he's out for an extended period of time, Samaje Perine (21 carries, 67 yards) will be the man to add. He looked decent in a lot of late action, but he hasn't fully adapted to the NFL yet. Thompson was absolutely electric for the Redskins. He had a couple of touchdowns on three carries, and that included a 61-yard burst on a delayed handoff. The scary thing is Thompson could have been better had he not dropped a pass when he was wide open over the middle of the field. He is worth adding in PPR leagues, as he appears to be one of Cousins' preferred targets and a legitimate touchdown threat. ",
            "5": "The Redskins suffered a lot of injuries in this game. Kelley, Reed, Morgan Moses, Josh Norman, Zach Brown and Mason Foster were all off the field at various points. While four returned, the team could be in trouble if Kelley and Moses are hurt. ",
            "6": "For the Rams, the result has to be disappointing. They came all the way back from 13 down to tie the game only to lose on Washington's final real offensive drive of the contest. Jared Goff had a fine performance that was certainly a regression from his Week 1 performance. Goff went 15-for-25 with 224 yards, one touchdown and one interception. The pick was probably his worst throw of the game, and it came in the team's final drive of the contest. Goff looked directly at a short checkdown, allowing Mason Foster to jump the route. It essentially sealed the victory for the Redskins. Still, the California product looks a lot better in Sean McVay's offense than he did all of last season. Goff looked poised in the pocket and was confident in his arm. He was fairly accurate and his receivers when open. Goff did hold on to the ball too long at times, but he certainly has grown a lot since last year. ",
            "7": "Goff's top receivers on Sunday were a couple of rookies. Cooper Kupp (3-33) saw the most targets with six, and he was pretty good on the field. Kupp didn't put up big numbers, but he did well against Kendall Fuller, a tough slot corner. The other rookie was Gerald Everett (3-95). The tight end had a huge 69-yard reception that saw the Redskins got lost in coverage. Everett is worth monitoring thanks to his athleticism, but I wouldn't pick him up just yet. The other top receivers Sammy Watkins (2-30) and Tavon Austin (1-5) were largely non-factors. Watkins had to face Josh Norman though, so Watkins could bounce back next week. ",
            "8": "Todd Gurley was one of the better players on the field for the Rams on Sunday. Gurley got 16 carries and totaled 88 yards and a touchdown. He was the only running back to see a carry, and he looked good against Washington's strong defense. Gurley finally had more room running behind his solid, new line and he looks like a true RB1. It also helps that Gurley's receiving ability has improved. He caught three passes for 48 yards and a touchdown. Most of it came on a dump-off, but he did well with the ball after the catch. ",
            "9": "The Rams had one nice play on their game-tying drive when they faked a punt. Johnny Hekker, one of the league's best punters and fake punters, was able to throw a pass that went for 22 yards to give the Rams a critical first down. It was a nice coaching decision by Sean McVay, and Hekker did well to execute. "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "45"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "20"
        },
        "comments": {
            "amount": "6",
            "1": "The Raiders ended up winning this game by 25 points, but it looked dicey for a second. Just a second. They were up 14-0, but the Jets suddenly climbed to within 14-10. New York was even getting the ball back, but a muffed punt that was lost in the sunlight led to a Marshawn Lynch touchdown, and Oakland never looked back. Lynch may have scored once, but Michael Crabtree managed to do it thrice. All three of Derek Carr's scores went to Crabtree, as the Jets' poor secondary had no chance of stopping him, or Carr for that matter. In fact, Carr misfired on just five occasions, going 23-of-28 for 230 yards and the three scores. Crabtree caught six passes for 80 yards otherwise. ",
            "2": "As for Lynch, he didn't get to do much because of the blowout. He pushed the Jets around, moving piles for 45 yards and a score on 12 carries. Jalen Richard (6-58) also found the end zone. ",
            "3": "The one statistical disappointment for Oakland's offense was Amari Cooper, who converted on just four of his five targets for 33 yards. It was just bad luck, as Crabtree saw most of the end-zone looks. Cooper was thrown to for a potential touchdown, but he was intefered with. He also lost out on a scoring opportunity when Cordarrelle Patterson ran for a 43-yard touchdown. ",
            "4": "As you can tell, I'm trying to get through this recap quickly, since this game was pretty worthless. The one thing that really surprised me was how much success Josh McCown had throughout the afternoon. McCown couldn't keep pace with the Raiders, but he engineered some scoring drives, going 17-of-25 for 166 yards and two touchdowns. The fact that the Raiders couldn't completely clamp down on McCown and his pedestrian supporting cast has to be troubling for them. ",
            "5": "Both of McCown's scores went to Jermaine Kearse, who snatched four balls for 64 yards otherwise. It's clear that Kearse is McCown's favorite target, and he's worth owning in 12-team leagues, solely for that reason. ",
            "6": "Matt Forte continues to out-touch Bilal Powell for some reason. Forte gained 53 yards on nine carries to go with four catches for 38 receiving yards. Compare this to Powell, who mustered only 13 yards on six attempts and failed to catch either of his two targets. Powell has been a disappointment thus far, but Todd Bowles is partly to blame for not getting the superior back involved nearly enough. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "42"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "17"
        },
        "comments": {
            "amount": "7",
            "1": "There was an hour-long thunderstorm delay, but the Cowboys wish the game could've been postponed indefinitely. They were absolutely manhandled by the Broncos on both sides of the football, suffering an embarrassing blowout loss. Denver's defense was utterly dominant. The team put the clamps on Ezekiel Elliott, limiting the NFL's reigning rushing champ to worse than one yard per carry. Elliott mustered only eight yards on nine carries. One of the biggest myths in the NFL is that the Cowboys have one of the top offensive lines in the NFL. That used to be the case, but they lost Ronald Leary, who was starting for the opposition this week. Leary's departure has created two holes up front, so it's going to be more difficult for Elliott to dominate in his sophomore campaign. ",
            "2": "Dallas' offensive line will be weaker in pass protection as well, and that was apparent in this game, as Dak Prescott was under siege quite a bit. Prescott took just two sacks, but he could've been brought down more often if it weren't for his pocket mobility and quick release. The pressure and tight coverage forced Prescott into two interceptions, and that number could've been much higher. In fact, Aqib Talib nearly had three interceptions in total, but Dez Bryant broke up two potential turnovers. Talib had the last laugh, as he pick-sixed Prescott at the very end of the game. Prescott ended up 30-of-50 for 238 yards, two touchdowns and the two picks, but a chunk of his yardage came in garbage time. Prescott was 14-of-20 for only 85 yards at intermission. ",
            "3": "As for Dallas' receiving corps, Bryant saw a whopping 16 targets, catching seven of them for 59 yards and a touchdown. Bryant, as mentioned, broke up a couple of interceptions. Jason Witten (10-97) scored a touchdown, as he had another big game. ",
            "4": "Meanwhile, Denver's offense was electric against the Cowboys, who brought no pass rush. Dallas sacked Trevor Siemian twice, but Siemian had a clean pocket for most of the afternoon. The Cowboys also had major issues tackling throughout the contest. They could've forced more punts had they just wrapped up. For example, C.J. Anderson had a 12-yard gain on a third-and-11 catch because Dallas just whiffed on him. Siemian finished 22-of-32 for 231 yards, four touchdowns and an interception. He only made a couple of mistakes, and the pick wasn't even on him because it was the result of a miscommunication. The one glaring error was when Siemian threw to Bennie Fowler on an early third down, but didn't see a wide-open Demaryius Thomas, who was open for a touchdown. ",
            "5": "As for Anderson, he was a beast, gaining 118 yards and a touchdown on 25 carries to go along with three catches for 36 receiving yards. He scored twice. I listed Anderson as a mid-round sleeper during the summer because he was in the best shape of his life, and it's really showing. Jamaal Charles, meanwhile, gained 46 yards on nine attempts. ",
            "6": "One of Siemian's touchdowns went to Anderson. The other two were thrown to Emmanuel Sanders, who caught six balls for 62 yards. Thomas (6-71) missed out, but as mentioned, he easily could've found the end zone as well. ",
            "7": "The one dark cloud over Denver's victory was an injury to Garett Bolles. The rookie left tackle was crying as he was carted into the locker room, so it unfortunately seems serious. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "12"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "9"
        },
        "comments": {
            "amount": "6",
            "1": "The Seahawks obviously have major issues with their offensive line, but I thought they'd be OK for this game. After all, the 49ers couldn't put much pressure on Cam Newton in last week's blowout loss, so they surely would struggle in that regard again. That, however, did not turn out to be the case. Wilson was constantly harassed throughout the afternoon, making it difficult for the Seahawks to maintain drives. It even looked like they were going to lose, as they trailed 9-6 in the fourth quarter. Wilson could've been picked on a several occasions, but he came up big in the clutch. He was like a magician in the pocket on one play, avoiding several potential sacks and finding Paul Richardson in the end zone for the game-winning score. Wilson's touchdown saved his fantasy day, as he was just 23-of-39 for 198 yards and the aforementioned score. Wilson did all he could, even converting a fourth down with a 9-yard scramble on a read option, but San Francisco's pass rush proved to be too overwhelming. ",
            "2": "Adding injury to insult, Jimmy Graham limped off the field in the opening half. He returned to action, but didn't appear to be completely healthy. He caught one pass for a single yard. Elsewhere, Wilson's top two receivers, Doug Baldwin and Tyler Lockett, each converted six of their nine targets for 44 and 64 yards, respectively. It's at least promising that Lockett appears to be healthy for the first time in a long while. ",
            "3": "Chris Carson seems to have overtaken Thomas Rawls as the lead back. Rawls, who started, managed just four yards on five attempts, while Carson gained 93 yards on 20 carries. Carson looked like Marshawn Lynch on a 16-yard run, bulldozing defenders in the process. C.J. Prosise, meanwhile, worked as a receiver out of the backfield, catching three balls for 22 receiving yards. He dropped a pass late in the game. ",
            "4": "As for the 49ers' offense, that unit was competitive because of Carlos Hyde, who had two long bursts in this game. He sprinted for 61 yards in the second quarter, then had a 27-yard burst on a third-and-12 draw. Hyde is in terrific shape right now, so he should continue to be dominant. ",
            "5": "Unfortunately for Hyde, he continues to be paired with a pedestrian quarterback. Brian Hoyer was 15-of-27 for only 99 yards and an interception where he didn't see Bobby Wagner. Hoyer was just overmatched against the Legion of Boom, and his offensive line doesn't give him much of an opportunity. There will be cries for C.J. Beathard, but the rookie doesn't stand much of a chance behind San Francisco's putrid offensive line. ",
            "6": "Because of Hoyer's limitations, San Francisco's leading receivers had just 26 yards. Pierre Garcon and Marquise Goodwin both held that distinction, each catching three balls. Goodwin dropped a pass in the red zone, negating a potential touchdown. "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "34"
        },
        "Team 2": {
            "Name": "Packers",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Packers were aiming to avenge their loss in the NFC Championship, but they never had the chance with all of the injuries they suffered throughout the evening and before kickoff. Things were ominous in the hours leading up to the game when left tackle David Bakhtiari was a surprise inactive, joining Bryan Bulaga as absent tackles. And if that wasn't enough, Green Bay lost Jordy Nelson to a quad injury on the first offensive drive, and Pro Bowl defensive tackle Mike Daniels exited the game with a hamstring shortly afterward. Cornerback Davon House and Randall Cobb were also knocked out. With so many injuries on both sides of the ball, the Packers couldn't be very competitive with the Falcons, who were an offensive machine in this contest despite losing a tackle themselves (Ryan Schraeder). Clay Matthews had success with Schraeder's backup, but that barely slowed down Atlanta. Matt Ryan's numbers don't look great - 19-of-28, 252 yards and a touchdown - but only because he barely threw following intermission. Out of 252 yards, 201 came prior to halftime. Ryan didn't do much in the second half, but he was effective on the eight throws, as he completed six of them. They involved moving the chains and keeping the Packers off the field, chewing up enough clock for Atlanta to hold on to a giant lead for a change. Why the Packers never attempted an onside kick is beyond me. The Atlanta defense, meanwhile, did a tremendous job, although the stats don't show it. Rodgers finished 33-of-50 for 343 yards, two touchdowns and an interception, but he was just 10-of-18 for 85 yards and a pick in the first half. The Falcons changed their defensive philosophy when they were way ahead, playing way off Green Bay's receivers. This allowed the Packers to accumulate tons of garbage yardage, but it also took a ton of time as well. Helping the Falcons' defense's cause was the play that occurred right before halftime. Rodgers, hit by Vic Beasley, fired a pass that was scooped up by Desmond Trufant, who ran the ball into the end zone. It looked like the pass was going forward, but the officials ruled it to be a lateral. Following the challenge, they inexplicably allowed the call to stand even though it was clearly the wrong one. Suddenly, a 17-7 deficit turned into a 24-7 disadvantage at halftime, and the injured Packers couldn't climb out of that hole. ",
            "2": "The Packers had a number of other things go against them as well. In addition to all the injuries, two big Cobb plays were negated by offensive pass interference. Mike McCarthy was so furious about the first that he was flagged for an unsportsmanlike penalty. As mentioned, Cobb (6-60) was knocked out with a shoulder injury, joining Nelson on the sidelines. Meanwhile, Martellus Bennett dropped two passes, though he still managed to catch five balls for 47 yards. Davante Adams (8-99) led the Packers in receiving, and he also scored a touchdown. ",
            "3": "Rodgers' other touchdown was thrown to Ty Montgomery, who caught six balls for 75 yards. Montgomery scored once more on the ground, but was limited to 35 rushing yards on 10 carries. ",
            "4": "Speaking of running backs with great fantasy numbers, Devonta Freeman exploded for 84 yards and two touchdowns on 19 carries. Tevin Coleman (6-42) had a 35-yard burst, and he also caught a touchdown. ",
            "5": "Julio Jones looked like he was going to have a big game, as he caught four balls for 95 yards in the first half. The Packers held the ball for most of the second half, however, so Jones finished with one more grab, making it five for 108 yards. Mohamed Sanu (5-85) also had a nice outing versus a young secondary. ",
            "6": "I mentioned Beasley earlier. Unfortunately for the Falcons, he was knocked out with a hamstring injury. Courtney Upshaw also left the game. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Lions",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "10"
        },
        "comments": {
            "amount": "6",
            "1": "The Giants were extremely fortunate to make the playoffs last year, as a number of their wins were fluky victories. This was apparent heading into the offseason, and New York had to do everything in its power to improve its awful pass protection. The front office did nothing, and now things are beginning to turn the other way. New York was dominated in this game. Though the yardage ended up being about even, most of that was the result of garbage time. In the first half, the Lions had outgained the Giants, 173-80, averaging more than 1.2 yards per play. They put tons of pressure on Eli Manning, who took five sacks, three from Ziggy Ansah, who abused left tackle Ereck Flowers. Five is a high number for Manning, who typically gets rid of the ball quickly. Manning was even fortunate in this game, as he appeared to be strip-sacked in the opening quarter for a return touchdown, but was ruled down after review. Manning fumbled a second time later, but the ball bounced right into his lap. This game could've been much uglier for the Giants, which is saying a lot. They were extremely sloppy at times. On one sequence, they had a first-and-goal at the 1-yard line, but because of a hold and a delay of game, they had to settle for a field goal. Manning finished 22-of-32 for 239 yards, one touchdown and an interception, which was a pass thrown behind Evan Engram. Though Manning had some fumbling issues, he was also hurt by some drops, including two by Brandon Marshall. The declining receiver had a ball fall through his hands for what should've been a long gain. There was a ton of hoopla surrounding the Marshall signing when it happened, and it was clear that people were being irrational about it, as Marshall was decaying with the Jets last season. Marshall has just one catch in each of his first two games with the Giants. New York should consider trading Marshall immediately to a team that doesn't recognize that he's done yet. Odell Beckham Jr., meanwhile, wasn't much of a factor. He caught four balls for 36 yards, and he had a drop at the very end. Beckham wasn't on the field all the time, and he probably should've sat this one out to continue healing. Engram, meanwhile, was New York's leading receiver with four grabs for 49 yards and a touchdown. ",
            "2": "The Giants attempted to run the ball, but they've never had success doing so. They kept it on the ground far too often in the second half, pounding the rock on crucial second-and-long situations, which were effectively wasted downs. Paul Perkins couldn't find any lanes whatsoever, as he was limited to just 10 yards on seven carries. ",
            "3": "The Lions didn't have the best pass protection either, as Greg Robinson struggled against Olivier Vernon. The talented Ricky Wagner was also beaten by Jason Pierre-Paul on a couple of occasions. Because of this, Matthew Stafford had to be a game-manager in this contest, and he handled that role very well. He misfired on just six attempts, going 15-of-21 for 122 yards and two touchdowns. He had several completions negated by numerous holds, including a 19-yard connection to Ameer Abdullah. ",
            "4": "Speaking of Abdullah, he had a 34-yard burst that helped him gain 86 yards on 17 carries. He didn't catch a pass, but as mentioned, he had a 19-yard grab wiped out by one of countless hold. ",
            "5": "Stafford's touchdowns went to Eric Ebron (5-42) and Marvin Jones (1-27). Ebron was able to have plenty of opportunities because the Giants were missing their only talented linebacker, B.J. Goodson. Jones and Golden Tate (4-25) were stymied by a talented secondary. Kenny Golladay (1 catch, 8 yards) took a step backward from his brilliant debut. ",
            "6": "Besides Ansah, some Detroit defenders enjoyed outstanding performances. Rookie linebacker Jarrad Davis made some clutch tackles to bring down defenders short of the line to gain, but he left with an apparent concussion in the fourth quarter, thanks to an uncalled block in the back by Beckham. Meanwhile, Quandre Diggs shut down the Giants' hopes with a terrific tackle on fourth down. For more thoughts, check out my updated "
        }
    },
    "numberOfGames": "16"
}