{
    "year": "2013",
    "week": "15",
    "Game 1": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Broncos",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "Remember when the Broncos looked so dominant at the beginning of the season? There was talk of 16-0 and the potential that the offense could break all sorts of records. They were extremely hot for a while, but they've suddenly lost grasp of homefield advantage in the AFC. In fact, with this loss, the Patriots are now in control of their own destiny for the No. 1 seed. Denver has issues on both sides of the ball. Beginning with the offense, Peyton Manning seemed to prove that he could win in cold weather when he was victorious last week, but a win over a horrible Tennessee team playing its third-consecutive road game in altitude was hardly impressive. The temperature was near-freezing in this contest, and yet Manning was much worse. His final numbers don't look bad - I'll get to those in a bit - but he was just 11-of-19 for only 137 yards with a couple of minutes remaining in the third quarter. Those are his true stats; everything he did after that could be considered garbage time, as San Diego suddenly went into a prevent. It must be noted that Manning didn't have Wes Welker at his disposal, but that's no excuse. He was still able to throw to Demaryius Thomas, Julius Thomas, Eric Decker and Knowshon Moreno, and that should be enough against a San Diego defense that has struggled for most of the season (though it has performed better the past three weeks). Manning spent an absurd amount of time targeting Andre Caldwell, which turned out to be a huge mistake. Caldwell caught both of Manning's touchdowns and led the team in receiving (6-59), but he made numerous unforced errors. Caldwell dropped a pass and didn't read a back-shoulder opportunity correctly. He also was targeted on a near-interception because he couldn't separate from the corner who was covering him. It was perplexing to see Manning utilize Caldwell so frequently, but Manning does tend to do dumb crap in these inexplicable December and January losses in the cold. It's like his brain freezes up, or something. And I don't even know why Caldwell was on the fied to begin with. Jacob Tamme did fine in the slot when Welker went down last week, so why not just use him? ",
            "2": "Thanks to junk time, Manning was able to save his fantasy owners by finishing 27-of-41 for 289 yards, two touchdowns and an interception that occurred because he was hit as he released the football. His scores were the 46th and 47th of his season, putting him four away from breaking Tom Brady's single-season record. ",
            "3": "The Broncos were hurt by a lacking ground attack, which has to be highly discouraging for them because they've attempted to establish one to counter this type of cold weather. Moreno had just 19 yards on eight carries, while Montee Ball lost a yard on three tries. ",
            "4": "As mentioned, Caldwell was the one who found the end zone on both occasions, leaving Demaryius Thomas (4-45), Julius Thomas (4-49) and Decker (2-42) with meager numbers. ",
            "5": "Denver's defense, meanwhile, couldn't do anything right. This includes... - Stopping the run. Ryan Mathews trampled his opponent, gaining 127 yards and a touchdown on 29 carries. The Broncos couldn't bring him down when San Diego was bleeding the clock. The Chargers, as a result, were keeping the ball away from Manning. - Containing Philip Rivers. San Diego's fiery quarterback didn't post great stats (12-of-20, 166 yards, two touchdowns), but he made some incredible, clutch throws to keep the chains moving. Both of his scores went to Keenan Allen (2-29). - Refraining from committing dumb penalties. The Broncos were so undisciplined that John Fox needs to be embarrassed right now. A couple of senseless infractions kept drives alive for the Chargers throughout the entire contest. The most egregious call was a neutral zone penalty on a punt that gave San Diego a free first down. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "26"
        },
        "comments": {
            "amount": "6",
            "1": "The big storyline heading into this game was Mike Shanahan's benching of Robert Griffin. Some analysts were up in arms about this move, completely neglecting the fact that a struggling, hobbled Griffin had thrown his teammates under the bus several times after some losses. In fact, most of the Washington players were behind the switch, and it showed; the Redskins displayed much more effort than they had the previous week. Oh, and Kirk Cousins wasn't too shabby either. He made some mistakes, including a lost fumble on a strip-sack at midfield, but he converted some great throws and led a clutch, 80-yard drive at the end of the game that would have tied up the score had the Redskins not opted to go for two. Cousins went 29-of-45 for 381 yards, three touchdowns and a pair of interceptions after intermission, both of which should have been avoided. His numbers could've been better though, as Pierre Garcon dropped a pass in the end zone. ",
            "2": "Cousin's three scores went to Garcon (7-129), Santana Moss (8-64) and Fred Davis (1-23). Despite Moss' big statistical day, he had a pretty rough afternoon. He muffed a punt, which set up a field goal for Atlanta. Moss later lost a crucial fumble in the red zone. ",
            "3": "Alfred Morris also lost two fumbles, one of which happened to be in the red zone as well. He happened to rush for 98 yards on 18 carries, but the turnover was a killer because it took a scoring opportunity off the board. ",
            "4": "Matt Ryan also had his turnover problems. In fact, he was part of a sequence in which there were lost fumbles on three consecutive plays. It started on Morris' aforementioned cough-up. Ryan was then strip-sacked when Ryan Kerrigan beat Ryan Schraeder quite easily. Moss then lost the ball in the red zone. Ryan also had an interception on an overthrow, as he finished 29-of-38 for 210 yards, one touchdown and the pick. The score was to Gonzalez who made some spectacular catches in this contest, including one in the opening quarter in which a defender was draped all over him. ",
            "5": "Gonzalez led the Falcons in receiving with six catches for 62 yards and the touchdown. Roddy White (5-53) was next on the box score. ",
            "6": "Steven Jackson appeared to be on his way to a big day early on when he had an impressive run in which he dragged multiple defenders. He managed to score twice, but accumulated just 38 yards on 15 carries. He was stuffed at the goal line in the second half and dropped a pass in the red zone. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Bears",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "31"
        },
        "comments": {
            "amount": "9",
            "1": "It was obvious to many that Marc Trestman made a mistake when choosing Jay Cutler to start over a red-hot Josh McCown. That was quite apparent for most of the game. Cutler led the Bears down the field to open the game, but hurled a careless interception in the end zone, as he normally does. Cutler then was guilty of a pick-six on a high throw, and a following a three-and-out in the second half, he displayed terrible body language. It appeared as though Chicago would lose at Cleveland, but Jason Campbell made sure that didn't happen. I'll have more on Campbell later, but the Cutler-McCown storyline is the most prominent one. The Bears escaped with a victory, as Cutler went 22-of-31 for 265 yards, three touchdowns and the two picks. Cutler made some great throws, but the turnovers nearly cost his team a crucial win. McCown did a great job of taking care of the football while also scoring tons of points, so even though the Bears were victorious in this game, that doesn't mean Trestman made the right choice. Cutler's carelessness could be a bigger factor going forward against tougher competition. ",
            "2": "Cutler's touchdowns went to Brandon Marshall (6-95), Earl Bennett (4-23) and Alshon Jeffery (5-72), who made a spectacular catch, as he usually does every single week. Martellus Bennett had a nice game statistically, but lost a fumble that was returned for a score when he was trying to reach for the first-down line. ",
            "3": "The Bears exposed a Cleveland ground defense that hasn't been very effective ever since losing Desmond Bryant to injury. Matt Forte gained 127 yards on 24 carries, while Michael Bush scored on a 40-yard touchdown late in the game. ",
            "4": "I mentioned Campbell earlier. He wasn't all bad - he completed 23-of-39 passes for 273 yards and a touchdown - but he missed open receivers and absolutely killed his team with two interceptions. Both were brutal. The first looked like a punt, while the second, which was taken back for six, made it seem like Campbell had no idea where he was going with his pass. It's worth noting that a chunk of Campbell's yardage came in garbage time when the Bears were up by 14. ",
            "5": "Campbell's sole score was to Josh Gordon (3-67), who was about 20 yards shy of setting the NFL all-time record for most receiving yardage over a five-game span, currently held by Calvin Johnson. Gordon broke Megatron's mark for most yardage over four contests last week, but couldn't maintain the unbelievably high level of production. He was actually blanked in the first half, thanks in part to a drop. He eventually caught a 43-yard score in the final minute of the game, though the touchdown was meaningless. ",
            "6": "Greg Little managed to lead the Browns in receiving (4-68). Jordan Cameron (3-23) didn't do much outside of catching short passes on the final drive. Davone Bess (1-9) had his trademark drop in the red zone. ",
            "7": "Chris Ogbonnaya was expected to receive the bulk of the workload going into this contest, but Edwin Baker, signed just a few days ago off Houston's practice squad, had most of the touches. Baker looked good, tallying 38 rushing yards and a touchdown to go along with four catches for 46 receiving yards. ",
            "8": "The Browns ran some Wildcat plays with rookie tight end MarQueis Gray, who was a quarterback at the University of Minnesota last year. He rushed twice for 30 yards. ",
            "9": "Joe Haden suffered a hip injury in the second half. He was forced out of the game and never returned. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Colts",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Texans",
            "Points": "3"
        },
        "comments": {
            "amount": "5",
            "1": "Texans' owner Bob McNair fired Gary Kubiak following last Thursday's loss to Jacksonville. Kubiak said Matt Schaub gave his team the best chance at victory, which is something McNair wanted no part of. McNair axed Kubiak, indicating that he wanted to tank this season in order to clinch the No. 1 overall pick in the draft (click here for my <b><a href=/draft2014.php>2014 NFL Mock Draft</a></b>). Given that, I didn't expect Houston to put forth much effort in this contest, but that wasn't the case. The Texans looked like they were playing hard, particularly on the defensive side of the ball. However, they just couldn't stop Andrew Luck, while their offense gave them absolutely no support. Luck's final numbers don't look great - 19-of-32, 180 yards, two touchdowns and an interception (underthrown to Da'Rick Rogers) with 29 rushing yards - but that's only because he attempted just 10 passes in the second half, completing only four of them. He was also hurt by a couple of drops, including one by Rogers, who disappointed after posting huge numbers last week. ",
            "2": "Luck's two touchdowns went to former Stanford teammate Griff Whalen (4-45) and Trent Richardson. Rogers had just two catches for 23 yards, while Coby Fleener didn't log a single reception. As for Richardson, the numbers will say that he had a rare, decent performance. He hauled in a receiving touchdown to go along with four catches for 38 yards through the air. He also rushed for 64 yards on 19 carries with some short-yardage conversions in the first half. It actually didn't look like Richardson converted those attempts, but the officials moved the chains on both occasions. However, Richardson was held to minimal gains on way too many occasions, and he was only in the game so much because Donald Brown (5-38) left early with a stinger and never returned. ",
            "3": "Houston's offense, meanwhile, was a complete mess. Keenum was dreadful, going 18-of-34 for 168 yards and two interceptions, and even those numbers were inflated because of garbage time; Keenum was just 9-of-19 for 88 yards and the two picks in the first half when this game was still actually up for grabs. Keenum's problem remained the same: He processes information very slowly, meaning he holds on to the ball way too long and stares down his receivers. He did so on one of his interceptions, as he looked at Andre Johnson way too long, allowing a Colt defender to make a play. He also took some bad sacks, including one that resulted in a safety because he stood in the end zone for what seemed like an eternity, completely unaware of what was going on around him. This safety allowed Robert Mathis to set the Colts' franchise single-season record with 16.5 sacks. ",
            "4": "Keenum's struggles had a huge impact on Johnson's numbers, as the great receiver was limited to just four catches for 18 yards. DeAndre Hopkins (3-52) had a slightly better day. ",
            "5": "Ben Tate ran the ball well, gaining 72 yards on 16 carries, but just didn't have many opportunities because his team was behind the entire game. He at least helped his PPR owners out with three catches for 20 receiving yards. Tate fumbled twice, but was fortunate that his team recovered both loose balls. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bills",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "20"
        },
        "comments": {
            "amount": "4",
            "1": "I'm not going to spend too much time on this game because these teams looked so pathetic. To illustrate, the Jaguars had a four-play sequence early in the first quarter when they went: interception, sack, pass batted down, sack. Of course, the Bills weren't much better, as E.J. Manuel tossed a pick to no one on what appeared to be an attempted screen. The Bills eventually got their act together, while Jacksonville had trouble doing so, which is understandable considering that it was missing both Cecil Shorts and Maurice Jones-Drew. The miscues continued, as receiver Kerry Taylor had a drop in the red zone in which the ball hit him right in the hands. Denard Robinson then lost a fumble in the end zone, resulting in a touchback. Henne then heaved another pick on a fade pass. Buffalo, meanwhile, didn't stay completely clean because Manuel lost a fumble. However, he wasn't too bad otherwise, going 17-of-24 for 193 yards, two touchdowns and the aforementioned pick. He also scrambled 10 times for 37 rushing yards and a third score on the ground. ",
            "2": "Manuel's touchdowns went to Robert Woods (5-82) and fullback Frank Summers. Stevie Johnson did nothing, catching just one ball for four yards. ",
            "3": "The Bills ran pretty well with both Fred Jackson (17-80) and C.J. Spiller (13-67). Both caught one pass for minimal yardage. Spiller tweaked his ankle, but stayed in the game. Marcell Dareus also hurt his ankle. He left and didn't return. ",
            "4": "Some stats for the Jaguars: - Henne finished 21-of-36 for 237 yards, two touchdowns and a pair of interceptions. He wasn't terrible despite the glaring lack of talent around him. - Jordan Todman gained 109 yards on 25 carries to go along with four catches for 44 receiving yards in Jones-Drew's absence. - Marcedes Lewis led the team in receiving with four grabs for 54 yards and a score. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Patriots",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The narrative entering this game for the Patriots was that their offense was bound to collapse without Rob Gronkowski. That's all every single NFL analyst on TV talked about. They said the Patriots were done without their big tight end. I figured this would light a fire under Tom Brady, who would will his team to victory. Brady nearly did so, and he played extremely well, but he ultimately came up a bit short, and this 20-point output will do nothing to silence his critics. What the critics won't recognize is that the Patriots posted 453 net yards of offense, outgaining Miami by 75 yards. Brady went 34-of-55 for 364 yards, two touchdowns and an interception on what was a desperation heave on the last play of the game. He did miss Gronkowski, however, as he needed his small receivers to come up with touchdowns at the very end. Danny Amendola actually had the ball in his hands for a game-winning score, but a Miami defender knocked it out at the very last second. The play was made by Michael Thomas, who was just signed off San Francisco's practice squad. Thomas also happened to be the player who pick off Brady to seal the victory. ",
            "2": "Brady targeted Julian Edelman and Amendola relentlessly, as you might expect him to with Gronkowski, Aaron Dobson and Kenbrell Thompkins all out. Edelman logged 13 receptions for 139 yards and a touchdown, while Amendola snatched 10 catches for 131 yards. ",
            "3": "It was strange to see Shane Vereen so underutilized. Vereen had just three catches for eight receiving yards to go along with two carries for 13 rushing yards. LeGarrette Blount (11-47) was the running back who handled the majority of the workload. He rotated with Stevan Ridley, who gained 34 yards on eight carries. ",
            "4": "As for the Dolphins, this is unquestionably the biggest win for the Ryan Tannehill-Joe Philbin regime. They didn't clinch anything, and it's still unclear if they'll even manage to secure a playoff spot, but they proved that they're a legitimate threat by knocking off their biggest rival. It was also huge that Tannehill played extremely well. Things were rocky for him and his offense early on, as he took a bad sack because he didn't recognize Kyle Arrington was blitzing. Tight end Michael Egnew ran some bad routes short of the first-down marker, while a field goal was botched because the Miami holder wasn't ready for the snap. However, Tannehill caught fire in the second half, misfiring on just five attempts. Tannehill ultimately finished 25-of-37 for 312 yards and three touchdowns. He was especially excellent on third down, helping his team convert 9-of-17 such situations. His only real blemish was underthrowing Mike Wallace for a potential fourth score. ",
            "5": "Tannehill's trio of touchdowns went to Wallace (6-105), Marcus Thigpen and Daniel Thomas. Brian Hartline and Rishard Matthews were also big parts of the scoring attack, with each catching five balls for 70 and 64 yards, respectively. ",
            "6": "Thomas was given most of the carries last week, so it's strange that he had just five carries compared to Lamar Miller's 15. There shouldn't be any complaints though, as Miller ran well, gaining 61 yards in the process, while Thomas appeased his fantasy owners with the aforementioned receiving score. ",
            "7": "Brent Grimes left the game with a groin toward the end and never returned. However, he told reporters that he's OK. "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Vikings",
            "Points": "48"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "It doesn't matter how explosive the Eagles' offensive play-makers are, or what sort of gimmicks Chip Kelly can come up with; Philadelphia has zero chance to advance deep into the playoffs if its defense doesn't improve. The team's stop unit was absolutely pathetic in this matchup, as it couldn't do anything to contain an offense that was missing Toby Gerhart, John Carlson, Kyle Rudolph, and of course, Adrian Peterson. Philadelphia's defense was so bad that it made Matt Cassel look like the second coming of Fran Tarkenton. It was unbelievable. Cassel opened 9-of-9 for 168 yards and a touchdown, and it was a legitimate 9-of-9 for 168 yards. He was extremely sharp, and his impressive start could have been even better had Cordarrelle Patterson not dropped a touchdown. Meanwhile, the Eagles' offense had trouble getting things going because of poor mistakes and bad luck. For instance, Nick Foles lofted a beautiful 40-yard pass to Riley Cooper, but the diversity-loving wideout had one foot out of bounds. Later, Philadelphia converted a nifty double reverse on fourth-and-1 for a touchdown, but Foles was whistled for a peel-back block that wasn't even necessary. Foles was later picked off on an overthrow, which was followed by an unsuccessful fourth-and-short try deep in his own territory. He also held on to the ball too long, helping the Vikings accumulate four sacks. ",
            "2": "Foles still managed to post some awesome numbers, though a huge chunk of his stats came in garbage time. He finished 30-of-48 for 428 yards, three touchdowns and the pick. He also had 41 rushing yards on five scrambles. His best play when this game was still in doubt was a 17-yard completion to DeSean Jackson that Foles somehow converted as he was getting drilled. ",
            "3": "Jackson nearly had half of Foles' yardage, snagging 10 balls for a whopping 195 yards and a score. However, like Foles, most of what Jackson did came after intermission when this game was essentially over. At one point, Jackson had to be restrained on the sideline because he was yelling at one of the assistant coaches. Zach Ertz (6-57) and Jason Avant (3-40) had Foles' other touchdowns. Ertz's score was an awesome one-hander. ",
            "4": "LeSean McCoy didn't have a chance to run the ball because his team trailed by a wide margin early on. He gained 38 yards on just eight carries, though he did have five catches for 68 receiving yards. ",
            "5": "As for the winning team, Cassel finished with outstanding numbers, going 26-of-35 for 382 yards, three touchdowns (two passing, one rushing) and an interception that wasn't his fault because the ball was deflected. Cassel endured some drops, so his stats could've even looked better. Again, Cassel was every bit as good as those numbers indicate. Or, perhaps, Philadelphia's defense was just bad. ",
            "6": "Cassel's touchdowns went to Greg Jennings (11-163) and Patterson (5-35). It's amazing how well Cassel and Jennings have gelled, especially when considering that the other two Minnesota quarterbacks haven't been able to connect with the former Packer wideout whatsoever. ",
            "7": "Starting in place of Peterson and Gerhart, the shockingly slow Matt Asiata mustered just 51 yards on 30 carries, but scored thrice. He also caught three balls, as the Vikings ran the same play on several occasions and had success against Philadelphia's sleepwalking defense. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "23"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "0"
        },
        "comments": {
            "amount": "3",
            "1": "The Giants put forth zero effort last week in San Diego once they saw the Eagles beat the Lions, which effectively knocked them out of the playoffs. However, despite what this score may say, New York really tried hard to beat the Seahawks. Unfortunately, awful turnovers, a key injury and just superior play by the opponent did them in. I'll address each item. - Awful turnovers: Eli Manning came into this contest with a league-leading 20 interceptions. He heaved five more in this game. The first wasn't really his fault because Victor Cruz had the ball bounce out of his hands and into a Seattle defender's. The second was foolish, as Manning tried to challenge Richard Sherman for some reason. Manning threw right to Sherman, who had great coverage. The third, right at the end of the opening half, was on a Hail Mary, so that shouldn't be on Manning either. The fourth pick was Manning's fault, however, as he threw behind his target. The fifth was in desperation mode. Manning, who went 18-of-31 for 156 yards and the quintet of picks, also fumbled twice, but was lucky enough to have David Diehl recover on both occasions. Had Diehl not pounced on both loose balls, Manning's afternoon would have been much worse. Manning was under heavy pressure all afternoon. He was sacked four times, but that number isn't indicative of the amount of heat he faced throughout this contest. - Key injury: Victor Cruz (2-25) suffered a concussion at the beginning of the third quarter after what looked to be a 16-yard reception. However, Pete Carroll pulled a Cobra Kai-type maneuver, challenging the play while Cruz was down on the field and barely moving. The Giants already had issues moving the chains, but they had no hope of doing so without their top play-maker. New York had just 54 net yards of offense in the first half with just two first downs. Yes, that's right - the Giants had more turnovers than first downs in the opening half! They ultimately converted just 1-of-10 attempts on third down. - Superior play by the opponent: The Seahawks couldn't muster much offense early because of a great effort by the New York defense. However, Russell Wilson was ultimately too much. He made some great plays with his trademark pocket mobility. He kept so many plays alive, turning many nothings into somethings. Wilson finished 18-of-27 for 206 yards and one touchdown to go along with 50 rushing yards on eight scrambles. He nearly had a second touchdown, but Golden Tate (2-25) stepped out of bounds. Wilson's only mistake was an interception heaved into double coverage late in the game. ",
            "2": "Marshawn Lynch couldn't get much going on the ground with just 47 yards on 16 carries, but he scored a touchdown and led the team in receiving with six catches for 73 yards, slightly edging out Doug Baldwin (6-71, TD). ",
            "3": "Some random stats for the Giants: - The Giants couldn't generate any sort of a running game. Andre Brown was limited to just 17 yards on 11 carries, though he did help his PPR owners with four catches for nine receiving yards. - Jerrell Jernigan led New York in receiving with seven grabs for 67 yards. Hakeem Nicks, meanwhile, kept his touchdown-less streak alive. He logged just one reception for five yards. He looked like he was 40, running slowly and being unable to separate from anyone. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "49ers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: </i> As my LVH Supercontest partner Matvei texted me, Next year, let's take Jim Harbaugh every week. That's not a bad strategy; Harbaugh's teams always seem to pull through, even in perceived bad situations. ",
            "2": "The 49ers entered the weekend as the final wild card in the NFC, so they couldn't afford to have a letdown against the Buccaneers. San Francisco quarterback Colin Kaepernick made a number of clutch plays with his arm and legs to produce long drives and points. The 49ers outplayed the Bucs on offense, defense and special teams to send Tampa Bay to its third double-digit-loss season in the last five years. ",
            "3": "To get the scoring started, San Francisco had a long drive that was led by some runs by Frank Gore (22-86) and Kaepernick. The 49ers' young signal-caller made a few clutch throws off of rollouts including a short touchdown pass to Michael Crabtree (5-45). After San Francisco tacked on another field goal, Kaepernick threw a perfect bomb to Vernon Davis for a 52-yard touchdown following the 2-minute warning. Davis burned Mark Barron in man coverage. Tampa Bay answered with a quick drive down the field for an 11-yard touchdown pass from Mike Glennon to Vincent Jackson (5-58). The 49ers added a field goal in the third quarter. On the first play of the fourth quarter, Glennon hit Tim Wright (7-82) for a 24-yard touchdown in busted coverage. San Francisco needed to answer, and Kaepernick rolled out to hit a 14-yarder to Crabtree for a first down. It was a redeeming moment for Crabtree after he had an idiotic unsportsmanlike conduct penalty earlier in the drive. Kaepernick had an unreal scramble to escape a sack and tackle for a 10-yard gain on a third-and-7. That set up a field goal. The Bucs tried some trickery with a reverse on the ensuing kickoff, but they fumbled the ball after the handoff. Kendall Hunter scooped up the loose ball and dove into the end zone for a touchdown. That was the final nail in the coffin for Tampa Bay. ",
            "4": "Kaepernick completed 19-of-29 passes for 203 yards with two touchdowns. He ran for 39 yards on seven carries. <l> Glennon was 18-of-34 for 179 yards with two scores and an interception. Bobby Rainey was held to 27 yards on 11 carries. ",
            "5": "Both teams' offensive lines had some issues in pass protection. Adrian Clayborn and Gerald McCoy had sacks, with the latter dominating the 49ers' interior. McCoy was a beast once again for the Bucs. For San Francisco, Justin Smith had an impressive sack going through a guard and center. Aldon Smith burned Donald Penn for his first sack and had two in the game. Patrick Willis added another sack. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Panthers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Panthers didn't seem to put forth maximum effort in this game, while Geno Smith didn't look completely incompetent as many expected him to because he was battling a top defense on the road. Despite all of this, Carolina essentially won by 17 points, with a New York garbage-time, backdoor score making this a 10-point affair. That speaks volumes about the disparity between these two teams. Carolina didn't seem to take the Jets seriously. It bypassed field goals when those made sense, which drew the ire of Joe Namath on Twitter, while many of the players didn't show much urgency. Of course, you can't exactly blame the Panthers for being a bit lethargic; they were playing a non-conference opponent with a losing record in between battles against the arch-rival Saints. This game simply didn't mean as much as next week's battle against New Orleans. ",
            "2": "Cam Newton went 16-of-24 for 273 yards and a touchdown along with seven scrambles for only 12 rushing yards. Newton was chased down and was wincing in pain on a tackle at the end of the second quarter, so perhaps that's why he didn't run very much. Newton's passing yardage is impressive, but 72 yards came on a DeAngelo Williams screen that was turned into Newton's sole score. Williams sprinted toward the end zone, as David Harris looked like he was running in slow motion as he was trying to chase him. Dee Milliner was also at fault, being unable to get off his block. ",
            "3": "In addition to his 72-yard receiving touchdown, Williams also had 81 rushing yards on 15 carries. That's the good news. The bad news is that Williams saw Mike Tolbert (12-18, TD) steal his goal-line carries yet again. ",
            "4": "Greg Olsen led Carolina in receiving with five catches for 88 yards. Steve Smith, meanwhile, didn't do very much, hauling in three receptions for 20 yards. ",
            "5": "As for the Jets, I mentioned that Smith didn't look completely incompetent, but he wasn't any good either. His final numbers - 15-of-28, 167 yards, one touchdown and an interception (with six scrambles, 44 rushing yards) - don't tell the whole story. Smith missed several open receivers, with his most blatant misfire being toward Saalim Hakim, who was wide open downfield. Smith completely missed him, firing the ball out of bounds by at least 10 yards. A little bit later, Smith was pick-sixed when he carelessly forced a pass into double coverage. It was a 10-point game at that point, so the interception essentially clinched a victory for Carolina. ",
            "6": "The Jets were never behind by a wide margin until the very end, so they were able to run the ball with Chris Ivory, who gained 66 yards on 11 carries. However, Ivory lost two goal-line carries to Sheldon Richardson, of all people. The rookie defensive end had a monstrous game. In addition to scoring a rushing touchdown and making four tackles, he chased Newton from behind to make an incredibly athletic tackle. ",
            "7": "The New York player who led the team in receiving (Jeff Cumberland, 3-50) was the one who caught Smith's sole score. Santonio Holmes, who foolishly called out Carolina's secondary prior to this game, embarrassed himself with just two catches for 14 yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "56"
        },
        "Team 2": {
            "Name": "Raiders",
            "Points": "31"
        },
        "comments": {
            "amount": "5",
            "1": "I can sum up this game in eight different words, repeated infinitely: Matt McGloin ugly interception, Jamaal Charles screen touchdown Matt McGloin ugly interception, Jamaal Charles screen touchdown Matt McGloin ugly interception, Jamaal Charles screen touchdown Matt McGloin ugly interception, Jamaal Charles screen touchdown Matt McGloin ugly interception, Jamaal Charles screen touchdown Well, that's not exactly precise; McGloin tossed just four picks instead of five. The fifth turnover was a lost fumble on a strip-sack. My bad. This game was just ridiculous. When the Raiders had the ball, McGloin tried his best to sabotage his career, hurling hideous pick after hideous pick. When the Chiefs took over on short fields, they scored via Charles screens. It was unbelievable. The Chiefs continuously ran the same play over and over, yet Oakland's inept defensive coordinator was simply unprepared for it. Even on a third-and-19 in the first quarter, the Raiders decided to blitz like idiots, as if Alex Smith was somehow going to burn them downfield. The Chiefs, in response, called a simple screen for Charles, who went the distance. Charles finished with five touchdowns, four of which were on screens. He caught eight balls for 195 receiving yards, while rushing for 20 yards on eight carries. Charles ultimately accounted for 56 percent of Kansas City's offense. ",
            "2": "Charles was also responsible for 68 percent of Alex Smith's passing yardage. Smith went 17-of-20 for 287 yards and five touchdowns, though he didn't really do much. Excluding running back screens, Smith had just one completion longer than 15 yards, which was a 23-yard conversion to Donnie Avery (2-33). Dwayne Bowe (3-24) disappointed his fantasy owners. ",
            "3": "As for the Raiders, there was only a little bit of good mixed in with a ton of bad for McGloin. He finished 18-of-36 for 297 yards, two touchdowns and the five turnovers. He did a solid job of moving the chains at times, but the give-aways were killers. The lost fumble was deep in his own territory, which set up an easy touchdown for the Chiefs. His first pick, which was telegraphed, was returned for a score. Another was tipped, but two others were incredibly dumb throws. I laughed when I saw someone tweet, McGloin was waiting all day for the linebacker to get open. In addition to McGloin's turnovers, the undrafted rookie quarterback made some other mistakes. He missed an open Marcel Reece for a touchdown in the first quarter. He also showed poor awareness amid weak-armed throws, and he was ultimately benched in favor of Terrelle Pryor, who didn't have much more success moving the chains. ",
            "4": "McGloin's two scores went to Andre Holmes (4-58), who made an amazing, one-handed catch for 28 yards, and Mychal Rivers (3-30), who hurt his team with a drop in the red zone. Rod Streater didn't find the end zone, but he led the team in receiving with four grabs for 59 yards. ",
            "5": "Reece predictably took a back seat with Rashad Jennings back. Jennings scored twice while rushing for 91 yards on 23 carries. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Rams",
            "Points": "27"
        },
        "Team 2": {
            "Name": "Saints",
            "Points": "16"
        },
        "comments": {
            "amount": "6",
            "1": "This was the most shocking result of the afternoon to most, but it really shouldn't have been too much of a surprise. The Saints, who stink on the road, had this largely meaningless game in between two tilts against the Panthers. They had also lost in St. Louis as double-digit favorites a couple of years ago despite facing a backup quarterback, so history was just repeating itself. This was a legitimate beatdown though. The Rams were up 27-3 entering the fourth quarter. The Saints managed to score two late touchdowns to make the end result more respectable, but this game was really never in doubt. They almost made things interesting at the very end, but Garrett Hartley had a short kick blocked - the second time that occurred during the game. The Rams were able to shut down New Orleans' potent offense thanks to the immense pressure they put on Drew Brees. They mustered four sacks - two by Robert Quinn - but that is a high number considering that Brees releases the ball so quickly. All of this heat forced Brees into two first-half interceptions. He was swarmed during the first pick, while the second was the result of Brees not seeing Trumaine Johnson, who cut in front of the intended target, who was in the end zone. Brees was nearly intercepted for the third time in the second half. Brees finished with solid numbers - 39-of-56, 393 yards, one touchdown and two picks - but most of that came in garbage time. Brees should've posted a second score, but a Charles Brown illegal-use-of-hands penalty wiped out a touchdown to Lance Moore. Brown was ultimately benched. ",
            "2": "Jimmy Graham was completely held in check, logging just two catches for 25 yards. Janoris Jenkins, doing his best impression of Aqib Talib, did a great job of shutting down the athletic tight end. ",
            "3": "Marques Colston led the Saints in receiving, snagging eight balls for 92 yards and a late touchdown to help his fantasy owners. Darren Sproles was also limited to 38 receiving yards on eight catches. ",
            "4": "Zac Stacy appeared to suffer a hip injury early in the first quarter. He left the game, but only briefly. He reentered the contest and finished on a very strong note, rumbling over the Saints for 133 yards and a touchdown on 28 carries. ",
            "5": "Kellen Clemens had perhaps the best game of his career. He let the ball hit the ground just six times, going 14-of-20 for 158 yards and two touchdowns, though a 31-yard score was on a screen to backup tight end Cory Harkey. Clemens was very efficient with the football despite not having Tavon Austin at his disposal. ",
            "6": "Harkey and Lance Kendricks (2-13) caught Clemens' touchdowns. Austin Pettis led the Rams in receiving with four catches for 41 yards. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "34"
        },
        "comments": {
            "amount": "4",
            "1": "The last time the Cardinals traveled to Tennessee, Vince Young engineered an amazing 99-yard touchdown drive in the final couple of minutes to lead the Titans to victory. This game was somehow nearly featured an even more improbable victory for Tennessee. The Titans were down 34-17 with 3:20 remaining in regulation, yet Ryan Fitzpatrick mounted an incredible comeback. In his final three drives, he was 16-of-20 for 193 yards if you exclude the three instances in which he spiked the ball to stop the clock. Tennessee was aided by two brutal calls inside near the goal line, including a shoulder-to-the-chest hit by safety Rashad Johnson that was inexplicably whistled as an unnecessary-roughness penalty. Johnson looked like he wanted to kill the officials as he yelled at them, but it was pointless; the zebras gave the Titans a free first down that the host was able to turn into a trip into the end zone. Following the game-tying score, Fitzpatrick bowed for his teammates, who celebrated the improbable comeback. Unfortunately for Fitzpatrick, he was intercepted in overtime after nearly tossing a pick-six. This helped set up the game-winning field goal for Arizona. The Cardinals managed to prevail in overtime, but allowing Tennessee to send this game into an extra session proved to be costly, as Larry Fitzgerald (6-49) suffered a concussion at the end of regulation on an onside-kick attempt. The Arizona Republic's Kent Somers tweeted that Fitzgerald is not OK. ",
            "2": "Though Fitzgerald had a team-high reception total, he wasn't the biggest part of the offense. Rashard Mendenhall (21-69) scored two touchdowns, but he wasn't either. Andre Ellington held that distinction, constantly breaking big gains both on the ground and through the air. Ellington gained 71 yards on 10 carries while logging four catches for 87 receiving yards. His best play was a 22-yard run. It appeared as though he would be bottled up for a loss, but he eluded defenders and sprinted downfield. ",
            "3": "Carson Palmer went 20-of-30 for 231 yards and a touchdown to Jake Ballard. He took just two sacks, which is a great sign. He was limping around after the Titans tackled him low in the second quarter, but he was 8-of-13 for 108 yards and a touchdown following intermission, so unlike Fitzgerald, he didn't seem to be bothered by that hit. ",
            "4": "Some Tennessee stats: - Thanks to that awesome comeback, Fitzpatrick finished 36-of-58 for 402 yards, four touchdowns and two interceptions. I mentioned that he was almost pick-sixed in overtime; that nearly happened earlier when Daryl Washington dropped an interception. Fitzpatrick was also lucky that he didn't lose a fumble on a desperation attempted shovel pass in the first half. - Chris Johnson rushed for only 40 yards on 13 carries, but he made up for it with a 25-yard receiving touchdown. Johnson had three catches for 51 yards. - Kendall Wright had a whopping 12 catches for 150 yards, while Nate Washington also had a big game (7-92). Fitzpatrick's four scores went to Michael Preston twice, Johnson and Delanie Walker (8-53). Walker should've hauled in a second touchdown, but he dropped a pass in the end zone. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Packers",
            "Points": "37"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "36"
        },
        "comments": {
            "amount": "6",
            "1": "<i> EDITOR'S NOTE: </i> I have one word for Dallas' latest inexplicable loss: LOL. ",
            "2": "It was December, so the Cowboys blowing a 23-point lead shouldn't surprise anybody. Tony Romo had a meltdown with two fourth-quarter interceptions to give Green Bay what it needed to pull out the win. The Packers had their slim playoff hopes stay alive with a huge comeback win, as they showed some serious heart fighting back for the win. ",
            "3": "It was all Dallas in the first half. Romo hit Terrance Williams (4-46) for 27 yards on a deep crossing route that led to a long Dan Bailey field goal. The Packers answered when Matt Flynn hit James Jones on a slant that he broke down the field for a 39-yard gain. DeMarcus Ware and Orlando Scandrick had a sack, but Mason Crosby hit a 27-yard field goal to tie it. DeMarco Murray soon ripped off a 41-yard run up the middle, and a pass to Dez Bryant set up Bailey's second three-pointer. Romo went down the seam to Jason Witten (4-71) for a 25-yard touchdown in the final seconds of the first quarter. Flynn threw a pick to Sterling Moore, and Bailey ended up with two more field goals before halftime. Romo hit a slant and go to Bryant for 37 yards. A few plays later, Murray charged into the end zone from a yard out for a 26-3 lead. Settling for all those field goals came back to bite Dallas. On the first play from scrimmage in the second half, Eddie Lacy took off on a 60-yard run. That led to Jordy Nelson (5-61) outfighting Orlando Scandrick on a jump ball for a touchdown. After another Bailey field goal, the Packers got six more with Flynn leading a drive. He connected with Andrew Quarless on a short slant for the score. Datone Jones and Clay Matthews sacked Romo on a third down just in front of the end zone. A punt return by Micah Hyde set up Green Bay at the Dallas 22-yard line. The drive finished with a middle screen to James Starks for a score. The Packers looked ready to take the lead when a pass deflected off Witten and was intercepted by Tramon Williams. He returned the pass inside the Dallas 10, but the review ruled Williams had trapped the ball. Romo took advantage of the opportunity and hit another big gainer down the seam to Witten. To end the drive, Bryant made a miraculous catch over two defenders for a touchdown. Flynn got a big completion to Jarrett Boykin (6-83) to move the ball inside the 10-yard line. A short toss to Jones (3-49) went for the score. The Cowboys had some questionable play-calling as they continued to throw rather than run the ball with Murray (18-134). Sam Shields soon made a superb interception to give Green Bay the ball at mid-field down by five with about three minutes remaining. A completion to Quarless (6-66), a pass-interference penalty and runs from Lacy moved the ball to the goal line. Lacy then dived over the top to grab the lead. The two-point conversion was incomplete. To end the game, Romo had a pass off the mark and Williams made a diving interception to clinch the victory for Green Bay. ",
            "4": "Romo completed 29-of-48 passes for 358 yards for two touchdowns and two interceptions. Bryant was a beast with 11 catches for 153 yards and a score. ",
            "5": "Flynn was 26-of-39 for 299 yards with four touchdowns and an interception. He really struggled in the first half, but made some clutch throws in the final two quarters. Lacy (21-141) was phenomenal for Green Bay. ",
            "6": "Defensively, George Selvie had a big first half with a tackle for a loss and a sack. He suffered an injury in the second half. The Dallas defense couldn't make enough plays in crunch time. Mike Daniels and Mike Neal had sacks for Green Bay. While the Packers couldn't stop Bryant, their defensive backs had clutch interceptions in the fourth quarter. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Steelers",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Bengals",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "The Bengals had a chance to move into the No. 2 spot in the wake of New England's loss to Miami. However, they didn't play like they had a chance to earn anything; they were extremely flat in this contest, trailing 30-7 entering the fourth quarter. The Steelers outplayed Cincinnati in all three facets of the game. Ben Roethlisberger was on fire early on, though you wouldn't know if by looking at his mediocre stat line. Roethlisberger finished 20-of-25 for 191 yards, one touchdown and an interception (an underthrow on a shot downfield), but he had a low yardage number because his team took the air out of the ball in the second half with such a huge lead. Roethlisberger actually opened a perfect 12-of-12 for 112 and a score, though he nearly tossed a second pick after that on an end-zone attempt that saw two Bengals crash into each other. ",
            "2": "Roethlisberger did a great job of spreading the ball around; a quartet of Steelers caught four of more passes: Antonio Brown (5-66, TD), Le'Veon Bell (5-50), Emmanuel Sanders (5-38) and Heath Miller (4-35). ",
            "3": "Bell did most of his damage as a receiver, as he had trouble finding running lanes behind an offensive line that was missing its second-string center and saw both tackles, Kelvin Beachum and Marcus Gilbert, suffer injuries. Bell managed just 57 yards on 24 carries, though he did make up for it with a touchdown. ",
            "4": "Both Steeler tackles got hurt, but the Bengals sustained way more injuries. James Harrison (making his first return to Pittsburgh), Jermaine Gresham, Dre Kirkpatrick and even punter Kevin Huber left the game with various maladies. ",
            "5": "Andy Dalton played poorly for most of this contest. He may have finished 25-of-44 for 230 yards and two touchdowns, but most of that came in garbage time. Just as Roethlisberger completed his 12th-consecutive pass to open the game, Dalton was a pathetic 2-of-10 for 15 yards. He was under tremendous pressure all evening, taking eight sacks. Dalton's scores went to Marvin Jones (5-48), who had a drop, and Tyler Eifert (3-33). A.J. Green didn't find the end zone, but he snagged nine catches for 93 yards. Ike Taylor, who has been torched by nearly everyone this year, inexplicably did a good job covering Green. Taylor also played well against Green in their Week 2 tilt. ",
            "6": "Giovani Bernard handled most of the workload, but mustered just 33 yards on 13 carries. Bernard at least scored a touchdown. BenJarvus Green-Ellis, meanwhile, had just four yards on four carries. He spent most of the game standing on the sideline. ",
            "7": "I mentioned earlier that the Steelers outplayed the Bengals in every facet. This includes special teams. In the first quarter, the Bengals botched a punt as the wind blew away a snap heading toward Huber, who picked up the ball and was tackled at his own 1-yard line. Later on, Brown returned a punt for a touchdown. Huber suffered a crushing hit after that, so he had to leave the game with a jaw injury. Kicker Mike Nugent took over the punting duties and struggled in that role. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "18"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "Matt Elam called out Calvin Johnson in the week leading up to this game, referring to the best receiver in the NFL as old. Johnson, who turned 28 in September, brushed it off, but the media took off with it. Everyone dubbed Elam a fool, including Ray Lewis, who said that Elam awakened a sleeping giant. I'm not sure why Megatron was sleeping, but the point was understood; why motivate such a talented player even further in a game with major playoff implications? Well, Elam apparently had no impact on Johnson. The monstrous receiver dropped three passes in this contest. The first two were for big gains that would've set up the Lions in scoring territory. The third had an even greater impact; Johnson couldn't hang on to the ball in the end zone on a two-point attempt with 2:25 remaining in regulation. The conversion would've put the Lions up a field goal instead of just one, which obviously would've changed Justin Tucker's sixth and decisive field goal, a booming 61-yarder, into a mere game-tying kick. The Ravens, who were now up by two with about 30 seconds left on the clock, intercepted Matthew Stafford on the ensuing drive immediately. The player who made the pick? Matt Elam. Perhaps trash-talking Johnson will become en vogue. ",
            "2": "Megatron had the three key drops, but still managed to lead the team in receiving with six catches for 98 yards. The player most prominently at fault for this loss was Stafford, who had a dreadful performance. He went 18-of-34 for 235 yards, one touchdown and three interceptions, but that doesn't tell the whole story. Stafford, who was also nearly picked very early, continuously displayed poor mechanics, attempting these weird, side-armed throws that often fell incomplete. He had two misfires this way prior to hurling his third and final pick to Elam in the same manner. Stafford's sole score went to Joseph Fauria, making his only catch for 14 yards. Reggie Bush also found the end zone, rushing for 86 yards on 17 carries to go along with two catches for 15 receiving yards. ",
            "3": "Joe Flacco had a mixed game. He missed some open receivers, but completed several impressive passes. He finished 20-of-38 for 222 yards. Flacco took a low hit to the knee by DeAndre Levy late in the fourth quarter, which should've been flagged. He was limping around, but never left the game. However, Flacco didn't complete an great pass after that, so it remains to be seen what his health will be going forward. ",
            "4": "Flacco's most prominent receivers were two of the three usual suspects: Torrey Smith (4-69) and Jacoby Jones (6-80). Dennis Pitta disappointed his fantasy owners with just two catches for 24 yards. ",
            "5": "Ray Rice had a couple of nice runs in this contest. He was given just 12 rushes, turning them into 56 yards. Bernard Pierce didn't do much, mustering just 21 yards on seven attempts. ",
            "6": "There were some shady calls in this game, most of which favored the Ravens. Two defensive penalties on the Lions helped set up a Baltimore field goal in the second quarter. Later, the officials missed an obvious pass interference on Baltimore, which should've set up Detroit on the 1-yard line. Conspiracy theorists can point out that this spread dropped from +6 to +4 an hour prior to kickoff despite equal action on both sides. Did several big-time bettors know that the fix would be in? Clete Blakeman wasn't involved this time, but the zebras definitely decided the winner of this game. ",
            "7": "As mentioned, this contest featured some major playoff implications. The Ravens, with the win, held on to the No. 6 seed. They also control their own destiny for the AFC North title. The Lions, meanwhile, relinquished first place in the NFC North, as both the Bears and Packers have jumped ahead of them. <table border=0 width=98%> <tr> <td> <iframe frameborder=0 id=pcd name=pcd src=/PostCommentDev/cmts/1118.php style=overflow-y:auto; width=100%></iframe> </td> </tr> </table> </l>"
        }
    }
}