{
    "year": "2013",
    "week": "02",
    "Game 1": {
        "Team 1": {
            "Name": "Patriots",
            "Points": "13"
        },
        "Team 2": {
            "Name": "Jets",
            "Points": "10"
        },
        "comments": {
            "amount": "5",
            "1": "If you weren't able to watch this game because you don't have NFL Network, consider yourself very fortunate. This was one of the most excruciating three-and-a-half hours of football I've ever seen. It's not just that both offenses performed poorly in a low-scoring affair; it's that they weren't even functional. Both teams, especially the Patriots, couldn't do basic things. Catching the football should not be that difficult, yet all of the New England wideouts, save for Julian Edelman, dropped passes all evening. Kenbrell Thompkins (2-47) was bad - he ran a wrong route in the end zone during the second quarter and then dropped a touchdown just prior to halftime - but Aaron Dobson looked like the worst receiver in NFL history. I'm not exaggerating at all. Dobson caught three balls for 56 yards and a touchdown, but that's a very deceiving stat line. He dropped at least five passes. There was one occasion in which he wasn't even looking back for the football. He glanced at Tom Brady at the very last second, which caused a key drop. Dobson continuously screwed up, but Brady inexplicably kept going back to him. I didn't understand the logic behind that. Stevan Ridley was benched for one fumble last week, so why wasn't Dobson taken out of the game after his third, fourth or fifth drop? With Dobson and Thompkins playing so poorly, Brady seemed so out of sync. He spent the entire first half yelling at his teammates, but he just seemed defeated after intermission. He failed to complete 50 percent of his passes for the first time in a game since Week 15, 2009, going 19-of-39 for 185 yards and a touchdown. The score came on the first drive of the contest - an 81-yard possession. The Patriots mustered just 151 yards the rest of the way, compared to 318 for the Jets. They were just 4-of-18 on third down and managed just moved the chains nine times in this entire contest. The Patriots will be better eventually, but they'll need Rob Gronkowski and Danny Amendola back. And who knows when they'll be available? In the meantime, all Brady will have to work with is Edelman (13-78), who was the lone bright spot for New England's offense - and even he wasn't flawless; he appeared to lose a fumble, but the call was reversed. I'm not sure what Bill Belichick can do in the short term. I joked on Twitter (<a href=https://twitter.com/walterfootball target=blank>@walterfootball</a>): #Patriots should play Alfonzo Dennard at receiver. Better than Dobson. Well, it wasn't really a joke. It's kind of the truth. The most telling moment for New England came just prior to halftime. The team was on the New York 25-yard line. The Patriots were faced a third down with 11 seconds and one timeout remaining. Instead of taking a shot at the end zone, as Brady normally would, he ran to the middle of the field and took a knee to give his kicker an easier field goal. Stephen Gostkowski whiffed in karmic fashion. ",
            "2": "I brought up the Dennard tweet earlier because he caught a key interception from Geno Smith in the red zone. Aqib Talib, meanwhile, picked him off twice. Smith did some nice things in this contest, but there was more bad than good. He finished 15-of-35 for 214 yards and the three picks. He also had a 16-yard scramble. Smith endured many of the same issues Tom Brady faced. His receivers just let him down. Stephen Hill lost a fumble and dropped a pass. Clyde Gates, who was on the field because Jeremy Kerley was out, couldn't control a second-quarter touchdown. He let the ball fall through his hands on a couple of other occasions. Still though, at least the Patriots didn't turn the ball over. Smith committed the three interceptions - two of which were terrible - and also missed some open receivers. He still has a long way to go. ",
            "3": "As with Edelman and the Patriots, there was one positive in the Jets' receiving corps. Santonio Holmes actually looked like a functional receiver. He caught three balls for 51 yards. He's not nearly the same player he once was - he's not playing on all of the snaps - but he's at least turning into a dependable, veteran wideout for Smith. ",
            "4": "The Jets actually ran the ball well and probably should've stuck with the ground game throughout the contest. Chris Ivory looked quick, gaining 52 yards on 12 carries. Bilal Powell (13-48, TD) also showed well. Meanwhile, Rildey gained just 40 yards on 16 attempts. I guess the silver lining is that he didn't fumble. ",
            "5": "Two New York linemen were ejected at the end of this contest. D'Brickashaw Ferguson and Willie Colon were tossed for throwing punches after Talib's game-sealing interception. Losing them would be devastating for the Jets' chances next week, should they be suspended. New York plays the Bills, so Ferguson's potential replacement would be responsible for blocking Mario Williams. "
        }
    },
    "Game 2": {
        "Team 1": {
            "Name": "Falcons",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Rams",
            "Points": "24"
        },
        "comments": {
            "amount": "6",
            "1": "It's only Week 2, but the Falcons already seem to be running out of bodies. Roddy White's nagging injury has been well-documented. He played, but once again barely did anything more than be a decoy (3 catches, 21 yards). He saw just three targets, as he stood on the sidelines most of the afternoon. Steven Jackson suffered a thigh injury in the first quarter. The Falcons listed him as questionable to return, but he never took the field again. All he was able to do was catch an eight-yard touchdown and carry the ball three times for no yards. Despite missing two key weapons, Matt Ryan was still unstoppable. He misfired on just 10 attempts, going 33-of-43 for 373 yards and two touchdowns despite having tons of pressure in his face. Ryan heavily favored Julio Jones, who hauled in 11 passes for 182 yards, including an 81-yarder in the first quarter, beating Janoris Jenkins, to give Atlanta a 14-0 lead. The Falcons, who were up 24-3 at the half, nearly blew this contest because they had trouble running the ball and consequently couldn't bleed the clock out. Jacquizz Rodgers proved to be a poor substitute for Jackson, managing just 17 yards on 11 attempts. Once the Rams drew to within seven in the fourth quarter, Ryan had to start throwing again - and the Rams had no answer for him. ",
            "2": "Other Atlanta stats: Tony Gonzalez (4-33) had a poor performance considering that Ryan didn't have much else to work with. Harry Douglas also disappointed (4-43), as many considered him to be a sneaky fantasy option with White suffering through his malady. ",
            "3": "Atlanta's defense also saw a key player go down; Asante Samuel aggravated his thigh injury in the first half. Despite this, the Rams had trouble moving the chains until the Falcons were up big after intermission. Sam Bradford's numbers look pretty solid - 32-of-55, 352 yards, three touchdowns and an interception - but most of that came in junk time. He was just 12-of-21 for 124 yards and the pick at the intermission. Bradford's sole pick wasn't his fault. He tossed a pass to Daryl Richardson in Falcons' territory, but the ball bounced off the running back's hands and into Osi Umenyiora's arms. The former Giant defensive end then galloped 68 yards to go into the end zone. The Rams looked like they would make the contest interesting - it would be 14-3, at the very worst - but the Falcons went up 21-0 instead. ",
            "4": "Two of Bradford's touchdowns went to Tavon Austin, who had six catches for 47 yards. Austin also had a 7-yard rush in which he was given the ball like a running back. I thought it was Isaiah Pead at first glance, but it was Austin instead. The third Bradford score went to Austin Pettis (8-78), who had a big game. Chris Givens (5-105) led the team in receiving, while Jared Cook (1-10) didn't do much following a huge debut. Cook missed out on a long catch because he tripped as the ball was sailing toward him. ",
            "5": "Richardson, meanwhile, couldn't find any running lanes. He managed 35 yards on 10 carries. The Rams' coaching staff seemed to shy away from him a bit after the aforementioned pick-six gaffe; he had just five touches after halftime. ",
            "6": "The Rams suffered an injury to an important player themselves in this contest. Rodger Saffold went down with a knee injury in the second quarter. It looked pretty bad, as he was carted off the field. <div class=dfpAdSlots> "
        }
    },
    "Game 3": {
        "Team 1": {
            "Name": "Ravens",
            "Points": "14"
        },
        "Team 2": {
            "Name": "Browns",
            "Points": "6"
        },
        "comments": {
            "amount": "7",
            "1": "The Ravens may have won this game, but Baltimore fans have to be very concerned. The offense can't sustain consistent drives. The receivers, save for Torrey Smith, can't catch, while the offensive line struggles to block. Joe Flacco had a major headache dealing with Cleveland's pass rush; the Browns swarmed the backfield all afternoon. They had just two sacks - including one by Barkevious Mingo that helped push the Ravens out of field goal position - but that's misleading because they were dominant in the trenches. Flacco, however, willed his team to victory with a very strong second half. His overall numbers weren't very impressive - 22-of-33, 211 yards and a touchdown - but he misfired on just two attempts after intermission; he was 10-of-12 for 102 yards and the score in the third and fourth quarters. ",
            "2": "The big news for Baltimore's offense was Ray Rice's hip flexor strain. He had just 36 yards on 13 carries prior to exiting with the injury. Fortunately, Rice should be OK; it's sounding like there's a chance he could be active next week. If not, the Ravens will be happy to roll with Bernard Pierce again. The second-year back mustered 57 yards and a touchdown on 19 carries. ",
            "3": "Smith was Baltimore's best wideout, as expected (7 catches, 85 yards), but promising rookie Marlon Brown hauled in Flacco's lone touchdown. He caught four balls for 45 yards. Dallas Clark, who ruined a potential victory for the Ravens in the opener, snagged just one reception. ",
            "4": "As for the Browns, they once again failed to give Trent Richardson the appropriate workload. Richardson carried the ball just 18 times despite the fact that his team either led or trailed by only one point until midway through the fourth quarter. Richardson also had five catches for 21 receiving yards, but 23 touches are simply not enough. With Josh Gordon out, Richardson was the only play-maker on the squad. He needs to have the ball in his hands around 30 times every single week. It's just unbelievable that two brilliant offensive minds in Rob Chudzinski and Norv Turner can't figure this out. ",
            "5": "While Richardson had just 18 carries, Brandon Weeden aired it out 33 times. Again, stupid. Weeden was much better this week, but only by default. He made a couple ofnice throws, but they were accompanied by awful passes, including one in the red zone during the opening drive. He was also responsible for three delay-of-game infractions, thanks to a lack of awareness. Weeden finished 21-of-33 for 227 yards. A big chunk of his yardage came on a completion to Cameron Jordan. Weeden's next-longest pass went for only 22 yards. Adding injury to insult, Weeden banged his thumb, forcing Jason Campbell into the game. X-rays were negative, so perhaps Weeden can start next week. I mentioned Cameron earlier; he continued to impress. He didn't find the end zone again, but he led all players in receiving yards with 95 off five receptions. Davone Bess (5-38) was next on the stat sheet for Cleveland. ",
            "6": "More bad coaching for the Browns: They went for it 4th-and-4 on Baltimore's 36 at the beginning of the fourth quarter. They gained three yards, so they turned it over on downs. On top of that, Chudzinski opted to challenge the spot, a strategy that almost never works. He lost the review. So, in addition to making a poor decision - the Ravens weren't moving the ball, so pinning them inside the 10 would've been the better move - he compounded it by wasting a precious second-half timeout. ",
            "7": "I thought it was amusing that the Baltimore crowd booed former kicker Billy Cundiff mercilessly. Cundiff, as you may remember, whiffed on a short kick that could have sent the Ravens to the Super Bowl following the 2011 season. Cundiff was undaunted, drilling both of his attempts, including a 51-yarder. "
        }
    },
    "Game 4": {
        "Team 1": {
            "Name": "Bills",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Panthers",
            "Points": "23"
        },
        "comments": {
            "amount": "5",
            "1": "Did the Bills come through in the clutch, or did the Panthers blow yet another close game? I imagine that all of the focus will be on Buffalo, given that rookie E.J. Manuel was brilliant on his final drive. Manuel, who had accuracy issues in the first half and turnover problems after intermission - he lost a fumble and threw a pick to Luke Kuechly - went 6-of-8 for 51 yards to go along with a nine-yard scramble in the red zone during the decisive possession. He capped it off with a two-yard floater to Stevie Johnson, who was inexplicably open in the end zone. Manuel's final numbers: 27-of-39 for 296 yards, one touchdown and the aforementioned pick. He'll be praised for the victory by the national media and Buffalo fans, but there are some issues. I already outlined the turnovers and inaccuracy. Manuel was also tentative at times, checking it down too often. Some of his throws in the red zone - earlier in the contest - were way off. The final drive was awesome, but he went down the field against a skeleton-crew Carolina stop unit. Part of the reason I won't blame the Panthers too much for screwing themselves out of another potential victory was because they suffered so many injuries in this contest. It started when Charles Johnson went down, grabbing his elbow. Cornerbacks Josh Norman and Josh Thomas hobbled off as well. Safety Charles Godfrey joined them when he was carted off with an Achilles. Quintin Mikell, who replaced him, was also carted off. That would help explain why there was so much confusion in the Carolina secondary on the final drive, especially when Manuel targeted Johnson in the end zone for the final score. ",
            "2": "Johnson, to no one's surprise, led the Bills in receiving; he had eight catches for 111 yards and a touchdown. Robert Woods (4-68) was next on the stat sheet for Buffalo. ",
            "3": "C.J. Spiller, who wasn't used much last week because of an early fumble, bounced back well. He tallied 103 rushing yards (16 carries) and 26 receiving yards (four catches). He lost a 28-yard gain because it was wiped out by a Lee Smith hold. He also saw Fred Jackson (12-30; 4-23) steal a touchdown from him at the goal line. ",
            "4": "The Panthers ran the ball pretty well. They were able to move the chains down the field and set up what looked like a front-door field goal late in regulation. DeAngelo Williams tallied 85 yards on 22 attempts. Having said that, one Carolina player who once again didn't run the ball enough was Cam Newton, who had just four scrambles for 15 rushing yards. It seems like Newton wants to be a pocket passer who rushes as a last resort, but Newton is just doing what opposing defensive coordinators want. If he doesn't use his legs, he's so much easier to defend. Newton finished 21-of-38 for 229 yards, two touchdowns and an interception on a miscommunication. The numbers don't look that bad, but he missed a number of receivers downfield. He's just not the same quarterback who finished the 2012 campaign on a hot streak. He's struggling without former offensive coordinator, Rob Chudzinski. It wouldn't hurt if the Panthers found a No. 2 wideout for Newton. Ted Ginn caught a touchdown - a play that should've never happened because the Panthers were able to retain possession when Buffalo held on a 4th-and-18 - but he's not a reliable receiver. Steve Smith (5-52) is aging. Greg Olsen (7-84) is a quality intermediate option, but an upgrade is needed across from Smith. ",
            "5": "Carolina also has to upgrade its offensive line. Mario Williams had a ridiculous afternoon in which he recorded an eye-popping 4.5 sacks. Middle linebacker Kiko Alonso played like a stud as well, recording 10 tackles, one sack and Newton's sole pick. "
        }
    },
    "Game 5": {
        "Team 1": {
            "Name": "Bears",
            "Points": "31"
        },
        "Team 2": {
            "Name": "Vikings",
            "Points": "30"
        },
        "comments": {
            "amount": "6",
            "1": "The Vikings were extremely lucky they weren't blown out of the water - and there was actually a ton of water in a torrential second-half downpour. They couldn't do anything on offense prior to intermission and were outgained by 120 yards at the break. However, they led at intermission because of three things: Cordarrelle Patterson's opening kickoff return for a touchdown; a Brian Robison fumble return for a score; and a Jay Cutler interception in the end zone that was tipped twice and fell into the arms of Kevin Williams. Christian Ponder was horrendous prior to halftime. He was 6-of-14 for 81 yards, one touchdown and an ugly pick-six by the time the intermission rolled around. I thought there was a chance Matt Cassel would open as the starter in the third quarter, but the coaching staff stuck with Ponder, who inexplicably caught fire. He was 10-of-16 for 146 yards after the break. ",
            "2": "Adrian Peterson, who said his goal was to rush for 2,500 yards this season, hasn't been very impressive in the early going. He failed to reach the century plateau in the opener, and just barely got there in this contest. He gained 100 yards on 26 carries, though he lost 13 yards on a ridiculous Chris Johnson-type attempt in which he ran backward for some reason. It's clear that Peterson misses his stud fullback Jerome Felton, who will be back from suspension in Week 4. ",
            "3": "Ponder's sole touchdown went to Kyle Rudolph (3-42), as expected. Greg Jennings had an OK outing, hauling in five grabs for 84 yards. Jerome Simpson predictably disappointed (2-49) after his awesome season debut. He's the 2013 version of Kevin Ogletree. ",
            "4": "The Bears were able to overcome fluky Minnesota touchdowns and late Ponder precision passing, thanks to a 66-yard, game-winning drive, capped off with a Martellus Bennett score. Jay Cutler was extremely sharp, going 28-of-39 for 290 yards, three touchdowns and two interceptions. As mentioned, one of his picks wasn't his fault because it was tipped twice into the air. ",
            "5": "Cutler tossed two scores to Bennett (7-76), while the other one went to Brandon Marshall (7-113, TD). Bennett nearly hauled in a third score, making a leaping, one-handed grab in which he extended his arm, but he fell out of bounds. Bennett is looking like he'll snag double-digit touchdowns by the end of the season. It was disappointing to see Alshon Jeffery record just one reception. He saw five targets come his way. Given that Cutler has Marshall, Bennett and Forte to throw to, there just aren't enough balls to go around. ",
            "6": "Matt Forte lost a fumble, but otherwise had a monstrous outing. Not only did he rush for 90 yards on 19 carries; he caught 11 passes for 71 receiving yards. Marc Trestman loves using running backs in the passing game, so this is hardly a surprise. <div class=dfpAdSlots> "
        }
    },
    "Game 6": {
        "Team 1": {
            "Name": "Packers",
            "Points": "38"
        },
        "Team 2": {
            "Name": "Redskins",
            "Points": "20"
        },
        "comments": {
            "amount": "5",
            "1": "One is an accident, two is a trend. Robert Griffin was very rusty in the season opener, but there was always a chance this was a one-game thing because he didn't play in the preseason. Well, his mechanics looked even worse in this contest. He has just been completely off. Calls for Kirk Cousins will start growing louder, and I couldn't blame Mike Shanahan for making the move because his franchise signal-caller just doesn't look right. Griffin's final numbers were awesome (26-of-40, 320 yards, three touchdowns, one interception), but don't be fooled. The young quarterback was just 6-of-13 for 107 yards and an interception against a Green Bay secondary missing its top safety - though to be fair, the pick was the result of a bobble by Josh Morgan, who shouldn't be on the field. Griffin simply put up garbage numbers against a prevent defense. It's a shame for the Packers that Griffin couldn't be more successful because Aaron Rodgers could have challenged Norm Van Brocklin's single-game passing record of 554 yards. Rodgers went 34-of-42 for 480 yards and four touchdowns. Given the big lead, the Packers didn't have to air it out. ",
            "2": "As you can imagine, all of the Green Bay receivers had monstrous numbers. James Jones, who didn't log a single reception last week, had 11 catches for 178 yards. He didn't find the end zone, but came close; he stretched out on one play, but lost the ball, which hit the pylon for a touchback. All of the other prominent Packers scored. Jordy Nelson (3-66) did twice. Randall Cobb was probably best overall (9-128, TD), while Jermichael Finley also reached the end zone (6-65, TD). ",
            "3": "The one dark cloud in this victory for the Packers was a first-quarter Eddie Lacy concussion. Lacy had just one carry for 10 yards prior to exiting. His replacement, James Starks, was unstoppable. The Redskins, who gave up a weekly high in rushing yards to LeSean McCoy on Monday night, allowed Starks to gain 132 yards and a touchdown on 20 carries. Starks also caught four passes for 36 receiving yards. ",
            "4": "It's worth noting that Green Bay was just 4-of-10 on third down. That may not seem such a big deal because its offense was so explosive, but the front line was to blame. The unit surrendered four sacks - a pair to Ryan Kerrigan - a was whistled for a false start and two holding penalties. ",
            "5": "Here are some of the other Washington numbers: Alfred Morris bounced back to total 107 yards on just 13 carries. Griffin's touchdowns went to Pierre Garcon (8-143), Santana Moss (3-41) and rookie tight end Jordan Reed (3-18). "
        }
    },
    "Game 7": {
        "Team 1": {
            "Name": "Texans",
            "Points": "30"
        },
        "Team 2": {
            "Name": "Titans",
            "Points": "24"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: Ben Tate had 93 yards on nine carries. Arian Foster recorded 79 yards on 19 attempts. Why is Foster receiving more than double the amount of carries than his superior teammate? It makes no sense. </i> ",
            "2": "There is no doubt that the 2-0 Texans have some fight in them. Houston had a vigorous comeback against San Diego last Monday night, but looked dead in the water late in the fourth quarter this week before some great throws by Matt Schaub to rookie DeAndre Hopkins led to an overtime win. The Titans came close to being 2-0 with road wins at Houston and Pittsburgh, but the Tennessee secondary couldn't close out the win for the team to now be 1-1. The Titans were down 14-10 at the start of the fourth quarter when Chris Johnson was stopped in his own end zone for a safety. Tennessee started its next next drive at its own one-yard line and moved the ball 99 yards for the lead. Jake Locker hit some big throws to Nate Washington (3-50) and Kendall Wright (7-54). The Titans took a one-point lead when Locker fired a bullet to Delanie Walker for a 10-yard touchdown. On the next third down, Schaub threw a weak pass off his back foot and it floated right to Alterraun Verner, who cruised into the end zone for a 20-yard touchdown. Hopkins ran the wrong route to set up the interception. The Texans responded by moving the ball with passes to Hopkins and a gain to Andre Johnson to the 3-yard line. Johnson (8-76) was injured on the play and headed into the locker room to end his game with what looked like a possible concussion courtesy of a helmet-to-helmet hit by Bernard Pollard. That set up a short touchdown run from Arian Foster. Foster carried a defender to convert the two-point conversion to tie it at 24. Houston got the ball back, and a 34-yard pass play to Keshawn Martin set up a last-ditch field goal from 46 yards out that was missed by Randy Bullock, his third miss of the game. The first two were from 51 yards. In overtime, runs by Foster (19-79) and Ben Tate (9-93) set up a miraculous catch by Hopkins to get the Texans to the two-yard line. Houston won the game on third-and-goal when Schaub threw a ball along the sideline to Hopkins (7-117), and the rookie made a fabulous reception while tapping his feet in bounds for the score. Schaub finished 26-of-48 for 298 yards with three touchdowns and two interceptions. Owen Daniels (2-24) had a beautiful diving grab for a 12-yard score. Garrett Graham caught Schaub's other score. ",
            "3": "Locker moved the ball well at times with some short precision passes to go along with some Johnson (25-96) runs. Locker tossed a short touchdown toss to Wright on a nice throw and catch in the first quarter. But aside from two drives, Tennessee struggled to move the ball. Brian Cushing and J.J. Watt were awesome for Houston. They each had two sacks with other tackles for a loss. Cushing made a number of clutch tackles, while Watt provided some welcome-to-the-NFL moments for Chance Warmack. Penalties on Titans offensive lineman Rob Turner also took big gains away from Johnson. Locker completed 17-of-30 passes for 148 yards with two touchdowns. ",
            "4": "The Texans have some cause for concern about their running game. Foster looks like he lacks a burst, and the offensive line wasn't opening up holes consistently enough. Although Foster played his best late in the game, Tate should receive more carries going forward. ",
            "5": "The Titans got sacks from Derrick Morgan and Jurrell Casey. Akeem Ayers and Zach Brown played well to limit Houston's running game. Pollard also had an interception. "
        }
    },
    "Game 8": {
        "Team 1": {
            "Name": "Dolphins",
            "Points": "24"
        },
        "Team 2": {
            "Name": "Colts",
            "Points": "20"
        },
        "comments": {
            "amount": "7",
            "1": "Andrew Luck and Robert Griffin draw all of the acclaim as the elite quarterbacks from the 2012 NFL Draft class, but Ryan Tannehill would love to make the argument that he belongs in their company. He made a strong case in this contest, out-dueling Luck to improve to 2-0. Tannehill may have gone up against a miserable defense, but he was very sharp. He went 23-of-34 for 319 yards and a touchdown. He was especially accurate after intermission, misfiring on just three passes (10-of-13). The one blemish is that he fumbled twice, though he only lost one. NFL.com credited Tannehill with three fumbles, but the third was a botched snap. ",
            "2": "Making things even better for Tannehill, he won't have to hear Mike Wallace whine and complain to the media about not getting the ball enough. Wallace couldn't do anything because of Joe Haden last week, but he managed to make nine catches for 115 yards and a touchdown. Charles Clay (5-109) and Brian Hartline (5-68) also were big parts of the offense. Clay also had a rushing score. ",
            "3": "Like Wallace, Lamar Miller rebounded from an ugly debut. He collected 69 yards and a touchdown on just 14 attempts. It's important to note that he saw more work than the pedestrian Daniel Thomas (8-30). ",
            "4": "Despite this strong showing by Miami's offense, there is a big concern, which is pass protection. Tannehill took five sacks and was stripped twice. The Colts don't even have a good pass rush, so what's going to happen when the Dolphins battle a team that has a strong front seven (the Browns don't count because they can't score, so the strength of their defense doesn't matter)? ",
            "5": "The Colts also have pass-protection issues. In fact, owner Jim Irsay took to Twitter and demanded for better blocking from his offensive line. Luck was sacked three times, but that doesn't tell the story of how much pressure Luck saw throughout the afternoon. Making matters worse, Indianapolis lost starting guard Donald Thomas for the season with a torn quad. ",
            "6": "Luck went 25-of-43 for 321 yards, one touchdown and an interception. The quarterback didn't have much fortune in the second half, as two touchdowns were wiped out because of a drop and an illegal shift. Luck's sole score went to Coby Fleener (4-69), who finally showed signs of life after a miserable preseason. T.Y. Hilton was the team's leading receiver (6-124). Reggie Wayne didn't do as much as usual (5-46) because the Dolphins game planned to make sure he wouldn't beat them. Hilton was heavily involved on offense because Darrius Heyward-Bey left the game with a shoulder injury. He'll need an MRI. ",
            "7": "With Vick Ballard out for the year, Ahmad Bradshaw saw most of the workload. He did a decent job against a tough Miami front, gaining 65 yards and a touchdown on 15 carries. He also caught three balls for 19 yards. Bradshaw needs to be in your fantasy lineup, especially when the Colts eventually battle weaker defenses. <div class=dfpAdSlots> "
        }
    },
    "Game 9": {
        "Team 1": {
            "Name": "Chiefs",
            "Points": "17"
        },
        "Team 2": {
            "Name": "Cowboys",
            "Points": "16"
        },
        "comments": {
            "amount": "7",
            "1": "The NFL Red Zone's Scott Hanson called this a surprise, but the Chiefs were favored and didn't even cover the spread. However, they still slightly outplayed the Cowboys and managed to improve to 2-0 - equaling the amount of victories they had all of last season. Alex Smith won't be able to win consistently against far superior competition, but as long as he can dink and dunk with a lead, the Chiefs will have a good chance to prevail. Smith went 21-of-36 for 223 yards and two touchdowns, with a big chunk of his completions being short dump-offs to Jamaal Charles. Smith had just three passes that went longer than 18 yards. Oddly enough though, he led his team in rushing; he scrambled eight times for 57 yards. ",
            "2": "As for Charles, he mustered 55 yards on 16 carries. As mentioned though, he was a big part of the passing game, logging eight catches for 48 receiving yards and an aerial touchdown. ",
            "3": "Smith's other touchdown went to Dwayne Bowe (4-56), who was able to get ont he board following a disappointing debut. Outside of Bowe and Charles, no Kansas City player had more than two receptions. ",
            "4": "Save for a few breakdowns in trying to cover Dez Bryant, the Chiefs' defense was awesome. Nose tackle Dontari Poe is a beast. Despite being a 340-pound nose tackle, he recorded two sacks. Poe may weigh that much, but he doesn't look like he does. It seems like he's a 310-pound under tackle with tons of athleticism. He ate very healthily this offseason, and it's paying off. ",
            "5": "I mentioned Bryant; he was unstoppable, especially in the first half. He notched a game-high nine receptions for 141 yards and a touchdown, though he was guilty of a deep drop. Unlike the Giants, the Chiefs opted to cover him one-on-one. The results nearly cost them, though Miles Austin-Jones (3-31) and Jason Witten (3-12) did nothing. ",
            "6": "Bryant had about half of Tony Romo's passing yardage. Romo went 30-of-42 for 298 yards and a touchdown. He wasn't picked off, but was lucky not to come away with a couple of interceptions. One was actually nullified by a hold. The Chiefs also dropped a potential pick. ",
            "7": "DeMarco Murray was disappointing on the ground, mustering just 25 yards on 12 carries. He did catch five balls for 49 receiving yards though. "
        }
    },
    "Game 10": {
        "Team 1": {
            "Name": "Chargers",
            "Points": "33"
        },
        "Team 2": {
            "Name": "Eagles",
            "Points": "30"
        },
        "comments": {
            "amount": "7",
            "1": "The Eagles are super explosive and unbelievably fast on offense, but if they don't play any defense, they won't win many games. Philadelphia's stop unit was absolutely atrocious in this game. There were too many three-man rushes. The cornerbacks were playing too far off of the receivers they were covering. There were too many missed tackles. Blown coverages were plentiful. Adjustments were never made. Defensive coordinator Billy Davis, who has never really had much success anywhere, needs to get his act together; otherwise, the Eagles will lose many more blowouts like this. Having said that, I don't want to take anything away from Philip Rivers, who was just phenomenal. He went 36-of-47 for 419 yards and three touchdowns despite losing starting receiver Malcom Floyd to what looked like a devastating injury. Floyd was not moving much after getting hit hard at the beginning of the third quarter. He was eventually wheeled off on a stretcher and taken to a hospital. Fortunately, he flew back with the team, but the injury ruined what was a great outing by Floyd, who had five receptions for 102 yards. ",
            "2": "All three of Rivers' touchdowns went to Eddie Royal. It's amazing; Royal now has five scores on the season. He needs to be added in all fantasy formats. ",
            "3": "Two other Chargers caught a high volume of passes, thanks to Rivers' 36 completions. Danny Woodhead made eight catches for 37 yards, while Antonio Gates snagged eight balls for 124 yards. Gates was close to scoring, but lost a fumble at the 1-yard line. It's worth noting that Keenan Allen caught two passes for 34 yards in relief of Floyd. ",
            "4": "Ryan Mathews was also guilty of coughing the ball up in the red zone, doing so in the second quarter. He rushed for 73 yards on 16 carries. He lost nine attempts to Woodhead, who turned them into 27 yards. Mathews wasn't on the field for San Diego's hurry-up offense. It's disappointing considering he's a former first-round pick. ",
            "5": "As for Philadelphia's offense, the unit generated 511 net yards, though the Eagles ran just 30 plays in the first half. The quarterback struggled early on with his accuracy, but caught fire after intermission. He went 23-of-36 for 428 yards and three touchdowns (two passing, one rushing). to go along with six scrambles for 23 yards on the ground. He could've enjoyed a much bigger day; James Casey dropped a score, while a DeSean Jackson touchdown was called back because rookie right tackle Lane Johnson lined up incorrectly. QBDK suffered an injury late in the game, briefly forcing Nick Foles onto the field. He would end up being OK, but it's just a reminder that he'll be knocked out of the lineup by mid-season. ",
            "6": "Speaking of Jackson, the quick receiver once again had a huge outing, registering nine catches for 193 yards and a touchdown. Jackson missed out on three other big gains. He had that aforementioned end-zone trip called back because of a penalty, while his quarterback overthrew him on two bombs. Jackson screwed up on his own, however. He dropped a deep bomb and was whistled for a personal foul, which helped move San Diego into position for a fourth-quarter touchdown. ",
            "7": "LeSean McCoy didn't even come close to matching his rushing total from last week, managing just 53 yards on 11 carries. However, he was highly impressive. He spun out of three tackles on one play for a 3-yard gain. He also took a short reception down the field for 70 yards. He finished with five catches for 114 receiving yards. "
        }
    },
    "Game 11": {
        "Team 1": {
            "Name": "Cardinals",
            "Points": "25"
        },
        "Team 2": {
            "Name": "Lions",
            "Points": "21"
        },
        "comments": {
            "amount": "8",
            "1": "The Lions have to be pleased that the Cardinals aren't in their division. They always lose when they travel to Arizona. There was some belief that this game would be different, based on how impressive they were last week, but Detroit found a way to screw up, as usual. A list of mental errors for Detroit: - David Akers was wide right on the second drive. Perhaps Kickalicious would've converted. - Reggie Bush lost the ball on a handoff at the Arizona 10-yard line in the third quarter. The turnover led to a Cardinals' field goal. - Defensive end Willie Young was guilty of illegal hands to the face on what should've been on Arizona punt. The Cardinals were awarded a free first down and eventually managed another field goal, thanks to a roughing-the-passer infraction. - Dwight Bullet Bill Bentley committed a terrible pass interference on Andre Roberts in the fourth quarter - his second of the game - setting up an Arizona touchdown. The Lions had five penalties in the second half. ",
            "2": "Bush, who had the aforementioned fumble - though it was officially credited to Matthew Stafford - suffered what looked to be a serious injury in the first half. He grabbed the back of his knee, but eventually reentered the game. Bush rushed for just 25 yards on nine carries, though he made up for it with three catches for 44 receiving yards. Joique Bell actually outgained him (8-31; 5-41). ",
            "3": "As for Stafford, he went 24-of-36 for 278 yards and two touchdowns. He came out on fire, but the Cardinals made the proper adjustments and shut him down after intermission. He was just 8-of-16 for 68 yards in the final couple of quarters. ",
            "4": "Both of Stafford's scores went to Calvin Johnson, which had to make his fantasy owners happy after they barely missed out on a couple of touchdowns last week. Megatron logged six catches for 116 yards despite Patrick Peterson's coverage. ",
            "5": "Speaking of Peterson, he was used on offense on a few snaps in this contest. Peterson caught a 17-yard pass along the sideline and even tossed a 17-yard dart on a trick play to Kerry Taylor. ",
            "6": "Carson Palmer had a pretty decent outing considering that Larry Fitzgerald wasn't 100 percent. Fitzgerald, who caught just two passes for 33 yards, wasn't even on the field during the final drive. Palmer went 22-of-39 for 248 yards, one touchdown and an ugly interception that was made off his back foot and taken back 66 yards by DeAndre Levy for a pick-six. Not included in Palmer's numbers were two long pass interferences on Bentley and an incompletion that should have been ruled a catch. It was obvious that Michael Floyd hauled a deep pass in, but the officials inexplicably said it was incomplete. ",
            "7": "Palmer's lone score went to rookie running back Andre Ellington, who had six touches for 62 yards. Floyd (3-22) and Andre Roberts (3-36) disappointed their fantasy owners. ",
            "8": "Rashard Mendenhall also scored. He gained 66 yards on 15 attempts. I'd like to see Ellington more involved. <div class=dfpAdSlots> "
        }
    },
    "Game 12": {
        "Team 1": {
            "Name": "Saints",
            "Points": "16"
        },
        "Team 2": {
            "Name": "Buccaneers",
            "Points": "14"
        },
        "comments": {
            "amount": "5",
            "1": "<i> EDITOR'S NOTE: I'm too pissed to write anything. If you were to tell me the Saints would hold the Buccaneers to 14 points, I would've bet 500 units on New Orleans. F***ing Drew Brees and his pick-six. Ugh. </i> ",
            "2": "New Orleans did its best to give this game to Tampa Bay, but the Bucs snatched defeat from the jaws of victory. The Saints' offense left a lot of points on the field thanks to two Drew Brees interceptions, a decision to pass on a gimmie field goal and a missed kick. In the end though, the Buccaneers' offense couldn't execute well enough to put away New Orleans. All 14 of Tampa Bay's points came off Brees' interceptions. After a weather delay, the veteran signal-caller's first pass was intercepted by Dekoda Watson. That set up a short touchdown pass from Josh Freeman to Kevin Ogletree (1-5). Brees answered with a 56-yard touchdown pass to Jimmy Graham in blown coverage by Watson. The Bucs struggled to cover Graham (10-179) throughout the afternoon, so he had a monster game. Graham was deadly in the first half and came up clutch in the final minute. He had another catch down to the one-yard line, but Tampa Bay put together a goal-line stand with a fourth-and-goal stop just before halftime. New Orleans was up 13-7 and knocking on the door for more points, when Brees made a terrible pass that was thrown to Mason Foster like he was the intended receiver. Foster rumbled down the sideline for an 85-yard touchdown return. That gave the Buccaneers a 14-13 lead with 12 minutes remaining. They had a drive to drain the clock, but Rian Lindell missed a 48-yard field goal. That gave Brees one more shot with a minute remaining. He connected with Graham for 15 yards and a strike to Marques Colston (4-63) for 31 yards inside the Tampa Bay's 10-yard line. On the final play of the game, Garrett Hartley hit a 27-yard field goal for the win. Brees finished 26-of-46 for 322 yards with a touchdown and two interceptions. He definitely left points on the field. ",
            "3": "The Buccaneers' offense was incapable of producing points on its own. Doug Martin was excellent for Tampa Bay as he ran for 144 yards on 29 carries. Martin picked up a lot of yards after contact while coming close to breaking off a long scoring run. The Bucs just couldn't consistently pass the ball to sustain drives. Freeman completed 9-of-22 passes for 125 yards with a touchdown and an interception. His pick was a telegraphed a pass to Vincent Jackson (5-77) that was intercepted by Malcolm Jenkins. A 31-yard return by Jenkins set up the Saints at Tampa Bay's 39-yard line, but New Orleans ended up punting. Another Bucs drive into Saints territory fizzled when Cam Jordan strip-sacked Freeman with New Orleans advancing the fumble to Tampa Bay's 40-yard line. ",
            "4": "Mike Williams had only two catches for nine yards. The Saints' defense struggled against the run, but the secondary and pass rush combined to shut down the Bucs' passing offense. ",
            "5": "For the second straight week, Tampa Bay continued to have problems with penalties. The team had three unnecessary-roughness infractions courtesy of Adrian Clayborn, Dashon Goldson and Ahmad Black. The Buccaneers also had a bad delay of game and an illegal formation that took away a third-down conversion. Perhaps the worst flag was an illegal formation penalty on right tackle Demar Dotson that canceled out a touchdown pass of over 70 yards to Jackson. Aside from the penalties, Tampa Bay's defense played extremely well. Gerald McCoy and Lavonte David recorded sacks. The Bucs' safeties had a lot of problems with Graham as both were beaten by the tight end downfield. Goldson was lucky Graham didn't score just before halftime. Mark Barron also was flagged for a 37-yard pass interference in coverage on Kenny Stills. The front seven did a good job of stopping New Orleans' running backs. Mark Ingram (8-20) stunk, especially near the goal line. Pierre Thomas (5-29) and Darren Sproles (7-26 rushing, 6-36 receiving) are so much better, and it doesn't make sense for the Saints to give Ingram any touches in place of those two. "
        }
    },
    "Game 13": {
        "Team 1": {
            "Name": "Broncos",
            "Points": "41"
        },
        "Team 2": {
            "Name": "Giants",
            "Points": "23"
        },
        "comments": {
            "amount": "6",
            "1": "The Broncos were dominant in their season opener, while the Giants lost despite outplaying their Week 1 foe because of six turnovers. There seemed to be a major role reversal early on; rookie running back Montee Ball lost a fumble in the red zone on the opening possession. Wes Welker then had a couple of drops. The Broncos then had four penalties during a third-quarter series, including a ridiculous taunting penalty that helped New York score a touchdown. The Giants trailed by just one point at that moment, so it appeared as though Denver would be the team that would screw itself out of a victory. And that's exactly when the Broncos took over. Peyton Manning was unstoppable in the second half. He was great overall - 30-of-43, 307 yards, two touchdowns - but his numbers after intermission were just outstanding. He went a near-perfect 12-of-14 for 107 yards and the pair of scores following the break. If the Broncos didn't commit mental errors in the first half, this would've been an even uglier blowout. The Giants' back seven is atrocious, thanks to injuries and mismanagement, so they didn't stand a chance against Manning once Denver started playing clean football. ",
            "2": "Peyton's two scores went to Julius Thomas (6-47) and Welker (3-39). Eric Decker (9-87) and Demaryius Thomas (5-52) couldn't find the end zone, but happened to be the two leading receivers. Demaryius Thomas fumbled, but was extremely fortunate that his teammate was able to recover the football. There were three Giants around to pounce on it, but they somehow couldn't come up with what looked like a golden opportunity. ",
            "3": "It was no surprise to see Knowshon Moreno have the best rushing performance on the Broncos. Listed as the No. 1 <a href=/fantasy2013sleepers.php>fantasy football sleeper</a> on this Web site, Moreno gained 93 yards and two scores on just 13 carries. He should be given more carries going forward, as it's quite apparent that Ball is a typical Big Ten plodder who is inept on third down. Ball mustered only 16 yards on 12 attempts to go along with the aforementioned lost fumble. ",
            "4": "Eli lost this contest - giving him an 0-3 record versus Peyton - but if it's any consolation to him, he out-threw his older brother. He generated 362 yards and a touchdown on 28-of-49 passing, but was responsible for four interceptions. The first occurred just prior to halftime. He made a poor decision and heaved it toward the end zone despite being in field goal range. One of his other picks was fluky, as it bounced off a player's foot. I was hoping the Broncos would return it for a score so I could call it a kick-six. The other two interceptions were heaved deep into double coverage. Eli had a poor showing overall in what could be his final battle against his brother, but if Peyton ever brings this up in the future, Eli can just shove his two Super Bowl rings in Peyton's face. ",
            "5": "Eli's sole aerial score came late in garbage time to Da'Rel Scott. Victor Cruz (8-118) and Hakeem Nicks (4-83) did well in terms of fantasy, though neither could reach the end zone. ",
            "6": "I was disappointed in what the Giants did in terms of their running game. David Wilson and newly signed Brandon Jacobs split carries evenly, with the former outgaining the latter, 17-4. Jacobs did score a touchdown on a goal-line plunge, but the other six attempts were a waste. Wilson is super talented and should have the ball in his hands more often. Sure, he had the two costly fumbles last week, but how is he supposed to prove himself? Coughlin needs to cut the crap and give the ball to his best running back if he wants to help his team win a game. "
        }
    },
    "Game 14": {
        "Team 1": {
            "Name": "Raiders",
            "Points": "19"
        },
        "Team 2": {
            "Name": "Jaguars",
            "Points": "9"
        },
        "comments": {
            "amount": "5",
            "1": "The Jaguars may have lost this game, but they happened to be the winners for the long term. They triumphed in the race for Teddy Bridgewater, as they now happen to be the overwhelming favorites to have the No. 1 pick in the 2014 NFL Draft (click here for my <a href=/draft2014.php>2014 NFL Mock Draft</a>). The man Bridgewater will be replacing, Chad Henne, went 25-of-38 for 241 yards and a touchdown. His stats aren't terrible, but he could barely do anything until the Raiders went up two scores. He then compiled a bunch of junk yardage, which includes his sole score to former Eagle Clay Harbor (3-34). Henne didn't stand much of a chance. He was sacked five times and lost his top weapon, Maurice Jones-Drew, to a second-quarter ankle injury. Head coach Gus Bradley said that Jones-Drew is dealing with looseness in that ankle. He could be out next week. Jones-Drew (10-27) let down his fantasy owners again, though it wasn't his fault. Jordan Todman (5-7) and Denard Robinson (1-0) did very little in relief. ",
            "2": "Jacksonville's leading receiver was Cecil Shorts (8-93), who also did most of his damage when this game was out of hand. The good news is that Henne, unlike the injured Blaine Gabbert, isn't inept enough to keep Shorts from producing in fantasy. ",
            "3": "As for the winning team, Terrelle Pryor did a solid job of moving the chains, but struggled in the red zone - which is not surprising, given his inexperience and lacking supporting cast. Pryor went 15-of-24 for 126 yards. He also scrambled nine times for 50 rushing yards. Pryor was close to throwing two touchdowns. One pass was behind Brice Butler just prior to intermission, while Denarius Moore dropped the ball in the red zone - which is also not surprising. Moore didn't log a single catch. Rod Streater (3-42) led the team in receiving. ",
            "4": "Darren McFadden was brilliant, gaining 129 yards on 19 tries. He also caught four passes for 28 receiving yards. Marcel Reece (2 carries, 15 yards) vultured a touchdown. He needs more touches. ",
            "5": "The dark cloud surrendering the Raiders in this victory was an injury that stud safety Tyvon Branch sustained. He was crawling around on the field because of an ankle problem. Head coach Dennis Allen called it serious. <div class=dfpAdSlots> "
        }
    },
    "Game 15": {
        "Team 1": {
            "Name": "Seahawks",
            "Points": "29"
        },
        "Team 2": {
            "Name": "49ers",
            "Points": "3"
        },
        "comments": {
            "amount": "5",
            "1": "The Seattle fans wanted to set the all-time record for crowd noise in a football game. I don't know if they managed to do that - perhaps the loud thunder heard during an hour-long delay helped - but it must have felt that way for the 49ers, who were completely destroyed in what has become one of the fiercest rivalries in all of football. The Seahawk defense completely dominated the San Francisco scoring attack. It's easy to tell that based on the score, but the 49ers just couldn't sustain drives. They held the ball for about only 23 minutes and committed a whopping five turnovers. Colin Kaepernick was responsible for four of them. Three were interceptions, while the other was a strip-sack. Kaepernick's first pick wasn't his fault - it was tipped into the air in the red zone - but the other two interceptions were major errors. Kaepernick failed to complete half of his passes, going 13-of-28 for 127 yards and the four give-aways. He managed to rush for 87 yards on nine scrambles, but the negatives obviously outweighed those numbers. Kaepernick, who was constantly pressured by Seattle's fierce pass rush, didn't have much of a chance. ",
            "2": "Kaepernick's supporting cast struggled. Anquan Boldin, who was unstoppable last week, didn't manage a single reception until there was 9:30 remaining in regulation. Richard Sherman, who snagged an interception, completely shut him down. Sherman arrogantly laughed afterward when he told the NBC sideline reporter that he wasn't on Boldin when Boldin hauled in his only reception. Vernon Davis, who had three catches for 20 yards, was knocked out of the contest with a hamstring injury. Frank Gore disappointed his fantasy owners with just 16 yards on nine carries. ",
            "3": "The Seahawks had much more success running the football. Marshawn Lynch rushed for 98 yards on 28 carries, as guard James Carpenter helped open up big holes for his back. Lynch found the end zone thrice; one touchdown came on a reception (3 catches, 37 yards). ",
            "4": "Lynch happened to be one of only two Seahawk players (Zach Miller, 2-22) who had more than one reception. That's because Russell Wilson completed just eight passes. He finished 8-of-19 for 142 yards, one touchdown and a pick that wasn't his fault because Golden Tate fell down. Wilson started slowly, but eventually got into a groove. He was effective on the ground with 33 yards on 10 scrambles. If you're wondering why Wilson tossed only eight completions, it's because the 49ers' front overwhelmed Seattle's offensive line, especially after stud left tackle Russell Okung was carted off with an injury. Aldon Smith consequently collected two sacks. San Francisco had four total sacks, which is a very high number considering Wilson's mobility. ",
            "5": "There were some strange calls in this game, as it seemed early on that the officials had a vendetta against the Seahawks. There was a phantom whistle on a first-quarter punt that allowed San Francisco to block it. The Seattle players stood up, so there should have at least been a false start called on the team. Luckily for the Seahawks, the 49ers weren't able to capitalize because of Kaepernick's first interception. Other strange calls: The refs missed a very obvious offside call on the 49ers on fourth-and-inches. Seattle was stuffed at the line of scrimmage, but should have been awarded with a first down. Later on, Navorro Bowman elbowed Wilson in the helmet. The officials once again neglected to throw a flag. The tide turned after halftime, however. The 49ers finished with 12 penalties. They killed themselves with some costly infractions, like a deep pass interference by Nnamdi Asomugha and a roughness penalty by Aldon Smith. "
        }
    },
    "Game 16": {
        "Team 1": {
            "Name": "Bengals",
            "Points": "20"
        },
        "Team 2": {
            "Name": "Steelers",
            "Points": "10"
        },
        "comments": {
            "amount": "3",
            "1": "ESPN made it seem like the Bengals turned the tide, as they called it, in the AFC North with this victory, but this game was about one thing: Pittsburgh's ineptitude. The Steelers are absolutely terrible for a number of reasons: - The Steelers can't pass protect. Cincinnati recorded just two sacks, but Ben Roethlisberger was a fraction of a second away from getting thrown down for a loss on many more occasions. The one silver lining is that new center Fernando Velasco did a much better job than Kelvin Beachum. - The Steelers don't have any dynamic weapons - except for Antonio Brown, who caught six balls for 57 yards (with a 33-yard gain wiped out by a penalty). Roethlisberger, who went 20-of-37 for 251 yards, one touchdown and an interception, tried heaving bombs downfield on several occasions, but his receivers couldn't get separation. The offense was completely stagnant at times; the unit had a net minus-2 yards in the third quarter. Pittsburgh was 3-of-12 on third downs (Cincinnati, by comparison, was 7-of-17). - The Steelers have an awful offensive coordinator. Seriously, Todd Haley needs to be fired immediately. He opened the contest with three Felix Jones (10-37) runs, which predictably led to a punt. Running three consecutive times isn't an absolutely terrible thing to do, but keep in mind that starter Isaac Redman (3-4) was injured on the opening kickoff. So, Haley didn't even bother adjusting despite the fact that he lost a starter. It's just unbelievable. Later on, there would be a key third-and-2 in which Haley called for an Redman (3-4) carry. The plodder was stuffed prior to reaching the first-down marker. Forum member Prodigy then posted something hilarious after one play call: <i> Lets do an end around with our slowest receiver instead of Brown, Sanders, or Wheaton. - Todd Haley. </i> Seriously, why is Jerricho Cotchery running end-arounds? So stupid. - The Steelers aren't disciplined. They made mental mistakes and were guilty of bad turnovers. The first occurred when tight end David Paulson lost a fumble in the red zone when Pittsburgh was already up 3-0. The officials initially ruled him down by contact, but Roethlisberger and company took their sweet old time, giving Marvin Lewis an opportunity to throw the red flag. There was some egregious stuff in the second half. An Antonio Brown 33-yard gain was wiped out by a Marcus Gilbert tripping penalty. LaMarr Woodley then committed a personal foul as the Bengals were running out the clock. Cincinnati was awarded with a free first down instead of being faced with a third-and-6 with three minutes remaining. Pittsburgh also let too much time run off the clock. Mike Tomlin screwed up by not using his timeouts right away on the final Cincinnati possession. Roethlisberger was also too sluggish on the final drive, as he wasted time by not spiking the ball. Of course, Big Ben was down by 10 instead of seven or three because he threw a bad, red-zone interception on the prior drive. - The Steelers' defense isn't very good anymore. The Bengals compiled 407 net yards of offense and would've had more than 20 points if Andy Dalton (25-of-45, 280 yards, TD) didn't miss wide-open receivers downfield all evening. A.J. Green caught six balls for 41 yards. Ike Taylor covered him very well. Pittsburgh struggled against the run, especially when Cincinnati was bleeding the clock. The unit couldn't bring down BenJarvus Green-Ellis (22-75). The Steelers also had major problems with Giovani Bernard. The rookie runner rushed for 38 yards on eight carries (not including an 11-yarder that was called back because of a hold) and also had a 27-yard reception. He scored twice. Bernard needs to be more involved on offense. The Law Firm wasn't bad, but Bernard is just so explosive. ",
            "2": "Cleaning up some other stuff, both Tyler Eifert and Jermaine Gresham tied for the Bengal team lead in receiving yards (66). Eifert, who hauled in a 61-reception, was overthrown on several instances, so he should've posted greater numbers. ",
            "3": "I'd like to mention something shady that occurred at the very end of this game. The Steelers, who were near the border of the red zone, spiked the ball with one second remaining. Instead of giving them one more play, Mike Carey, one of the dirtiest officials in the NFL, ruled that the game was over. Pittsburgh legitimately had one second left, but he just ended the game with no explanation. I had the Steelers +6.5, but there were many who were able to obtain +7 earlier in the week. The Steelers probably would've tried a field goal - it was fourth down - which would've pushed the spread. Carey has been involved in some weird gambling stuff over the years, so we can just add this to the list. <table border=0 width=98%> <tr> <td> <div id=post_comment_wrapper> </td> </tr> </table> "
        }
    }
}